Repository: Easonqsp/calibre-translations
Catalog: content-server/*.po
Languages: bs, el, he, hr, nb, sk, tr

source: No book found
bs: Nije pronađena knjiga
el: Δεν βρέθηκε βιβλίο
he: לא נמצאו ספרים
hr: Nije pronađena nijedna knjiga
nb: Ingen bøker funnet
sk: Nebola nájdená žiadna kniha
tr: Hiçbir kitap bulunamadı

source: Read this book
bs: Čitaj ovu knjigu
el: Ανάγνωση αυτού του βιβλίου
he: קרא ספר זה
hr: Čitaj ovu knjigu
nb: Les denne boka
sk: Čítať túto knihu
tr: Bu kitabı oku

source: Download this book in the {0} format ({1})
hr: Preuzmi ovu knjigu u {0} formatu ({1})
sk: Stiahnuť knihu vo formáte {0} ({1})

source: Delete this book
sk: Zmazať túto knihu

source: Could not fetch metadata for book
bs: Nije moguće dohvatanje meta-podataka za knjigu
el: Δεν ήταν δυνατή η ανάκτηση μεταδεδομένων για το βιβλίο
he: לא ניתן לאחזר מטא-נתונים עבור הספר
hr: Ne mogu dohvatiti metapodatke za knjigu
nb: Kunne ikke hente metadata for boken
sk: Nie je možné získať metadáta knihy
tr: Bu kitap için üst veri toplanamadı

source: Fetching metadata for the book, please wait
bs: Hvatanje meta-data za knjigu, sačekajte
el: Ανάκτηση μεταδεδομένων του βιβλίου, παρακαλώ περιμένετε
he: מאחזר מטא-נתונים עבור הספר, אנא המתן
hr: Dohvaćam metapodatke za knjigu, pričekajte...
nb: Henter metadata for boken. Vennligst vent
sk: Načítavam metadáta knihy, prosím čakajte
tr: Bu kitap için üst veri toplanıyor, lütfen bekleyin

source: Book details
bs: Detalji o knjizi
hr: Detalji o knjizi
sk: Podrobnosti o knihe

source: Show important metadata
hr: Prikaži važne metapodatke
sk: Zobraziť dôležité metadáta

source: Show only the important metadata fields in the book details
hr: Pokaži samo važna polja metapodataka u detaljima knjige
sk: Zobraziť iba dôležité polia metadát v detailoch knihy

source: Show all metadata
hr: Prikaži sve metapodatke
sk: Zobraziť všetky metadáta

source: Show all metadata fields in the book details
hr: Pokaži sva polja metapodataka u detaljima knjige
sk: Zobraziť všetky polia metadát v detailoch knihy

source: Search the internet
hr: Pretraži Internet
sk: Hľadať na internete

source: Search for this author or book on various websites
hr: Traži ovog pisca ili knjigu na raznim stranicama
sk: Hľadať tohto autora alebo knihu na rôznych stránkach

source: Search for the author <i>{}</i> at:
hr: Traži pisca <i>{}</i> na:
sk: Hľadať autora <i>{}</i> v:

source: Google books
hr: Google knjige
sk: Google knihy

source: Search for the book <i>{}</i> at:
hr: Traži knjigu <i>{}</i> na:
sk: Hľadať knihu <i>{}</i> v:

source: Please close all other browser tabs with calibre open
bs: Zatvori sve ostale kartice u pretraživaču u kojima je otvoren calibre
hr: Zatvorite sve druge kartice preglednika sa otvorenim Calibreom
sk: Prosím zavrite všetky ostatné karty prehliadača s otvoreným Calibre

source: You must allow calibre to use IndexedDB storage in your browser to read books
bs: Dozvolite calibre-u da koristi pohranu za IndexedDB u svom pretraživaču kako bi mogli čitati knjige
el: Θα πρέπει να επιτρέψετε στο calibre να χρησιμοποιήσει την αποθήκευση σε IndexedDB εντός του προγράμματος περιήγησής σας, για να διαβάσετε τα βιβλία
he: עליך לאפשר לקליבר להשתמש באחסון IndexedDB בדפדפן שלך על מנת לקרוא ספרים
hr: Morate dozvoliti Calibreu korištenje IndexedDB skladišta vašeg preglednika da bi mogli čitati knjige
nb: Du må tillate calibre å bruke IndexedDB-lagring i nettleseren din for å kunne lese bøker.
sk: Musíte povoliť Calibre použiť úložisko IndexedDB vo vašom prehliadači, aby ste mohli čítať knihy
tr: Kitap okuyabilmek için calibrenin tarayıcınızdaki EndeksliDB deposunu kullanmasına izin vermelisiniz

source: Database upgraded!
bs: Baza podataka je nadograđena!
el: Η βάση δεδομένων αναβαθμίστηκε!
he: מסד הנתונים עודכן!
hr: Baza podataka nadograđena!
nb: Database oppgradert
sk: Databáza aktualizovaná!
tr: Veritabanı güncellendi!

source: A newer version of calibre is available, please click the reload button in your browser.
bs: Dostupna je novija veerzija calibre, molim da kliknete na 'reload' dugme u svom pretraživaču.
el: Μια νεώτερη έκδοση του calibre είναι διαθέσιμη. Παρακαλώ κάντε «κλικ» στο κουμπί ανανέωσης του περιηγητή σας.
he: גירסה עדכנית של קליבר זמינה, אנא לחץ על כפתור טען-מחדש בדפדפן שלך.
hr: Nova verzija Calibrea je dostupna, ponovno učitajte stranicu.
nb: En nyere versjon av calibre er tilgjengelig. Vennligst klikk relast-knappen i nettleseren din.
sk: Nová verzia calibre je dostupná, prosím kliknite na tlačidlo obnovenia vo vašom prehliadači.
tr: Calibrenin yeni sürümü mevcut, lütfen tarayıcınızdaki tekrar yükle düğmesine tıklayın.

source: There was an error while interacting with the database used to store books for offline reading. Click "Show details" for more information.
bs: Postoji greška u toku interakcije sa bazama koje se koriste za sačuvaju knjige za offline čitanje. Klikni 'Prikaži detalje' za više informacija.
el: Παρουσιάστηκε σφάλμα κατά την αλληλεπίδραση με τη βάση δεδομένων που χρησιμοποιείται για την αποθήκευση βιβλίων για την εκτός σύνδεσης ανάγνωση . Κάντε «κλικ» στο κουμπί «Εμφάνιση λεπτομερειών» για περισσότερες πληροφορίες.
he: אירעה שגיאה בזמן האינטראקציה עם מסד הנתונים המשמש לאחסון ספרים לקריאה לא מקוונת. לחץ על "הצג פרטים" למידע נוסף.
hr: Došlo je do greške prilikom uspostavljanja veze sa bazom podataka namijenjene skladištenju knjiga za offline čitanje. Kliknite na "Prikaži detalje" za više informacija.
nb: Det skjedde en feil ved interaksjon med databasen som brukes for å lagre bøker til lesing uten nett. Klikk "Vis detaljer" for mer informasjon.
sk: Pri komunikácii s databázou, ktorá ukladá knihy pre čítanie v režime offline sa vyskytla chyba. Kliknite "Zobraziť podrobnosti" pre viac informácií.
tr: Çevrimdışı okuma için depolanan kitaplar için kullanılan veritabanıyla etkileşim sırasında hata oluştu. Daha fazla bilgi için "Detayları göster" düğmesine tıklayın.

source: Cannot read book
bs: Čitanje knjige nije moguće
el: Αδύνατη η ανάγνωση βιβλίου
he: לא ניתן לקרוא את הספר
hr: Ne mogu čitati knjigu
nb: Kunne ikke lese boka
sk: Nepodarilo sa načítať knihu
tr: Kitabı okuyamıyor

source: Reading of books is not supported on Microsoft Edge. Use a better browser such as Google Chrome or Mozilla Firefox
hr: Čitanje knjiga nije podržano u Microsoft Edgeu. Upotrijebite drugi preglednik poput Google Chromea ili Mozilla Firefoxa
sk: Čítanie kníh nie je podporované na Microsoft Edge. Použite lepší prehliadač ako napríklad Google Chrome alebo Mozilla Firefox

source: Failed to read from the books database
bs: Neuspio pokušaj čitanja iz baze podataka
el: Αποτυχία ανάγνωσης από τη βάση δεδομένων των βιβλίων
he: נכשל בקריאה ממסד נתוני הספרים
hr: Ne mogu pročitati bazu podataka knjiga
nb: Feilet ved lesing fra bokdatabasen
sk: Nepodarilo sa načítať knihu z databázy kníh
tr: Kitap veritabanından kitap okumada başarısız oldu

source: Failed to read from the objects database
bs: Neuspio pokušaj čitanja iz baze podataka
el: Αποτυχία ανάγνωσης από τη βάση δεδομένων των αντικειμένων
hr: Ne mogu pročitati bazu podataka objekata
nb: Feilet ved lesing fra objektdatabasen
sk: Nepodarilo sa čítať z databázy objektov

source: Failed to write to the books database
bs: Neuspjelo pisanje u bazu podataka knjiga
el: Αποτυχία εγγραφής στη βάση δεδομένων των βιβλίων
he: נכשל בכתיבה למסד נתוני הספרים
hr: Ne mogu zapisati u bazu podataka knjiga
nb: Feilet ved skriving til bokdatabasen
sk: Napodaril sa zápis do databázy kníh
tr: Kitap veritabanına yazmada başarısız oldu

source: Failed to store book data ({0}) with error: {1}
bs: Neuspio pokušaj čuvanja podakata iz knjige ({0}) s greškom: {1}
el: Αποτυχία αποθήκευσης των δεδομένων του βιβλίου ({0}) Σφάλμα: {1}
hr: Ne mogu pohraniti podatke o knjizi ({0}) s greškom: {1}
nb: Feilet ved lagring av bok ({0}) sine data med feil: {1}
sk: Nepodarilo sa uložiť dáta knihy ({0}) s chybou: {1}
tr: {1} hatasıyla kitap verisini ({0}) depolamada başarısız oldu

source: Failed to store mathjax file ({0}) with error: {1}
bs: Neuspio pokušaj da se zapiše mathjax datoteka ({0}) s greškom: {1}
el: Αποτυχία αποθήκευσης του αρχείου mathjax ({0}) Σφάλμα: {1}
hr: Ne mogu pohraniti mathjax datoteku ({0}) s greškom: {1}
nb: Feilet ved lagring av mathjax ({0}) med feol: {1}
sk: Nepodarilo sa uložiť súbor mathjax ({0}) s chybou: {1}

source: Failed to write to the objects database
bs: Neuspio pokušaj da se upiše u bazu podataka objekata
el: Αποτυχία εγγραφής στη βάση δεδομένων των αντικειμένων
hr: Ne mogu zapisati u bazu podataka objekata
nb: Feilet ved skriving fra objektdatabasen
sk: Nepodaril sa zápis do databázy objektov
tr: Obje veritabanına yazmada başarısız oldu

source: No matches found
bs: Nema rezultata
el: Δεν βρέθηκαν αντιστοιχίες.
he: לא נמצאו התאמות
hr: Podudarnosti nisu pronađene
nb: Ingen treff
sk: Neboli nájdené žiadne výsledky
tr: Eşleşme bulunamadı

source: The text "{}" was not found in the Table of Contents
bs: Tekst "{}" nije pronađen u Sadržaju
el: Το κείμενο «{}» δεν βρέθηκε στον Πίνακα Περιεχομένων
hr: Tekst "{}" nije pronađen u Sadržaju
nb: Teksten "{}" ble ikke funnet i innholdsfortegnelsen.
sk: Text "{}" nebol nájdený v obsahu

source: Search Table of Contents
bs: Pretraži Sadržaj
el: Αναζήτηση Πίνακα Περιεχομένων
he: חפש תוכן עניינים
hr: Pretraži Sadržaj
nb: Søk i innholdsfortegnelsen
sk: Hľadať v obsahu
tr: İçindekiler Dizinini Ara

source: White
bs: Bijelo
hr: Bijelo
nb: Hvit
sk: Biela
tr: Beyaz

source: Black
bs: Crno
hr: Crno
nb: Svart
sk: Čierna
tr: Siyah

source: Sepia light
hr: Sepia, svijetlo
sk: Sépia svetlá

source: Sepia dark
hr: Sepia, tamno
sk: Sépia tmavá

source: Next match
bs: Sljedeći rezultat
el: Επόμενη αντιστοιχία
hr: Sljedeća podudarnost
nb: Neste treff
sk: Ďalší výsledok
tr: Sonraki eşleşme

source: Previous match
bs: Prethodni rezultat
hr: Prethodna podudarnost
sk: Predchádzajúca zhoda

source: Unknown book
bs: Nepoznata knjiga
el: Άγνωστο βιβλίο
he: ספר לא ידוע
hr: Nepoznata knjiga
nb: Ukjent bo
sk: Neznáma kniha
tr: Bilinmeyen kitap

source: book
hr: knjiga
sk: kniha

source: Could not open {}. {}
hr: Ne mogu otvoriti {}. {}
sk: Nedá sa otvoriť {}. {}

source: Go back to:
hr: Povratak na:
sk: Ísť späť na:

source: Home
bs: Početna
el: Αρχική
hr: Početna
nb: Hjem
sk: Domov
tr: Ev

source: Book list
hr: Popis knjiga
sk: Zoznam kníh

source: Downloading {0} for offline reading, please wait...
bs: Skidanje {0} za vanmrežno čitanje, sačekajte...
el: Λήψη {0} για ανάγνωση εκτός σύνδεσης, παρακαλώ περιμένετε...
he: מוריד {0} לקריאה לא מקוונת, אנא המתן...
hr: Preuzimam {0} za offline čitanje, pričekajte...
nb: Laster ned {0} for frakoblet lesning. Vennligst vent...
sk: Sťahovanie {0} pre čítanie offline, čakajte prosím...
tr: Çevrimdışı okuma için {0} indiriliyor, lütfen bekleyin...

source: Downloading book manifest...
bs: Skidanje sažetka knjige...
hr: Preuzimam knjižni manifest...
nb: Laster ned bokmanifestet...
sk: Sťahovanie manifestu knihu...
tr: Kitap bildirisi indiriliyor...

source: Could not initialize database
hr: Ne mogu pokrenuti bazu podataka
sk: Nedá sa inicializovať databáza

source: Failed to initialize IndexedDB
bs: Neuspješan pokušaj inicijalizacije Indeksirane DB
hr: Ne mogu pokrenuti IndexedDB
sk: Nepodarilo sa inicializovať IndexedDB

source: Book id #
bs: ID knjige #
el: ID Βιβλίου #
he: מזהה ספר #
hr: Knjiga id #
nb: Bok id #
sk: ID-knihy #
tr: Kitap kimlik #

source: Failed to load book manifest
bs: Neuspio pokušaj učitavanja sažetka knjige
hr: Ne mogu učitati knjižni manifest
nb: Feilet ved lasting av bokmanifest
sk: Nepodarilo sa načítať manifest knihy
tr: Kitap bildirisi yüklemesi başarısız oldu

source: Could not open {title} as the book manifest failed to load, click "Show Details" for more information.
bs: Ne mogu otvoriti {title} jer se sažetak nije uspio učitati, klikni za "Prikaži detalje" za više informacija.
hr: Ne mogu otvoriti {title} jer se knjižni manifest nije učitao, klikni "Više detalja" za dodatne informacije.
nb: Kunne ike åpne {title} fordi manifestet feilet ved lesing. Klikk "Vis detaljer" for mer informasjon.
sk: Nie je možné otvoriť {title}, keďže sa nepodarilo načítať manifest, kliknite "Zobraziť podrobnosti" pre viac informácií.

source: The manifest for {title} is not valid
bs: Sažetak {title} nije ispravan
hr: Manifest za {title} nije valjan
nb: Manifestet for {title} er ikke gyldig
sk: Manifest knihy {title} nie je platný
tr: {başlık} için bildiri geçerli değil

source: calibre upgraded!
bs: calibre je nadograđen!
el: Το calibre αναβαθμίστηκε!
he: קליבר עודכן!
hr: Calibre je nadograđen!
nb: Calibre oppdatert!
sk: calibre aktualizované!
tr: calibre güncellendi!

source: Failed to prepare book for reading
bs: Neuspio pokušaj pripreme knjige za čitanje
el: Απέτυχε να προετοιμαστεί το βιβλίο για ανάγνωση
hr: Ne mogu pripremiti knjigu za čitanje
nb: Feilet under forberedelser for lesing av bok
sk: Nepodarilo sa pripraviť knihu na čítanie
tr: Kitabın yüklenmesi başarısız oldu

source: Preparation of book for reading was aborted because it took too long
bs: Priprema knjige za čitanje je prekinuta jer traje predugo
el: Η προετοιμασία του βιβλίου για ανάγνωση ματαιώθηκε λόγω υπέρβασης χρονικού ορίου
hr: Priprema knjige za čitanje nije uspjela jer je trajala predugo
nb: Forberedelser for lesing av bok ble avbrutt fordi det tok for lang tid
sk: Príprava knihy na čítania bola prerušená, pretože trvala príliš dlho
tr: Kitabın okunması için hazırlık çok uzun sürdüğü için iptal edildi

source: There was an error processing the book, click "Show details" for more information
bs: Postoji greška u obradi knjige, klikni na "Prikaži detalje" za više informacija
el: Υπήρξε ένα σφάλμα κατά την επεξεργασία του βιβλίου, κάντε «κλικ» στην επιλογή «Εμφάνιση λεπτομερειών» για περισσότερες πληροφορίες
hr: Došlo je do greške prilikom obrade knjige, klikni na "Više detalja" za dodatne informacije
nb: Det oppstod en feil ved prosessering av en bok. Klikk "Vis detaljer" for mer informasjon.
sk: Pri spracovaní knihy sa vyskytla chyba, kliknite na "Zobraziť podrobnosti" pre viac informácií

source: Book is queued for processing on the server...
bs: Knjiga je dodana za obradu na serveru...
el: Το βιβλίο είναι σε σειρά αναμονής για την επεξεργασία στο διακομιστή ...
he: הספר נמצא בתור לעיבוד בשרת...
hr: Knjiga čeka red za obradu na poslužitelju...
nb: Boken er lagt på køen for prosessering på serveren...
sk: Kniha bola zaradená pre spracovanie na server...
tr: Sunucuda işlem yapmak için kitap gerekli...

source: Book is being prepared for reading on the server...
bs: Knjiga se priprema za čitanje na serveru...
el: Βιβλίο προετοιμάζεται για ανάγνωση στον διακομιστή ...
he: הספר נמצא בשלבי הכנה לקריאה בשרת...
hr: Knjiga se priprema za čitanje na poslužitelju...
nb: Boken ble forberedt for lesing på serveren...
sk: Príprava knihy na čítanie na servery...
tr: Kitap okunmak için sunucuda hazır hale getiriliyor...

source: Downloaded {}, saving to disk, this may take a few seconds...
bs: Skinuto {}, spremam na disk, ovo može potrajati nekoliko sekundi...
el: Λήψη {} και αποθήκευση στον δίσκο. Μπορεί να διαρκέσει μερικά δευτερόλεπτα ...
he: {} הורדו, שומר לדיסק, זה עלול לקחת מספר שניות...
hr: Preuzeto {}, sprema se na disk, može malo potrajati...
nb: Lastet ned {}, og lagrer på disk. Dette kan ta et par sekunder..
sk: Stiahnuté {}, ukladá sa na disk, môže to trvať niekoľko sekúnd...
tr: Yüklendi {}, diske kaydediliyor. Bu biraz zaman alabilir.

source: Downloaded {0}, {1} left
bs: Skinuto {0}, {1} još ostalo
el: Λήψη {0}, απόμειναν {1}
he: הורדו {0}, {1} נותרו
hr: Preuzeto {0}, {1} čeka
nb: Lastet ned {0}, {1} igjen
sk: Stiahnuté {0}, {1} ostáva
tr: {0} yüklendi, {1} kaldı

source: Could not download book
bs: Ne mogu skinuti knjigu
el: Αδύνατη η λήψη βιβλίου
he: לא ניתן להוריד את הספר
hr: Nisam mogao preuzeti knjigu
nb: Kunne ikke laste ned bok
sk: Nebolo možné stiahnuť knihu
tr: Kitap indirilemiyor

source: Failed to download some book data, click "Show details" for more information
bs: Neuspio pokušaj skidanja nekih od podataka knjige, klikni "Prikaži detalje" za više informacija
el: Αποτυχία λήψης κάποιων δεδομένων του βιβλίου. κάντε «κλικ» στην επιλογή «Εμφάνιση λεπτομερειών» για περισσότερες πληροφορίες
he: נכשל בהורדת כמה נתוני ספר, לחץ על "הצג פרטים" למידע נוסף
hr: Neuspješno preuzimanje dijela knjiških podataka, klikni "Više detalja" za dodatne informacije
nb: Feilet ved nedlastning av noe bokdata. Klikk "Vis detaljer" for mer informasjon
sk: Nebolo možné stiahnuť niektoré dáta knihy, kliknite na "Zobraziť podrobnosti" pre viac informácií
tr: Bazı kitap verileri indirilemedi, daha fazla bilgi için "Detayları Göster"e tıklayın

source: Failed to load MathJax manifest
bs: Neuspio pokušaj učivanja MathJax sažetka
hr: Ne mogu učitati MathJax manifest
nb: Feilet ved lasting av MathJax manifestet
sk: Nebolo možné načítať MathJax manifest

source: Could not open {title} as the MathJax manifest failed to load, click "Show Details" for more information.
bs: Neuspjelo otvaranje {title} jer se MathJax sažetak nije uspio učitati, klikni "Prikaži detalje" za dodatne informacije.
hr: Ne mogu otvoriti {title} jer se MathJax manifest nije učitao, klikni "Više detalja" za dodatne informacije.
nb: Kunne ikke åpne {title} da MathJax manifestet feilet under lasting. Klikk "Vis detaljer" for mer informasjon
sk: Nie je možné otvoriť {title}, keďže sa nepodarilo načítať MathJax manifest, kliknite "Zobraziť podrobnosti" pre viac informácií.

source: The MathJax manifest is not valid
bs: MathJax sažetak nije ispravan
hr: MathJax manifest nije valjan
nb: MathJax manifestet er ugyldig
sk: MathJax manifest nie je platný

source: Downloading MathJax to render mathematics in this book...
bs: Skidanje MathJax za izračunavanje matematike u ovoj knjizi...
el: Λήψη MathJax να καταστήσει τα μαθηματικά σε αυτό το βιβλίο ...
hr: Preuzimam MathJax za prikaz matematičkih formula u ovoj knjizi...
nb: Laster ned MathJax for å vise matemakk i denne boka..
sk: Sťahuje sa MathJax pre vykreslenie matematiky v tejto knihe...

source: Could not download MathJax
bs: Nije moguće skidanje MathJax
el: Αδύνατη η λήψη MathJax
hr: Nisam mogao preuzeti MathJax
nb: Kunne ikke laste ned MathJax
sk: Nebolo možné stiahnuť MathJax
tr: MathJax indirilemiyor

source: Failed to download some MathJax data, click "Show details" for more information
bs: Nije moguće skidanje nekih MathJax podataka, klikni na "Prikaži detalje" za dodatke informacije
el: Αποτυχία λήψης κάποιων δεδομένων MathJax. Κάντε «κλικ» στην επιλογή «Εμφάνιση λεπτομερειών» για περισσότερες πληροφορίες
he: נכשל בהורדת כמה נתוני MathJax, לחץ על "הצג פרטים" למידע נוסף
hr: Nisam mogao preuzeti dijelove podataka za MathJax, klikni na "Više detalja" za dodatne informacije
nb: Feilet ved lasting av MathJax data. Klikk "Vis detaljer" for mer informasjon.
sk: Nebolo možné stiahnuť niektoré dáta MathJax, kliknite na "Zobraziť podrobnosti" pre viac informácií
tr: Bazı MathJax verilerini indirmede hata, daha fazla bilgi için "Detayları Göster" tıklayın

source: Loading data, please wait...
hr: Učitavam podatke, molim pričekajte...
sk: Načítavam dáta, prosím počkajte...

source: Footnote
hr: Napomena
sk: Poznámka pod čiarou

source: Invisible text
bs: Nevidljivi tekst
hr: Nevidljivi tekst
sk: Neviditelný text

source: The text <i>{}</i> is present on this page but not visible
bs: Tekst <i>{}</i> je na ovoj stranici ali nije vidljiv
hr: Tekst <i>{}</i> je prisutan na stranici, ali nije vidljiv.
sk: Text <i>{}</i> sa nachádza na tejto stránke ale nie je viditeľný

source: Next section
hr: Sljedeći odjeljak
sk: Ďalšia časť

source: Previous section
hr: Prethodni odjeljak
sk: Predchádzajúca časť

source: Document end
hr: Kraj dokumenta
sk: Koniec dokumentu

source: Metadata
hr: Metapodaci
sk: Metadáta

source: Details about this book
sk: Detaily o tejto knihe

source: Are you sure you want to remove this book from local storage? You will have to re-download it from calibre if you want to read it again.
bs: Da li zaista želite ukloniti ovu knjigu sa lokalne pohrane? Ukoliko je želite ponovo pročitati trebat ćete je ponovo skinuti sa calibre.
el: Είστε βέβαιοι ότι θέλετε να αφαιρέσετε αυτό το βιβλίο από την τοπική αποθήκευση; Θα πρέπει να το ξανακατεβάσετε από το calibre, αν θέλετε να το διαβάσετε ξανά.
hr: Sigurno želite ukloniti knjigu iz lokalnog skladišta? Morat ćete je ponovo preuzeti ako je poželite opet čitati.
nb: Er du sikker på at du vil fjerne denne boken fra lokal lagring? Du må laste den ned på nytt fra calibre hvis du ønsker å lese den igjen
sk: Naozaj chcete odobrať túto knihu z lokálneho úložiska? Ak ju bude chcieť opäť čítať, tak ju budete musieť znovu stiahnuť z calibre.
tr: Bu kitabı yerel depolama alanınızdan silmek istediğinize emin misiniz? Tekrar okumak isterseniz kitabı calibre'den tekrar indirmeniz gerekecektir.

source: Delete book
bs: Izbriši knjigu
el: Διαγραφή βιβλίου
hr: Izbriši knjigu
nb: Slett boka
sk: Zmazať knihu
tr: Kitabı sil

source: Deleting local book copy, please wait...
bs: Brisanje lokalne kopije knjige, sačekajte...
el: Διαγραφή τοπικού αντιγράφου του βιβλίου, παρακαλώ περιμένετε ...
hr: Brisanje lokalne kopije, pričekajte...
nb: Sletter lokal kopi. Vennligst vent..
sk: Odstraňuje sa lokálna kópia knihy, prosím čakajte...
tr: Kitabın yerel kopyası siliniyor, lütfen bekleyin...

source: Failed to delete book from local storage, click "Show details" for more information.
bs: Neuspjelo brisanje knjige sa lokalne pohrane, klikni na "Prikaži detalje" za dodatne informacije.
el: Αποτυχία διαγραφής βιβλίου από την τοπική αποθήκευση. Κάντε «κλικ» στην επιλογή «Εμφάνιση λεπτομερειών» για περισσότερες πληροφορίες
hr: Neuspješno brisanje knjige iz lokalnog skladišta, klikni "Više detalja" za dodatne informacije
nb: Feilet ved sletting av bok fra lokal lagring. Klikk "Flere detaljer" for mer informasjon
sk: Nebolo možné odstrániť knihu z lokálneho úložiska, kliknite na "Zobraziť podrobnosti" pre viac informácií
tr: Kitap yerel depolama alanınızdan silinemedi. Daha fazla bilgi için "Detayları Göster"e tıklayın.

source: Return to list of books
bs: Povratak na listu knjiga
el: Επιστροφή στην λίστα βιβλίων
hr: Povratak na popis knjiga
nb: Returner til listen over bøker
sk: Vrátiť sa na zoznam kníh
tr: Kitap listesine dön.

source: Back
bs: Nazad
el: Πίσω
he: אחורה
hr: Natrag
nb: tilbake
sk: Späť
tr: Geri

source: Forward
bs: Naprijed
el: Εμπρός
he: קדימה
hr: Naprijed
nb: Neste
sk: Dopredu
tr: İleri

source: Search for text in this book
bs: Pretraži tekst u ovoj knjizi
el: Αναζήτηση κειμένου στο βιβλίο
he: חפש טקסט בספר זה
hr: Traži tekst u ovoj knjizi
nb: Søk etter tekst i denne boken
sk: Hľadať text v tejto knihe
tr: Kitap içinde metin ara

source: Go to
bs: Idi na
el: Μετάβαση σε
hr: Idi na
nb: Gå til
sk: Prejsť na
tr: Konumuna git

source: Go to a specific location in the book
bs: Idi na određenu lokaciju u knjizi
el: Μεταφορά σε συγκεκριμένη τοποθεσία του βιβλίου
hr: Idi na točno određeni položaj u knjizi
nb: Gå til en spesifikk lokasjon i boka
sk: Prejsť na konkrétne miesto v knihe

source: Sync
bs: Sinhronizacija
hr: Sinkronizacija
nb: Synkroniser
sk: Synchronizovať

source: Get last read position and annotations from the server
bs: Preuzmi posljednju poziciju čitanja i zabilješki sa servera
nb: Gent siste leseposisjon og annotasjoner fra serveren
sk: Získať poslednú prečítanú pozíciu a poznámky zo servera

source: Delete this book from the device
bs: Izbriši ovu knjigu sa uređaja
el: Διαγραφή βιβλίου από τη συσκευή
hr: Izbriši knjigu sa uređaja
nb: Slette denne boken fra enheten
sk: Zmazať túto knihu zo zariadenia
tr: Kitabı bu cihazdan sil

source: Reload
bs: Učitaj ponovo
el: Επαναφόρτωση
hr: Ponovno učitaj
nb: Last på nytt
sk: Obnoviť
tr: Yeniden yükle

source: Reload this book from the server
bs: Ponovo učitaj knjigu sa servera
el: Φορτώσετε εκ νέου αυτό το βιβλίο από τον διακομιστή
hr: Ponovno učitaj ovu knjigu sa poslužitelja
nb: Relast denne boken fra serveren
sk: Načítať túto knihu zo servera
tr: Bu kitabı sunucudan tekrar yükle
