Repository: Easonqsp/calibre-translations
Catalog: content-server/*.po
Languages: bs, el, he, hr, nb, sk, tr

source: Fetching data from server, please wait
el: Ανάκτηση δεδομένων από το διακομιστή, παρακαλώ περιμένετε
he: משיכג נתונים משרת, אנא המתן
tr: Sunucudan veri alınıyor, lütfen bekleyin...

source: Could not change library
el: Δεν ήταν δυνατή η αλλαγή της βιβλιοθήκης
he: לא ניתן לשנות ספריה
tr: Kitaplık değiştirilemedi

source: Could not change sort order
el: Δεν ήταν δυνατή η αλλαγή ταξινόμησης
he: לא ניתן לשנות סדר מיון
tr: Mevcut sıralama değiştirilemedi

source: Could not change search query
el: Δεν ήταν δυνατή η αλλαγή του ερωτήματος αναζήτησης
he: לא ניתן לשנות את שאילתת החיפוש
tr: Arama sorgusu değiştirilemedi

source: The search expression could not be parsed:
el: Η έκφραση αναζήτησης δεν μπορούσε να αναλυθεί:
he: ביטוי החיפוש לא ניתן לניתוח:
tr: Arama sorgusu çözümlenemedi:

source: Please close all other tabs with a calibre book open
el: Παρακαλώ κλείστε όλες τις άλλες καρτέλες με ανοιχτό βιβλίο calibre
tr: Lütfen calibre açık kitap içeren tüm diğer sekmeleri kapayın
