Repository: Easonqsp/calibre-translations
Catalog: content-server/*.po
Languages: bs, el, he, hr, nb, sk, tr

source: Table of Contents
bs: Sadržaj
el: Πίνακας Περιεχομένων
he: תוכן העניינים
hr: Sadržaj
nb: Innholdsfortegnelse
sk: Obsah
tr: İçindekiler

source: Font size
bs: Veličina fonta
hr: Veličina pisma
nb: Skrift størrelse
sk: Veľkosť písma
tr: Font boyutu

source: Change text size
bs: Promijeni veličinu teksta
el: Αλλαγή μεγέθους κειμένου
hr: Promijeni veličinu teksta
nb: Endre tekststørrelse
sk: Zmeniť veľkosť textu
tr: Yazı büyüklüğünü değiştir

source: Preferences
bs: Opcije
el: Προτιμήσεις
hr: Postavke
nb: Innstillinger
sk: Nastavenia
tr: Tercihler

source: Configure the book reader
bs: Podesi čitač knjiga
el: Ρυθμίστε τις παραμέτρους του αναγνώστη βιβλίων
hr: Prilagodi čitač knjiga
nb: Konfigurer bokleseren
sk: Nastaviť čítačku
tr: Kitap okuyucuyu düzenle

source: Full screen
hr: Puni zaslon
sk: Na celú obrazovku

source: Are you sure you want to reload this book?
bs: Želiš li zaista da ponovo učitaš ovu knjigu?
el: Είστε σίγουρος/η ότι θέλετε να επαναφορτώσετε το βιβλίο;
hr: Sigurno želite ponovno učitati ovu knjigu?
nb: Er du sikker på at du vil relaste denne boken?
sk: Ste si istý, že chcete opäť načítať túto knihu?
tr: Bu kitabı tekrar yüklemek istediğinize emin misiniz?

source: Reload book
bs: Ponovo učitaj knjigu
el: Επαναφόρτωση βιβλίου
hr: Ponovno učitaj knjigu
nb: Relast bok
sk: Opätovne načítať knihu
tr: Ktabı tekrar yükle

source: Go to…
bs: Idi na...
hr: Idi na...
sk: Prejsť na...

source: Tap (or right click) for controls
sk: Ťuknutím (alebo pravým klikom) zobrazíte ovládacie prvky

source: Tap to turn back
sk: Ťuknutím sa vrátite späť

source: Tap to turn page
sk: Ťuknutím otočíte stranu

source: Bootstrapping book reader...
bs: Bootstrapping čitač knjige...
nb: Oppstarter bokleseren...
sk: Inicializácia čítačky...
tr: Kitap okuyucusu başlatılıyor...

source: Not found
bs: Nije pronađeno
el: Δεν βρέθηκε
hr: Nije nađeno
sk: Nenájdené
tr: bulunamadı

source: The text: <i>{}</i> was not found in this book
bs: Tekst: <i>{}</i> nije pronađen u ovo knjizi
hr: Tekst: <i>{}</i> nije nađen u ovoj knjizi
sk: Text: <i>{}</i> nebol nájdený v tejto knihe

source: Missing file
bs: Nedostaje datoteka
hr: Nedostaje datoteka
sk: Chýbajúci súbor

source: There was an error processing the book
bs: Pojavila se greška tokom obrade knjige
el: Υπήρξε ένα σφάλμα κατά την επεξεργασία του βιβλίου
he: אירעה שגיאה בעיבוד הספר
nb: Det skjedde en feil ved prosessering av boka
sk: Pri spracovaní knihy sa vyskytla chyba
tr: Kitap işlenirken hata oluştu

source: Loading <i>{name}</i> from <i>{title}</i>, please wait...
bs: Učitavanje <i>{name}</i> od <i>{title}</i>, sačekajte...
el: Φόρτωση <i>{name}</i> από <i>{title}</i>, παρακαλώ περιμένετε...
nb: Laster <i>{name}</i> av <i>{title</i>, vennligst vent...
sk: Načítava sa <i>{name}</i> from <i>{title}</i>, prosím čakajte...

source: Destination does not exist
bs: Odredište ne postoji
el: Ο προορισμός δεν υπάρχει
hr: Odredište ne postoji
nb: Målet finnes ikke
sk: Cieľ neexistuje
tr: Hedef bulunmamakta

source: The file {} does not exist in this book
bs: Datoteka {} ne postoji u ovoj knjizi
el: Το αρχείο {} δεν υπάρχει σε αυτό το βιβλίο
he: הקובץ {} אינה קיים בספר זה
hr: Datoteka {} ne postoji u ovoj knjizi
nb: Fila {} finnes ikke i denne boka
sk: Súbor {} v tejto knihe neexistuje
tr: Bu kitapta {} dosyası bulunmamakta

source: Add
sk: Pridať

source: Empty
sk: Prázdne

source: Book title
sk: Názov knihy

source: Authors
hr: Autori
sk: Autori

source: Series
sk: Sérií

source: Current section
sk: Aktuálny výber

source: Progress
hr: Progres
sk: Priebeh

source: Left
sk: Vľavo

source: Middle
sk: Stred

source: Right
sk: Vpravo

source: Header
sk: Hlavička

source: Footer
sk: Päta

source: {0} of {1}
sk: {0} z {1}

source: Configure book reader
bs: Podesi čitač knjige
hr: Prilagodi čitač knjiga
nb: Konfigurer bokleseren
sk: Konfigurovať čítačku kníh

source: Colors
bs: Boje
el: Χρώματα
hr: Boje
nb: Farger
sk: Farby
tr: Renkler

source: Colors of the page and text
sk: Farba strany a textu

source: Page layout
sk: Rozloženie strany

source: Page margins and number of pages per screen
sk: Okraje strany a počet strán na obrazovku

source: Headers and footers
sk: Hlavičky a päty

source: Customize the headers and footers
sk: Prispôsobiť hlavičky a päty

source: Cannot remove
bs: Nije moguće ukloniti
el: Αδύνατη η αφαίρεση
nb: Kan ikke fjerne
sk: Nemôžem odobrať
tr: Silinemez

source: Name not specified
bs: Nije određen naziv
el: Δεν έχει οριστεί Όνομα
nb: Navn ikke spesifisert
sk: Názov nezadaný

source: Invalid color
bs: Nevažeća boja
hr: Nevaljala boja
nb: Ugyldig farge
sk: Neplatná farba
tr: Geçersiz renk

source: The color {} is not a valid color
bs: Boja {} nije važeća
nb: Fargen {} er ikke en gyldig farge
sk: Farba {} nie je platnou farbou

source: New scheme
bs: Nova šema
nb: Nytt skjema
sk: Nová schéma

source: Edit scheme
bs: Promijeni šemu
nb: Rediger skjema
sk: Upraviť schému

source: Remove scheme
bs: Ukloni šemu
nb: Fjern skjema
sk: Odstrániť schému

source: Background:
bs: Pozadina:
hr: Pozadina:
nb: Bakgrunn:
sk: Pozadie:
tr: Arkaplan:

source: Foreground:
bs: Prednja strana:
hr: Prednja strana:
nb: Front:
sk: Popredie:
tr: Önplan:

source: Top:
bs: Gore:
hr: Vrh:
nb: Topp:
sk: Hore:
tr: Üst:

source: Bottom:
bs: Dole:
hr: Dno:
nb: Bunn:
sk: Dole:
tr: Alt:

source: Left:
bs: Lijevo:
hr: Lijevo:
nb: Venstre:
sk: Vľavo:
tr: Sol:

source: Right:
bs: Desno:
hr: Desno:
nb: Høyre:
sk: Vpravo:
tr: Sağ:

source: Paged mode
bs: Stranični mod
nb: Side modus
sk: Stránkový režim

source: Flow mode
bs: Tečni mod
nb: Flyt modus
sk: Plynulý režim

source: In portrait orientation:
bs: U uspravnoj orijentaciji:
nb: I portrett retning:
sk: Pri orientácii na výšku:

source: In landscape orientation:
bs: U položenoj orijentaciji:
nb: I landskap retning:
sk: Pri orientácii na šírku:

source: Change the maximum screen area (in pixels) used to display text. A value of zero means that all available screen area is used.
sk: Zmeniť maximum plochy (v pixeloch), ktorý sa má použiť na zobrazenie textu. Nulová hodnota znamená, že sa použije všetká dostupná plocha.

source: Max. width:
bs: Maksimalna širina:
hr: Max. širina:
nb: Maks bredde:
sk: Max. šírka:
tr: Azami genişlik:

source: Max. height:
bs: Maksimalna visina:
hr: Max. visina:
nb: Maks høyde:
sk: Max. výška:
tr: Azami yükseklik:

source: Custom size
bs: Prilagođena veličina
hr: Prilagođena veličina
nb: Tilpasset størrelse
sk: Vlastná veľkosť
tr: Özel boyut

source: Font size (pixels):
bs: Veličina fonta (u pikselima):
hr: Veličina pisma (pikseli):
nb: Skrift størrelse (piksler):
sk: Veľkosť písma (pixely):

source: Failed to communicate with "{}", network error, is the server running and accessible?
hr: Neuspješan pokušaj komunikacije sa "{}", mrežna pogreška, je li poslužitelj pokrenut i dostupan?

source: OK
el: Εντάξει
hr: U redu
tr: TAMAM

source: The library restriction for the current user is invalid: {}
hr: Ograničenja biblioteke za trenutnog korisnika su nevažeća: {}

source: Failed to load Tag browser data
hr: Neuspjelo učitavanje podataka preglednika oznaka

source: Fetching data for the Tag browser, please wait
hr: Dohvaćanje podataka za preglednik oznaka, pričekajte

source: Change how the tags/authors/etc. are sorted in the "Tag browser"
hr: Promijeni kako su oznake/pisci/itd. posloženi u pregledniku oznaka

source: Tag browser category partitioning method
hr: Način razdvajanja kategorija u pregledniku oznaka

source: Choose how Tag browser subcategories are displayed when there are more items than the limit. Select by first letter to see an A, B, C list. Choose partitioned to have a list of fixed-sized groups. Set to disabled if you never want subcategories.
hr: Odaberi kako su prikazane podkategorije preglednika oznaka, kad postoji više stavki od ograničenja. Odaberi prvo slovo za prikaz A, B, C popisa. Odaberi razdvajanje za popise sa fiksnom veličinom grupe. Onemogući ako nikad ne želiš vidjeti podkategorije.

source: If a "Tag browser" category has more than this number of items, it is divided up into subcategories. If the partition method is set to disable, this value is ignored.
hr: Ako kategorija preglednika oznaka ima više stavki od ovog broja, dijeli se na podkategorije. Ako je metoda podjele onemogućena, vrijednost se zanemaruje.

source: A comma-separated list of categories in which items containing periods are displayed in the Tag browser trees. For example, if this box contains 'tags' then tags of the form 'Mystery.English' and 'Mystery.Thriller' will be displayed with English and Thriller both under 'Mystery'. If 'tags' is not in this box, then the tags will be displayed each on their own line.
hr: Popis kategorija razdvojenih zarezom, gdje su stavke koje sadrže točke prikazane u stablu preglednika oznaka. Npr. "Misterija.Engleska" i "Misterija.Triler" će oboje biti prikazani pod "Misterija".

source: Configure Tag browser
hr: Konfiguriraj preglednik oznaka

source: You are using a browser that does not have the iframe srcdoc attribute. This is not supported. Use a better browser such as <b>Google Chrome</b> or <b>Mozilla Firefox</b>, instead. You can also use the simplified <a href="mobile">/mobile</a> interface if you do not have access to a modern browser.
hr: Koristite preglednik koji nema iframe src atribut. To nije podržano. Prijeđite na bolji preglednik poput <b>Google Chrome</b> ili <b>Mozilla Firefox</b>. Možete koristiti pojednostavljeno <a href="mobile">/mobile</a> sučelje ako nemate pristup modernom pregledniku.

source: Showing books matching: {}
bs: Prikaži knjige koje se poklapaju: {}
hr: Prikazujem knjige koje odgovaraju: {}

source: Failed to load books from calibre library, with error:
bs: Nesupješan pokušaj učitavanja knjiga iz calibre biblioteke, s greškom:
hr: Neuspješno učitavanje knjiga iz calibre biblioteke, s greškom:

source: Choose a Virtual library to browse from the list below
hr: Odaberi Virtualnu biblioteku za pregled sa popisa ispod

source: Choose book list mode…
hr: Odaberi način prikaza popisa knjiga...

source: Choose a display mode for the list of books from below
hr: Odaberi način prikaza za popis sa knjigama

source: What would you like to do with the {} format?
hr: Što želite učiniti sa {} formatom?

source: Read or download this book in the {} format
hr: Čitaj ili preuzmi ovu knjigu u {} formatu

source: Offline storage quota exceeded! Try deleting some stored books first.
hr: Premašili ste dozvoljenu veličinu offline skladišta! Prvo izbrišite neku knjigu.

source: Your browser does not support IndexedDB. Cannot read books. Consider using a modern browser, such as Chrome or Firefox.
hr: vaš preglednik ne podržava IndexedDB. Ne mogu čitati knjige. Upotrijebite drugi preglednik poput Google Chromea ili Mozilla Firefoxa.

source: Failed to read the file {0} for the book {1} from the browser offline cache.
hr: Ne mogu pročitati datoteku {0} za knjigu {1} iz preglednikovog offline spremnika.

source: This usually means the cache is close to full. Clear the browser cache from the browser settings.
hr: Ovo obično znači da je cache gotovo pun. Obrišite cache vašeg preglednika iz postavki preglednika.

source: Cannot read file from book
bs: Nemoguće čitanje datoteke iz knjige
hr: Ne mogu pročitati datoteku iz knjige

source: Failed to read the MathJax files from the browser offline cache.
hr: Ne mogu pročitati MathJax datoteke iz preglednikovog offline spremnika.

source: Failed to read recent books from local storage
bs: Neuspješno čitanje nedavnih knjiga sa lokalne pohrane
hr: Ne mogu pročitati nedavno dodane knjige iz lokalnog skladišta.

source: Close Search bar
hr: Zatvori Pretragu

source: Book id #{}
hr: Knjiga id #{}

source: Cannot read books
hr: Ne mogu čitati knjige

source: Go to this footnote in the main view
hr: Idi na ovu napomenu u glavnom pregledu

source: Close the footnotes window
hr: Zatvori prozor napomena

source: Loading note, please wait...
hr: Učitavam bilješku, pričekajte...

source: Document start
hr: Početak dokumenta

source: Syncing to last read position
hr: Sinkronizacija sa zadnjom točkom u pročitanom tekstu

source: Downloading last read data from server, please wait...
hr: Preuzimam podatke o zadnjoj točci u pročitanom tekstu sa poslužitelja, pričekajte...

source: Failed to fetch sync data
hr: Neuspješno preuzimanje podataka za sinkronizaciju.

source: Failed to download last read data from server, click "Show details" for more information.
hr: Neuspješno preuzimanje podatke o zadnjoj točci u pročitanom tekstu, klikni "Više detalja" za dodatne informacije

source: Enter full screen mode
hr: Uđi u način punog zaslona

source: Failed to load tag browser data
el: Η φόρτωση δεδομένων από τον περιηγητή ετικετών απέτυχε
he: כישלון בטעינת נתוני דפדפן התגיות
nb: Feilet ved lasting av data til merlapputforsker
tr: Tarayıcı verisi yüklemesi başarısız oldu

source: Fetching data for the tag browser, please wait
el: Πρόσβαση στα δεδομένα για την περιηγητή ετικεκών, παρακαλώ περιμένετε
he: מביא נתונים עבור דפדפן התגיות, אנא המתן
nb: Henter data for merkelapputforskeren. vennligst vent
tr: Etiket tarayıcısı için veri alınıyor, lütfen bekleyin...

source: Change how the tags/authors/etc. are sorted in the Tag Browser
el: Αλλαγή ταξινόμησης των ετικετών/συγγραφέων/κ.τ.λ. στον περιηγητή ετικετών
he: שנה את הדרך בה התגיות/המחברים וכו' מתמיינים בדפדפן התגיות
nb: Endre hvordan merkelapper/forfattere/o.l. er sortert i merkelapputforskeren
tr: Etiketler/yazarlar/vs.'nin Etiket Tarayıcısında nasıl sıralandığını değiştir

source: Tags browser category partitioning method
el: Μέθοδος διαμέρισης κατηγοριών του περιηγητή ετικετών
he: שיטת חלוקה בקטגורית תגיות דפדפן
nb: Delingsmetode for merkleapputforkers kategori
tr: Etiket tarayıcısı sınıflandırma bölümlendirme yöntemi

source: Choose how tag browser subcategories are displayed when there are more items than the limit. Select by first letter to see an A, B, C list. Choose partitioned to have a list of fixed-sized groups. Set to disabled if you never want subcategories.
el: Επιλέξτε τον τρόπο εμφάνισης των υποκατηγοριών του περιηγητή ετικετών, όταν υπάρχουν περισσότερα στοιχεία από το όριο. Επιλογή με βάση το πρώτο γράμμα για την εμφάνιση αλφαβητικής λίστας. Επιλέξτε διαμέριση για να έχετε μια λίστα των πάγιων-μεγέθους ομάδων. Απενεργοποιήστε το, αν δεν θέλετε υποκατηγορίες.
nb: Velg hvordan merkelapputforskerens underkategorier vises når det er flere ting en grensen. Velg første bokstav for å se en A, B, C liste. Velg partisjonert for å ha en liste med grupper med fast-bredde. Sett på avskrudd hvis du aldri vil ha underkategorier.
tr: Sınır değerinden fazla öğe olduğunda etiket tarayıcısı alt sınıflandırmalarının nasıl görüneceğini seçin. Alfabeye göre sıralı listeyi görmek için önce ilk harfi girin. "bölümlendirilmiş"i seçerek sabit boyutlu gruplar elde edin. Alt sınıflandırmalar istemiyorsanız etkinleştirmeyin.

source: If a Tag Browser category has more than this number of items, it is divided up into subcategories. If the partition method is set to disable, this value is ignored.
el: Εάν μια κατηγορία του περιηγητή ετικετών έχει περισσότερα, από αυτόν τον αριθμό, αντικείμενα, τότε χωρίζεται σε υποκατηγορίες. Αν η μέθοδος διαμέρισης είναι απενεργοποιημένη, η τιμή αυτή παραβλέπεται.
nb: Hvis en merkelappuforskerkategorier har flere enn dette antall ting, deles den opp i underkategorier. Hvis delingsmetoden er satt til avskrudd vil denne verdien ignoreres.
tr: Eğer bir Etiket Tarayıcı kategorisi bu sayıdan fazla öğeye sahipse, alt kategorilere bölünür. Bölümleme yöntemi kapalı olarak ayarlanmışsa, bu değer göz ardı edilir.

source: A comma-separated list of categories in which items containing periods are displayed in the tag browser trees. For example, if this box contains 'tags' then tags of the form 'Mystery.English' and 'Mystery.Thriller' will be displayed with English and Thriller both under 'Mystery'. If 'tags' is not in this box, then the tags will be displayed each on their own line.
el: Μια λίστα διαχωρισμένη με κόμματα των κατηγοριών, στην οποία τα στοιχεία που περιέχουν περιόδους εμφανίζονται στα δέντρα του προγράμματος περιήγησης ετικετών. Για παράδειγμα, εάν αυτό το παράθυρο περιέχει «ετικέτες» τότε οι ετικέτες της μορφής « Μυστήριο.Αγγλικά »και« Μυστήριο.Φόβου » θα εμφανιστούν με την μορφή δένδρου, δηλαδή «Αγγλικά» και «Φόβου» ως υποκόμβοι υπό τον κόμβο «Μυστήριο». Αν αυτό το παράθυρο δεν περιέχει «ετικέτες», τότε οι ετικέτες θα εμφανιστούν ξεχωριστά σε δική τους γραμμή.
nb: En kommaseparert liste med kategorier hvor ting som inneholder puktum vises i merklapputforskerens trær. For eksempl, hvis boksen inneholder 'tags', så merkelapper på formen 'Mystery.English' og 'Mystery.Thriller' vil bli vist med English og Thriller begge under 'Mystery'. Hvis 'tags' ikke er boksen, da vil merkelappen bli vist hver på sin linje.
tr: Nokta içeren öğeler etiket tarayıcı ağaçlarında gösterildiği virgülle ayrılmış kategori listesi. Örneğin, bu kutu 'etiketler' içeriyorsa, 'Gizem.İngilizce' ve 'Gizem.Korku' biçimindeki etiketler 'Gizem' altında hem İngilizce hem de Korku içerecek şekilde görüntülenir. 'etiketler' bu kutuda değilse, etiketler her biri kendi satırında olacak şekilde görüntülenir.

source: Configure Tag Browser
el: Διαμόρφωση περιηγητή ετικετών
he: קבע תצורת דפדפן התגיות
nb: Konfigurer merkleapputforskeren
tr: Etiket Tarayıcıyı Ayarla

source: Book List Mode
el: Λειτουργεία λίστας βιβλίων
he: מצב רשימת ספרים
nb: Boklistemodus
tr: Kitap Listesi Modu

source: A Random Book
el: Ένα τυχαίο βιβλίο
he: ספר אקראי
nb: En tilfeldig bo
tr: Rastgele Kitap

source: Read this book in the {} format
el: Ανάγνωση βιβλίου στην μορφή {}
he: קרא ספר זה בפורמט {}
nb: Les denne boken i {} format
tr: Bu kitabı {} biçiminde okuyun

source: Download the {} format of this book
el: Λήψη μορφής {} του βιβλίου
he: הורד את הפורמט {} של ספר זה
nb: Last ned {} for denne boka
tr: Bu kitabın {} biçimini indirin

source: of
he: של
nb: av
tr: içinden

source: Download this book in the {} format
el: Λήψη βιβλίου στην μορφή {}
he: הורד ספר זה בפורמט {}
nb: Last ned denne boken i {} format
tr: Bu kitabı {} biçiminde indir

source: Your browser does not support IndexedDB. Cannot read books. Consider using a modern browser, such as Firefox, Chrome or Edge.
el: Αδύνατη η ανάγνωση των βιβλίων. Το πρόγραμμα περιήγησής σας δεν υποστηρίζει IndexedDB. Σκεφτείτε να χρησιμοποιήσετε ένα σύγχρονο πρόγραμμα περιήγησης, όπως το Firefox, Chrome ή Edge.
he: הדפדפן שלך אינו תומך ב-IndexedDB. לא ניתן לקרוא ספרים. שקול להשתמש בדפדפן מודרני, כגון פיירפוקס, כרום או אדג'.
nb: Nettleseren din støtter ikke IndexedDB. Kunne ikke lese bøker. Vurder å bytte til en moderne nettleser, som for eksempel Firefox, Chrome eller Edge.
tr: Tarayıcınız EndeksDB'yi desteklemiyor. Kitapları okuyamıyor. Firefox, Chrome ya da Edge gibi daha modern bir tarayıcı kullanmayı düşünün.

source: Failed to read the file {0} for the book {1} from the database
el: Αποτυχία ανάγνωσης του αρχείου {0} του βιβλίο {1} από τη βάση δεδομένων
he: נכשל בקריאת הקובץ {0} עבור הספר {1} ממסד הנתונים
nb: Feilet ved lesing av fil {0} for bok {1} fra databasen
tr: Veritabanından {1} kitap için dosya {0} okumada başarısız oldu

source: Failed to read the MathJax files from local storage
el: Αποτυχία ανάγνωσης των αρχείων MathJax από την τοπική αποθήκευση
nb: Feilet ved lesing av mathjax ({0}) med feol: {1}
tr: MathJax dosyalarını yerel depolamadan okumada başarısız oldu

source: Sepia Light
nb: Natrulig lys brun

source: Sepia Dark
nb: Natrulig mørk brun

source: Could not open book
el: Δεν ήταν δυνατό το άνοιγμα του βιβλίου
he: לא ניתן לפתוח את הספר
nb: Kunne ikke åpne bok
tr: Kitap açılamadı

source: Click to go back to the details page for: {}
el: Κάντε «κλικ» για να επιστρέψετε στη σελίδα λεπτομερειών για: {}
he: לחץ כדי לחזור אחורה לעמוד הפרטים עבור: {}
nb: Klikk for å gå tilbake til detaljsiden for: {}
tr: {} için detaylar sayfasına geri döne tıklayın

source: Next Section
el: Επόμενο τμήμα
nb: Neste Avsnitt
tr: Sonraki Bölüm

source: Previous Section
el: Προηγούμενο τμήμα
nb: Forrige Avsnitt
tr: Önceki Bölüm

source: Document Start
el: Αρχή Κειμένου
nb: Begynnelsen av dokumentet
tr: Belge Başı

source: Document End
el: Τέλος Κειμένου
nb: Slutten av dokumentet
tr: Belge Sonu

source: Bookmarks
el: Σελιδοδείκτες
he: סימניות
nb: Bokmerker
tr: Yer imleri

source: Change the colors of the page and text
nb: Velg farger for side og tekst

source: Page Layout
el: Διαμόρφωση Σελίδας
nb: Sideutlegg

source: Change the page margins and number of pages per screen
nb: Endre sidemarger og antall sider pr skjerm

source: Cannot remove a builtin color scheme
bs: Nije moguće ukloniti ugrađenu kolornu šemu
nb: Kan ikke fjerne ett innebygd fargeskjema

source: You must specify a name for the color scheme
bs: Trebate odrediti naziv za kolornu šemu
nb: Du må angi et navn for fargeskjemaet

source: Choose a color scheme below
bs: Izaberite kolornu šemu ispod
nb: Velg ett fargeskjema nedenfor

source: Change the page margins (in pixels) below
bs: Promijeni margine stranice (u pikselima) ispod
nb: Endre sidemarger ( i piksler) nedenfor

source: Choose the page layout mode. In paged mode, the text is split up into individual pages, as in a paper book. In flow mode text is presented as one long scrolling page, as in web browsers.
bs: Odaberi mod za izgled stranice. U Straničnom modu, tekst će se podijeliti na pojedinačne stranice, kao u papirnom izdanje knjige. U Tečnom modu tekst će se prikazati kao jedna dugačka lista, kao u internet pretraživačima.
nb: Velg side utforming modus. I side modus, blir teksten delt til enkeltsider, som i en papirbok. I flytmodus blir teksten presentert som en lang rullerbar side, som i nettlesere.

source: In paged mode, control the number of pages per screen. A setting of zero means the number of pages is set based on the screen size.
bs: U Straničnom modu, kontroliše se broj stranica po jednom ekranu. Postavka na nulu podrazumijeva da će broj stranica biti baziran na veličini ekrana.
nb: I side modus, kontrollerer antall sider pr skjerm. Verdien 0 betyr at antall sider baseres på skjermstørrelsen.

source: Change the maximum screen area used to display text. A value of zero means that all available screen area is used.
nb: Endre maksimum skjermområde som skal brukes til å vise tekst. Verdien 0 betyr at hele skjermen blir brukt.

source: Could not search as the spine item {} is missing from the book
bs: Nije moguće izvršiti pretragu jer nedostaju leđa {} knjige

source: Reloading tag browser with updated settings, please wait...
he: טוען את דפדפן התגיות עם הגדרות מעודכנות, נא להמתין...
tr: Etiket tarayıcısı güncellenen ayarlarla yeniden yükleniyor, lütfen bekleyin...

source: Close this panel
el: Κλείσιμο αυτού του πάνελ
he: סגור פאנל זה
tr: Bu paneli kapat

source: Books matching
el: Βιβλία που ταιριάζουν
he: ספרים תואמים
tr: Eşleşen kitaplar

source: Click to clear this search
el: «Κλικ» για καθαρισμό αναζήτησης
he: לחץ לניקוי חיפוש זה
tr: Bu aramayı temizlemek için tıklayın

source: Currently showing the library:
el: Αυτή τη στιγμή εμφανίζονται στη βιβλιοθήκη:
he: כרגע מציג את הספריה:
tr: Şu anda gösterilen kitaplık:

source: Choose a random book from your library
el: Επιλογή ενός τυχαίου βιβλίου της βιβλιοθήκης σας
he: בחר ספר אקראי מהספריה שלך
tr: Kitaplığınızdan rastgele bir kitap seçin

source: Change Library
el: Αλλαγή βιβλιοθήκης
he: שנה ספריה
tr: Kitaplığı Değiştir

source: Choose a different library to display
el: Επιλέξτε την εμφάνιση διαφορετικής βιβλιοθήκης
he: בחר ספריה אחרת להצגה
tr: Gösterilecek farklı bir kitaplık seçin

source: Book Details
el: Λεπτομέρειες βιβλίου
he: פרטי ספר
tr: Kitap Detayları

source: Pick another random book
el: Επιλογή ενός άλλου βιβλίου στην τύχη
he: בחר ספר אקראי אחר
tr: Başka bir rastgele bir kitap seç
