Repository: Easonqsp/calibre-translations
Catalog: content-server/*.po
Languages: bs, el, he, hr, nb, sk, tr

source: Error in message handler
bs: Greška u prenosiocu poruke
el: Σφάλμα στο πρόγραμμα χειρισμού μηνυμάτων
nb: Feil i meldingshåndterere
sk: Chyba v programe správ
tr: Mesaj işleyicisinde hata

source: Failed to communicate with "{}", timed out after: {} seconds
bs: Neuspjela komunikacija sa "{}", zaustavljeno nakon: {} sekundi
el: Αποτυχία σύνδεσης με "{}", το χρονικό όριο έληξε μετά: {} δευτερόλεπτα
he: נכשל ביצירת תקשורת עם "{}", טיים-אאוט אחרי: {} שניות
hr: Neuspješan pokušaj komunikacije sa "{}", isteklo vrijeme nakon: {} sekundi
nb: Kommunikasjon med "{}" feilet. Forsøket timet ut etter: {} sekunder
sk: Komunikácia s "{}" zlyhala, čas vyprší o: {} sekúnd
tr: "{}" ulaşılamadı, zaman aşımı süresi: {} saniye

source: Failed to communicate with "{}", aborted
bs: Neuspjela komunikacija sa "{}", zaustavljeno
el: Αποτυχία σύνδεσης με "{}", απερρίφθη
he: נכשל ביצירת קשר עם "{}", בוטל
hr: Neuspješan pokušaj komunikacije sa "{}", prekinuto
nb: Kommunikasjon med "{}" feilet. Forsøket ble avbrutt
sk: Komunikácia s "{}" zlyhala, prerušené
tr: İletişim başarısız "{}", durduruldu

source: Failed to communicate with "{}", with status: [{}] {}<br><br>{}
bs: Neuspjela komunikacija sa "{}", sa stanjem: [{}] {}<br><br>{}
el: Αποτυχία σύνδεσης με "{}", υπό καθεστώς: [{}] {}<br><br>{}
hr: Neuspješan pokušaj komunikacije sa "{}", statusna poruka: [{}] {}<br><br>{}
nb: Feilet ved kommunikasjon med "{}", status: [{}] {}<br><br>{}
sk: Komunikácia s "{}" zlyhala, so statusom [{}] {}<br><br>{}

source: The calibre web application has been updated. Do you want reload the site?
hr: Calibre web aplikacija je ažurirana. Želite li ponovo učitati stranicu?
sk: Calibre web aplikácia bola aktualizovaná. Chcete znovu načítať stránku?

source: Close
bs: Zatvori
el: Κλείσιμο
he: סגור
hr: Zatvori
nb: Lukk
sk: Zatvoriť
tr: Kapat

source: Show details
bs: Prikaži detalje
el: Εμφάνιση λεπτομερειών
he: הצג פרטים
hr: Prikaži detalje
nb: Vis detaljer
sk: Zobraziť podrobnosti
tr: Ayrıntıları göster

source: Loading, please wait...
bs: Učitavam, molim sačekajte...
el: Φορτώνει, παρακαλώ περιμένετε...
he: טוען, אנא המתן...
hr: Učitavam, molim pričekajte...
nb: Laster, vennligst vent...
sk: Načitava sa, čakajte...
tr: Yükleniyor, lütfen bekleyin...

source: Error:
bs: Greška:
el: Σφάλμα:
he: שגיאה:
hr: Greška:
nb: Feil:
sk: Chyba:
tr: Hata:

source: Warning:
bs: Upozorenje:
el: Προειδοποίηση:
he: אזהרה:
hr: Upozorenje:
nb: Advarsel:
sk: Varovanie:
tr: Uyarı:

source: {percent:.0%} of {total}
sk: {percent:.0%} z {total}

source: A grid of book covers
hr: Naslovnice knjiga prikazana u rešetki
sk: Mriežka obalov kníh

source: by
bs: od
el: από
he: לפי
hr: od
nb: av
sk: od
tr: hayır

source: Unknown
bs: Nepoznato
hr: Nepoznat
sk: Neznáme

source: {} by {}
bs: {} od {}
el: {} μέσω {}
he: {} לפי {}
hr: {} od {}
nb: {} etter {}
sk: {} od {}
tr: Yazar {} Kitap {}

source: A customizable list (see Preferences->Sharing over the net->Book list template)
hr: Prilagodljivi popis (vidi Preferences->Sharing over the net->Book list template)
sk: Prispôsobiteľný zoznam (pozrite Nastavenia->Zdieľanie po sieti->Šablóna zoznamu kníh)

source: <b>{title}</b> by {authors}
hr: <b>{title}</b> od {authors}
sk: <b>{title}</b>od {authors}

source: {series_index} of <i>{series}</i>
hr: {series_index} od <i>{series}</i>
sk: {series_index} z <i>{series}</i>

source: Date: {timestamp}
hr: Datum: {timestamp}
sk: Dátum: {timestamp}

source: Published: {pubdate}
hr: Objavljeno: {pubdate}
sk: Vydané: {pubdate}

source: Publisher: {publisher}
hr: Izdavač: {publisher}
sk: Vydavateľ: {publisher}

source: Yes
bs: Da
el: Ναι
he: כן
hr: Da
nb: Ja
sk: Áno
tr: EVET

source: No
bs: Ne
el: Όχι
he: לא
hr: Ne
nb: Nei
sk: Nie

source: Failed to delete book
bs: Neuspio pokušaj brisanja knjige
el: Αποτυχία διαγραφής βιβλίου
hr: Neuspješan pokušaj brisanja knjige
nb: Feilet ved sletting av bok
sk: Nepodarilo sa odstrániť knihu
tr: Kitap silinirken hata oluştu.

source: What would you like to do with this book?
hr: Što želite učiniti sa ovom knjigom?
sk: Čo by ste chceli urobiť s touto knihou?

source: Read
bs: Čitam
el: Ανάγνωση
he: קרא
hr: Čitaj
nb: Les
sk: Čítať
tr: Oku

source: Delete
bs: Izbriši
el: Διαγραφή
hr: Obriši
nb: Slett
sk: Odstrániť
tr: Sil

source: No downloaded books present
bs: Nijedna knjiga nije skinuta na računar
hr: Nijedna preuzeta knjiga nije dostupna
sk: Nie sú prítomné žiadne stiahnuté knihy

source: Database not initialized
hr: Baza podataka nije pokrenuta
sk: Databáza neinicializovaná

source: Downloaded books
bs: Knjige koje su skinute na računar
hr: Preuzete knjige
sk: Stiahnuté knihy

source: Loading downloaded books from storage, please wait...
bs: Učitavanje knjiga skinutih na računar iz arhive, sačekajte
hr: Učitavaju se preuzete knjige iz skladišta, molim pričekajte...
sk: Načítavam stiahnuté knihy z úložiska, prosím čakajte...

source: Restore default settings
bs: Vrati podrazumijevane postavke
el: Επαναφορά αρχικών ρυθμίσεων
he: שחזר הגדרות ברירת-מחדל
hr: Vrati zadane vrijednosti
nb: Gjenoppretter standard instillinger
sk: Obnoviť pôvodné nastavenia
tr: Varsayılan ayarları geri yükle

source: Continue reading…
bs: Nastavi čitanje...
hr: Nastavi čitanje...
sk: Pokračovať v čítaní...

source: Browse all downloaded books…
hr: Prelistati sve preuzete knjige...
sk: Prezerať všetky stiahnuté knihy...

source: Change password for: {}
hr: Promijeni zaporku za: {}
sk: Zmeniť heslo pre: {}

source: Current password:
hr: Trenutna zaporka:
sk: Terajšie heslo:

source: New password:
hr: Nova zaporka:
sk: Nové heslo:

source: New password again:
hr: Nova zaporka, ponovo:
sk: Nové heslo znovu:

source: Password successfully changed, you will be asked for the new password the next time the browser has to contact the calibre server.
hr: Zaporka uspješno promijenjena, Kada se sljedeći put spojite na calibe poslužitelj, nova zaporka će biti tražena.
sk: Heslo bolo úspešne zmenené, najbližšie keď prehliadač bude musieť kontaktovať calibre server, budete požiadaný o nové heslo.

source: Failed to change password, with error: {}
hr: Zaporka se nije promijenila, zbog greške: {}
sk: Zmena hesla zlyhala s chybou: {}

source: The two new passwords do not match
hr: Nove zaporke se ne podudaraju
sk: Dve nové heslá nesedia

source: Empty passwords are not allowed
hr: Zaporka ne smije biti prazna
sk: Prázdne heslá nie sú dovolené

source: Contacting server, please wait...
hr: Spajanje na poslužitelj, pričekajte...
sk: Kontaktujem server, prosím počkajte...

source: Cancel
bs: Otkaži
el: Ακύρωση
he: ביטול
hr: Poništi
nb: Avbryt
sk: Zrušiť
tr: İptal

source: Logged in as {}
hr: Prijavljen kao {}
sk: Prihlásený ako {}

source: You are logged in as the user <b>{}</b>. To log in as a different user, you will have to restart the browser.
hr: Prijavljeni ste kao korisnik <b>{}</b>. Da biste se prijavili kao drugačiji korisnik, morati ćete ponovno pokrenuti preglednik.
sk: Ste prihlásený ako používateľ <b>{}</b>. Ak sa chcete prihlásiť ako iný používateľ, budete musieť reštartovať prehliadač.

source: Change password
hr: Promijeni zaporku
sk: Zmeniť heslo

source: Choose the calibre library to browse…
bs: Izaberi calibre biblioteku koju želiš pregledati...
hr: Odabir calibre biblioteke za pregled...
sk: Zvoľte knižnicu Calibre, pre prehliadanie...

source: A list with thumbnails and some book details
hr: Lista sa naslovnicama i kratkim opisom knjiga
sk: Zoznam s náhľadom a zopár informáciami o knihe

source: {0} of <i>{1}</i>
hr: {0} od <i>{1}</i>
sk: {0} z <i>{1}</i>

source: Normal
sk: Normálna

source: Select all
sk: Vybrať všetko

source: Remove formatting
sk: Odstrániť formátovanie

source: Undo
sk: Vrátiť späť

source: Redo
sk: Znovu

source: Bold
sk: Tučné

source: Italic
sk: Kurzíva

source: Underline
sk: Podčiarknuté

source: Strikethrough
sk: Prečiarknuté

source: Superscript
sk: Horný index

source: Subscript
sk: Dolný index

source: Insert separator
sk: Vložiť oddeľovač

source: Style the selected text block
sk: Nastaviť štýl označeného bloku textu

source: Unordered list
sk: Neusporiadaný zoznam

source: Ordered list
sk: Usporiadaný zoznam

source: Align left
sk: Zarovnať vľavo

source: Align justified
sk: Zarovnať do bloku

source: Align center
sk: Zarovnať na stred

source: Align right
sk: Zarovnať vpravo

source: Choose text color
sk: Zvoľte farbu textu

source: Added successfully
sk: Úspešne pridané

source: Open
sk: Otvoriť

source: A book with the title "{0}" already exists in the library.
sk: Kniha s názvom "{0}" už v knižnici je.

source: Add anyway
sk: Pridať aj tak

source: You are not allowed to make changes to the library
sk: Nemáte povolenie vykonávať zmeny v knižnici

source: Add books
sk: Pridať knihy

source: Replace
sk: Nahradiť

source: Keep
sk: Ponechať

source: Count:
bs: Količina:
el: Αριθμούν:
he: מונה:
hr: Zbroj:
nb: Antall:
sk: Počet:
tr: Toplam:

source: Rating: {:.1f}
bs: Ocjena: {:.1f}
el: Αξιολόγηση: {:.1f}
he: דירוג: {:.1f}
hr: Ocjena: {:.1f}
nb: Rangering: {:.1f}
sk: Hodnotenie: {:.1f}
tr: Puanlama: {:.1f}

source: Search for books based on this category (a search term will be added to the search box)
bs: Pretraga knjiga bazirana na ovoj kategoriji (upit za pretragu će se dodati u polje za pretragu)
el: Αναζήτηση βιβλίων βάση αυτής της κατηγορίας ( ένας όρος αναζήτησης θα προστεθεί στο πλαίσιο αναζήτησης )
he: חיפוש ספרים המבוסס על קטגוריה הזו (מונח החיפוש יתווסף בתיבת החיפוש)
hr: Pretraži knjige prema ovoj kategoriji (izraz za pretragu će biti dodan u okno za pretragu)
nb: Søk etter bøker basert på denne kategorien (et søkeord vil bli lagt til søkeboksen)
sk: Vyhľadávanie kníh založené na tejto kategórii (hľadaný výraz bude pridaný do hľadacieho poľa)
tr: Bu kategorideki kitaplara göre ara (arama kutusune bir arama terimi eklenecek)

source: Books matching this category
bs: Knjige koje odgovaraju ovoj kategoriji
el: Βιβλία που ταιριάζουν στην κατηγορία
he: ספרים תואמים לקטגוריה זו
hr: Knjige u ovoj kategoriji
nb: Bøker som samsvarer med denne kategorien
sk: Knihy, ktoré zodpovedajú tejto kategórii
tr: Bu kategoriyle eşleşen kitaplar

source: Books that do not match this category
bs: Knjige koje ne odgovaraju ovoj kategoriji
el: Βιβλία που δεν ταιριάζουν στην κατηγορία
he: ספרים שאינם תואמים לקטגוריה זו
hr: Knjige koje ne odgovaraju ovoj kategoriji
nb: Bøker som ikke samsvarer med denne kategorien
sk: Knihy, ktoré nezodpovedajú tejto kategórii
tr: Bu kategoriyle eşleşmeyen kitaplar

source: Books that match this category and all sub-categories
bs: Knjige koje odgovaraju ovoj kategoriji i svim podkategorijama
el: Βιβλία που ταιριάζουν στην κατηγορία και σε όλες τις υποκατηγορίες
he: ספרים התואמים לקטגוריה זו ולכל תתי-הקטגוריות שלה
hr: Knjige koje odgovaraju ovoj kategoriji i svim podkategorijama
nb: Bøker som samsvarer med denne kategorien og underkategorier
sk: Knihy, ktoré zodpovedajú tejto kategórii a všetkým podkategóriám
tr: Bu kategoriyle ve tüm alt kategorilerle eşleşen kitaplar

source: Books that do not match this category or any of its sub-categories
bs: Knjige koje ne odgovaraju ovoj kategoriji ili bilo kojoj njenoj podkategoriji
el: Βιβλία που δεν ταιριάζουν στην κατηγορία και σε όλες τις υποκατηγορίες
he: ספרים שאינם תואמים לקטגוריה זו ולכל אחת מתתי-הקטגוריות שלה
hr: Knjige koje ne odgovaraju ovoj kategoriji i svim podkategorijama
nb: Bøker som ikke samsvarer med denne kategorien eller underkategorier
sk: Knihy, ktoré nezodpovedajú tejto kategórii a žiadnej z podkategórií
tr: Bu kategoriyle veya bunun alt kategorileriyle eşleşmeyen kitaplar

source: Add to the search expression with:
bs: Dopuni pretraživanje sa:
el: Πρόσθεσε στην αναζήτηση για την έκφραση:
he: הוסף את ביטוי החיפוש עם:
hr: Dodaj izrazu za pretragu sa:
nb: Legg til søkeutrykket med:
sk: Pridať do vyhľadávania výraz s:
tr: Arama ifadesine birlikte ekle:

source: Number of books in this category: {}
bs: Broj knjiga u ovoj kategoriji: {}
el: Αριθμός βιβλίων σε αυτήν την κατηγορία: {}
he: מספר הספרים בקטגורייה זו: {}
hr: Broj knjiga u ovoj kategoriji: {}
nb: Antall bøker i denne kategorien: {}
sk: Počet kníh v tejto kategórii: {}
tr: Bu kategorideki kitap sayısı: {}

source: Average rating for books in this category: {:.1f}
bs: Prosječna ocjena za knjige u ovoj kategoriji: {:.1f}
el: Μέση βαθμολογία βιβλίων σε αυτή την κατηγορία: {:.1f}
he: דירוג ממוצע לספרים בקטגוריה זו: {:.1f}
hr: Prosječna ocjena za knjige u ovoj kategoriji: {:.1f}
nb: Gjennomsnittlig rangering for bøker i denne kategorien: {:.1f}
sk: Priemerné hodnotenie kníh v tejto kategórii: {:.1f}
tr: Bu kategorideki kitaplar için puan ortalaması: {:.1f}

source: Search
bs: Pretraga
el: Αναζήτηση
he: חיפוש
hr: Pretraga
nb: Søk
sk: Hľadať
tr: Ara

source: Do the search
bs: Uradi pretragu
el: Αναζήτησέ το
he: בצע את החיפוש
hr: Pretraži
nb: Gjennomfør søk
sk: Vykonať hľadanie
tr: Arama yap

source: Search for books
bs: Pretraži knjige
el: Αναζήτηση βιβλίων
he: חפש ספרים
hr: Pronađi knjigu
nb: Søk etter bøker
sk: Hľadať knihy
tr: Kitap ara

source: Enter the search query
bs: Unesi upit za pretragu
el: Εισάγετε το ερώτημα αναζήτησης
he: הזן את שאילתת החיפוש
hr: Unesite pojam za pretragu
nb: Oppgi søkespørring
sk: Zadajte vyhľadávací dotaz
tr: Arama sorgusunu girin

source: Sort tags by
bs: Poredaj oznake po
el: Ταξινόμηση ετικετών κατά
he: מיין לפי תגיות
hr: Poredaj oznake po
nb: Sorter merkelapper etter
sk: Triediť štítky podľa
tr: Etiketleri sıralama ölçütü

source: Name
bs: Naziv
el: Όνομα
he: שם
hr: Ime
nb: Navn
sk: Názov
tr: İsim

source: Popularity (number of books)
bs: Popularnost (broj knjiga)
el: Δημοτικότητα (αριθμός βιβλίων)
he: פופולריות (מספר ספרים)
hr: Popularnost (broj knjiga)
nb: Popularitet (antall bøker)
sk: Popularita (počet kníh)
tr: Popülerlik (kitap sayısı)

source: Average rating
bs: Prosječna ocjena
el: Μέσος όρος βαθμολόγησης
he: דירוג ממוצע
hr: Prosječna ocjena
nb: Snittvurdering
sk: Priemerné hodnotenie
tr: Ortalama puan

source: First Letter
bs: Prvo slovo
el: Πρώτο γράμμα
he: אות ראשונה
hr: Prvo slovo
nb: Første bokstav
sk: Prvé písmeno
tr: İlk harf

source: Disable
bs: Onemogući
el: Απενεργοποίηση
he: השבת
hr: Onemogući
nb: Skru av
sk: Zakázať
tr: Kapat

source: Partition
bs: Particija
el: Κατάτμηση
he: מחיצה
hr: Podjela
nb: Partisjoner
sk: Oddiel
tr: Bölüm

source: Collapse when more items than
bs: Spusti kada postoji više stavki od
el: Σύμπτυξη όταν υπάρχουν περισσότερα στοιχεία από
he: כווץ כאשר ישנם יותר פריטים מ-
hr: Zatvori kad ima više stavki od
nb: Kollaps når fler ting enn
sk: Zoskupiť pri počte položiek nad
tr: Bundan fazla öge olduğunda daralt

source: Categories not to partition
bs: Kategorije koje se neće dijeliti
el: Μη διαμερισμός κατηγοριών
he: קטגוריות שלא לחלק
hr: Kategorije koje se ne razdvajaju
nb: Kategorier som ikke partisjoneres
sk: Kategórie, ktoré sa nerozčleňujú
tr: Bölünmeyecek sınıflandırmalar

source: Hide empty categories (columns)
bs: Sakrij prazne kategorije (kolone)
el: Απόκρυψη κενών κατηγοριών (στηλών)
he: הסתר קטגוריות ריקות (עמודות)
hr: Sakrij prazne kategorije (stupci)
nb: Skjul tomme kategorier (kolonner)
sk: Skryť prázdne kategórie (stĺpce)
tr: Boş kategorileri sakla (sütun)

source: When checked, calibre will automatically hide any category (a column, custom or standard) that has no items to show. For example, some categories might not have values when using virtual libraries. Checking this box will cause these empty categories to be hidden.
bs: Kada je ovo uključeno, calibre će automatski sakriti bilo koju kategoriju (kolonu, prilagođenu ili standardnu) koja nema stavki za prikaz. Na primjer, neke od kategorija možda neće imati vrijednosti prilikom korištenja virtualne biblioteke. Označavanje ovog polja ove kategorije će biti sakrivene.
nb: Når avhuket, vil calibre automatisk skjule alle kategorier, (en kolonne, egendefinert eller standard) som ikke har ting å vise. FOr eksempel, noen kategorier kan ikke ha verdier når de bruker virtuelle biblioteker. Avhuking av denne boksen vil medføre at disse kategoriene automatisk skjules.
sk: Ak zaškrtnuté, calibre automaticky skryje akúkoľvek kategóriu (stĺpec, vlastné alebo štandard), ktorá nezobrazuje žiadne položky. Napríklad, niektoré kategórie môžu byť bez hodnôt, pokiaľ používajú virtuálne knižnice. Zaškrtnutie tejto kolónky spôsobí, že prázdne kategórie budú skryté.
tr: İşaretlendiğinde, calibre gösterilecek öğe bulunmayan herhangi bir kategoriyi (sütun, özel veya standart) otomatik olarak saklar. Örneğin, bazı kategoriler sanal kitaplıkları kullanırken herhangi bir değere sahip olmayabilir. Bu kutu işaretlendiğinde bu boş kategoriler saklanır.

source: Unhandled error
bs: Nepredviđena greška
el: Αδιαχείριστο σφάλμα
he: שגיאה לא מטופלת
hr: Neobrađena pogreška
nb: Uhåndtert feil
sk: Neošetrená chyba
tr: İşlenmeyen hata

source: You are not authorized to view this site
bs: Niste ovlašteni da vidite ove stranice
el: Δεν έχετε την εξουσιοδότηση να δείτε αυτή την ιστοσελίδα
he: אין לך הרשאה לצפות באתר זה
hr: Niste ovlašteni za pristup ovoj stranici
nb: Du er ikke autorisert to å vise denne siden
sk: Nemáte oprávnenie na prezeranie tejto stránky
tr: Bu siteyi görüntülemeye yetkiniz yok

source: Could not get more books
bs: Nije moguće dohvatiti više knjiga
el: Δεν ήταν δυνατή η λήψη περισσότερων βιβλίων
he: לא ניתן להשיג ספרים נוספים
hr: Ne mogu dohvatiti još knjiga
nb: Kunne ikke hente flere bøker
sk: Nie je možné získať viac kníh
tr: Daha fazla kitap alınamadı

source: Server returned an invalid response
bs: Server je vratio neispravan odgovor
el: Ο διακομιστής επέστρεψε μη έγκυρη απόκριση
he: השרת החזיר תגובה לא חוקית
hr: Poslužitelj je vratio nevažeći odgovor
nb: Serveren returnerte en ugyldig respons
sk: Server vrátil neplatnú odpoveď
tr: Sunucu geçersiz bir cevap verdi

source: Show more books
bs: Prikaži više knjiga
el: Εμφάνιση περισσότερων βιβλίων
he: הצג ספרים נוספים
hr: Prikaži više knjiga
nb: Vis flere bøker
sk: Ukázať viac kníh
tr: Daha fazla kitap göster

source: Fetching metadata for more books, please wait
bs: Hvatanje meta-podataka za više knjiga, sačekajte
el: Ανάκτηση μεταδεδομένων για περισσότερα βιβλία, παρακαλώ περιμένετε
he: מאחזר מטא-נתונים עבור ספרים נוספים, אנא המתן
hr: Dohvaćam metapodatke za više knjiga, pričekajte
nb: Henter metadata for flere bøker, vennligst vent
sk: Načítavam metadáta pre viac kníh, prosím čakajte
tr: Daha fazla kitap için üst veri toplanıyor, lütfen bekleyin

source: Showing Virtual library: {}
hr: Prikazujem Virtualnu biblioteku: {}
sk: Zobrazuje sa virtuálna knižnica: {}

source: Show all books in library
hr: Prikaži sve knjige u biblioteci
sk: Zobraziť všetky knihy v knižnici

source: No books matching: {}
bs: Nijedna se knjiga ne poklapa: {}
hr: Nema knjiga koje odgovaraju: {}
sk: Žiadne knihy zodpovedajúce: {}

source: Clear
bs: Očisti
hr: Očisti
nb: Tøm
sk: Vymazať

source: Clear this search
bs: Očisti ovu pretragu
hr: Očisti ovu pretragu
sk: Vymazať toto hľadanie

source: Sort books
bs: Poredaj knjige
el: Ταξινόμηση βιβλίων
he: מיין ספרים
hr: Posloži knjige
nb: Sorter bøker
sk: Triediť knihy
tr: Kitapları sırala

source: More actions
bs: Više opcija
el: Περισσότερες ενέργειες
he: פעולות נוספות
hr: Više radnji
nb: Flere handlinger
sk: Viac akcií
tr: Daha fazla eylem

source: No books found
hr: Nema pronađenih knjiga
sk: Žiadne knihy nenájdené

source: Go back to the home page
bs: Idi na početnu stranicu
hr: Vratite se na početnu stranicu
sk: Vrátiť sa späť na domovskú stránku

source: Loading books from the {} calibre library, please wait...
bs: Učitavanje knjiga iz {} calibre biblioteke, sačekaj...
hr: Učitavam knjige iz {} calibre biblioteke, pričekajte...
sk: Načítavam knihy z calibre knižnice {}, prosím počkajte...

source: Sort books by…
bs: Poredaj knjige po...
hr: Posloži knjige po...
sk: Triediť knihy podľa...

source: Reverse current sort order
bs: Obrni trenutni način sortiranja
el: Αντίστροφη τρέχουσας σειράς ταξινόμηση
he: הפוך סדר מיון נוכחי
hr: Preokreni trenutni slijed slaganja
nb: Reverser sorteringsrekkefølge
sk: Otočiť súčasný spôsob triedenia
tr: Mevcut sıralamayı tersine döndür

source: Change how the list of books is sorted
bs: Promijeni način na koji je spisak knjiga poredan
el: Αλλαγή του τρόπου ταξινόμησης της λίστας βιβλίων
he: שנה את אופן מיון רשימת הספרים
hr: Promijeni kako je popis knjiga posložen
nb: Endre hvordan boklisten sorteres
sk: Zmeniť ako je triedený zoznam kníh
tr: Kitap listesinin nasıl sıralandığını değiştir

source: Choose Virtual library…
hr: Odaberi Virtualnu biblioteku
sk: Vyberte virtuálnu knižnicu...

source: Cover grid
hr: Rešetka sa naslovnicama
sk: Mriežka obalov

source: Detailed list
hr: Detaljan popis
sk: Detailný zoznam

source: Custom list
hr: Prilagođeni popis
sk: Vlastný zoznam

source: More actions…
hr: Više radnji
sk: Viac akcií…

source: Book list mode
hr: Način prikaza popisa knjiga
sk: Spôsob zobrazenia zoznamu kníh

source: Change how the list of books is displayed
bs: Promijeni način na koji je spisak knjiga prikazan
el: Αλλαγή του τρόπου εμφάνισης της λίστας βιβλίων
he: שינוי אופן הצגת רשימת הספרים
hr: Promijeni kako je prikazan popis knjiga
nb: Endre hvordan listen med bøker vises
sk: Zmeniť ako je zobrazený zoznam kníh
tr: Kitap listesinin nasıl görüntülendiğini değiştir

source: A random book
hr: Slučajna knjiga
sk: Náhodná kniha

source: Choose a random book from the library
bs: Izaberi nasumičnu knjigu iz biblioteke
hr: Odaberi slučajnu knjigu iz biblioteke
sk: Vybrať náhodnú knihu z knižnice

source: Choose Virtual library
hr: Odaberi Virtualnu biblioteku
sk: Vybrať virtuálnu knižnicu

source: Browse books in a Virtual library
hr: Pretraži knjige u Virtualnoj biblioteci
sk: Prehliadať knihy vo virtuálnej knižnici

source: Donate to support calibre development
bs: Donirajte kako biste podržali razvoj calibre
el: Κάντε μια δωρεά για να υποστηρίξτε την ανάπτυξη του calibre
he: תרום לתמיכה בפיתוח קליבר
hr: Darujte za podršku razvoja Calibrea
nb: Doner for å støtte calibres utvikling
sk: Prispieť na vývoj Calibre
tr: Calibre geliştirmesine yardımcı olmak için destek olun

source: Deleting {0} from library, please wait...
sk: Mažem {0} z knižnice, počkajte prosím...

source: Are you sure?
sk: Ste si istý?

source: This will <b>permanently delete</b> <i>{0}</i> from your calibre library. Are you sure?
sk: Toto <b>permanentne zmaže</b> <i>{0}</i> z vašej calibre knižnice. Ste si istý?

source: Name:
bs: Naziv:
el: Όνομα:
hr: Ime:
nb: Navn
sk: Názov:
tr: İsim:

source: Remove
sk: Odstrániť

source: Unrated
sk: Nehodnotené

source: Untitled
sk: Bez názvu

source: Cover
sk: Obálka

source: Apply changes
sk: Použiť zmeny

source: Edit metadata
sk: Upraviť metadáta

source: Loading books from the calibre library, please wait...
bs: Učitvavanje knjiga iz calibre biblioteke, sačekajte...
hr: Učitavam knjige iz calibre biblioteke, pričekajte...
sk: Načítavam knihy z calibre knižnice, prosím počkajte...

source: Download
bs: Preuzmi
el: Λήψη
he: הורדה
hr: Preuzimanje
nb: Last ned
sk: Stiahnuť
tr: İndir

source: File size: {}
hr: Veličina datoteke: {}
sk: Veľkosť súboru: {}

source: Click to see books with {0}: {1}
bs: Kliknite za prikaz knjiga sa {0}: {1}
el: «Κλικ» για εμφάνιση βιβλίων με {0}: {1}
he: לחץ לצפייה בספרים עם: {0}: {1}
hr: Klikni za knjige sa {0}: {1}
nb: Klikk for å se bøker med {0}: {1}
sk: Kliknite pre zobrazenie kníh s {0}: {1}
tr: {0} ile daha fazla kitap görmek için tıklayın: {1}

source: Click to see books with language: {}
bs: Klikni da vidiš knjige sa jezikom: {}
el: «Κλικ» για εμφάνιση βιβλίων στην γλώσσα: {}
he: לחץ לצפייה בספרים עם השפה: {}
hr: Klikni za knjige na jeziku: {}
nb: Klikk for å se bøker med språk: {}
sk: Kliknite pre zobrazenie kníh v jazyku: {}
tr: {} dilindeki kitapları görmek için tıklayın

source: {0} of <a>{1}</a>
hr: {0} od <a>{1}</a>
sk: {0} z <a>{1}</a>
