Repository: Easonqsp/calibre-translations
Catalog: manual/*/catalogs.po
Languages: cs, de, es, pl, sv

source: Excluded books
cs: Vyloučené knihy
de: Ausgeschlossene Bücher
es: Libros excluidos
pl: Wykluczone książki
sv: Uteslutna böcker

source: Exclusion rules allow you to specify books that will not be cataloged.
cs: Pravidla vyloučení vám umožňují zadat knihy, které nebudou katalogizovány.
de: Durch Ausschlussregeln können Sie Bücher angeben, die nicht katalogisiert werden sollen.
es: Las reglas de exclusión le permiten especificar los libros que no se incluirán en el catálogo.
pl: Reguły wykluczające pozwalają pominąć wybrane książki.
sv: Uteslutningsregler tillåter dig specificera böcker som inte ska katalogiseras.

source: The checkbox in the first column enables the rule. :guilabel:`Name` is a rule name that you provide. :guilabel:`Field` is either :guilabel:`Tags` or a custom column in your library. :guilabel:`Value` is the content of :guilabel:`Field` to match. When an exclusion rule is satisfied, the book will be excluded from the generated catalog.
cs: Zatržítko v prvním sloupci povolí pravidlo. :guilabel:`Název` je název pravidla, který zadáte. :guilabel:`Pole` je buď :guilabel:`Štítky`, nebo vlastní sloupec z vaší knihovny. :guilabel:`Hodnota` je obsah :guilabel:`Pole`, který porovnat. Když je pravidlo předpony splněno, kniha bude vyloučena z generovaného katalogu.
de: Das Kontrollkästchen in der ersten Spalte aktiviert eine Regel. :guilabel:`Name` ist der von Ihnen gewählte Name für eine Regel. :guilabel:`Feld` ist entweder ein :guilabel:`Schlagwort` oder eine benutzerdefinierte Spalte aus Ihrer Bibliothek. :guilabel:`Wert` ist der Inhalt des :guilabel:`Felds`, dem die Regel entsprechen soll. Wenn eine Ausnahmeregel erfüllt ist, wird das Buch aus dem zu generierenden Katalog ausgeschlossen.
es: La casilla en la primera columna activa la regla. :guilabel:`Nombre` es el nombre que prefiera para la regla. :guilabel:`Campo` puede ser :guilabel:`Etiquetas` o una columna personalizada de la biblioteca. :guilabel:`Valor` es el contenido de :guilabel:`Campo` que debe coincidir. Cuando se satisface una regla de exclusión, el libro se excluirá del catálogo que se genere.
pl: Zaznaczenia pola w pierwszej kolumnie aktywuje regułę. :guilabel:`Nazwa` to nazwa reguły, nadawana przez ciebie. W kolumnie :guilabel:`Pole` może być albo :guilabel:`Etykieta` albo twoja własna kolumna, utworzona w bibliotece. :guilabel:`Wartość` to treść :guilabel:`Pola`, która musi zostać odnaleziona. Jeśli warunek zostanie spełniony, książka zostanie wykluczona z katalogu.
sv: En kryssruta i första kolumnen aktiverar regeln. :guilabel:`Namn` är ett regelnamn du anger. :guilabel:`Fält` är antingen :guilabel:`Etikett` eller en anpassad kolumn i ditt bibliotek. :guilabel:`Värde` är innehållet av :guilabel:`Fält` att passa mot. När en uteslutningsregel är uppfylld, kommer boken uteslutas från genererad katalog.

source: Two exclusion rules have been specified in the example above:
cs: Vy výše uvedeném příkladu byla zadána dvě pravidla vyloučení:
de: im obigen Beispiel wurden zwei Ausschlussregeln angegeben:
es: En el ejemplo anterior se han especificado dos reglas de exclusión:
pl: Powyżej zostały przedstawione dwie reguły wykluczające:
sv: Två uteslutningsregler har specificerats i exemplet ovan:

source: The :guilabel:`Catalogs` rule specifies that any book with a :guilabel:`Catalog` tag will be excluded from the generated catalog.
cs: Pravidlo :guilabel:`Katalogy` určuje, že jakákoliv kniha se štítkem :guilabel:`Katalog` bude vyloučena z generovaného katalogu.
de: Die Regel :guilabel:`Catalogs` legt fest, dass jedes Buch mit dem Schlagwort :guilabel:`Catalog` bei der Generierung des Katalogs ausgeschlossen wird.
es: La regla :guilabel:`Catálogos` especifica que cualquier libro con la etiqueta :guilabel:`Catálogo` se excluirá del catálogo generado.
pl: Reguła :guilabel:`Catalogs` wyłącza z katalogu książki z etykietą :guilabel:`Catalog`.
sv: :guilabel:`Kataloger` regeln anger att godtycklig bok med en :guilabel:`Katalog` etikett kommer att uteslutas från genererad katalog.

source: The :guilabel:`Archived` Books rule specifies that any book with a value of :guilabel:`Archived` in the custom column :guilabel:`Status` will be excluded from the generated catalog.
cs: Pravidlo :guilabel:`Archivované knihy` určuje, že jakákoliv kniha s hodnotou :guilabel:`Archivováno` ve vlastním sloupci guilabel:`Stav` bude vyloučena z generovaného katalogu.
de: Die Regel :guilabel:`Archived Books` bestimmt, dass jedes Buch mit dem Wert :guilabel:`Archived` in der benutzerdefinierten Spalte :guilabel:`Status` aus der Generierung des Katalogs ausgeschlossen wird.
es: La regla :guilabel:`Libros archivados` especifica que cualquier libro con un valor de :guilabel:`Archivado` en la columna personalizada :guilabel:`Estado` será excluido del catálogo generado.
pl: Dzięki regule :guilabel:`Archived Books` z katalogu zostaną wykluczone książki, które w kolumnie :guilabel:`Status` mają wartość :guilabel:`Archived`.
sv: :guilabel:`Archived` bokregel anger att godtycklig bok med ett värde av :guilabel:`Archived` i en anpassad kolumn :guilabel:`Status` kommer att exkluderas från genererad katalog.

source: All rules are evaluated for every book. Disabled or incomplete rules are ignored.
cs: Jsou vyhodnocována všechna pravidla pro každou knihu. Zakázaná nebo neúplná pravidla jsou ignorována.
de: Alle Regeln werden für jedes Buch ausgewertet. Abgeschaltete oder unvollständige Regeln werden ignoriert.
es: Todas las reglas se evalúan par cada libro. Las reglas desactivadas o incompletas no se tienen en cuenta.
pl: Wszystkie reguły są dopasowywane do każdej książki. Nieaktywne i niekompletne reguły są ignorowane.
sv: Alla regel utvärderas för varje bok. Inaktiverad eller inkomplett regel ignoreras.

source: Excluded genres
cs: Vyloučené žánry
de: Ausgeschlossene Genres
es: Géneros excluidos
pl: Wykluczone rodzaje
sv: Uteslutna genrer

source: When the catalog is generated, tags in your database are used as genres. For example, you may use the tags ``Fiction`` and ``Nonfiction``. These tags become genres in the generated catalog, with books listed under their respective genre lists based on their assigned tags. A book will be listed in every genre section for which it has a corresponding tag.
cs: Když je generován katalog, jsou štítky ve vaší databázi použity jako žánry. Například můžete použít štítky ``Román`` a ``Literatura faktu``. Tyto štítky se stanou žánry ve vygenerovaném katalogu s knihami vypsanými pod jejich příslušnými seznamy žánrů na základě svých přiřazených štítků.
de: Wenn der Katalog generiert wird, werden die Schlagworte Ihrer Datenbank als Genres verwendet. Sie könnten beispielsweise die Schlagworte ``Fiction`` und ``Nonfiction`` verwenden. Die Schlagworte werden im generierten Katalog zu Genres und die Bücher werden entsprechend der Schlagworte in die zugehörigen Genre-Listen einsortiert. Ein Buch wird in jedem Genre-Abschnitt aufgeführt, für den es ein entsprechendes Schlagwort besitzt.
es: Cuando se genera el catálogo, las etiquetas en la base de datos se usan como géneros. Por ejemplo, puede usar las etiquetas «Ficción» y «No ficción». Estas etiquetas aparecen como géneros en el catálogo generado, con los libros en sus respectivas listas de género según las etiquetas que tengan asignadas. Cada libro estará en la lista de todos los generos para los que tenga la correspondiente etiqueta.
pl: Kiedy katalog jest generowany, etykiety są traktowane jak rodzaje (gatunki literackie). Jeżeli, na przykład, używasz etykiet ``Fikcja`` i ``Fakt``. Etykiety te staną się osobnymi rodzajami w katalogu, z przynależnymi do nich książkami. Każda książka zostanie umieszczona we wszystkich rodzajach, zgodnie z tym, jakie miała przypisane etykiety.
sv: När katalogen genereras, är det etiketter i databasen som används som genrer. Till exempel kan du använda etiketter ``Skönlitteratur`` och ``Facklitteratur``. Dessa etiketter blir genrer i den genererade katalogen med böcker som anges under respektive genrelistor baserade på sina tilldelade etiketter. En bok kommer att listas i varje genreavsnitt som den har en motsvarande etikett.

source: You may be using certain tags for other purposes, perhaps a + to indicate a read book, or a bracketed tag like ``[Amazon Freebie]`` to indicate a book's source. The :guilabel:`Excluded genres` regex allows you to specify tags that you don't want used as genres in the generated catalog. The default exclusion regex pattern ``\[.+\]\+`` excludes any tags of the form ``[tag]``, as well as excluding ``+``, the default tag for read books, from being used as genres in the generated catalog.
cs: Možná používáte určité štítky pro jiné účely, možná + označení přečtené knihy, nebo štítek v hranatých závorkách, jako je ``[Amazon Freebie]``, pro označení zdroje knihy. Regulární výraz :guilabel:`Vyloučené žánry` vám umožňuje zadat štítky, které nechcete použít jako žánry v generovaném katalogu. Výchozí regulární výraz vyloučení ``\[.+\]\+`` vyloučí jakékoliv štítky ve formě ``[štítek]``, stejně jako vyloučí ``+``, výchozí štítek pro přečtené knihy, aby nebyly použity jako žánry v generovaném katalogu.
de: Sie möchten möglicherweise bestimmte Schlagworte für andere Zwecke nutzen, vielleicht ein + um ein gelesenes Buch zu kennzeichnen oder ein Schlagwort in eckigen Klammern wie ``[Amazon Freebie]`` um z. B. Buchquellen anzugeben. Mit dem Regex :guilabel:`Ausgeschlossen Genres` geben Sie an, welche Schlagworte bei der Generierung des Katalogs ausgeschlossen werden sollen. Das voreingestellte Regex-Muster ``\[.+\]\+`` schließt alle Bücher mit Schlagworten in eckigen Klammern der Form ``[Schlagwort]`` sowie alle mit ``+`` als gelesen gekennzeichneten Bücher von der Kataloggenerierung aus.
es: Puede usar algunas etiquetas con diferentes propósitos, quizá un + para indicar un libro leído, o una etiqueta entre corchetes como «[Promoción de Amazon]» para recoger el origen de un libro. La expresión regular :gilabel:`Géneros excluidos` le permite especificar las etiquetas que no quiere que se usen como géneros en el catálogo generado. La expresión predeterminada «\[.+\]|\+» excluye todas las etiquetas de la forma «[etiqueta]», así como «+», la etiqueta predeterminada para los libros leídos, de la lista de géneros en el catálogo generado.
pl: Czasem stosuje się etykiety, do oznaczenia pewnych specjalnych cech na przykład + dla oznaczenia przeczytanych książek, albo nawiasy kwadratowe, ot takie: :guilabel:`[Amazon Freebie]` do oznaczenia pochodzenia książek. Wyrażenie w polu :guilabel:`Wykluczone rodzaje` pozwala wykluczyć te, których nie chcesz użyć w katalogu. Domyślna wartość ``\[.+\]\+`` wyklucza z katalogu wszystkie etykiety w postaci ``[tag]`` oraz ``+``, domyślny dla przeczytanych książek.
sv: Du kan använda vissa etiketter för andra syften, kanske ett + för att indikera att en bok lästs, eller en hakparates som ``[Amazon Freebie]`` för att indikera en boks källa. :guilabel:`Uteslutna genrer` regex tillåter dig att ange etiketter som du inte vill använda som genre i den genererade katalogen. Grundinställning för uteslutnings regex-mönster ``\[.+\]\+`` utesluter alla etiketter med formen ``[etikett]``, samt utesluta ``+``, standard etikett för lästa böcker, från att användas som genrer i den skapade katalogen.

source: You can also use an exact tag name in a regex. For example, ``[Amazon Freebie]`` or ``[Project Gutenberg]``. If you want to list multiple exact tags for exclusion, put a pipe (vertical bar) character between them: ``[Amazon Freebie]|[Project Gutenberg]``.
cs: V regulárním výrazu můžete také použít přesný název štítku. Například ``[Amazon Freebie]`` nebo ``[Projekt Gutenberg]``. Pokud chcete vypsat více přesných štítků k vyloučení, vložte mezi ně znak svislé čáry: ``[Amazon Freebie]|[Projekt Gutenberg]``.
de: Sie können Schlagworte auch direkt in einem Regex benutzen. Beispielsweise ``[Amazon Freebie]`` oder ``[Project Gutenberg]``. Wenn mehrere Schlagworte für den Ausschluss auflistet werden sollen, sind diese durch ein Pipezeichen (senkrechter Strich) zu trennen: ``[Amazon Freebie]|[Project Gutenberg]``.
es: También puede usar un nombre exacto de etiqueta en una expresión regular. Por ejemplo, «[Promoción de Amazon]» o «[Proyecto Gutenberg]». Si quiere introducir una lista de varias etiquetas exactas para la exclusión, ponga un carácter de barra vertical entre ellas: «[Promoción de Amazon]|[Proyecto Gutenberg]».
pl: Można również użyć konkretnych etykiet jako wyrażenia. Na przykład ``[Amazon Freebie]`` lub ``[Project Gutenberg]``. Jeśli chcesz umieścić kilka takich etykiet, umieść między nimi pionową kreskę: ``[Amazon Freebie]|[Project Gutenberg]``.
sv: Du kan också använda ett exakt namn i regex-uttryck. Till exempel, ``[Amazon Freebie]`` eller ``[Project Gutenberg]``. Om du vill lista flera exakta etiketter för uteslutning, använd en pip-tecken (vertikalt sträck |) mellan dem: ``[Amazon Freebie]|[Project Gutenberg]``.

source: :guilabel:`Results of regex` shows you which tags will be excluded when the catalog is built, based on the tags in your database and the regex pattern you enter. The results are updated as you modify the regex pattern.
cs: :guilabel:`Výsledky regulárního výrazu` zobrazí, které štítky budou vyloučeny při sestavování katalogu na základě štítků ve vaší databázi a regulárního výrazu, který jste zadali. Výsledky jsou aktualizovány, jak měníte regulární výraz.
de: :guilabel:`Ergebnis des Regex` zeigt Ihnen, welche Schlagworte bei der Erstellung des Katalogs ausgeschlossen werden. Diese basieren auf den verwendeten Schlagworten in Ihrer Datenbank und dem oben eingegebenen Regex-Muster. Die Ergebnisse werden aktualisiert, sobald Sie das Regex-Muster ändern.
es: :guilabel:`Resultado de expresión regular` muestra qué etiquetas se excluirán cuando se genere el catálogo, según las etiquetas presentes en la base de datos y la expresión regular introducida. El resultado se actualiza al modificar la expresión regular.
pl: :guilabel:`Wynik wyrażenia` pokazuje, jakie etykiety zostaną wykluczone w czasie budowania katalogu, porównując etykiety z twojej biblioteki z wyrażeniem wpisanym w pole powyżej. Wynik jest uaktualniany w miarę wpisywania wyrażenia.
sv: :guilabel:`Resultat av regex` visar dig vilka etiketter som kommer att uteslutas när katalog byggs, baserat på etiketter i din databas och regex-mönster som anges. Resultat är uppdateras allt medan du ändrar regex-mönstret.

source: Other options
cs: Další volby
de: Weitere Optionen
es: Otras opciones
pl: Inne opcje
sv: Andra alternativ

source: :guilabel:`Catalog cover` specifies whether to generate a new cover or use an existing cover. It is possible to create a custom cover for your catalogs - see :ref:`Custom catalog covers` for more information. If you have created a custom cover that you want to reuse, select :guilabel:`Use existing cover`. Otherwise, select :guilabel:`Generate new cover`.
cs: :guilabel:`Obálka katalogu` určuje, zda generovat novou obálku nebo použít existující obálku. Je možné vytvořit vlastní obálku pro vaše katalogy – pro více informací se podívejte na :ref:`Custom catalog covers`. Pokud jste vytvořili vlastní obálku, kterou chcete znovu použít, vyberte :guilabel:`Použít existující obálku`. Jinak vyberte :guilabel:`Generovat novou obálku`.
de: :guilabel:`Katalog Cover-Bild` bestimmt, ob ein neues Cover generiert oder ein vorhandenes Cover verwendet werden soll. Es ist möglich ein benutzerdefiniertes Cover für Ihre Kataloge zu erstellen - siehe :ref:`Custom catalog covers` für weitere Informationen. Wenn Sie ein benutzerdefiniertes Cover erstellt haben und es wiederverwenden möchten, aktivieren Sie :guilabel:`Vorhandenes Coverbild verwenden` oder ansonsten :guilabel:`Neues Coverbild generieren`.
es: :guilabel:`Portada del catálogo` especifica si se generará una nueva portada o se usará una portada existente. Es posible crear una portada personalizada para los catálogos, véase :ref:`Custom catalog covers` para más información. Si ha creado una portada personalizada que quiere volver a usar, seleccione :guilabel:`Utilizar portada actual`. En caso contrario seleccione :guilabel:`Generar nueva portada`.
pl: :guilabel:`Okładka katalogu` określa, czy zostanie wygenerowana nowa okładka, czy też calibre użyje istniejącej. Możliwe jest stworzenie własnej okładki katalogu - patrz :ref:`Własna okładka katalogu`. Jeśli masz swoją okładkę, której chcesz użyć ponownie, wybierz :guilabel:`Użyj istniejącej okładki`. W przeciwnym przypadku, wybierz :guilabel:`Wygeneruj nową okładkę`.
sv: :guilabel:`Katalogomslag` anger om ett nytt omslag ska skapas eller använda ett befintligt omslag. Det är möjligt att skapa en anpassat omslag för dina kataloger - se :ref:`Custom catalog covers` för mer information. Om du har skapat en anpassad omslag som du vill återanvända, väljer du Använd befintligt omslag. Annars, välj :guilabel:`Skapa nytt omslag`.

source: :guilabel:`Extra Description note` specifies a custom column's contents to be inserted into the Description page, next to the cover thumbnail. For example, you might want to display the date you last read a book using a :guilabel:`Last Read` custom column. For advanced use of the Description note feature, see `this post in the calibre forum <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
cs: :guilabel:`Dodatečná poznámka popisu` určuje obsah vlastního sloupce, který vložit do stránky Popis vedle náhledu obálky. Například možná chcete zobrazit datum, kdy jste naposledy četli knihu, pomocí vlastního slupce :guilabel:`Naposledy čteno`. Pro pokročilé používání funkce poznámky Popisu se podívejte na tento příspěvek ve fóru calibre <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
de: :guilabel:`Extra Notiz zur Beschreibung` fügt den Inhalt einer benutzerdefinierten Spalte in den Beschreibungsabschnitt neben der Cover-Miniatur ein. So könnten Sie sich beispielsweise mit einer benutzerdefinierten Spalte :guilabel:`Last Read` das Datum anzeigen lassen, wann Sie ein Buch zuletzt gelesen haben. Weitere Nutzungsmöglichkeiten dieser Funktion können Sie in `diesem Beitrag im calibre-Forum <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_ finden.
es: :guilabel:`Nota de descripción extra` especifica una columna personalizada cuyo contenido se incluirá en la página de descripción, junto a la miniatura de portada. Por ejemplo, puede querer mostrar la fecha de última lectura del libro usando una columna personalizada :guilabel:`Leído por última vez`. Para un uso avanzado de la opción de nota de descripción, véase `este mensaje en el foro de calibre <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_ (en inglés).
pl: :guilabel:`Dodatkowy opis` określa kolumnę, której treść zostanie umieszczona na stronie opisu, obok miniatury okładki. Przykładowo, możesz umieścić tam datę, kiedy ostatnio czytałeś książkę, korzystając z utworzonej wcześniej kolumny :guilabel:`Ostatnio czytana`. Więcej informacji na temat użycia tego opisu znajdziesz w `tym wątku na forum calibre <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.
sv: :guilabel:`Extra beskrivningsnot` anger att anpassat kolumninnehåll ska infogas till beskrivningssidan, bredvid omslagsikonen. Till exempel, om du kanske vill visa datum när du senast läst en bok använd :guilabel:`Senaste lästa` kolumnanpassning. För avancerad användning av notbeskrivningsfunktioner, se `this post in the calibre forum <http://www.mobileread.com/forums/showpost.php?p=1335767&postcount=395>`_.

source: :guilabel:`Thumb width` specifies a width preference for cover thumbnails included with Descriptions pages. Thumbnails are cached to improve performance.To experiment with different widths, try generating a catalog with just a few books until you've determined your preferred width, then generate your full catalog. The first time a catalog is generated with a new thumbnail width, performance will be slower, but subsequent builds of the catalog will take advantage of the thumbnail cache.
cs: :guilabel:`Šířka náhledu` určuje předvolbu šířky pro náhledy obálek obsažené na stránkách Popis. Náhledy jsou ukládány do mezipaměti pro zlepšení výkonu. Pro experimentování s různými šířkami zkuste generovat katalog jen s pár knihami, doku neurčíte svou upřednostňovanou šířku, pak vygenerujte úplný katalog. Když je katalog generován poprvé s novou šířkou náhledu, výkon bude nižší, ale následující sestavení katalogu využijí náhledy v mezipaměti.
de: :guilabel:`Coverbild-Breite` gibt die Breiteneinstellung für Cover-Miniaturen im Beschreibungsabschnitt an. Miniaturansichten werden zur Verbesserung der Leistung zwischengespeichert. Verwenden Sie beim Experimentieren mit unterschiedlichen Breiten im Katalog nur wenige Bücher und generieren Sie den kompletten Katalog erst, wenn Sie Ihre bevorzugte Breite gefunden haben. Die erste Erstellung des Katalogs dauert etwas länger, da zuerst die Cover-Miniaturen generiert werden müssen. Nachfolgende Katalogerstellungen nutzen die im Cache abgelegten Cover-Miniaturen.
es: :guilabel:`Ancho de la miniatura` especifica la anchura preferida para las miniaturas de portada incluidas en las páginas de descripción. Las miniaturas se mantienen en caché para mejorar el rendimiento. Para experimentar con distintos tamaños, pruebe a generar un catálogo con unos pocos libros hasta que determine la anchura preferida, después genere el catálogo completo. La primera vez que se genera un catálogo con una nueva anchura de miniaturas el rendimiento será menor, pero las veces siguientes se aprovechará el caché de miniaturas.
pl: :guilabel:`Szerokość miniaturki` to szerokość obrazka okładki, umieszczanego na stronie z opisem. Miniatury są buforowane, by zwiększyć wydajność. Aby poeksperymentować z okładkami spróbuj wygenerować katalog, zawierający tylko kilka książek, dopóki nie ustalisz właściwych rozmiarów miniatury, a dopiero potem cały katalog. Za pierwszym razem generowanie katalogu, zawierającego miniatury okładek będzie długotrwałe, kolejne powinny zająć mniej czasu, bo miniatury są buforowane.
sv: :guilabel:`Ikonbildsbredd` anger bredpreferens för omslagsikoner som inkluderas på beskrivningssidor. Ikoner är buffrade för att förbättra prestanda. För att experimentera med olika bredder, försök generera en katalog med bara några få böcker tills du har utrönt vilken som är föredragen bredd, sedan skapa din fullständiga katalog. Första gången en katalog skapas med en ny ikonbredd kommer prestanda vara lägre, men efterföljande bygge av katalog kommer utnyttja bufferten för ikoner.
