Repository: Easonqsp/calibre-translations
Catalog: manual/*/catalogs.po
Languages: cs, de, es, pl, sv

source: Creating AZW3 • EPUB • MOBI Catalogs
cs: Vytváření katalogů AZW3 • EPUB • MOBI
de: Erstelle AZW3 • EPUB • MOBI Kataloge
es: Crear catálogos AZW3 • EPUB • MOBI Catalogs
pl: Tworzenie katalogów w formacie
sv: Skapa AZW3 • EPUB • MOBI kataloger

source: calibre's Create catalog feature enables you to create a catalog of your library in a variety of formats. This help file describes cataloging options when generating a catalog in AZW3, EPUB and MOBI formats.
cs: Funkce calibre Vytvořit katalog vám umožňuje vytvořit z vaší knihovny katalog v různých formátech. Tento soubor nápovědy popisuje volby zařazení do katalogu při generování katalogu ve formátech AZW3, EPUB a MOBI.
de: Mit calibre's Katalog erstellen Werkzeug können Sie Kataloge ihrer eigenen Bibliothek in unterschiedlichen Formaten erstellen. Diese Hilfedatei beschreibt die Katalogisierungsoptionen zur Generierung eines Katalogs im AZW3-, EPUB- und MOBI-Format.
pl: Opcja tworzenia katalogów calibre umożliwia stworzenie katalogu książek w różnych formatach. Ten rozdział opisuje opcje tworzenia katalogów w formatach AZW3, EPUB i MOBI
sv: calibres Skapa katalogfunktioner kan du skapa en katalog över biblioteket i en mängd olika format. Denna hjälpfil beskriver katalogiseringsalternativ när katalog skapas i AZW3, EPUB och MOBI format.

source: Selecting books to catalog
cs: Výběr knih do katalogu
de: Bücher zum Katalogisieren auswählen
es: Seleccionar libros para catalogar
pl: Wybór książek do katalogu
sv: Välja böcker att katalogisera

source: If you want *all* of your library cataloged, remove any search or filtering criteria in the main window. With a single book selected, all books in your library will be candidates for inclusion in the generated catalog. Individual books may be excluded by various criteria; see the :ref:`excluded_genres` section below for more information.
cs: Pokud chcete katalogizovat *celou* svou knihovnu, odeberte v hlavním okně jakákoliv kritéria hledání nebo filtrování. Pokud máte vybránu jednu knihu, všechny knihy ve vaší knihovně budou kandidáti na zahrnutí do generovaného katalogu. Jednotlivé knihy mohou být vyloučeny různými kritérii, pro více informací se podívejte na oddíl :ref:`excluded_genres` níže.
de: Falls Sie ihre komplette Bibliothek katalogisieren möchten, entfernen Sie alle Such- oder Filterkriterien im Hauptfenster. Mit der Selektion eines einzelnen Buches im Hauptfenster werden alle Bücher der Bibliothek in den zu generierenden Katalog übernommen. Einzelne Bücher können nach verschiedenen Kriterien ausgeschlossen werden. Für weitere Informationen siehe unter dem Abschnitt :ref:`excluded_genres`.
es: Si quiere catalogar *todos* los libros de la biblioteca, elimine cualquier criterio de búsqueda o filtrado en la ventana principal. Si sólo hay un libro seleccionado, todos los libros de la biblioteca se considerarán para el catálogo generado. Pueden excluirse libros individuales según distintos criterios; véase la sección :ref:`excluded_genres` más adelante para más información.
pl: Jeśli chcesz skatalogować *cały* księgozbiór, usuń wszystkie filtry i kryteria wyszukiwania w głównym oknie. Jeśli tylko jedna książka jest zaznaczona na liście, wszystkie książki z biblioteki będą brane pod uwagę przy tworzeniu katalogu. Można określić dodatkowe kryteria, na podstawie których niektóre z nich zostaną wykluczone. Więcej informacji znajdziesz w sekcji :ref:`excluded_genres` poniżej.
sv: Om du vill att *alla* dina bibliotek katalogiseras, ta bort valfri sökning eller filtrera villkor i huvudfönstret. Med en enkelt val bok, kommer alla böcker i ditt bibliotek bli kandidater för inkludering i den skapade katalogen. Individuella böcker kan kommas att exkluderas av diverse orsaker; se :ref:`excluded_genres` sektionen nedan för mer information.

source: If you want only *some* of your library cataloged, you have two options:
cs: Pokud chcete katalogizovat pouze *něco* z vaší knihovny, máte dvě volby:
de: Wenn Sie nur *einige* Bücher aus der Bibliothek katalogisieren wollen, haben Sie zwei Möglichkeiten:
es: Si sólo desea catalogar *algunos* libros de la biblioteca, tiene dos opciones:
pl: Jeśli chcesz umieścić w katalogu tylko *niektóre* książki, masz dwie możliwości:
sv: Om du vill bara att *några* av dina bibliotek katalogiserade, har du två alternativ:

source: Create a multiple selection of the books you want cataloged. With more than one book selected in calibre's main window, only the selected books will be cataloged.
cs: Vytvořte výběr více knih, které chcete katalogizovat. Pokud je v hlavním okně calibre vybrána více než jedna kniha, budou katalogizovány pouze vybrané knihy.
de: Wählen Sie mehrere Bücher gleichzeitig zur Katalogisierung aus. Mit mehr als einem ausgewählten Buch in calibre's Hauptfenster werden nur die ausgewählten Bücher katalogisiert.
pl: Zaznacz na liście te książki, które chcesz umieścić w katalogu. Jeśli w głównym oknie jest zaznaczona więcej niż jedna książka to w katalogu znajdą się wyłącznie te zaznaczone.
sv: Skapa ett flerval av böckerna du vill katalogisera. Med mer än en bok vald i calibres huvudfönster, kommer bara de valda böckerna katalogiseras.

source: Use the Search field or the Tag Browser to filter the displayed books. Only the displayed books will be cataloged.
cs: Použijte pole Hledat nebo Prohlížeč štítků pro filtrování zobrazených knih. Budou katalogizovány pouze vybrané knihy.
de: Verwenden Sie das Suchfeld oder den Schlagwort-Browser, um die angezeigten Bücher zu filtern. Es werden dann nur die angezeigten Bücher katalogisiert.
es: Usar el campo de búsqueda o el explorador de etiquetas para filtrar los libros mostrados. Sólo se catalogarán los libros que se muestran en la ventana principal.
pl: Użyj wyszukiwania lub przeglądarki etykiet, by odfiltrować listę książek. Tylko widoczne na liście książki zostaną umieszczone w katalogu.
sv: Använd sökfält eller etikettbläddraren för filtrera de visade böckerna. Bara de visade böckerna kommer katalogiseras.

source: To begin catalog generation, select the menu item :guilabel:`Convert books > Create a catalog of the books in your calibre library`. You may also add a :guilabel:`Create Catalog` button to a toolbar in :guilabel:`Preferences > Interface > Toolbars` for easier access to the Generate catalog dialog.
cs: Pro zahájení generování katalogu vyberte položku nabídky :guilabel:`Převést knihy > Vytvořit katalog knih ve vaší knihovně calibre`.
de: Um die Katalog-Erstellung zu starten, wählen Sie den Menüpunkt :guilabel:`Bücher zu konvertieren -> Einen Katalog Ihrer calibre-Bibliothek erstellen`. Sie können alternativ Ihrer Werkzeugleiste auch die Schaltfläche :guilabel:`Katalog erstellen` über :guilabel:`Einstellungen -> Benutzeroberfläche -> Werkzeugleiste -> Symbolleisten` für den einfacheren Zugriff hinzufügen.
es: Para comenzar la generación del catálogo, seleccione el elemento de menú :guilabel:`Convertir libros > Crear un catálogo de los libros en la biblioteca de calibre`. También puede añadir un botón :guilabel:`Crear catálogo` a una barra de herramientas en :guilabel:`Preferencias > Interfaz > Barra de herramientas` para tener un acceso más cómo al diálogo para generar catálogos.
pl: Aby rozpocząć generowanie katalogu wybierz z menu polecenie :guilabel:`Konwertuj książki > Stwórz katalog książek w swojej bibliotece calibre`. Możesz również dodać przycisk :guilabel:`Utwórz katalog` do paska narzędzi w :guilabel:`Ustawienia > Interfejs > Pasek narzędzi`, by mieć łatwy dostęp do okna dialogowego Utwórz katalog.
sv: För att påbörja kataloggenerering, välj menyval :guilabel:`Konvertera böcker > Skapa en katalog med böckerna i ditt calibre-bibliotek`. Du kan också lägga till en :guilabel:`Skapa katalog`-knapp i verktygsraden i :guilabel:`Inställningar > Gränssnitt > Verktygsrad` för att enklare nå dialogen för skapa kataloger.

source: In :guilabel:`Catalog options`, select **AZW3, EPUB or MOBI** as the Catalog format. In the :guilabel:`Catalog title` field, provide a name that will be used for the generated catalog. If a catalog of the same name and format already exists, it will be replaced with the newly-generated catalog.
cs: Ve :guilabel:`Volby katalogu` vyberte jako formát katalogu **AZW3, EPUB nebo MOBI**. V poli :guilabel:`Název katalogu` zadejte název, který bude použit pro vygenerovaný katalog. Pokud již existuje katalog se stejným názvem a formátem, bude nahrazen nově vytvořeným katalogem.
de: Unter :guilabel:`Katalogeinstellungen` wählen Sie **AZW3, EPUB oder MOBI** als Katalogformat aus. Es stehen weitere Formate als Auswahl zur Verfügung. Im Feld für :guilabel:`Katalog-Titel` wird der Name des Katalogs angegeben. Ein bestehender Katalog mit dem gleichen Titel wird durch den neu generierten Katalog ersetzt.
es: En :guilabel:`Opciones del catálogo`, seleccione **AZW3**, **EPUB** o **MOBI** como formato del catálogo. En el campo :guilabel:`Título del catálogo` escriba un nombre para el catálogo que se genere. Si ya existe un catálogo con ese nombre será sustutuido por el nuevo catálogo generado.
pl: Na karcie :guilabel:`Opcje katalogu` wybierz **AZW3, EPUB lub MOBI** jako format katalogu. W polu :guilabel:`Tytuł katalogu` podaj nazwę, która zostanie użyta przy generowaniu katalogu. Jeżeli istnieje już katalog o tej samej nazwie i formacie, zostanie on zastąpiony nowo tworzonym.
sv: I :guilabel:`Katalogalternativ`, välj **AZW3, EPUB eller MOBI** som katalogformat. I :guilabel:`Katalogtitel` fältet, ge ett namn för att användas för den skapade katalogen. Om katalogen har samma namn och format som en existerande, kommer den ersättas med den nyligen skapade katalogen.

source: Enabling :guilabel:`Send catalog to device automatically` will download the generated catalog to a connected device upon completion.
cs: Povolení :guilabel:`Odeslat katalog do zařízení automaticky` stáhne po dokončení vygenerovaný katalog do připojeného zařízení.
de: Bei Aktivierung von :guilabel:`Katalog automatisch ans Gerät senden` wird der generierte Katalog automatisch nach Abschluss an ein angeschlossenes Gerät gesendet.
es: Si se activa :guilabel:`Enviar el catálogo automáticamente al dispositivo`, el catálogo generado se copiará al dispositivo conectado una vez completado.
pl: Zaznaczenie opcji :guilabel:`Automatycznie wyślij katalog do urządzenia` spowoduje, przesłanie katalogu do aktualnie podłączonego urządzenia zaraz po jego wygenerowaniu.
sv: Aktivering :guilabel:`Skicka katalogen till enheten automatiskt` kommer ladda ner skapad katalog till en ansluten enhet efter slutförandet.

source: Included sections
cs: Zahrnuté oddíly
de: Eingeschlossene Abschnitte
es: Secciones incluidas
pl: Włączone sekcje
sv: Inkluderade sektioner

source: Sections enabled by a checkmark will be included in the generated catalog:
cs: Oddíly povolené zatržítkem budou zahrnuty do generovaného katalogu::
de: Abschnitte, die durch ein Häkchen aktiviert sind, werden in den generierten Katalog aufgenommen:
es: Las secciones con la casilla marcada se incluirán en el catálogo generado:
pl: Oznaczone sekcje zostaną włączone do katalogu:
sv: Sektionen aktiverade med bock kommer att inkluderas i den skapade katalogen:

source: :guilabel:`Authors` - all books, sorted by author, presented in a list format. Non-series books are listed before series books.
cs: :guilabel:`Autoři` – všechny knihy seřazené podle autora zobrazené ve formátu seznamu. Knihy bez sérií jsou vypsány před knihami v sérii.
de: :guilabel:`Autoren` - alle Bücher werden als Liste nach Autor sortiert. Bücher ohne Serie werden vor Serien-Bücher gelistet.
es: :guilabel:`Autores` — todos los libros, ordenados por autor, presentados como una lista. Los libros que no corresponden a ninguna serie se muestran antes de los que sí pertenecen.
pl: :guilabel:`Autorzy` - wszystkie książki, posortowane wg autora, w postaci listy. Książki będące częścią żadnego cyklu są umieszczane przed połączonymi w cykle.
sv: :guilabel:`Författare` - alla böcker, sorterade på författare, tillgängliga i ett listformat. Icke-serieböcker listas för serieböcker.

source: :guilabel:`Titles` - all books, sorted by title, presented in a list format.
cs: :guilabel:`Názvy` – všechny knihy seřazené podle názvu zobrazené ve formátu seznamu.
de: :guilabel:`Titel` - alle Bücher werden als Liste nach Titel sortiert.
es: :guilabel:`Títulos` — todos los libros, ordenados por título, presentados como una lista.
pl: :guilabel:`Tytuły` - wszystkie książcki, posortowane wg tytułu, w postaci listy.
sv: :guilabel:`Titlar` - alla böcker, sorterade på titel, tillgänglig i ett listformat.

source: :guilabel:`Series` - all books that are part of a series, sorted by series, presented in a list format.
cs: :guilabel:`Série` – všechny knihy, které jsou součástí série, seřazené podle názvu zobrazené ve formátu seznamu.
de: :guilabel:`Serien` - alle Serien-Bücher werden als Liste nach Serienname und -nummer sortiert.
es: :guilabel:`Series` — todos los libros que forman parte de alguna serie, ordenados por serie, presentados como una lista.
pl: :guilabel:`Serie` - wszystkie książki, które są częścią cyklu, posortowane wg cyklu, w postaci listy.
sv: :guilabel:`Serier` - alla böcker som är del av serien, sorterade på serier, tillgängliga i ett listformat.

source: :guilabel:`Genres` - individual genres presented in a list, sorted by Author and Series.
cs: :guilabel:`Žánry` – jednotlivé žánry zobrazené v seznamu, seřazené podle autora a série.
de: :guilabel:`Genres` - einzelne Genres werden als Liste nach Autor und Serie sortiert.
es: :guilabel:`Géneros` — géneros individuales presentados como una lista, ordenados por autor y serie.
pl: :guilabel:`Rodzaje` - poszczególne gatunki literackie w postaci listy, posortowane wg autora i cyklu
sv: :guilabel:`Genrer` - individuella genrer, tillgängliga i en lista, sorterade på författare och serie.

source: :guilabel:`Recently` Added - all books, sorted in reverse chronological order. List includes books added in the last 30 days, then a month-by-month listing of added books.
cs: :guilabel:`Nedávno přidané` – všechny knihy seřazené v obráceném chronologickém pořadí. Seznam obsahuje knihy přidané za posledních 30 dní, pak výpis přidaných knih po měsících.
de: :guilabel:`Zuletzt hinzugefügt` - alle Bücher in umgekehrter chronologischer Reihenfolge nach Hinzufügedatum sortiert. Die Liste enthält alle Bücher, die innerhalb der letzten 30 Tage und danach von Monat zu Monat hinzugefügt wurden.
es: :guilabel:`Añadidos recientemente` — todos los libros, por orden cronológico inverso. La lista incluye los libros añadidos en los últimos 30 días y luego un listado de libros añadidos mes a mes.
pl: :guilabel:`Ostatnio dodane` - wszystkie książki, posortowane w kolejności odwrotnej do chronologicznej. Lista zawiera książki dodane w ciągu ostatnich 30 dni, dalej zaś miesiąc po miesiącu.
sv: :guilabel:`Nyligen tillagd` - alla böcker, sorterade i omvänd kronologisk ordning. Listan inkluderar böcker tillagda de senaste 30 dagarna, sedan en månatlig listning av tillagda böcker.

source: :guilabel:`Descriptions` - detailed description page for each book, including a cover thumbnail and comments. Sorted by author, with non-series books listed before series books.
cs: :guilabel:`Popisy` – podrobná stránka popisu pro každou knihu včetně náhledu obálky a komentářů. Seřazeno podle autora s knihami bez sérií vypsanými před knihami v sérii.
de: :guilabel:`Beschreibungen` - detaillierte Beschreibungsseite für jedes Buch, einschließlich Miniatur-Cover und Kommentare. Sortiert nach Autor, Bücher ohne Serie werden vor Serien-Bücher aufgeführt.
es: :guilabel:`Descripciones` — una página de descripción detallada para cada libro, incluyendo una miniatura de portada y comentaries. Ordenados por autor, con los libros que no pertenecen a ninguna serie antes de los que sí pertenecen.
pl: :guilabel:`Opisy` - szczegółowy opis każdej książki, z uwzględnieniem okładki i komentarza. Posortowane wg autora, książki nie będące częścią cyklu są umieszczane przed cyklami.
sv: :guilabel:`Beskrivningar` - detaljerad beskrivningssida för varje bok, inkluderar omslagsikon och kommentarer. Sorterade per författare, med icke-serieböcker listade före serieböcker.

source: Prefixes
cs: Předpony
de: Präfixe
es: Prefijos
pl: Przedrostki
sv: Prefix

source: Prefix rules allow you to add a prefix to book listings when certain criteria are met. For example, you might want to mark books you've read with a checkmark, or books on your wishlist with an X.
cs: Pravidla předpony vám umožňují přidat předponu do výpisů knih, když jsou splněna určitá kritéria. Například možná chcete označit přečtené knihy zatržítkem, nebo knihy na seznamu přání označit X.
de: Durch Präfix-Regeln können Sie Bücherlisten ein Präfix hinzufügen, wenn bestimmte Kriterien erfüllt sind. Mit diesen Regeln können Sie beispielsweise gelesene Bücher mit einem Häkchen versehen oder Bücher Ihrer Wunschliste mit einem X markieren.
es: Las reglas de prefijo le permiten añadir un prefijo a las listas de libros cuando se satisfacen ciertos criterios. Por ejemplo, puede querer señalar con una marca los libros ya leídos, o los libros en la lista de deseos con una X.
pl: Reguły przedrostków pozwalają dodać przedrostek do książek, które spełniają określone kryteria. Na przykład możesz oznaczyć książki, które już przeczytałeś, albo te, które chcesz nabyć.
sv: Prefixregler tillåter dig att lägga till ett prefix till boklistan när vissa villkor är uppfyllda. Till exempel, du kanske vill markera böcker du har läst med en bock, eller böcker på din önskelista med ett X.

source: The checkbox in the first column enables the rule. :guilabel:`Name` is a rule name that you provide. :guilabel:`Field` is either :guilabel:`Tags` or a custom column from your library. :guilabel:`Value` is the content of :guilabel:`Field` to match. When a prefix rule is satisfied, the book will be marked with the selected :guilabel:`Prefix`.
cs: Zatržítko v prvním sloupci povolí pravidlo. :guilabel:`Název` je název pravidla, který zadáte. :guilabel:`Pole` je buď :guilabel:`Štítky`, nebo vlastní sloupec z vaší knihovny. :guilabel:`Hodnota` je obsah :guilabel:`Pole`, který porovnat. Když je pravidlo předpony splněno, kniha bude označena vybranou :guilabel:`Předponou`.
de: Das Kontrollkästchen in der ersten Spalte aktiviert eine Regel. :guilabel:`Name` ist ein von Ihnen gewählter Name für eine Regel. :guilabel:`Feld` ist entweder ein :guilabel:`Schlagwort` oder eine benutzerdefinierte Spalte aus Ihrer Bibliothek. :guilabel:`Wert` ist der Inhalt des :guilabel:`Felds`, dem die Regel entsprechen soll. Wenn eine Präfix-Regel erfüllt ist, wird das Buch mit dem ausgewählten :guilabel:`Präfix` markiert.
es: La casilla en la primera columna activa la regla. :guilabel:`Nombre` es el nombre que prefiera para la regla. :guilabel:`Campo` puede ser :guilabel:`Etiquetas` o una columna personalizada de la biblioteca. :guilabel:`Valor` es el contenido de :guilabel:`Campo` que debe coincidir. Cuando se satisface una regla de prefijo, el libro se marcará con el :guilabel:`Prefijo` seleccionado.
pl: Zaznaczenia pola w pierwszej kolumnie aktywuje regułę. :guilabel:`Nazwa` to nazwa reguły, nadawana przez ciebie. W kolumnie :guilabel:`Pole` może być albo :guilabel:`Etykieta` albo twoja własna kolumna, utworzona w bibliotece. :guilabel:`Wartość` to treść :guilabel:`Pola`, która musi zostać odnaleziona. Jeśli warunek zostanie spełniony, książka zostanie oznaczona wybranym :guilabel:`Przedrostkiem`.
sv: Kryssrutan i den första kolumnen aktiverar regeln. :guilabel:`Namn` är ett regelnamn som du lämnar. :guilabel:`Fält` är antingen :guilabel:`Etikett` eller en egen kolumn från biblioteket. :guilabel:`Värde` är innehållet i :guilabel:`Fält` för att passa mot. När en prefixregel är uppfylld, kommer boken vara märkt med den valda :guilabel:`Prefix`.

source: Three prefix rules have been specified in the example above:
cs: Vy výše uvedeném příkladu byla zadána tři pravidla předpony:
de: Im obigen Beispiel wurden drei Präfix-Regeln verwendet:
es: El el ejemplo anterior se han especificado tres reglas de prefijo:
pl: Trzy takie reguły zostały przedstawione w powyższym przykładzie:
sv: Tre prefixregler har angivits i exemplet ovan:

source: :guilabel:`Read book` specifies that a book with any date in a custom column named :guilabel:`Last read` will be prefixed with a checkmark symbol.
cs: :guilabel:`Přečtená kniha` určuje, že kniha s jakýmkoliv datem ve vlastním sloupci pojmenovaném :guilabel:`Přečteno` bude označena předponou se symbolem zatržítka.
de: :guilabel:`Read book` gibt an, dass jedes Buch mit einem Datum in der benutzerdefinierten Spalte mit Namen :guilabel:`Last read` ein Häkchen-Symbol vorangestellt bekommt.
es: :guilabel:`Libro leído` especifica que un libro con una fecha cualquiera en una columna personalizada llamada :guilabel:`Leído por última vez` estará preferido por una marca de verificación.
pl: :guilabel:`Read book` określa, że książka z dowolną datą w kolumnie :guilabel:`Last Read` zostanie oznaczona "ptaszkiem"
sv: :guilabel:`Läs bok` anger att en bok med godtyckligt datum i en anpassad kolumn namngiven :guilabel:`Senast läst` kommer att prefixas med en bocksymbol.

source: :guilabel:`Wishlist` item specifies that any book with a :guilabel:`Wishlist` tag will be prefixed with an X symbol.
cs: :guilabel:`Položka seznamu přání` určuje, že jakákoliv kniha se štítkem :guilabel:`Seznam přání` bude označena předponou se symbolem X.
de: :guilabel:`Wishlist` - Diese Regel bestimmt, dass jedes Buch mit dem Schlagwort :guilabel:`Wishlist` ein X-Symbol vorangestellt bekommt.
es: :guilabel:`Deseado` especifica que cualquier libron la etiqueta :guilabel:`Deseado` estará precedido por una cruz.
pl: Dzięki regule :guilabel:`Wishlist` każda książka, zawierająca etykietę :guilabel:`Wishlist` zostanie oznaczona symbolem X.
sv: :guilabel:`Önskelistprodukt` objekt anger att godtycklig bok med en :guilabel:`Önskelistprodukt` etikett kommer att prefixas men en X-symbol.

source: :guilabel:`Library` books specifies that any book with a value of True (or Yes) in a custom column :guilabel:`Available in Library` will be prefixed with a double arrow symbol.
cs: :guilabel:`Knihy v knihovně` určuje, že jakákoliv kniha s hodnotou Pravda (nebo Ano) ve vlastním sloupci :guilabel:`Dostupná v knihovně` bude označena předponou se symbolem obousměrné šipky.
de: :guilabel:`Library books` bestimmt, dass jedes Buch mit dem Wert True (oder Ja) in der benutzerdefinierten Spalte :guilabel:`Available in Library` durch ein vorangestelltes Doppelpfeil-Symbol gekennzeichnet wird.
es: :guilabel:`Biblioteca` especifica que cualquier libro con un valor «True» (o Sí) en una columna personalizada :guilable:`Disponible en la biblioteca` estará precedido por una flecha doble.
pl: Reguła :guilabel:`Library` pozwala oznaczyć podwójną strzałką każdą książkę, która ma wartość True (albo Yes) w kolumnie :guilabel:`Available in Library`.
sv: :guilabel:`Bibliotek` böcker anger att godtycklig bok med ett sant(ja)-värde i en anpassad kolumn :guilabel:`Available in Library` kommer att prefixas med en dubbelpilsymbol.

source: The first matching rule supplies the prefix. Disabled or incomplete rules are ignored.
cs: První odpovídající pravidlo určí předponu. Zakázaná nebo neúplná pravidla jsou ignorována.
de: Die erste zutreffende Regel bestimmt das Präfix. Abgeschaltete oder unvollständige Regeln werden ignoriert.
es: El prefijo se toma de la primera regla que coincida. Las reglas desactivadas o incompletas no se tienen en cuenta.
pl: Przedrostek jest określany przez pierwszą pasującą regułę. Reguły nieaktywne lub niekompletne są pomijane.
sv: Den första passande regeln tillhandahåller prefixet. Inaktiverad eller ofullständig regel ignoreras.
