Repository: Easonqsp/calibre-translations
Catalog: manual/*/catalogs.po
Languages: cs, de, es, pl, sv

source: :guilabel:`Merge with Comments` specifies a custom column whose content will be non-destructively merged with the Comments metadata during catalog generation. For example, you might have a custom column :guilabel:`Author Bio` that you'd like to append to the Comments metadata. You can choose to insert the custom column contents *before or after* the Comments section, and optionally separate the appended content with a horizontal rule separator. Eligible custom column types include ``text, comments, and composite``.
cs: :guilabel:`Sloučit s komentáři` určuje vlastní sloupec, jehož obsah bude nedestruktivně sloučen s metadaty komentářů během generování katalogu. Například můžete mít vlastní sloupec :guilabel:`Biografie autora`, který byste chtěli připojit k metadatům komentářů. Můžete zvolit vložit obsah vlastního sloupce *před nebo za* oddíl Komentáře a volitelně oddělit připojený obsah vodorovnou čárou. Vhodné typy vlastních sloupců zahrnují ``text, komentáře a složený``.
de: :guilabel:`Mit Kommentaren zusammenführen` gibt eine benutzerdefinierte Spalte an, deren Inhalt bei der Katalog-Generierung zerstörungsfrei mit den Metadaten der Kommentare zusammengeführt wird. So können Sie beispielsweise eine benutzerdefinierte Spalte :guilabel:`Author Bio` an die Metadaten des Kommentars anhängen. Sie können die benutzerdefinierte Spalte *vor oder nach* dem Kommentar-Abschnitt einfügen und den angefügten Inhalt optional durch eine zusätzliche horizontale Trennlinie abtrennen. Verwendbare benutzerdefinierte Spaltentypen sind ``Text-, Kommentar- und zusammengesetzte Spalten``.
es: :guilabel:`Unir con comentarios` especifica una columna personalizada cuyo contenido se unirá, sin alterarlo, con el campo de metadatos de comentarios durante la generación del catálogo. Por ejemplo, puede tener una columna personalizada :guilabel:`Biografía del autor` que desee agregar a los metadatos de comentarios. Puede elegir insertar el contenido de la columna personalizada *antes* o *después* de la sección de comentarios y, opcionalmente, separar el contenido adicional con una línea horizontal. Los tipos de columna personalizada que se pueden seleccionar son ``texto``, ``comentarios`` y ``compuesta``.
pl: :guilabel:`Połącz z komentarzem` pozwala określić kolumnę, której treść zostanie w trakcie budowania katalogu połączona z komentarzem z metadanych. Na przykład jeśli masz własną kolumnę :guilabel:`Autor Bio`, możesz ją dodać do komentarza książki. Możesz wybrać, czy jej treść ma zostać umieszczona *przed czy po* sekcji komentarza i opcjonalnie oddzielić je poziomą linią. W ten sposób można dodać kolumny typu ``tekst, komentarze i składające się z innych kolumn``.
sv: :guilabel:`Slå samman med Kommentarer` anger en anpassad kolumn vars innehåll kommer ovillkorligen slås samman med metadatakommentarer under kataloggenereringen. Till exempel, har du kanske en anpassad kolumn :guilabel:`Författare biografi` som du vill lägga till slutet av metadatakommentarer. Du kan välja att infoga de anpassade kolumninnehållet *före eller efter* kommentarssektionen och alternative separat lägga till innehåll med en horisontal regelseparator. Godtagbara anpassade kolumntyper inkluderar `` text, kommentarer och blandningen``.

source: Custom catalog covers
cs: Vlastní obálky katalogu
de: Benutzerdefinierte Katalog-Coverbilder:
es: Portadas personalizadas para catálogos
pl: Własna okładka katalogu
sv: Utforma katalogomslag

source: |cc| With the `Generate Cover plugin <http://www.mobileread.com/forums/showthread.php?t=124219>`_ installed, you can create custom covers for your catalog. To install the plugin, go to :guilabel:`Preferences > Advanced > Plugins > Get new plugins`.
cs: |cc| S nainstalovaným `modulem Generovat obálku <http://www.mobileread.com/forums/showthread.php?t=124219>`_ můžete vytvořit vlastní obálky pro své katalogy. Pro nainstalování modulu přejděte na :guilabel:`Předvolby > Pokročilé > Moduly > Získat nové moduly`.
de: |cc| Mit dem installierten Plugin `Generate Cover <http://www.mobileread.com/forums/showthread.php?t=124219>`_ können Sie benutzerdefinierte Coverbilder für Ihren Katalog erstellen. Um dieses Plugin zu installieren, gehen Sie über :guilabel:`Einstellungen -> Erweitert -> Plugins -> Neue Plugins holen` und wählen dort das Plugin zur Installation aus.
es: |cc| Con el `complemento Generate Cover <http://www.mobileread.com/forums/showthread.php?t=124219>`_ instalado, puede crear portadas personalizadas para los catálogos. Para instalar el complemento, vaya a :guilabel:`Preferencias > Avanzado > Complementos > Obtener nuevos complementos`.
pl: |cc| Jeśli masz zainstalowaną wtyczkę `Generate Cover plugin <http://www.mobileread.com/forums/showthread.php?t=124219>`_, możesz wygenerować własną okładkę dla katalogu. Aby zainstalować wtyczkę, przejdź do :guilabel:`Ustawienia > Zaawansowane > Wtyczki > Pobierz nowe wtyczki`.
sv: |cc| Med `Generate Cover plugin <http://www.mobileread.com/forums/showthread.php?t=124219>`_ installerad kan du skapa egna omslag för din katalog. För att installera tillägg, gå till :guilabel:`Inställningar > Avancerat > Tillägg > Hämta nya tillägg`.

source: Additional help resources
cs: Dodatečné zdroje nápovědy
de: Weitere Hilfe-Ressourcen
es: Otras fuentes de ayuda
pl: Dodatkowe informacje
sv: Ytterligare hjälpresurser

source: For more information on calibre's Catalog feature, see the MobileRead forum sticky `Creating Catalogs - Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_, where you can find information on how to customize the catalog templates, and how to submit a bug report.
cs: Pro více informací o funkci Katalog calibre navštivte fórum MobileRead `Creating Catalogs: Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_, kde můžete najít informace o tom, jak přizpůsobit šablony katalogu, a jak poslat chybové hlášení.
de: Weitere Informationen zur calibre Katalogfunktionen finden Sie im MobileRead-Forum unter dem angehefteten Beitrag `Creating Catalogs - Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_. Dort werden Informationen zur Anpassung von Katalogvorlagen bereitgestellt und beschrieben, wie Sie bei Problemen einen Fehlerbericht erstellen und einreichen können.
pl: Więcej informacji o katalogach calibre znajdziesz na forum MobileRead, w przyklejonym wątku `Creating Catalogs - Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_, gdzie dowiesz się jak zmienić szablony katalogu i jak zgłaszać błędy dotyczące katalogów.
sv: För mer information om calibres katalogfunktioner, se MobileRead forum `Creating Catalogs - Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_, var du kan hitta information om hur du kan anpassa katalogmallar och hur du kan skicka en felrapport.

source: To ask questions or discuss calibre's Catalog feature with other users, visit the MobileRead forum `Calibre Catalogs <http://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
cs: Pokud máte otázky nebo chcete diskutovat o funkci Katalog Calibre s ostatními uživateli, navštivte fórum MobileRead `Calibre Catalogs <http://www.mobileread.com/forums/forumdisplay.php?f=236>`_.
de: Besuchen Sie im MobileRead-Forum `Calibre Catalogs `Calibre Catalogs <http://www.mobileread.com/forums/forumdisplay.php?f=236>`_, um Fragen zur Katalog-Funktion von calibre zu stellen oder deren Anwendung mit anderen Benutzern zu diskutieren.
es: Para preguntar o discutir sobre las funciones de catálogos de |app| con otros usuarios, visite el foro de MobileRead `Calibre Catalogs <http://www.mobileread.com/forums/forumdisplay.php?f=236>`_ (en inglés).
pl: Na forum MobilerRead, w wątku `Calibre Catalogs <http://www.mobileread.com/forums/forumdisplay.php?f=236>`_ możesz zadawać pytania i dyskutować o katalogach z innymi użytkownikami.
sv: För att ställa frågor eller diskutera calibre-katalogfunktionen med andra användare, besök MobileRead forumet `Calibre Catalogs <http://www.mobileread.com/forums/forumdisplay.php?f=236>`_.

source: |app|'s Create catalog feature enables you to create a catalog of your library in a variety of formats. This help file describes cataloging options when generating a catalog in AZW3, EPUB and MOBI formats.
es: La función «Crear catálogo» de |app| le permite crear un catálogo de la biblioteca en diferentes formatos. Este archivo de ayuda describe las opciones para generar catálogos en los formatos AZW3, EPUB y MOBI.

source: Create a multiple selection of the books you want cataloged. With more than one book selected in |app|'s main window, only the selected books will be cataloged.
es: Crear una selección múltiple de los libros que quiera catalogar. Si hay más de un libro seleccionado en la ventana principal de |app|, sólo se catalogarán los libros seleccionados

source: For more information on |app|'s Catalog feature, see the MobileRead forum sticky `Creating Catalogs - Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_, where you can find information on how to customize the catalog templates, and how to submit a bug report.
es: Para más información sobre las funciones de catálogo de |app|, véase el tema fijo del foro de MobileRead `Creating Catalogs - Start here <http://www.mobileread.com/forums/showthread.php?t=118556>`_ (en inglés), donde encontrará información sobre cómo personalizar las plantillas de catálogo y cómo enviar informes de errores.
