Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: Tag for MOBI files to be marked as personal documents. This option has no effect on the conversion. It is used only when sending MOBI files to a device. If the file being sent has the specified tag, it will be marked as a personal document when sent to the Kindle.
de: Schlagwort für MOBI Dateien, die als persönliche Dokumente markiert werden sollen. Diese Option hat keine Auswirklungen auf die Konvertierung. Es wird nur beim Versenden von MOBI Dateien zu einem Gerät verwendet. Wenn die Datei an den Kindle gesendet wird, ist sie durch ein bestimmtes Schlagwort als persönliches Dokument markiert.
fr: La balise pour les fichiers MOBI sont identifiés comme documents personnel. Cette option n'a aucun effet sur la conversion. Elle n'est utilisée essentiellement lors de l'envoi des fichiers MOBI vers un périphérique. Si le fichier est envoyé comme une balise spécifique, il sera identifié comme un document personnel lors de l'envoi vers votre Kindle.

source: OEB Output Options
de: OEB-Ausgabeoptionen
fr: Options de sortie OEB

source: PDB Output Options
de: PDB-Ausgabeoptionen
fr: Options de sortie PDB

source: Format to use inside the pdb container. Choices are: ['doc', 'ztxt', 'ereader']
de: Format zur Verwendung im pbd Container. Wählbar ist: ['doc', 'ztxt', 'ereader']
fr: Format à utiliser à l’intérieur du conteneur pdb. Les choix sont : ['doc', 'ztxt', 'ereader']

source: Add Table of Contents to beginning of the book.
de: Inhaltsverzeichnis am Anfang des Buches hinzufügen.
fr: Ajouter la table des matières au début du livre.

source: Specify the character encoding of the output document. The default is cp1252. Note: This option is not honored by all formats.
de: Geben Sie die Zeichenkodierung für das Ausgabe-Dokument an. Die Voreinstellung ist cp1252. Achtung: Diese Einstellung wird nicht von allen Formaten übernommen.
fr: Spécifier l’encodage des caractères pour le document de sortie. Par défaut : cp1252. Note: Cette option n’est pas gérée par tous les formats.

source: PDF Output Options
de: PDF-Ausgabeoptionen
fr: Options de sortie PDF

source: Custom size of the document. Use the form widthxheight EG. `123x321` to specify the width and height. This overrides any specified paper-size.
de: Wunschgröße des Dokuments. Verwenden Sie dabei BreitexHöhe, z.B. `123x321` für die Angabe der Breite und Höhe. Dies überschreibt jede angegebene Seitengröße.
fr: Taille de document personnalisée. Utiliser le format largeur x hauteur, c.-à-d. `123x321` pour spécifier la largeur et la hauteur. Toute taille de papier spécifiée sera remplacée par celle-ci.

source: Use the old, less capable engine to generate the PDF
de: Benutzen sie das alte, nicht so leistungsfähige Engine um das PDF zu erstellen
fr: Utiliser l'ancien moteur moins performant pour générer le pdf

source: Normally, the PDF page size is set by the output profile chosen under page options. This option will cause the page size settings under PDF Output to override the size specified by the output profile.
de: Normalerweise wird die PDF Blattgröße vom Output Profile unter Seiteneinrichtung eingestellt. Diese Option überschreibt die in Output Profile eingestellte Größe mit der vom PDF-Ausgabe.
fr: Normalement, la taille de la page PDF est définie par le profil de sortie choisi dans la page Options. Cette option entraînera le remplacement de la taille spécifiée par le profil de sortie par les paramètres de taille de la sortie PDF.

source: The size of the paper. This size will be overridden when a non default output profile is used. Default is letter. Choices are [u'a0', u'a1', u'a2', u'a3', u'a4', u'a5', u'a6', u'b0', u'b1', u'b2', u'b3', u'b4', u'b5', u'b6', u'legal', u'letter']
de: Das Papierformat. T Diese Größe wird überschrieben, wenn kein Standard-Ausgabe-Profil verwendet wird. Standardwert ist letter. Zur Auswahl stehen [u'a0', u'a1', u'a2', u'a3', u'a4', u'a5', u'a6', u'b0', u'b1', u'b2', u'b3', u'b4', u'b5', u'b6', u'legal', u'letter']
fr: La taille du papier. Cette taille sera remplacée par un profil de sortie ne faisant pas partie des options par défaut. Les choix sont [u'a0', u'a1', u'a2', u'a3', u'a4', u'a5', u'a6', u'b0', u'b1', u'b2', u'b3', u'b4', u'b5', u'b6', u'legal', u'letter']

source: Add a Table of Contents at the end of the PDF that lists page numbers. Useful if you want to print out the PDF. If this PDF is intended for electronic use, use the PDF Outline instead.
de: Ein Inhaltsverzeichnis (TOC) mit Seitenzahlen am Ende der PDF hinzufügen. Das ist nützlich, wenn Sie die PDF drucken möchten. Wenn diese PDF für die elektronische Nutzung vorgesehen ist, nutzen Sie stattdessen das PDF Outline.
fr: Ajouter une table des matières à la fin du PDF qui répertorie les numéros de page. Utile si vous souhaitez imprimer le PDF. Si ce fichier PDF est destiné à un usage électronique, utilisez plutôt le Navigateur PDF.

source: The default font size
de: Voreingestellte Schriftgröße
fr: La taille de la police de caractères par défaut

source: An HTML template used to generate footers on every page. The strings _PAGENUM_, _TITLE_, _AUTHOR_ and _SECTION_ will be replaced by their current values.
de: Ein HTML Template, das verwendet wird um Fußzeilen auf jeder Seite zu generieren. Die Zeichenketten _PAGENUM_, _TITLE_, _AUTHOR_ und _SECTION_ für Seitenzahl, Titel, Autor, Abschnitt werden durch ihre aktuellen Werte ersetzt.
fr: Un modèle HTML utilisé pour générer les pieds de page sur chaque page. Les chaînes _PAGENUM_, _TITLE_, _AUTHOR_ et _SECTION_ seront remplacées par leurs valeurs courantes.

source: An HTML template used to generate headers on every page. The strings _PAGENUM_, _TITLE_, _AUTHOR_ and _SECTION_ will be replaced by their current values.
de: Ein HTML Template, das verwendet wird um Kopfzeilen auf jeder Seite zu generieren. Die Zeichenketten _PAGENUM_, _TITLE_, _AUTHOR_ und _SECTION_ für Seitenzahl, Titel, Autor, Abschnitt werden durch ihre aktuellen Werte ersetzt.
fr: Un modèle HTML utilisé pour générer les entêtes sur chaque page. Les chaînes _PAGENUM_, _TITLE_, _AUTHOR_ et _SECTION_ seront remplacées par leurs valeurs courantes.

source: Surround all links with a red box, useful for debugging.
de: Umrahmt alle Links mit einem roten Quadrat. Nützlich für Fehlersuche.
fr: Entoure tous les liens avec une boîte rouge, utile pour déboguer.

source: The font family used to render monospaced fonts
de: Die Schriftfamilie wird verwendet, um Monospace-Schriften zu rendern
fr: La famille de police utilisée pour rendre les polices de caractères à espacement fixe

source: The default font size for monospaced text
de: Die Standard-Schriftgröße für Monospace-Text
fr: La taille par défaut de la police de caractères pour le texte à espacement fixe

source: Add page numbers to the bottom of every page in the generated PDF file. If you specify a footer template, it will take precedence over this option.
de: Die Seitenzahlen werden unter jeder Seite in der generierten PDF-Datei ergänzt. Ein von Ihnen festgelegtes Template hat vor dieser Option Vorrang.
fr: Rajoute les numéros sur chaque bas de page dans les fichiers PDF générés. Si vous précisez un modèle de pied de page, ce dernier sera appliqué préalablement à cette option.

source: The font family used to render sans-serif fonts
de: Die Schriftfamilie wird verwendet, um serifenlose Schriften zu rendern
fr: La famille de police utilisée pour rendre les polices de caractères sans-serif

source: The font family used to render serif fonts
de: Die Schriftfamilie wird verwendet, um in Serifenschriften zu rendern
fr: La famille de police utilisée pour rendre les polices serif

source: Preserve the aspect ratio of the cover, instead of stretching it to fill the full first page of the generated pdf.
de: Seitenverhältnis des Coverbildes beibehalten, statt es auf die volle erste Seite des erzeugten PDFs zu skalieren.
fr: Conserver le ratio de la couverture au lieu de l’étirer pour remplir entièrement la première page du pdf généré.

source: Title for generated table of contents.
de: Titel für das erstellte Inhaltsverzeichnis (TOC).
fr: Titre pour la table des matières générée.

source: Generate an uncompressed PDF, useful for debugging, only works with the new PDF engine.
de: Erstellt einem nicht komprimierten PDF, nützlich für Fehlersuche, funktioniert nur mit dem neuen PDF Engine.
fr: Génère un fichier PDF non compressé, utile pour le débogage, ne fonctionne qu'avec le nouveau moteur PDF.

source: The unit of measure for page sizes. Default is inch. Choices are ['millimeter', 'centimeter', 'point', 'inch', 'pica', 'didot', 'cicero', 'devicepixel'] Note: This does not override the unit for margins!
de: Die Einheit für Blattgröße. Standard ist Zoll. Zur Auswahl stehen ['millimeter', 'centimeter', 'point', 'inch', 'pica', 'didot', 'cicero', 'devicepixel'] Hinweis: Diese Einstellung überschreibt nicht die Einheit für Seitenränder!
fr: L'unité de mesure pour la taille des pages. L'unité par défaut est le pouce (inch). Les choix possibles sont ['millimeter', 'centimeter', 'point', 'inch', 'pica', 'didot', 'cicero', 'devicepixel'] Note: Ce choix ne remplacera pas celui fait pour les marges !

source: PML Output Options
de: PML-Ausgabeoptionen
fr: Options de sortie PML

source: Do not reduce the size or bit depth of images. Images have their size and depth reduced by default to accommodate applications that can not convert images on their own such as Dropbook.
de: Bittiefe von Bildern nicht reduzieren. Bilder werden standardmäßig bezüglich Bittiefe und Größe verkleinert, um Anwendungen, die Bilder nicht von sich aus verarbeiten können, zu unterstützen (z.B. Dropbook).
fr: Ne pas réduire la taille ou la profondeur des images. Les images ont leur taille et profondeur réduite par défaut pour être compatibles aux applications qui ne convertissent pas les images d’elles-mêmes comme Dropbook.

source: Specify the character encoding of the output document. The default is cp1252.
de: Geben Sie die Zeichenkodierung des Ausgabe-Dokuments an. Voreinstellung ist cp1252.
fr: Spécifier l’encodage de caractères pour le document de sortie. Par défaut : cp1252.

source: RB Output Options
de: RB-Ausgabeoptionen
fr: Options de sortie RB

source: RTF Output Options
de: RTF-Ausgabeoptionen
fr: Options de sortie RTF

source: SNB Output Options
de: SNB-Ausgabeoptionen
fr: Options de sortie SNB

source: Specify whether or not to insert two space characters to indent the first line of each paragraph.
de: Geben Sie an, ob zur Einrückung der ersten Zeile jedes Absatzes zwei Leerzeichen eingefügt werden sollen.
fr: Spécifier s’il faut insérer ou non deux espaces pour indenter la première ligne de chaque paragraphe.

source: Resize all the images for full screen view.
de: Alle Bilder für Vollbildanzeige neu skalieren.
fr: Redimensionne toutes les images pour l’affichage en plein écran.

source: Specify whether or not to hide the chapter title for each chapter. Useful for image-only output (eg. comics).
de: Geben Sie an, ob der Kapitelname für jedes Kapitel versteckt werden soll oder nicht. Nützlich für Ausgabe ausschließlich mit Bildern (z.B. Comics).
fr: Spécifier s’il faut cacher ou non le titre de chapitre pour chaque chapitre. Utile pour les sorties ne contenant que des images (eg. les bandes dessinées).

source: Specify whether or not to insert an empty line between two paragraphs.
de: Geben Sie an, ob eine Leerzeile zwischen zwei Absätzen eingefügt werden soll.
fr: Spécifier s’il faut ou non insérer une ligne vide entre deux paragraphes.

source: The maximum number of characters per line. This splits on the first space before the specified value. If no space is found the line will be broken at the space after and will exceed the specified value. Also, there is a minimum of 25 characters. Use 0 to disable line splitting.
de: Maximale Anzahl von Zeichen pro Zeile. Dies teilt beim ersten Leerzeichen vor dem angegebenen Wert. Falls kein Leerzeichen gefunden wird, wird die Zeile am Leerzeichen danach umgebrochen und den angegebenen Wert überschreiten. Das Minimum ist 25 Zeichen. Verwenden Sie 0, um den Zeilenumbruch auszuschalten.
fr: Le nombre maximum de caractères par ligne. Ceci génère une rupture sur le premier espace avant la valeur spécifiée. Si aucun espace n’est trouvé, la ligne sera scindée sur l’espace suivant et ne devra pas excéder la valeur spécifiée. Avec un minimum de 25 caractères. Utiliser 0 pour désactiver la rupture de la ligne.

source: Specify the character encoding of the output document. The default is utf-8.
de: Geben Sie die Zeichenkodierung für das Ausgabe-Dokument an. Die Voreinstellung ist utf-8.
fr: Définir l’encodage des caractères du document produit. La valeur par défaut est utf-8.

source: TCR Output Options
de: TCR-Ausgabeoptionen
fr: Options de sortie TCR

source: TXT Output Options
de: TXT-Ausgabeoptionen
fr: Options de sortie TXT

source: Force splitting on the max-line-length value when no space is present. Also allows max-line-length to be below the minimum
de: Zeilenumbruch bei der maximalen Zeilenlänge erzwingen, falls kein Leerzeichen vorhanden ist. Gestattet auch, die maximale Zeilenlänge unter das Minimum zu setzen
fr: Forcer la rupture sur la valeur maximale de la longueur de ligne quand aucun espace n’est présent. Autorise aussi la valeur maximale de la longueur de ligne à être en dessous du minimum

source: Do not remove font color from output. This is only useful when txt-output-formatting is set to textile. Textile is the only formatting that supports setting font color. If this option is not specified font color will not be set and default to the color displayed by the reader (generally this is black).
de: Zeichenfarbe nicht von der Ausgabe entfernen. Dies ist nur sinnvoll, wenn die Textausgabe-Formatierung auf Textile eingestellt ist. Textile ist die einzige Formatierung welche die Einstellung der Zeichenfarbe unterstützt. Wenn diese Einstellung nicht definiert ist, wird keine Zeichenfarbe eingestellt und die Farbe wird durch den Reader bestimmt (gewöhnlich ist die Farbe schwarz).
fr: Ne pas enlever la couleur de police de la sortie. N'est utile lorsque la variable "txt-output-formatting" est définie à "textile". Textile est le seul formatage qui prend en charge la mise en place de couleur de police. Si cette option n’est pas spécifiée, la couleur de police ne sera pas définie, et sera mise par défaut sur la valeur de couleur affichée par le lecteur (noir généralement).

source: Do not remove image references within the document. This is only useful when paired with a txt-output-formatting option that is not none because links are always removed with plain text output.
de: Abbildungen im Dokument nicht enfernen. Dies ist nur sinnvoll, wenn es gemeinsam mit einer txt-output-formatting Option, die nicht "none" ist, benutzt wird - da bei einfacher Textausgabe Abbildungen immer entfernt werden.
fr: Ne pas supprimer les références à des images à l’intérieur du document. Cette option est utile seulement quand elle est couplée avec une option txt-output-formatting qui n’est pas nulle car les références à des images sont toujours supprimées avec la sortie texte classique.

source: Do not remove links within the document. This is only useful when paired with a txt-output-formatting option that is not none because links are always removed with plain text output.
de: Links im Dokument nicht enfernen. Dies ist nur sinnvoll, wenn es gemeinsam mit einer txt-output-formatting Option, die nicht "none" ist, benutzt wird - da bei einfacher Textausgabe Links immer entfernt werden.
fr: Ne pas supprimer les liens à l’intérieur du document. Cette option est utile seulement quand elle est couplée avec une option txt-output-formatting qui n’est pas nulle car les liens sont toujours supprimées avec la sortie texte classique.

source: Type of newline to use. Options are ['old_mac', 'system', 'unix', 'windows']. Default is 'system'. Use 'old_mac' for compatibility with Mac OS 9 and earlier. For Mac OS X use 'unix'. 'system' will default to the newline type used by this OS.
de: Art des zu verwendenden Zeilenumbruchs. Einstellungsmöglichkeiten: ['old_mac', 'system', 'unix', 'windows']. Voreinstellung ist 'system'. Verwenden Sie 'old_mac' zur Kompatibilität mit Mac OS 9 und früheren Systemen. Für Mac OS X verwenden Sie 'unix'. 'system' wird standardmäßig von diesem OS als Zeilenumbruch verwendet.
fr: Type de saut de ligne à utiliser. Les options sont ['old_mac', 'system', 'unix', 'windows']. Par défaut : 'system'. Utiliser 'old_mac' pour une compatibilité avec les Mac OS9 et antérieur. Pour les Mac OS X utiliser 'unix'. 'system' utilisera le type de saut de ligne utilisé par ce système d’exploitation.

source: Formatting used within the document. \* plain: Produce plain text. \* markdown: Produce Markdown formatted text. \* textile: Produce Textile formatted text.
de: Benutzte Formatierungen innerhalb des Dokuments. \* plain: Erzeugt unformatierten Text. \* markdown: Erzeugt ein Markdown formatierter Text. \* textile: Erzeugt ein Textile formatierten Text.
fr: Mise en forme utilisée à l’intérieur du document. \* plain : produit du texte simple. \* markdown : Produit du texte avec la mise en forme Markdown. \* textile : Produit du texte avec la mise en forme Textile.

source: TXTZ Output Options
de: TXTZ-Ausgabeoptionen
fr: Options de sortie TXTZ

source: Launch the calibre edit book tool.
fr: Démarre l'outil d'édition de livre de calibre.

source: Whenever you pass arguments to :command:`ebook-edit` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`ebook-edit` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`ebook-edit` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Edit the named file inside the book
fr: Éditez le fichier nommé à l'intérieur du livre

source: Read/Write metadata from/to ebook files.
de: Lesen/Schreiben von Metadaten aus/in eBook-Dateien.
fr: Lit/Ecrit les métadonnées depuis/vers les fichiers livre.

source: Supported formats for reading metadata: azw, azw1, azw3, azw4, cbr, cbz, chm, docx, epub, fb2, html, htmlz, imp, lit, lrf, lrx, mobi, odt, oebzip, opf, pdb, pdf, pml, pmlz, pobi, prc, rar, rb, rtf, snb, tpz, txt, txtz, updb, zip
de: Unterstützte Formate zum Lesen von Metadaten: azw, azw1, azw3, azw4, cbr, cbz, chm, docx, epub, fb2, html, htmlz, imp, lit, lrf, lrx, mobi, odt, oebzip, opf, pdb, pdf, pml, pmlz, pobi, prc, rar, rb, rtf, snb, tpz, txt, txtz, updb, zip
fr: Formats supportés pour la lecture des métadonnées : azw, azw1, azw3, azw4, cbr, cbz, chm, docx, epub, fb2, html, htmlz, imp, lit, lrf, lrx, mobi, odt, oebzip, opf, pdb, pdf, pml, pmlz, pobi, prc, rar, rb, rtf, snb, tpz, txt, txtz, updb, zip

source: Supported formats for writing metadata: azw, azw1, azw3, azw4, epub, fb2, htmlz, lrf, mobi, pdb, pdf, prc, rtf, tpz, txtz
de: Unterstützte Formate zum Schreiben von Metadaten: azw, azw1, azw3, azw4, epub, fb2, htmlz, lrf, mobi, pdb, pdf, prc, rtf, tpz, txtz
fr: Formats supportés pour l'écriture des métadonnées: azw, azw1, azw3, azw4, epub, fb2, htmlz, lrf, mobi, pdb, pdf, prc, rtf, tpz, txtz

source: Different file types support different kinds of metadata. If you try to set some metadata on a file type that does not support it, the metadata will be silently ignored.
de: Verschiedene Dateitypen unterstützen verschiedene Arten von Metadaten. Wenn Sie versuchen Metadaten in einem Dateityp zu setzen, der diese nicht unterstützt, werden diese Matadaten ohne Warnung ignoriert.
fr: Différents types de fichiers prennent en charge différentes sortes de métadonnées. Si vous essayer d’indiquer des métadonnées sur un type de fichier qui ne le prend pas en charge, les métadonnées seront ignorées sans avertissement.

source: Whenever you pass arguments to :command:`ebook-meta` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`ebook-meta` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`ebook-meta` qui comportent des espaces, mettez ces arguments entre guillemets.

source: String to be used when sorting by author. If unspecified, and the author(s) are specified, it will be auto-generated from the author(s).
de: Zeichenfolge, die für die Sortierung nach Autor verwendet werden soll. Falls nicht angegeben, und ein Autor vorhanden ist, wird sie aus der Autorenangabe automatisch erstellt.
fr: Chaine utilisée pour le tri par auteur. Si non spécifiée, et que le(s) auteur(s) sont spécifié(s), il sera généré automatiquement à partir des auteurs.

source: Set the authors. Multiple authors should be separated by the & character. Author names should be in the order Firstname Lastname.
de: Geben Sie den Autor an. Mehrere Autoren sollten durch ein & Zeichen getrennt angegeben werden. Die Namen der Autoren sollten in der Reihenfolge Vorname Nachname angegeben werden.
fr: Indiquer les auteurs. Les auteurs multiples doivent être séparés par le caractère &. Les noms d’auteur doivent être dans l’ordre Prénom Nom.

source: Set the book category.
de: Geben Sie die Kategorie des Buches an.
fr: Indiquer la catégorie du livre.

source: Set the cover to the specified file.
de: Geben Sie das Coverbild für die angegebene Datei an.
fr: Indiquer la couverture pour le fichier spécifié.

source: Set the published date.
de: Geben Sie das Erscheinungsdatum an.
fr: Indiquer la date de publication.

source: Read metadata from the specified OPF file and use it to set metadata in the ebook. Metadata specified on the command line will override metadata read from the OPF file
de: Metadaten aus der angegebenen OPF-Datei lesen und als Metadaten im eBook verwenden. Auf der Kommandozeile angegebene Metadaten überschreiben die aus der OPF-Datei gelesenen Metadaten
fr: Lire les métadonnées à partir du fichier OPF spécifié et les utiliser pour indiquer les méta-données du livre numérique. Les métadonnées spécifiées en ligne de commande écraseront les métadonnées lues à partir du fichier OPF.

source: Get the cover from the ebook and save it at as the specified file.
de: Coverbild des eBooks holen und als angegebene Datei speichern.
fr: Obtenir la couverture du livre numérique et l’enregistre sous le fichier spécifié.

source: Set the identifiers for the book, can be specified multiple times. For example: :option:`--identifier` uri:http://acme.com :option:`--identifier` isbn:12345 To remove an identifier, specify no value, :option:`--identifier` isbn: Note that for EPUB files, an identifier marked as the package identifier cannot be removed.
de: Festlegen der Kennung des Buches. Kann mehrmals angegeben werden. Beispiel: :option:`--identifier` uri:http://acme.com :option:`--identifier` isbn:12345. Um eine Kennung zu entfernen, geben Sie keinen Wert an, :option:`--identifier` isbn: Beachten Sie, dass bei EPUB Dateien Kennungen, die als Paketkennung markiert sind, nicht entfernt werden können.
fr: Définir les identifiants du livre, peut être spécifié à plusieurs reprises. Par exemple : :option:`--identifier` uri:http://acme.com :option:`--identifier` isbn:12345. Pour supprimer un identifiant, laissez la valeur en blanc, :option:`--identifier` isbn:. Notez que pour les fichiers EPUB, un identifiant marqué comme identifiant de paquet ne peut pas être supprimé.

source: Set the BookID in LRF files
de: BookID für LRF-Dateien angeben
fr: Indiquer l’identifiant du livre dans les fichiers LRF
