Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: Export a :command:`catalog` in format specified by path/to/destination extension. Options control how entries are displayed in the generated :command:`catalog` output.
de: Exportiert einen :command:`Katalog` nach /Pfad/zum/Ziel im Format der Erweiterung. Optionen bestimmen, wie Einträge im erstellten :command:`Katalog` angezeigt werden.
fr: Exporte une :command:`catalog` au format spécifié par l’extension de /chemin/vers/destination. Les options contrôlent la manière dont les entrées sont affichées dans la sortie :command:`catalog` générée.

source: The fields to output when cataloging books in the database. Should be a comma-separated list of fields. Available fields: all, title, title_sort, author_sort, authors, comments, cover, formats, id, isbn, library_name, ondevice, pubdate, publisher, rating, series_index, series, size, tags, timestamp, uuid, languages, identifiers, plus user-created custom fields. Example: :option:`--fields=title,authors,tags` Default: 'all' Applies to: CSV, XML output formats
de: Die Felder, die ausgegeben werden, wenn Bücher in dieser Datenbank katalogisiert werden. Sollte eine kommagetrennte Liste von Feldern sein. Verfügbare Felder: all, title, title_sort, author_sort, authors, comments, cover, formats, id, isbn, library_name, ondevice, pubdate, publisher, rating, series_index, series, size, tags, timestamp, uuid, languages, identifiers, und vom Benutzer erstellte eigene Felder. Beispiel :option:`--fields=title,authors,tags`. Standard: 'all'. Wird angewendet bei: CSV, XML Ausgabeformaten
fr: Les champs à insérer lors du catalogage des livres dans la base. Doit être une liste de champs séparées par des virgules. Champs disponibles: all, title, title_sort, author_sort, authors, comments, cover, formats, id, isbn, library_name, ondevice, pubdate, publisher, rating, series_index, series, size, tags, timestamp, uuid, languages, identifiers,en plus des champs personnalisés créés par l'utilisateur. Exemple : :option:`--fields=title,authors,tags` Par défaut: 'all' Applicable aux formats de sortie CSV, XML

source: Comma-separated list of database IDs to catalog. If declared, :option:`--search` is ignored. Default: all
de: Durch Kommata getrennte Liste der Datenbank-IDs, die zu katalogisieren sind. Wenn angegeben, wird :option:`--search` ignoriert. Voreinstellung: 'all'
fr: Liste séparée par des virgules d’identifiants de base de données à cataloguer. Si déclaré, :option:`--search` est ignoré. Option par défaut : all

source: Filter the results by the search query. For the format of the search query, please see the search-related documentation in the User Manual. Default: no filtering
de: Die Ergebnisse durch die Suchanfrage filtern. Für das Format der Suchanfrage sehen Sie sich bitte die Dokumentation, die die Suche betrifft, im Benutzerhandbuch an. Voreinstellung: keine Filterung.
fr: Filtrer les résultats par la requête de recherche. Pour le format de la requête de recherche, veuillez consulter la section recherche dans le Manuel Utilisateur. Par défaut: Pas de filtre

source: Output field to sort on. Available fields: author_sort, id, rating, size, timestamp, title_sort Default: 'id' Applies to: CSV, XML output formats
de: Ausgabefeld, nach dem sortiert werden soll. Verfügbare Felder: author_sort, id, rating, size, timestamp, title_sort Vorgabe: 'id'. Gilt für CSV- und XML-Ausgabeformate
fr: Champ de sortie à utiliser pour le tri. Champs disponibles: author_sort, id, rating, size, timestamp, title_sort Par défault: '%default' S’applique aux formats : CSV, XML

source: Show detailed output information. Useful for debugging
de: Detaillierte Ausgabeinformation anzeigen. Hilfreich zur Fehlerdiagnose
fr: Affiche des informations détaillées. Utile pour le débogage

source: calibredb :command:`saved_searches` add name search calibredb :command:`saved_searches` remove name
de: calibredb :command:`saved_searches` add Suchname Such-Definition fügt eine Suche hinzu. calibredb :command:`saved_searches` remove Suchname löscht eine gespeicherte Suche. Beispiel: calibredb saved_searches add SucheLudlum authors:"=Robert Ludlum" und calibredb saved_searches remove SucheLudlum
fr: calibredb :command:`saved_searches` ajoutez la recherche de nom calibredb :command:`saved_searches` supprimez le nom

source: Manage the saved searches stored in this database. If you try to add a query with a name that already exists, it will be replaced.
de: Verwaltet die in der Datenbank abgelegten gespeicherten Suchen. Bereits vorhandene Suchen werden überschrieben, wenn eine neue Suche mit gleichem Namen hinzugefügt wird.
fr: Gére les recherches sauvegardées stockées dans la base de données. Si vous tentez d’ajouter une requête avec un nom préexistant, elle sera remplacée.

source: Create a custom column. label is the machine friendly name of the column. Should not contain spaces or colons. name is the human friendly name of the column. datatype is one of: rating, int, text, float, comments, datetime, composite, bool, enumeration, series
de: Erstellt eine benutzerdefinierte Spalte. Lable ist der maschinefreundliche Name der Spalte. Sollte keine Leerzeichen oder Doppelpunkte enthalten. Name ist der benutzerfreundliche Name der Spalte. Datatype ist einer aus: rating, int, text, float, comments, datetime, composite, bool, enumeration, series
fr: Créez une colonne personnalisée. label correspond au nom de la colonne pour le programme. Ne doit pas contenir d’espace ou de deux-points. name est le nom de la colonne pour l’utilisateur. datatype est à choisir parmi : : rating, int, text, float, comments, datetime, composite, bool, enumeration, series

source: A dictionary of options to customize how the data in this column will be interpreted. This is a JSON string. For enumeration columns, use :option:`--display=`"{\"enum_values\":[\"val1\", \"val2\"]}" There are many options that can go into the display variable.The options by column type are: composite: composite_template, composite_sort, make_category,contains_html, use_decorations datetime: date_format enumeration: enum_values, enum_colors, use_decorations int, float: number_format text: is_names, use_decorations The best way to find legal combinations is to create a custom column of the appropriate type in the GUI then look at the backup OPF for a book (ensure that a new OPF has been created since the column was added). You will see the JSON for the "display" for the new column in the OPF.
de: Ein Wörterbuch von Optionen zum Anpassen, wie die Daten in dieser Spalte interpretiert werden. Das ist eine JSON-Zeichenkette. Zum Aufzählen von Spalten verwenden Sie :option:`--display=`"{\"enum_values\":[\"val1\", \"val2\"]}". Es gibt viele Optionen, die in der Anzeigevariable enthalten sein können. Diese Optionen nach Art der Spalten sind: Zusammengesetzt – composite: composite_template, composite_sort, make_category,contains_html, use_decorations Datum und Zeit – datetime: date_format Aufzählung – enumeration: enum_values, enum_colors, use_decorations Ganz- und Fließkommazahlen – int, float: number_format Text – text: is_names, use_decorations Der beste Weg, eine gültige Kombinationen zu finden, ist eine benutzerdefinierte Spalte des entsprechenden Typs im GUI zu erstellen und dann auf die Sicherung der OPF-Datei des Buches zu schauen. (Stellen Sie sicher, dass die OPF-Datei nach dem Hinzufügen der Spalte neu erstellt wurde). Sie werden die JSON für "display" der neuen Spalte im OPF sehen.
fr: Un dictionnaire des options pour personnaliser la manière dont les données dans cette colonne seront interprétées. C'est une chaîne JSON. Pour des colonnes d'énumération, employez :option:`--display=`"{\"enum_values\":[\"val1\", \"val2\"]}" Il y a beaucoup d'options qui peuvent entrer dans la variable d'affichage.Les options par type de colonne sont : composite: composite_template, composite_sort, make_category,contains_html, use_decorations datetime: date_format enumeration: enum_values, enum_colors, use_decorations int, float: number_format text: is_names, use_decorations La meilleure manière de trouver des combinaisons légitimes est de créer dans le GUI une colonne personnalisée du type approprié et d'ensuite regarder dans le backup de l'OPF d'un livre (assurez-vous qu'un nouvel OPF a été créé depuis que la colonne a été ajoutée). Vous verrez le JSON pour l' « affichage » pour la nouvelle colonne dans l'OPF.

source: This column stores tag like data (i.e. multiple comma separated values). Only applies if datatype is text.
de: Diese Spalte speichert Daten ähnlich wie bei Schlagwörtern (z.B. mehrere durch Kommata getrennte Werte). Gilt nur, wenn der Datentyp Text ist.
fr: Cette colonne stocke les étiquettes comme des données (par exemple des valeurs multiples séparées par des virgules). Appliqué seulement si le type de donnée est du texte.

source: List available custom columns. Shows column labels and ids.
de: Listet verfügbare benutzerdefinierte Spalten auf. Zeigt Spaltenbeschriftung und IDs.
fr: Liste les colonnes personnalisées disponibles. Affiche les libellés de colonne et les identifiants.

source: Show details for each column.
de: Details jeder Spalte anzeigen.
fr: Afficher les détails pour chaque colonne.

source: Remove the custom column identified by label. You can see available columns with the custom_columns command.
de: Entfernt die durch die Beschriftung identifizierten benutzerdefinierten Spalten. Sie können die verfügbaren Spalten mit dem custom_columns Befehl anzeigen lassen.
fr: Enlevez la colonne personnalisée identifiée par libellé. Vous pouvez voir les colonnes disponibles avec la commande custom_columns.

source: Do not ask for confirmation
de: Nicht nach einer Bestätigung fragen
fr: Ne pas demander de confirmation

source: Set the value of a custom column for the book identified by id. You can get a list of ids using the list command. You can get a list of custom column names using the custom_columns command.
de: Setzt den Wert einer benutzerdefinierten Spalte für das durch die ID identifizierte Buch. Eine Liste der IDs erhalten Sie mit Hilfe des list Befehls. Sie erhalten eine Liste der Namen von benutzerdefinierten Spalten mit Hilfe des custom_columns Befehls.
fr: Définir la valeur d’une colonne personnalisée pour le livre identifié par l’id. Vous pouvez obtenir une liste d’ids en utilisant la commande list. Vous pouvez obtenir une liste des noms de colonnes personnalisés en utilisant la commande custom_columns.

source: If the column stores multiple values, append the specified values to the existing ones, instead of replacing them.
de: Wenn die Spalte mehrere Werte speichert, sollen die angegebenen Werte zu den bestehenden hinzugefügt werden, anstatt sie zu ersetzen.
fr: Si la colonne stocke des valeurs multiples, ajouter les valeurs spécifiées à celles existantes, au lieu de les remplacer.

source: Restore this database from the metadata stored in OPF files in each directory of the calibre library. This is useful if your metadata.db file has been corrupted.
de: Wiederherstellung der Datenbank mithilfe der gespeicherten Metadaten der OPF-Dateien aus den einzelnen Buchverzeichnissen der Calibre-Bibliothek. Dies ist nützlich, falls die Datei metadata.db beschädigt ist.
fr: Restaurez cette base de données à partir des métadonnées stockées dans les fichiers OPF dans chaque répertoire de la bibliothèque calibre. Ceci est précieux si votre fichier metadata.db est corrompu.

source: WARNING: This command completely regenerates your database. You will lose all saved searches, user categories, plugboards, stored per-book conversion settings, and custom recipes. Restored metadata will only be as accurate as what is found in the OPF files.
de: ACHTUNG: Dieser Befehl regeneriert die Datenbank vollständig. Sie verlieren dadurch alle gespeicherten Suchen, benutzerdefinierte Kategorien, Schalttafeln, individuell pro Buch gespeicherte Konvertierungseinstellungen und benutzer- definierte Nachrichtenquellen. Die wiederhergestellten Metadaten sind nur so vollständig wie die in den OPF-Dateien gespeicherten Daten.
fr: ATTENTION : cette commande régénère complètement votre base de données. Vous perdrez toutes les recherches sauvegardées, les catégories utilisateur, les tableaux de connexions, les réglages de conversion par livre et les recettes personnalisées. Les métadonnées restaurées seront aussi précises que ce qui sera trouvé dans les fichiers OPF.

source: Really do the recovery. The command will not run unless this option is specified.
de: Führt die Wiederherstellung tatsächlich durch. Der Befehl wird nicht ausgeführt, wenn diese Option nicht vorhanden ist.
fr: Effectuer réellement la récupération. La commande ne sera pas exécuté si cette option n’est pas spécifiée.

source: Perform some checks on the filesystem representing a library. Reports are invalid_titles, extra_titles, invalid_authors, extra_authors, missing_formats, extra_formats, extra_files, missing_covers, extra_covers, failed_folders
de: Führt einige Prüfungen über das Dateisystems aus, das die Bibliothek enthält. Berichte sind invalid_titles, extra_titles, invalid_authors, extra_authors, missing_formats, extra_formats, extra_files, missing_covers, extra_covers, failed_folders
fr: Effectue certaines vérifications sur le fichier système représentant la bibliothèque. Les rapports sont invalid_titles, extra_titles, invalid_authors, extra_authors, missing_formats, extra_formats, extra_files, missing_covers, extra_covers, failed_folders

source: Output in CSV
de: Ausgabe als CSV
fr: Sortie en CSV

source: Comma-separated list of extensions to ignore. Default: all
de: Komma-separierte Liste der zu ignorierenden Erweiterungen. Standard: all
fr: Liste d’extensions à ignorer, séparées par des virgules. Par défaut: toutes

source: Comma-separated list of names to ignore. Default: all
de: Komma-separierte Liste der zu ignorierenden Namen. Standard: all
fr: Liste de noms à ignorer séparés par des virgules. Par défaut : tous

source: Comma-separated list of reports. Default: all
de: Komma-separierte Liste von Berichten. Standard: alle
fr: Liste de rapports séparés par des virgules. Par défaut : tous

source: Produce a report of the category information in the database. The information is the equivalent of what is shown in the tags pane.
de: Erstellt einen Report der Kategorie-Informationen in der Datenbank. Die Information entspricht dem, was im Schlagwort-Browser angezeigt wird.
fr: Produit un rapport sur les informations des catégories dans la base de données. Les informations sont les équivalents de ce qui est affiché dans le panneau des étiquettes.

source: Comma-separated list of category lookup names. Default: all
de: Komma-separierte Liste von Kategorie-Suchnamen. Voreinstellung: 'all'
fr: Liste de catégories de noms de recherche séparées par des virgules. Par défaut: tous

source: Output only the number of items in a category instead of the counts per item within the category
de: Nur Anzahl der Einträge in einer Kategorie ausgeben anstelle der Anzahl pro Eintrag in der Kategorie
fr: Sort seulement le nombre d’articles dans une catégorie au lieu du nombre d’occurrences par article à l’intérieur de la catégorie

source: The character to put around the category value in CSV mode. Default is quotes (").
de: Zeichen, mit dem Kategorie-Werte im CSV- Modus umschlossen werden. Standard sind Anführungszeichen (").
fr: Le caractère à mettre autour de la valeur de la catégorie dans le mode CSV. Des guillemets (") constituent le défaut.

source: The string used to separate fields in CSV mode. Default is a comma.
de: Zeichenfolge zur Aufteilung von Feldern im CSV-Modus. Standard ist ein Komma.
fr: La chaîne utilisée pour séparer les champs en mode CSV. Par défaut une virgule.

source: Backup the metadata stored in the database into individual OPF files in each books directory. This normally happens automatically, but you can run this command to force re-generation of the OPF files, with the --all option.
de: Metadaten aus der Datenbank werden in einzelne OPF Dateien im jeweiligen Verzeichnis eines Buches gesichert. Dies geschieht normalerweise automatisch, kann jedoch auch manuell für die erneute Generierung der OPF-Dateien mit der Option --all angestoßen werden.
fr: Sauvegarde les métadonnées stockées dans la base de données dans les fichiers OPF individuels dans chaque répertoire de livres. Ceci se déroule normalement automatiquement, mais vous pouvez lancer cette commande pour forcer la régénération des fichiers OPF, avec l'option --all.

source: Note that there is normally no need to do this, as the OPF files are backed up automatically, every time metadata is changed.
de: Beachten Sie, dass normalerweise keine Notwendigkeit besteht, dies zu tun, da die OPF-Dateien bei jeder Änderung der Metadaten automatisch gesichert werden.
fr: Notez qu'il y a normalement aucun besoin de faire ceci, car les fichiers OPF sont mis à jour automatiquement, chaque fois que les métadonnées sont changées.

source: Normally, this command only operates on books that have out of date OPF files. This option makes it operate on all books.
de: Normalerweise beachtet dieser Befehl nur Bücher, deren OPF Dateien nicht mehr aktuell sind. Diese Option führt den Befehl für alle Bücher aus.
fr: Normalement, cette commande opère seulement sur les livres qui ont des fichiers OPF périmés. Cette option la fait opérer sur tous les livres.

source: Create a :command:`clone` of the current library. This creates a new, empty library that has all the same custom columns, virtual libraries and other settings as the current library.
de: Erstellt einen :command:`clone` der aktuellen Bibliothek. Dieser Befehl erstellt eine neue leere Bibliothek, mit denselben benutzerdefinierten Spalten, virtuellen Bibliotheken und anderen Einstellungen der aktuellen Bibliothek.
fr: Crée un :command:`clone` de la bibliothèque active. Ceci crée une bibliothèque nouvelle, vide qui contient toutes les mêmes colonnes personnalisées, bibliothèques virtuelles et autres paramètres que votre bibliothèque actuelle.

source: The cloned library will contain no books. If you want to create a full duplicate, including all books, then simply use your filesystem tools to copy the library folder.
de: Die geklonte Bibliothek wird keine Bücher beinhalten. Wenn Sie ein vollständiges Duplikat, einschließlich aller Bücher erstellen möchten, dann verwenden Sie einfach Ihre Dateisystem-Werkzeuge, und kopieren den Bibliotheksordner.
fr: Cette bibliothèque clonée ne contiendra aucun livre. Si vous voulez avoir une copie complète, incluant tous les livres, utiliser alors simplement vos outils du système de fichiers pour copier le répertoire de la bibliothèque.

source: Only update metadata in files of the specified format. Specify it multiple times for multiple formats. By default, all formats are updated.
de: Aktualisiert nur Metadaten in Dateien des angegebenen Formats. Wählen Sie die gewünschten Formate durch anklicken aus. Standardmäßig werden alle Formate aktualisiert.
fr: Met uniquement à jour les métadonnées dans les fichiers au format spécifié. Spécifier le plusieurs fois pour de multiples formats. Par défaut, tous les formats sont mis à jour.

source: Command Line Interface
de: Kommandozeilen Interface
fr: Interface en ligne de commande

source: On OS X you have to go to Preferences->Advanced->Miscellaneous and click install command line tools to make the command line tools available. On other platforms, just start a terminal and type the command.
de: Unter OS X müssen Sie auf Einstellungen -> Erweitert -> Verschiedenes aufrufen und dann auf Kommandozeilen-Tools installieren klicken, damit die Kommandozeilen-Tools zur Verfügung stellen. Auf anderen Plattformen starten Sie einfach die Eingabeaufforderung bzw. das Terminal und geben dann einen Befehl zur Ausführung ein.
fr: Sur OS X vous devez aller à Préférences->Avancés->Divers et cliquer sur installer les outils de ligne de commande pour rendre les outils de ligne de commande disponibles. Sur d'autres plateformes, juste démarrer un terminal et taper la commande

source: Documented Commands
de: Dokumentierte Befehle
fr: Commandes documentées

source: Undocumented Commands
de: Undokumentierte Befehle
fr: Commandes non documentées

source: You can see usage for undocumented commands by executing them without arguments in a terminal.
de: Sie können die Verwendung von undokumentierten Befehlen durch Ausführung des Befehls ohne Angabe Argumente in einem Terminal sehen.
fr: Vous pouvez voir l'utilisation des commandes non documentées en les exécutants sans arguments dans un terminal

source: Convert an ebook from one format to another.
de: Konvertiert ein Ebook von einem Format in ein anderes.
fr: Convertir un e-livre d'un format à un autre.

source: input_file is the input and output_file is the output. Both must be specified as the first two arguments to the command.
de: input_file ist die Quell- und output_file die Ziel-Datei. Beide müssen dem Befehl als die ersten beiden Argumente übergeben werden.
fr: input_file est l'entrée et output_file est la sortie. Les deux doivent être spécifiés comme les deux premiers arguments de la commande.

source: The output ebook format is guessed from the file extension of output_file. output_file can also be of the special format .EXT where EXT is the output file extension. In this case, the name of the output file is derived from the name of the input file. Note that the filenames must not start with a hyphen. Finally, if output_file has no extension, then it is treated as a directory and an "open ebook" (OEB) consisting of HTML files is written to that directory. These files are the files that would normally have been passed to the output plugin.
de: Das Ausgabeformat wird durch die Dateiendung von output_file bestimmt. output_file kann auch das Spezialformat .EXT haben, wobei EXT die gewünschte Dateiendung ist. In diesem Fall wird der Name der Ausgabedatei aus dem Namen der Eingabedatei abgeleitet. Bitte beachten: die Dateinamen dürfen nicht mit einem Bindestrich beginnen. Zu guter Letzt, falls output_file keine Dateiendung hat, wird der Name als Verzeichnis behandelt, und ein "open ebook" (OEB), das aus HTML-Dateien besteht, wird in dieses Verzeichnis geschrieben. Diese Dateien sind die, die normalerweise an das Ausgabe-Plugin übergeben werden.
fr: Le format d'e-livre de sortie est défini par l'extension du fichier output_file. output_file peut également être un format spécial .EXT où EXT est l'extension du fichier de sortie. Dans ce cas, le nom du fichier de sortie est dérivé du nom du fichier d'entrée. Notez que les noms de fichier ne doivent pas commencer par un trait d'union. Pour finir, si output_file n'a pas d'extension, il est traité comme un répertoire et un «open ebook » (OEB) se composant des fichiers HTML est écrit dans ce répertoire. Ces fichiers sont les fichiers qui auraient été normalement traité par l'extension de sortie.

source: After specifying the input and output file you can customize the conversion by specifying various options. The available options depend on the input and output file types. To get help on them specify the input and output file and then use the -h option.
de: Nach Angabe der Ein- und Ausgabe-Datei können Sie die Konvertierung anpassen, indem verschiedene Optionen angeben werden. Die verfügbaren Optionen hängen von den Dateitypen für die Ein- und Ausgabe ab. Um für diese eine Hilfe zu erhalten, geben sie nach Angabe der Ein- und Ausgabedatei die Option –h an.
fr: Après avoir spécifié le fichier d'entrée et de sortie vous pouvez adapter la conversion en spécifiant diverses options. Les options disponibles dépendent des types de fichier d'entrée et de sortie. Pour obtenir de l'aide sur celles-ci, spécifiez le fichier d'entrée et de sortie et puis employez l'option -h
