Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: The version of the title to be used for sorting. If unspecified, and the title is specified, it will be auto-generated from the title.
de: Version des Titels, die für die Sortierung verwendet wird. Falls nichts angegeben, aber ein Titel angegeben ist, wird diese Version automatisch aus dem Titel erstellt.
fr: La version du titre utilisé pour le tri. Si non spécifiée, et que le titre est spécifié, il sera généré automatiquement à partir du titre.

source: Specify the name of an OPF file. The metadata will be written to the OPF file.
de: Geben Sie den Namen der OPF Datei an. Die Metadaten werden in die OPF Datei geschrieben.
fr: Spécifier le nom du fichier OPF. Les métadonnées seront écrites dans le fichier OPF.

source: Polishing tries to minimize the changes to the internal code of your ebook. Unlike conversion, it does not flatten CSS, rename files, change font sizes, adjust margins, etc. Every action performs only the minimum set of changes needed for the desired effect.
de: Perfektionieren verändert den Code im Buch nur minimal. Im Gegensatz zur Konvertierung findet hierbei keine generelle Änderung der CSS Struktur, an Schriftgröße oder Ränder, am Code oder Dateiumbenennungen usw. statt. Jede Aktion führt nur ein Mindestmaß an Korrekturen für den gewünschten Effekt aus.
fr: Le polissage tente de minimiser les modifications apportées au code interne de votre livre numérique. Contrairement à la conversion, il n’aplatit pas les CSS, ne renomme pas les fichiers, ne change pas les tailles de police, n'ajuste pas les marges, etc... Chaque action exécute seulement le minimum de modifications nécessaires pour obtenir l'effet désiré.

source: You should use this tool as the last step in your ebook creation process.
de: Dieses Tool wird als letzter Schritt in der Erstellung des Buches eingesetzt.
fr: Vous devriez utiliser cet outil comme dernière étape dans votre processus de création d'e-livre.

source: Note that polishing only works on files in the AZW3 or EPUB formats.
de: Bücher perfektionieren funktioniert nur bei Büchern mit den Formaten AZW3 oder EPUB.
fr: Notez que le polissage fonctionne uniquement avec les fichiers aux formats AZW3 et EPUB.

source: Whenever you pass arguments to :command:`ebook-polish` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`ebook-polish` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`ebook-polish` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Path to a cover image. Changes the cover specified in the ebook. If no cover is present, or the cover is not properly identified, inserts a new cover.
de: Pfad zu einem Coverbild. Ändert das im eBook festgelegte Titelbild. Wenn kein Coverbild vorhanden ist, oder dieses nicht vollständig identifiziert ist, fügt es ein neues Coverbild ein.
fr: Chemin vers une image de couverture. Change la couverture spécifiée dans le livre. Si aucune couverture n'est présente ou si la couverture n'est pas identifiée correctement, insère une nouvelle couverture.

source: Embed all fonts that are referenced in the document and are not already embedded. This will scan your computer for the fonts, and if they are found, they will be embedded into the document. Please ensure that you have the proper license for embedding the fonts used in this document.
de: Alle Schriftarten einbetten, die im Dokument referenziert, aber bisher noch nicht eingebunden sind. Hierbei werden Schriften auf Ihrem System gesucht und im Dokument eingebettet, wenn sie gefunden werden. Bitte stellen Sie sicher, dass Sie über die richtige Lizenz für die Einbettung dieser Schriftarten verfügen.
fr: Incorporer toutes les polices qui sont référencées dans le document et non encore intégrées. Une recherche sera effectuée sur votre ordinateur et si les polices sont retrouvées, elles seront intégrées dans le document. Veuillez vous assurer que vous possédez la licence appropriée pour incorporer les polices utilisées dans ce document.

source: Insert a "book jacket" page at the start of the book that contains all the book metadata such as title, tags, authors, series, comments, etc. Any previous book jacket will be replaced.
de: Fügt einen "Buchumschlag" als erste Seite des Buches ein, welche alle Metadaten des Buches wie Titel, Tags, Authoren, Reihe, Kommentare, etc. beinhaltet. Jede ältere Buchumschlag wird ersetzt.
fr: Insérer une page "jaquette" au début du livre, sur laquelle on peut lire les éléments de métadonnées tels que le titre, les étiquettes, les auteurs, les séries, les commentaires, etc... Toute jaquette du livre préexistante sera remplacée.

source: Path to an OPF file. The metadata in the book is updated from the OPF file.
de: Pfad zu einer OPF Datei. Die Metadaten in dem Buch werden aus der OPF Datei aktualisiert.
fr: Chemin vers un fichier OPF. Les métadonnées du livre sont mises à jour à partir du ficher OPF.

source: Remove a previous inserted book jacket page.
de: Entfernen einer zuvor erstellten Buchumschlag-Seite
fr: Supprimer une jaquette de livre insérée précédemment

source: Remove all unused CSS rules from stylesheets and <style> tags. Some books created from production templates can have a large number of extra CSS rules that dont match any actual content. These extra rules can slow down readers that need to parse them all.
de: Entferne alle nicht verwendeten CSS-Regeln aus Stylesheets und <style> tags. Manche aus Vorlagen erstellte Bücher verwenden eine Menge CSS-Regeln, die nirgends im Buch gebraucht werden. Die zusetzlichen Einträge können Reader, die alle Regeln analysieren müssen, verlangsamen.
fr: Supprimer toutes les règles CSS inutilisées des feuilles de style et des balises <style> . Certains livres créés à partir de modèles de production peuvent comporter un grand nombre de règles CSS supplémentaires qui ne correspondent à aucun contenu présent. Ces règles supplémentaires peuvent ralentir certains lecteurs qui ont besoin de toutes les analyser.

source: Convert plain text dashes, ellipsis, quotes, multiple hyphens, etc. into their typographically correct equivalents. Note that the algorithm can sometimes generate incorrect results, especially when single quotes at the start of contractions are involved.
de: Umwandeln von unformatiertem Text mit Bindestrichen, Auslassungszeichen, Anführungszeichen, mehreren Bindestrichen usw. in deren typografisch richtiges Equivalent. Beachten Sie, dass der Algorithmus manchmal unzutreffende Ergebnisse erzeugt, besonders wenn einzelne Anführungszeichen zu Beginn einer Zusammenziehung stehen.
fr: Convertir les tirets de texte brut, ellipses, guillemets, multiples traits d'union, etc... dans leur équivalents typographiques corrects. Notez que l'algorithme peut parfois générer des résultats erronés, particulièrement quand les apostrophes au début des contractions sont impliquées.

source: Subsetting fonts means reducing an embedded font to contain only the characters used from that font in the book. This greatly reduces the size of the font files (halving the font file sizes is common). For example, if the book uses a specific font for headers, then subsetting will reduce that font to contain only the characters present in the actual headers in the book. Or if the book embeds the bold and italic versions of a font, but bold and italic text is relatively rare, or absent altogether, then the bold and italic fonts can either be reduced to only a few characters or completely removed. The only downside to subsetting fonts is that if, at a later date you decide to add more text to your books, the newly added text might not be covered by the subset font.
de: Eine "Schrift reduzieren" bedeutet, eine eingebettete Schrift auf die Buchstaben zu reduzieren, welche im Buch tatsächlich verwendet werden. Diese Option vermindert die Größe der Schriftdatei enorm (die Dateigröße zu halbieren ist fast immer möglich). Wenn ein Buch zum Beispiel eine spezielle Schrift für Überschriften benutzt, wird "Schrift reduzieren" nur die Buchstaben in die eingebettete Schrift übernehmen, die tatsächlich in den Überschriften verwendet werden. Genau so wird, wenn die Schrift auch kursive oder fette Buchstaben enthält, diese aber selten oder gar nicht verwendet werden, diese Schrift auf die wirklich benutzten Zeichen reduziert oder sogar komplett entfernt werden. Der einzige Nachteil von "Schrift reduzieren" ist, dass ein nachträglich hinzugefügter Text möglicherweise nicht ganz durch die reduzierte Schrift abgedeckt wird.
fr: Créer un sous-ensemble de polices signifie réduire une police embarquée pour contenir uniquement les caractères utilisés de cette police dans le livre. Cela réduit considérablement la taille des fichiers de police (une réduction de moitié de la taille du fichier de police est fréquent). Par exemple, si le livre utilise une police spécifique pour les en-têtes, alors créer un sous-ensemble réduira la police pour ne contenir que les caractères réellement présents dans les en-têtes du livre. Ou si le livre intègre les versions en gras et italique d'une police, mais que le texte en italique ou en gras est relativement rare, voire inexistant, alors les caractères gras et en italiques peuvent être soit réduits à seulement quelques caractères, voire complètement retirés. Le seul inconvénient des sous-ensembles de polices, c'est que si, à une date ultérieure, vous décidez d'ajouter du texte à vos livres, le texte nouvellement ajouté pourrait ne pas être pris en compte par la police réduite.

source: Produce more verbose output, useful for debugging.
de: Produziere eine umfangreichere Ausgabe, nützlich fürs Debuggen.
fr: Générer une sortie plus détaillée (utile pour le débogage)

source: View an ebook.
de: Ein eBook ansehen.
fr: Voir un e-livre

source: Whenever you pass arguments to :command:`ebook-viewer` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`ebook-viewer` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`ebook-viewer` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Print javascript alert and console messages to the console
de: Javascript Warnungen und Konsolennachrichten auf der Konsole ausgeben
fr: Afficher les alertes javascript et les messages console dans la console

source: If specified, viewer window will try to open full screen when started.
de: Falls ausgewählt, wird das Betrachterfenster nach Möglichkeit im Vollbildmodus geöffnet.
fr: Si précisé, la fenêtre de la visionneuse essaiera, au démarrage, de s’ouvrir en plein écran.

source: The position at which to open the specified book. The position is a location as displayed in the top left corner of the viewer.
de: Bildschirmposition, an der das Buch geöffnet werden soll. Die Stelle wird oben links im Betrachter angezeigt.
fr: La position à laquelle ouvrir le livre indiqué. Cette position est un endroit tel que celui est affiché dans le coin supérieur gauche de la visionneuse.

source: If specified, viewer window will try to come to the front when started.
de: Falls ausgewählt, wird das Betrachterfenster nach Möglichkeit im Vordergrund geöffnet.
fr: Si spécifié, la fenêtre de la visionneuse essaiera, au lancement, d’apparaître au premier plan.

source: Fetch book metadata from online sources. You must specify at least one of title, authors or ISBN.
de: Abruf von Buchmetadaten aus Online-Quellen. Se müssen mindestens einen Titel, Autor oder eine ISBN angeben.
fr: Récupérer des métadonnées de livre depuis des sources en ligne. Vous devez spécifier au moins le titre, les auteurs ou l'ISBN.

source: Whenever you pass arguments to :command:`fetch-ebook-metadata` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`fetch-ebook-metadata` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`fetch-ebook-metadata` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Book author(s)
de: Buchautor(en)
fr: Auteur(s) du livre

source: Specify a filename. The cover, if available, will be saved to it. Without this option, no cover will be downloaded.
de: Geben Sie einen Dateinamen an. Das Cover wird, wenn verfügbar, darin gespeichert werden. Ohne diese Option wird kein Cover heruntergeladen.
fr: Spécifier un nom de fichier. La couverture, si disponible, y sera sauvée. Sans cette option, aucune couverture ne sera téléchargée.

source: Book ISBN
de: Buch ISBN
fr: ISBN du livre

source: Output the metadata in OPF format instead of human readable text.
de: Ausgabe der Metadaten im OPF-Format statt lesbaren Klartext.
fr: Produit les métadonnées dans le format d'OPF au lieu d'un texte lisible pour l'homme.

source: Timeout in seconds. Default is 30
de: Timeout in Sekunden. Die Voreinstellung ist 30
fr: Délai d'attente en secondes. Par défaut est à 30

source: Book title
de: Buchtitel
fr: Titre du livre

source: Print the log to the console (stderr)
de: Druckt das Protokoll in der Konsole aus (stderr)
fr: Imprimee le journal vers la console (stderr)

source: Convert an LRF file into an LRS (XML UTF-8 encoded) file
de: Eine LRF-Datei in eine LRS (XML UTF-8 kodierte) Datei konvertieren
fr: Convertit un fichier LRF en un fichier LRS (encodage XML UTF-8)

source: Whenever you pass arguments to :command:`lrf2lrs` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`lrf2lrs` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`lrf2lrs` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Do not save embedded image and font files to disk
de: Eingebettete Bilder und Schriftdateien nicht auf Festplatte speichern
fr: Ne pas enregistrer les images incorporées et les fichiers de polices sur l'ordinateur

source: Output LRS file
de: Ausgabe LRS-Datei
fr: Fichier sortie LRS

source: Read the LRF ebook book.lrf
de: Öffnet das LRF-eBook book.lrf
fr: Lit l'e-livre LRF livre.lrf

source: Whenever you pass arguments to :command:`lrfviewer` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`lrfviewer` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`lrfviewer` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Disable hyphenation. Should significantly speed up rendering.
de: Deaktiviert die Silbentrennung. Die Darstellung sollte deutlich beschleunigt werden.
fr: Désactive l'utilisation du trait d'union. Devrait accélérer le rendu de manière significative.

source: Profile the LRF renderer
de: Einstellung der LRF Darstellung
fr: Profile le rendu LRF

source: Print more information about the rendering process
de: Detailliertere Informationen über den Renderingprozess ausgeben
fr: Imprime plus d'information à propos du processus de rendu

source: Turn on visual aids to debugging the rendering engine
de: Aktivierung visueller Hilfsmittel für das Debuggen des Darstellungsmodules.
fr: Active les aides visuelles pour corriger le moteur de rendu

source: By default the background is off white as I find this easier on the eyes. Use this option to make the background pure white.
de: Standardmäßig ist der Hintergrund naturweiß, weil ich dies angenehmer für die Augen finde. Verwenden Sie diese Option, um den Hintergrund auf reinweiß einzustellen.
fr: Par défaut le fond est blanc cassé que je truve plus facile pour les yeux. Employez cette option pour faire un fond blanc pur.

source: Compile an LRS file into an LRF file.
de: Eine LRF Datei aus einer LRS-Datei erstellen.
fr: Compile un fichier LRS en un fichier LRF.

source: Whenever you pass arguments to :command:`lrs2lrf` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`lrs2lrf` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`lrs2lrf` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Convert LRS to LRS, useful for debugging.
de: Konvertierung von LRS zu LRS, hilfreich bei der Fehlerdiagnose.
fr: Convertir LRS en LRS, utile pour déboguer.

source: Path to output file
de: Pfad zur Zieldatei
fr: Chemin vers le fichier en sortie

source: Verbose processing
de: Ausführliche Verarbeitung
fr: Analyse avec explications

source: Where URL is for example http://google.com
de: Dabei ist die URL z. B. http://google.com
fr: %prog URL Où l'URL est par exemple http://google.com

source: Whenever you pass arguments to :command:`web2disk` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`web2disk` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`web2disk` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Base directory into which URL is saved. Default is .
de: Grundverzeichnis, in das die URL gespeichert wird. Voreinstellung ist ein Punkt: .
fr: Répertoire de base dans lequel l’URL est sauvegardée. L'option par défaut est .

source: Minimum interval in seconds between consecutive fetches. Default is 0 s
de: Kleinstes Intervall in Sekunden zwischen aufeinander folgenden Abrufen. Voreinstellung ist 0 s
fr: Intervalle minimal entre deux téléchargements, en secondes. L'option par défaut est 0 s

source: Do not download CSS stylesheets.
de: CSS-Stylesheets nicht herunterladen.
fr: Ne pas télécharger les feuilles de style CSS.

source: The character encoding for the websites you are trying to download. The default is to try and guess the encoding.
de: Zeichenkodierung für Webseiten, die zu laden versucht werden. In der Voreinstellung wird versucht, die Kodierung zu erraten.
fr: Encodage des caractères pour les sites web que vous essayer de télécharger. Par défaut, essaie de trouver l’encodage.

source: Any link that matches this regular expression will be ignored. This option can be specified multiple times, in which case as long as any regexp matches a link, it will be ignored. By default, no links are ignored. If both filter regexp and match regexp are specified, then filter regexp is applied first.
de: Jeder Link, der durch diesen regulären Ausdruck beschrieben wird, wird ignoriert. Diese Option kann mehrfach angegeben werden, dann wird jeder Link, der durch irgendeinen der regulären Ausdrücke beschrieben wird, ignoriert. Standardmäßig wird kein Link ignoriert. Werden sowohl Filter- als auch Suchausdrücke verwendet, werden die Filterausdrücke zuerst angewendet.
fr: N’importe quel lien correspondant à cette expression régulière sera ignoré. Cette option peut-être activée plusieurs fois, auquel cas n’importe quel lien sera ignoré aussi longtemps qu’il correspond à une expression régulière. Par défaut, aucun lien n’est ignoré. Si l’expression régulière filtre et correspondance sont spécifiées, alors l’expression régulière filtre est appliquée en premier.

source: Only links that match this regular expression will be followed. This option can be specified multiple times, in which case as long as a link matches any one regexp, it will be followed. By default all links are followed.
de: Nur Links, die diesem regulären Ausdruck entsprechen, werden verfolgt. Diese Option kann mehrmals angegeben werden, somit werden Links verfolgt, solange sie einem regulären Ausdruck entsprechen. In der Voreinstellung werden alle Links verfolgt.
fr: Seuls les liens correspondant à cette expression rationnelle seront suivis. Cette option peut être spécifiée plusieurs fois auquel cas tout lien qui correspondra à cette expression sera suivi. Par défaut, tous les liens sont suivis.

source: The maximum number of files to download. This only applies to files from <a href> tags. Default is 9223372036854775807
de: Höchstzahl der Dateien, die geladen werden. Dies trifft nur auf Dateien aus <a href> Tags zu. Voreinstellung ist 9223372036854775807
fr: Nombre maximum de fichiers à télécharger. Ceci ne sera valable que pour les fichiers à partir des balises <a href>. L'option par défaut est 9223372036854775807

source: Maximum number of levels to recurse i.e. depth of links to follow. Default 1
de: Maximale Zahl von einbezogenen Ebenen, z.B. Tiefe der Links, die verfolgt werden. Voreinstellung: 1
fr: Nombre maximum de niveaux de récursivité c-à-d le niveau de profondeur des liens à suivre. Option par défaut 1

source: Timeout in seconds to wait for a response from the server. Default: 10.0 s
de: Timeout in Sekunden beim Warten auf eine Antwort vom Server. Voreinstellung: 10.0 s
fr: Délai d’attente en secondes d'une réponse du serveur. Option par défaut est 10.0 s

source: [options]
de: [Optionen]

source: Fork and deliver message in background. If you use this option, you should also use :option:`--outbox` to handle delivery failures.
de: Nachrichten im Hintergrund versenden. Falls Sie diese Option verwenden, sollten Sie zur Behandlung von Übermittlungsfehlern auch :option:`--outbox` verwenden.

source: The fields to display when listing books in the database. Should be a comma separated list of fields. Available fields: author_sort,authors,comments,cover,formats,identifiers,isbn,last_modified,pubdate,publisher,rating,series,series_index,size,tags,timestamp,title,uuid Default: title,authors. The special field "all" can be used to select all fields.
de: Anzuzeigende Felder bei der Auflistung von Büchern in der Datenbank. Sollte eine durch Kommata getrennte Liste von Feldern sein. Verfügbare Felder: author_sort, authors, comments, cover, formats, identifiers, isbn, last_modified, pubdate, publisher, rating, series, series_index, size,tags, timestamp, title, uuid. Voreinstellung: title,authors. Das besondere Feld "all" wählt alle Felder aus.

source: Generate output in JSON format, which is more suitable for machine parsing. Causes the line width and separator options to be ignored.
de: Generiert die Ausgabe im JSON-Format, welches maschinell besser zu analysieren ist. Bewirkt, dass die Einstellungen für line width und separator options ignoriert werden.

source: Update the metadata in the actual book files stored in the calibre library from the metadata in the calibre database. Normally, metadata is updated only when exporting files from calibre, this command is useful if you want the files to be updated in place. Note that different file formats support different amounts of metadata. You can use the special value 'all' for book_id to update metadata in all books. You can also specify many book ids separated by spaces and id ranges separated by hyphens. For example: calibredb :command:`embed_metadata` 1 2 10-15 23
de: Aktualisiert die Metadaten aktueller Buchdateien der Calibre Bibliothek aus den Metadaten der Calibre Datenbank. Die Metadaten werden normalerweise nur aktualisiert, wenn Dateien aus Calibre exportiert werden, dieser Befehl ist hilfreich, wenn die Dateien an Ort und Stelle aktualisiert werden sollen. Beachte, dass unterschiedliche Formate unterschiedliche Metadaten unterstützen. Sie können den besonderen Wert 'all' für book_id benutzen, um die Metadaten aller Bücher zu aktualisieren. Ebenfalls können Bücher durch hintereinander folgende Buch-ID's getrennt mit Leerzeichen und ID-Bereiche getrennt durch Bindestrich definieren. Beispiel: calibredb :command:`embed_metadata` 1 2 10-15 23
