Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: Options to use an SMTP relay server to send mail. calibre will try to send the email directly unless --relay is specified.
de: Optionen für die Verwendung eines SMTP-Servers zum Versenden von E-Mails. Solange über --relay kein SMTP-Server angegeben ist, wird Calibre versuchen, eine E-Mail direkt zu versenden.
fr: Options pour utiliser un serveur de relais SMTP pour envoyer un courriel. calibre essayera d'envoyer un courriel directement à moins que --un relais est spécifié.

source: Encryption method to use when connecting to relay. Choices are TLS, SSL and NONE. Default is TLS. WARNING: Choosing NONE is highly insecure
de: Verwendete Verschlüsselungsmethode beim Herstellen der Verbindung mit dem SMTP-Server. Auswahlmöglichkeiten sind TLS, SSL und NONE. Standardwert ist TLS. Warnung: Die Auswahl NONE ist sehr unsicher.
fr: Méthode de cryptage à utiliser lors de la connection à un relais. Les choix sont TLS, SSL et AUCUN. L'option par défaut est TLS. ATTENTION : choisir AUCUN est très risqué

source: Password for relay
de: Passwort für den Mail-Server
fr: Mot de passe pour le relais

source: Port to connect to on relay server. Default is to use 465 if encryption method is SSL and 25 otherwise.
de: Der Anschluss zum SMTP-Server, der auf die Verbindungen wartet. Standardmäßig wird bei SSL-Verschlüsslung Port 465 und andernfalls 25 verwendet.
fr: Port pour se connecter à un serveur relais. L'option par défaut est d'utiliser le 465 si la méthode de cryptage est le SSL et 25 autrement.

source: An SMTP relay server to use to send mail.
de: Der SMTP-Server-Name zum Versenden einer E-Mail Nachricht.
fr: Un serveur de relais SMTP à utiliser pour envoyer un courriel.

source: Username for relay
de: Benutzername auf dem Mail-Server
fr: Nom d'utilisateur pour le relais

source: :command:`calibredb` is the command line interface to the |app| database. It has several sub-commands, documented below:
de: :command:`calibredb` ist das Kommandozeilen-Interface zur |app| Datenbank. Es verfügt über mehrere nachfolgend dokumentierte Sub-Befehle:
fr: :command:`calibredb` est l'interface en ligne de commande pour la base de données |app|. Il y a plusieurs sous commandes, documentées ci-dessous :

source: Global options
de: Globale Optionen
fr: Options globales

source: Do not notify the running calibre GUI (if any) that the database has changed. Use with care, as it can lead to database corruption!
de: Datenbankänderungen nicht an die Calibre-Oberfläche (wenn vorhanden) melden. Mit Vorsicht benutzen, da es zu korrupten Datenbanken kommen kann!
fr: Désactive la notification dans l'interface utilisateur (si active) concernant une modification de la base de données. À utiliser avec précaution car cela peut provoquer une corruption de la base !

source: Path to the calibre library. Default is to use the path stored in the settings.
de: Pfad zur Calibre-Bibliothek. Die Voreinstellung ist der in den Einstellungen gespeicherte Pfad.
fr: Répertoire de la bibliothèque calibre. Par défaut : celui indiqué dans les paramètres.

source: List the books available in the calibre database.
de: Listet die verfügbaren Bücher in der Calibre Datenbank auf.
fr: Liste les livres disponibles dans la base de données calibre.

source: Whenever you pass arguments to calibredb that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an den :command:`calibredb` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à calibredb qui comportent des espaces, mettez ces arguments entre guillemets.

source: Sort results in ascending order
de: Ergebnisse in aufsteigender Reihenfolge sortieren
fr: Trier les résultats dans l’ordre ascendant

source: The fields to display when listing books in the database. Should be a comma separated list of fields. Available fields: author_sort,authors,comments,cover,formats,identifiers,isbn,last_modified,pubdate,publisher,rating,series,series_index,size,tags,timestamp,title,uuid Default: title,authors. The special field "all" can be used to select all fields. Only has effect in the text output format.
fr: Les champs à afficher quand les livres sont listés dans la base de données. Doit être une liste de champs séparés par des virgules. Champs disponibles : author_sort, authors, comments, cover, formats, identifiers, isbn, last_modified, pubdate, publisher, rating, series, series_index, size, tags, timestamp, title, uuid Par défaut : title, authors. Le champ spécial "all" peut être utilisé pour sélectionner tous les champs. Ceci n’affecte que le format du texte en sortie.

source: Generate output that is more suitable for machine parsing. Book entries are separates using the ASCII Record Separator character (30), individual fields in an entry using the Group Separator (29) and individual filenames using the File Separator (28)
fr: Génère une sortie qui est plus appropriée pour l'analyse machine. Les entrées livres sont séparées en utilisant un caractère Séparateur d’Enregistrement ASCII (30), les champs individuels dans une entrée en utilisant le Séparateur de Groupe (29) et les noms de fichiers individuels en utilisant le Séparateur de Fichier (28)

source: The maximum number of results to display. Default: all
de: Die maximale Anzahl anzuzeigender Ergebnisse. Standard: Alle
fr: Le maximum de résultats à afficher. Par défaut: tous

source: The maximum width of a single line in the output. Defaults to detecting screen size.
de: Maximale Breite einer einzelnen Zeile in der Ausgabe. In der Voreinstellung wird die Bildschirmgröße erkannt.
fr: Largeur maximum pour une seule ligne en sortie. Par défaut détecte la taille de l’écran.

source: The prefix for all file paths. Default is the absolute path to the library folder.
de: Der Vorsatzcode zu allen Dateipfaden. Die Voreinstellung ist der absolute Pfad zum Bibliotheksverzeichnis.
fr: Préfixe de tous les répertoires. Par défaut : chemin absolu du dossier de la bibliothèque.

source: Filter the results by the search query. For the format of the search query, please see the search related documentation in the User Manual. Default is to do no filtering.
de: Die Ergebnisse durch die Suchanfrage filtern. Für das Format der Suchanfrage sehen Sie sich bitte die Dokumentation, die die Suche betrifft, im Benutzerhandbuch an. Voreinstellung ist, keine Filterung durchzuführen.
fr: Filtrer les résultats à l’aide de la requête de recherche. Pour le format de la requête de recherche, veuillez consulter la section recherche dans le manuel utilisateur. Par défaut n’effectue aucun filtrage

source: The string used to separate fields. Default is a space.
de: Zeichenfolge zur Unterscheidung der Felder. Die Voreinstellung ist ein Leerzeichen.
fr: La chaîne utilisée pour séparer des champs. Par défaut : un espace

source: The field by which to sort the results. Available fields: publisher,series_index,formats,isbn,uuid,pubdate,rating,series,timestamp,author_sort,cover,comments,identifiers,last_modified,authors,title,tags,size Default: None
de: Das Feld, welches zur Sortierung der Ergebnisse herangezogen wird. Verfügbare Felder: publisher, series_index, formats, isbn, uuid, pubdate, rating, series, timestamp, author_sort, cover, comments, identifiers, last_modified, authors, title, tags, size. Voreinstellung: None
fr: Le champ par lequel trier les résultats. Champs disponibles : publisher, series_index, formats, isbn, uuid, pubdate, rating, series, timestamp, author_sort, cover, comments, identifiers, last_modified, authors, title, tags, size Par défaut : aucun

source: Add the specified files as books to the database. You can also specify directories, see the directory related options below.
de: Fügt die angegebenen Dateien als Bücher zur Datenbank hinzu. Sie können auch Verzeichnisse angeben, vergleichen Sie dazu die auf Verzeichnisse bezogenen Optionen unten.
fr: Ajoute les fichiers spécifiés comme livres dans la base de données. Vous pouvez aussi spécifier des répertoires, voir les les options relatives aux répertoires ci-dessous.

source: Set the authors of the added book(s)
de: Autor der hinzugefügten Bücher festlegen
fr: Définissez les auteurs du(es) livre(s) ajouté(s)

source: Path to the cover to use for the added book
de: Pfad zum Coverbild des hinzugefügten Buches
fr: Chemin à utiliser pour la couverture du livre ajouté

source: Add books to database even if they already exist. Comparison is done based on book titles.
de: Bücher zur Datenbank hinzufügen, auch wenn diese schon vorhanden sind. Der Abgleich erfolgt aufgrund des Titels der Bücher.
fr: Ajouter les livres dans la base de données même s’ils existent déjà. La comparaison est basée sur les titres des livres numériques.

source: Add an empty book (a book with no formats)
de: Ein leeres Buch hinzufügen (ein Buch ohne Formate)
fr: Ajouter un livre vide (un livre sans format)

source: Set the ISBN of the added book(s)
de: ISBN der hinzugefügten Bücher festlegen
fr: Définir l'ISBN du(es) livre(s) ajouté(s)

source: A comma separated list of languages (best to use ISO639 language codes, though some language names may also be recognized)
de: Eine durch Kommas getrennte Liste der Sprachen (obwohl einige Sprachen auch am Namen erkannt werden, verwendet man besser die Sprachcodes der ISO639)
fr: Une liste de langages séparés par une virgule (mieux d'utiliser les codes de langue IS0639, ainsi certains noms de langues peuvent aussi être reconnus)

source: Assume that each directory has only a single logical book and that all files in it are different e-book formats of that book
de: Vorausgesetzt jedes Verzeichnis beinhaltet nur ein einziges logisches Buch und alle Dateien in diesem Verzeichnis sind verschiedene eBook-Formate dieses einzelnen Buches
fr: Supposer que chaque répertoire dispose d’un livre logique et que tous les fichiers dans celui-ci sont des formats différents de ce même livre.

source: Process directories recursively
de: Verzeichnisse rekursiv verarbeiten
fr: Traite les répertoires récursivement

source: Set the series of the added book(s)
de: Serien der der hinzugefügten Bücher festlegen
fr: Définir les séries du(es) livre(s) ajouté(s)

source: Set the series number of the added book(s)
de: Serien Nummer der hinzugefügten Bücher festlegen
fr: Assigne le numéro de la série de(s) livre(s) ajoutés

source: Set the tags of the added book(s)
de: Tags der hinzugefügten Bücher festlegen
fr: Définir les étiquettes du(es) livre(s) ajouté(s)

source: Set the title of the added book(s)
de: Titel der hinzugefügten Bücher festlegen
fr: Définir le titre du(es) livre(s) ajouté(s)

source: Remove the books identified by ids from the database. ids should be a comma separated list of id numbers (you can get id numbers by using the list command). For example, 23,34,57-85 (when specifying a range, the last number in the range is not included).
de: Entfernt die Bücher anhand von IDs aus der Datenbank. Die IDs in der Liste der ID-Nummern sollten durch ein Komma getrennt werden (Sie können ID-Nummern mit Hilfe des Befehls Liste bekommen). Beispiel: 23,34,57-85 (bei Angabe eines Bereichs, ist die letzte Zahl im Bereich nicht enthalten).
fr: Enlever les livres identifiés par des ids de la base de données. les ids devraient être une liste séparée par une virgule de numéros d'identité (vous pouvez obtenir des numéros d'identité à l'aide de la commande list). Par exemple, 23,34,57-85 (en spécifiant une série, le dernier nombre de la série n'est pas inclus).

source: Add the ebook in ebook_file to the available formats for the logical book identified by id. You can get id by using the list command. If the format already exists, it is replaced, unless the do not replace option is specified.
de: Fügt das eBook in ebook_file zu den verfügbaren Formaten hinzu, wobei das logische Buch durch die ID identifiziert wird. Sie können die ID erhalten, indem Sie den Befehl list ausführen. Wenn das Format bereits existiert, wird es ersetzt, außer es ist die "Nicht ersetzen" Option gewählt.
fr: Ajouter l'e-livre dans ebook_file aux formats disponibles pour le livre logique identifié par l'id. Vous pouvez obtenir l'id à l'aide de la commande list. Si le format existe déjà, il est remplacé, à moins que l'option ne pas remplacer pas soit spécifiée.

source: Do not replace the format if it already exists
de: Ersetzen Sie das Format nicht, falls es schon existiert
fr: Ne pas remplacer le format s'il existe déjà

source: Remove the format fmt from the logical book identified by id. You can get id by using the list command. fmt should be a file extension like LRF or TXT or EPUB. If the logical book does not have fmt available, do nothing.
de: Entfernt das Format fmt des logischen Buches, das durch die ID gekennzeichnet ist. Sie erhalten die ID durch den Befehl list. fmt sollte eine Dateiendung wie LRF oder TXT oder EPUB sein. Falls das logische Buch im entsprechenden Format nicht vorliegt, passiert gar nichts.
fr: Supprimer le format fmt du livre logique identifié par id. Vous pouvez obtenir l’identifiant à l’aide de la commande list. fmt doit être une extension de fichier comme LRF, TXT ou EPUB. Si le fichier logique n’a pas de format fmt disponible, aucune action n’est effectuée.

source: Show the metadata stored in the calibre database for the book identified by id. id is an id number from the list command.
de: Zeigt die in der Calibre Datenbank gespeicherten Metadaten für das durch die ID angegebene Buch. ID ist eine ID Nummer des Befehls list.
fr: Afficher les métadonnées stockées dans la base de données calibre pour le livre identifié par id. id est un identifiant obtenu à l’aide de la commande list.

source: Print metadata in OPF form (XML)
de: Metadaten als OPF (XML) drucken
fr: Imprimer les métadonnées dans un formulaire OPF (XML)

source: Set the metadata stored in the calibre database for the book identified by id from the OPF file metadata.opf. id is an id number from the list command. You can get a quick feel for the OPF format by using the --as-opf switch to the show_metadata command. You can also set the metadata of individual fields with the --field option. If you use the --field option, there is no need to specify an OPF file.
de: Übernimmt die Metadaten für das durch die id identifizierte Buch aus der OPF Datei metadata.opf der Calibre Datenbank. id ist eine id-Nummer vom Befehl list. Sie können eine schnelle Vorstellung vom OPF Format bekommen, wenn Sie die --as-opf Option zu show_metadata command benutzen. Zudem lassen sich die Metadaten einzelner Felder mit der Option --field ändern. Wenn Sie die --field Option nutzen, brauchen Sie keine OPF Datei anzugeben.
fr: Placer les métadonnées stockées dans la base de données de calibre pour le livre identifié par id à partir du fichier OPF metadata.opf. id est un numéro d'identification issu de la liste de commande. Vous pouvez obtenir un aperçu rapide du format OPF à l'aide du commutateur --as-opf de la commande show_metadata. Vous pouvez également placer les métadonnées de champs individuels avec l'option --field. Si vous utilisez l'option --field, il n'est pas nécessaire de spécifier un fichier OPF.

source: The field to set. Format is field_name:value, for example: :option:`--field` tags:tag1,tag2. Use :option:`--list-fields` to get a list of all field names. You can specify this option multiple times to set multiple fields. Note: For languages you must use the ISO639 language codes (e.g. en for English, fr for French and so on). For identifiers, the syntax is :option:`--field` identifiers:isbn:XXXX,doi:YYYYY. For boolean (yes/no) fields use true and false or yes and no.
de: Bereich festlegen. Das Format ist field_name:value, zum Beispiel: :option:`--field` tags:tag1,tag2. Verwenden Sie :option:`--list-fields` um eine Liste mit allen Feldnamen zu erhalten. Sie können diese Funktion mehrfach anwenden, um mehrere Felder festzulegen. Hinweis: Für die Sprache muss der ISO639 Sprachcode (z.B. en für Englisch, de für Deutsch usw.) verwendet werden. Für Kennungen/IDs ist die Syntax :option:`--field` identifiers:isbn:XXXX,doi:YYYYY. Für boolesche Felder (ja/nein) verwenden Sie true und false oder yes und no.
fr: Le champ à paramétrer. Le format est field_name:value, par exemple : :option:`--field` tags:tag1,tag2. Utilisez :option:`--list-fields` pour récupérer une liste de tous les noms de champs. Vous pouvez spécifier cette option plusieurs fois pour fixer plusieurs champs. Note: pour languages, vous devez utiliser les codes de langues ISO639 (par exemple, en pour Anglais, fr pour Français, et ainsi de suite). Pour les identifiants (identifiers), la syntaxe est :option:`--field` identifiers:isbn:XXXX,doi:YYYYY. Pour les champs booléens (oui/non), utilisez "true" (vrai) ou "false" (faux) ou "yes" (oui) et "no" (non).

source: List the metadata field names that can be used with the :option:`--field` option
de: Listet die Metadaten-Feldnamen auf, die mit :option:`--field` option verwendet werden können
fr: Liste les noms de champ de métadonnées qui peuvent être utilisés avec l'option :option:`--field`

source: Export the books specified by ids (a comma separated list) to the filesystem. The :command:`export` operation saves all formats of the book, its cover and metadata (in an opf file). You can get id numbers from the list command.
de: Exportiert die durch IDs (eine durch Kommata getrennte Liste) angegebenen Bücher in das Dateisystem. Der Exportvorgang speichert alle Formate der Bücher, ihre Cover-Bilder und Metadaten (in einer opf-Datei). Die ID-Nummern erhalten Sie mit dem Befehl list.
fr: Exporter les livres spécifiés par ids (une liste séparée par des virgules) vers le système de fichiers. L’export enregistre tous les formats du livre, la couverture et les métadonnées (dans un fichier opf). Vous pouvez obtenir les numéros id à partir de la commande list.

source: Export all books in database, ignoring the list of ids.
de: Exportiere alle Bücher der Datenbank, die Liste der IDs wird ignoriert.
fr: Exporter tous les livres dans la base, en ignorant la liste des identifiants

source: Normally, calibre will convert all non English characters into English equivalents for the file names. WARNING: If you turn this off, you may experience errors when saving, depending on how well the filesystem you are saving to supports unicode. Specifying this switch will turn this behavior off.
de: Normalerweise konvertiert Calibre alle nicht-englischen Zeichen in englische Entsprechungen für die Dateinamen. ACHTUNG: Falls Sie dies abstellen, könnten Fehler beim Speichern auftreten, abhängig davon, wie gut das Dateisystem, unter dem Sie abspeichern, Unicode unterstützt. Durch Setzen des Schalters wird dieses Verhalten deaktiviert.
fr: Normalement, calibre convertira tous les caractères non anglais vers des équivalents anglais pour les noms de fichiers. AVERTISSEMENT : Si vous désactivez ceci, vous pourrez obtenir des erreurs lors de l’enregistrement, cela dépendra si le système de fichiers sur lequel vous sauvegardez prend en charge l’Unicode.

source: Normally, calibre will save the cover in a separate file along with the actual e-book file(s). Specifying this switch will turn this behavior off.
de: Normalerweise speichert Calibre das Coverbild in einer separaten Datei zusammen mit den eigentlichen eBook-Datei(en). Durch Setzen des Schalters wird dieses Verhalten deaktiviert.
fr: Normalement, calibre enregistrera la couverture dans un fichier séparé du(des) fichier(s) de livre numérique. L'utilisation de ce commutateur arrête ce comportement

source: Normally, calibre will update the metadata in the saved files from what is in the calibre library. Makes saving to disk slower. Specifying this switch will turn this behavior off.
de: Normalerweise aktualisiert Calibre die Metadaten in den gespeicherten Dateien mit den Metadaten in der Calibre-Bibliothek. Dies verlangsamt das Speichern auf die Festplatte. Durch Setzen des Schalters wird dieses Verhalten deaktiviert.
fr: En temps normal calibre mettra à jour les métadonnées des fichiers sauvegardés à partir du contenu de la bibliothèque calibre. L’enregistrement prendra davantage de temps. L'utilisation de ce commutateur arrête ce comportement

source: Normally, calibre will write the metadata into a separate OPF file along with the actual e-book files. Specifying this switch will turn this behavior off.
de: Normalerweise schreibt Calibre die Metadaten in eine gesonderte OPF-Datei zusammen mit den eigentlichen eBook-Dateien. Durch Setzen des Schalters wird dieses Verhalten deaktiviert.
fr: Normalement, calibre écrira les métadonnées dans un fichier OPF séparé avec les fichiers de livre numérique actuels. L'utilisation de ce commutateur arrête ce comportement

source: Comma separated list of formats to save for each book. By default all available formats are saved.
de: Komma-separierte Liste der für jedes Buch zu speichernden Formate. Standardmäßig werden alle Formate gespeichert.
fr: Liste séparée par des virgules de formats à enregistrer pour chaque livre. Par défaut tous les formats disponibles sont sauvegardés.

source: Replace whitespace with underscores.
de: Leerzeichen mit Unterstrichen ersetzen.
fr: Remplacer les espaces par des underscores.

source: Export all books into a single directory
de: Exportiere alle Bücher in ein einziges Verzeichnis
fr: Exporter les livres vers un seul répertoire

source: The template to control the filename and directory structure of the saved files. Default is "{author_sort}/{title}/{title} - {authors}" which will save books into a per-author subdirectory with filenames containing title and author. Available controls are: {publisher, series_index, isbn, pubdate, rating, series, author_sort, languages, authors, last_modified, timestamp, title, id, tags}
de: Vorlage um den Dateinamen und die Dateipfadstruktur der gespeicherten Dateien anzupassen. Als Standard ist "{author_sort}/{title}/{title} - {authors}" festgelegt, welches die Bücher in Unterverzeichnisse nach Autoren speichert, wobei der Dateirname aus dem Titel und dem Autor besteht. Mögliche Anpassungen sind: {publisher, series_index, isbn, pubdate, rating, series, author_sort, languages, authors, last_modified, timestamp, title, id, tags}
fr: Le modèle pour contrôler le nom de fichier et la structure des répertoires des fichiers enregistrés. Par défaut est : "{author_sort}/{title}/{title} - {authors}" qui va sauvegarder les livres dans un sous-répertoire par auteur avec des noms de fichiers contenant le titre et l’auteur. Les contrôles disponibles sont : {publisher, series_index, isbn, pubdate, rating, series, author_sort, languages, authors, last_modified, timestamp, title, id, tags}

source: The format in which to display dates. %d - day, %b - month, %m - month number, %Y - year. Default is: %b, %Y
de: Das Format, in dem das Datum angezeigt wird. %d - Tag, %b - Monat, %m - Monatsnummer, %Y - Jahr. Standard ist: %b, %Y
fr: Le format suivant lequel afficher les dates. %d - jour, %b - mois, %m- numéro de mois, %Y - année. Par défaut : %b, %Y

source: Export books to the specified directory. Default is .
de: Bücher in ein bestimmtes Verzeichnis exportieren. Standard ist .
fr: Exporter les livres vers le répertoire spécifié. Par défaut.

source: Convert paths to lowercase.
de: Pfade in Kleinschreibung umwandeln.
fr: Convertir les chemins en minuscule.
