Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: Launch the calibre edit book tool. You can optionally also specify the names of files inside the book which will be opened for editing automatically.
de: Startet den Calibre Bucheditor. Sie können optional auch Namen der Dateien innerhalb des Buches angeben, die dann automatisch beim Start zur Bearbeitung geöffnet werden.

source: Polishing books is all about putting the shine of perfection onto your carefully crafted ebooks.
de: Bei Bücher perfektionieren dreht sich alles um den Feinschliff und die Perfektionierung des sorgfältig gestalteten eBooks.
