Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: When calibre removes blank lines between paragraphs, it automatically sets a paragraph indent, to ensure that paragraphs can be easily distinguished. This option controls the width of that indent (in em). If you set this value negative, then the indent specified in the input document is used, that is, calibre does not change the indentation.
de: Wenn Calibre Leerzeilen zwischen Absätzen entfernt, wird automatisch ein Absatzeinzug hinzugefügt um Absätze einfach unterscheidbar darzustellen. Diese Option setzt die Größe des Einzugs (in em). Ist dieser Wert negativ, wird der Absatzeinzug des Dokuments genutzt, Calibre ändert den Einzug also nicht.
fr: Lorsque calibre supprime les lignes blanches entre les paragraphes, il ajoute automatiquement une indentation de paragraphe, afin de s’assurer que les paragraphes puissent être facilement distingués. Cette option contrôle la largeur de cette indentation (en em). Si vous fixez une valeur négative, alors l’indentation spécifiée dans le document d’entrée est utilisée, c’est à dire que calibre ne modifie pas l’indentation.

source: Convert plain quotes, dashes and ellipsis to their typographically correct equivalents. For details, see http://daringfireball.net/projects/smartypants
de: Konvertiere einfache und doppelte Anführungszeichen sowie Quotierungszeichen zu deren typografisch korrekten Formen. Details finden Sie unter http://daringfireball.net/projects/smartypants (nur in Englisch)
fr: Convertit les guillemets, les tirets et les points de suspension en leurs équivalents typographiques corrects. Pour plus de détails, voir http://daringfireball.net/projects/smartypants

source: Subset all embedded fonts. Every embedded font is reduced to contain only the glyphs used in this document. This decreases the size of the font files. Useful if you are embedding a particularly large font with lots of unused glyphs.
de: Alle eingebetteten Schriften reduzieren. Jede eingebettete Schrift wird so reduziert, dass Sie nur Glyphen enthält, die in diesem Dokument verwendet werden. Dadurch verringert sich die Größe der Schriftdateien. Dies ist nützlich, wenn Sie eine relativ große Schrift mit vielen unbenutzten Glyphen einbetten möchten.
fr: Crée un sous-ensemble de toutes les polices intégrées. Chaque police intégrée est réduite pour ne contenir que les caractères utilisés dans le document. Cela réduit la taille des fichiers associés aux polices. Utile si vous souhaitez intégrer des polices particulièrement grandes dont peu de caractères sont utilisés.

source: Convert fancy quotes, dashes and ellipsis to their plain equivalents.
de: Ausgefallene Anführungszeichen, Striche und Auslassungspunkte in ihre Entsprechungen in einfachem Text konvertieren.
fr: Convertit les guillemets, tirets et points de suspension unicode en leurs équivalents en texte brut.

source: Heuristic Processing
de: Heuristische Verarbeitung
fr: Traitement heuristique

source: Modify the document text and structure using common patterns. Disabled by default. Use --enable-heuristics to enable. Individual actions can be disabled with the --disable-* options.
de: Modifiziert den Dokumententext und die Struktur durch Anwendung häufiger Muster. Standardmäßig deaktiviert. Nutzen Sie --enable-heuristics zur Aktivierung. Individuelle Aktionen können mit den Optionen --disable-* deaktiviert werden.
fr: Modifie le texte et la structure du document selon le modèle courant. Désactivé par défaut. Utiliser --enable-heuristics pour l’activer. Les actions individuelles peuvent être désactivées grâce à l’option --disable-*.

source: Analyze hyphenated words throughout the document. The document itself is used as a dictionary to determine whether hyphens should be retained or removed.
de: Analysiert getrennte Worte im Dokument. Das Dokument wird selbst als Wörterbuch genutzt, um festzustellen, ob Bindestriche gelöscht oder beibehalten werden sollten.
fr: Analyser les mots contenant des traits d'union dans le document. Le document lui-même est utilisé comme dictionnaire pour déterminer si les traits d'union doivent être conservés ou retirés.

source: Remove empty paragraphs from the document when they exist between every other paragraph
de: Entfernt leeren Absätze, die zwischen anderen Absätzen liegen, aus dem Dokument
fr: Supprimer les paragraphes vides du document quand ils se trouvent entre d'autres paragraphes

source: Turn indentation created from multiple non-breaking space entities into CSS indents.
de: Konvertiere Einrückungen, die von mehreren geschützten Leerzeichen herrühren, in CSS-Einrückungen.
fr: Transforme les retraits de ligne créées par une suite d'espaces insécables en retraits CSS.

source: Left aligned scene break markers are center aligned. Replace soft scene breaks that use multiple blank lines with horizontal rules.
de: Linksbündige Abschnittswechsel werden zentriert. Weiche Abschnittswechsel, die mehrere Leerzeilen benutzen, werden mit horizontalen Linien ersetzt.
fr: Les marqueurs de rupture de scène alignés à gauche sont alignés au centre. Les ruptures de scène qui utilisent des lignes blanches multiples sont remplacées par des traits horizontaux.

source: Look for common words and patterns that denote italics and italicize them.
de: Suche nach gängigen Markern, die Kursivdruck kennzeichnen und formatiere sie entsprechend.
fr: Rechercher les mots et les motifs usuels qui dénotent la présence de mots en italiques et les mettre en italique.

source: Detect unformatted chapter headings and sub headings. Change them to h2 and h3 tags. This setting will not create a TOC, but can be used in conjunction with structure detection to create one.
de: Unformatierte Kapitelüberschriften und Untertitel aufspüren und in h2 resp. h3 Tags umwandeln. Diese Einstellung erstellt nur in Kombination mit der Strukturanalyse ein Inhaltsverzeichnis.
fr: Détecte les titre de chapitre et les sous-titres sans mise en forme et les transforme en balise h2 et h3. Ce réglage ne va pas créer de table des matières, mais peut être utilisé dans la partie Détection de structure afin d'en créer une.

source: Looks for occurrences of sequential <h1> or <h2> tags. The tags are renumbered to prevent splitting in the middle of chapter headings.
de: Sucht aufeinanderfolgende <h1> oder <h2> Tags. Um Trennungen in Kapitelüberschriften zu verhinden, werden die Tags neu nummeriert.
fr: Recherche les occurrences de séquences de balises <h1> ou <h2>. Les balises sont renumérotées afin de d'éviter que les titres de chapitres ne soient coupés en deux.

source: Unwrap lines using punctuation and other formatting clues.
de: Zeilenumbrüche basierend auf Satzzeichen und anderen Hinweisen löschen.
fr: Redéfinir la longueur des lignes en se basant sur la ponctuation et autres indices de présentation.

source: Enable heuristic processing. This option must be set for any heuristic processing to take place.
de: Heuristik(en) aktivieren. Falls deaktiviert, werden keine Heuristiken zur Verarbeitung verwendet.
fr: Activer le traitement heuristique. Cette option doit être activée pour que tout traitement heuristique puisse être effectué.

source: Scale used to determine the length at which a line should be unwrapped. Valid values are a decimal between 0 and 1. The default is 0.4, just below the median line length. If only a few lines in the document require unwrapping this value should be reduced
de: Skala, die angibt, bei welcher Zeilenlänge der Zeilenumbruch gelöscht werden sollte. Erlaubte Werte sind Dezimalzahlen zwischen 0 und 1, die Standardeinstellung ist 0.4, etwas unter dem Median der Zeilenlänge. Reduzieren Sie diesen Wert, wenn nur einige Zeilenumbrüche gelöscht werden sollen
fr: Échelle utilisée pour déterminer la longueur à partir de laquelle une ligne doit être redéfinie. Les valeurs acceptables sont les décimaux compris entre 0 et 1. La valeur pas défaut est de 0.4, juste en dessous de la valeur médiane des longueurs de ligne dans le document. Si seules quelques lignes dans le document nécessitent d’être redéfinies, cette valeur devrait être réduite.

source: Replace scene breaks with the specified text. By default, the text from the input document is used.
de: Abschnittswechsel mit angegebenem Text ersetzen. Standardmäßig wird der Text des Eingabedokumentes verwendet.
fr: Remplacer les ruptures de scène par le texte spécifié. Par défaut, le texte du document initial est utilisé.

source: Search And Replace
de: Suchen und Ersetzen
fr: Rechercher Et Remplacer

source: Modify the document text and structure using user defined patterns.
de: Ändere Text und Struktur des Dokument durch Nutzung von benutzerdefinierten Mustern.
fr: Modifier le texte et la structure du document en utilisant des modèles définis par l’utilisateur.

source: Path to a file containing search and replace regular expressions. The file must contain alternating lines of regular expression followed by replacement pattern (which can be an empty line). The regular expression must be in the python regex syntax and the file must be UTF-8 encoded.
de: Pfad zu einer Datei mit regulären Ausdrücken für Suchen und Ersetzen. Die Datei muss abwechselnd Zeilen von regulären Ausdrücken gefolgt von einem Austausch-Muster (das kann eine leere Zeile sein) enthalten. Der reguläre Ausdruck muss der Python-Regex-Syntax entsprechen und die Datei muss in UTF-8 kodiert sein.
fr: Chemin vers un fichier contenant les expressions régulières de recherche et remplacement. Le fichier doit contenir en alternances des lignes d'expressions régulières suivies par des modèles de remplacement (qui peuvent être une ligne vide). L'expression régulière doit être écrite dans la syntaxe des regexp python et le fichier doit être encodé en UTF-8.

source: Replacement to replace the text found with sr1-search.
de: Ersatz zum Ersetzen des gefundenen Text mit sr1-search.
fr: Remplacement pour le texte correspondant à la recherche sr1-recherche.

source: Search pattern (regular expression) to be replaced with sr1-replace.
de: Suchmuster (regulärer Ausdruck), wird durch sr1-replace ersetzt.
fr: Motif de recherche (expression régulière) qui sera remplacé par sr1-replace.

source: Replacement to replace the text found with sr2-search.
de: Ersatz zum Ersetzen des gefundenen Text mit sr2-search.
fr: Remplacement pour le texte correspondant à la recherche sr2-recherche.

source: Search pattern (regular expression) to be replaced with sr2-replace.
de: Suchmuster (regulärer Ausdruck), wird durch sr2-replace ersetzt.
fr: Modèle de recherche (expression régulière) qui sera remplacé par sr2-replace.

source: Replacement to replace the text found with sr3-search.
de: Ersatz zum Ersetzen des gefundenen Text mit sr3-search.
fr: Remplacement pour le texte correspondant à la recherche sr3-recherche.

source: Search pattern (regular expression) to be replaced with sr3-replace.
de: Suchmuster (regulärer Ausdruck), wird durch sr3-replace ersetzt.
fr: Modèles de recherche (expression régulière) qui sera remplacée par sr3-replace.

source: Structure Detection
de: Struktur Erkennung
fr: Détection de la structure

source: Control auto-detection of document structure.
de: Kontrolle der automatischen Erkennung der Dokumentstruktur.
fr: Contrôle de l’auto-détection de la structure du document.

source: An XPath expression to detect chapter titles. The default is to consider <h1> or <h2> tags that contain the words "chapter","book","section", "prologue", "epilogue", or "part" as chapter titles as well as any tags that have class="chapter". The expression used must evaluate to a list of elements. To disable chapter detection, use the expression "/". See the XPath Tutorial in the calibre User Manual for further help on using this feature.
de: Ein XPath-Ausdruck, um die Kapiteltitel zu finden. Standardmäßig werden <h1> oder <h2> tags, welche die Wörter "chapter", "book", "section", "prologue", "epilogue" oder "part" enthalten als Kapiteltitel behandelt, ebenso wie alle tags die class="chapter" haben. Der genutzte Ausdruck muss eine Liste von Elementen bewerten. Um die Kapitelerkennung abzuschalten, benutzen Sie den Ausdruck "/". Siehe das XPath Tutorial im Calibre Handbuch für weitere Hilfe zu diesem Feature.
fr: Une expression XPath pour détecter les titres de chapitres. Par défaut, les étiquettes <h1> et <h2> qui contiennent les mots "chapter", "book", "section", "prologue", "epilogue", ou "part" ainsi que les étiquettes qui ont class="chapter". L’expression utilisée doit être évaluée comme une liste d’éléments. Pour désactiver la détection de chapitre, utiliser l’expression "/". Regarder le tutoriel XPath dans le Manuel Utilisateur de calibre pour plus d’aide sur l’utilisation de cette fonction.

source: Specify how to mark detected chapters. A value of "pagebreak" will insert page breaks before chapters. A value of "rule" will insert a line before chapters. A value of "none" will disable chapter marking and a value of "both" will use both page breaks and lines to mark chapters.
de: Geben Sie an, wie erkannte Kapitel gekennzeichnet werden sollen. Der Wert "pagebreak" fügt Seitenumbrüche vor Kapiteln ein. Der Wert "rule" fügt eine Linie vor Kapiteln ein. Der Wert "none" schaltet die Kapitelmarkierung aus und der Wert "both" verwendet sowohl Seitenumbrüche als auch Linien zur Kapitelmarkierung.
fr: Précise comment indiquer les chapitres détectés. Une valeur de "pagebreak" insérera un saut de page avant chaque chapitre. Une valeur de "rule" insérera un filet avant chaque chapitre. Une valeur de "none" désactivera le marquage des chapitres et une valeur de "both" utilisera à la fois un saut de page et un filet.

source: Some documents specify page margins by specifying a left and right margin on each individual paragraph. calibre will try to detect and remove these margins. Sometimes, this can cause the removal of margins that should not have been removed. In this case you can disable the removal.
de: Einige Dokumente definieren Seitenränder durch die Angabe eines rechten und linken Randes für jeden Absatz. Calibre wird versuchen, diese Ränder zu entfernen. Manchmal kann dies dazu führen, dass Ränder entfernt werden, die beibehalten hätten werden sollen. In diesem Fall können Sie die Entfernung deaktiveren.
fr: Certains documents spécifient la marge de la page en précisant une marge gauche et droite sur chacun des paragraphes. calibre va tenter de détecter et de supprimer ces marges. Cela peut éventuellement provoquer le retrait de certaines marges qui ne devaient pas être retirés. Dans ce cas, vous pouvez désactiver le retrait de ces marges.

source: Insert the book metadata at the start of the book. This is useful if your ebook reader does not support displaying/searching metadata directly.
de: Metadaten des Buchs am Buchanfang einfügen. Das ist hilfreich, wenn Ihr eBook-Reader das direkte Anzeigen/Suchen von Metadaten nicht unterstützt.
fr: Insérer les métadonnées au début du livre. Utile si votre liseuse électronique ne prend pas en charge directement l’affichage/recherche des métadonnées.

source: An XPath expression. Page breaks are inserted before the specified elements. To disable use the expression: /
de: Ein XPath-Ausdruck. Seitenumbrüche werden vor den angegebenen Elementen eingefügt. Zur Deaktivierung benutze den Ausdruk: /
fr: Une expression XPath. Des séparateurs de pages sont insérés avant les éléments spécifiés. Pour désactiver utiliser cette expression: /

source: Use the cover detected from the source file in preference to the specified cover.
de: Verwendet bevorzugt das aus der Ursprungsdatei gewonnene Coverbild anstatt des angegebenen Coverbildes.
fr: Utiliser la couverture contenue dans le fichier d’entrée plutôt que la couverture spécifiée.

source: Remove the first image from the input ebook. Useful if the input document has a cover image that is not identified as a cover. In this case, if you set a cover in calibre, the output document will end up with two cover images if you do not specify this option.
de: Entferne das erste Bild vom eingefügten eBook. Hilfreich, wenn das Dokument ein Coverbild hat, welches nicht als Coverbild erkannt wurde. Sonst würde durch das Hinzufügen eines Coverbildes in Calibre das eBook dann zwei Coverbilder haben.
fr: Supprime la première image du livre numérique en entrée. Utile si le document à transformer a une image de couverture qui n’est pas identifiée comme une couverture. Dans ce cas, si vous avez une image de couverture dans calibre, le document de sortie aura deux images de couverture si vous n’utilisez pas cette option.

source: An XPath expression to detect the location in the document at which to start reading. Some ebook reading programs (most prominently the Kindle) use this location as the position at which to open the book. See the XPath tutorial in the calibre User Manual for further help using this feature.
de: Ein XPath Ausdruck um die Stelle im Dokument zu erkenen, wo mit dem Lesen begonnen werden soll. Einige eBook-Leseprogramme (allen voran der Kindle) verwenden diese Stelle als Position um das Buch zu öffnen. Lesen Sie das XPath tutorial im Calibre Benutzerhandbuch um weitere Hilfe zu diesem Feature zu erhalten.
fr: Expression XPath pour détecter l'emplacement du début de la lecture dans le document. Certaines liseuses (dont la plus connue est le Kindle) utilisent cette position comme emplacement d'ouverture du livre. Voir le Tutoriel XPath dans le Manuel d’utilisation de Calibre pour une aide supplémentaire concernant cette fonctionnalité.

source: Table Of Contents
de: Inhaltsverzeichnis
fr: Table des matières

source: Control the automatic generation of a Table of Contents. By default, if the source file has a Table of Contents, it will be used in preference to the automatically generated one.
de: Kontrolle der automatischen Erstellung eines Inhaltsverzeichnisses. Laut Voreinstellung wird, falls die Ursprungsdatei ein Inhaltsverzeichnis hat, dieses verwendet anstatt des automatisch erstellten.
fr: Contrôle la génération automatique de la table des matières. Par défaut, si le fichier source a une table des matières, elle sera utilisée de préférence par rapport à celle qui est générée automatiquement.

source: When creating a TOC from links in the input document, allow duplicate entries, i.e. allow more than one entry with the same text, provided that they point to a different location.
de: Erlaubt doppelte Einträge, wenn ein Inhaltsverzeichnis aus den Links des Eingabedokumentes erzeugt wird. Erlaubt also mehr als einen Eintag mit demselben Text, solange die Einträge auf unterschiedliche Stellen verweisen.
fr: Lors de la création d’une table des matières à partir de liens dans le document d’entrée, autorise des entrées dupliquées, à savoir autorise plus d’une entrée avec le même texte, du moment qu’elles pointent vers des emplacements différents.

source: XPath expression that specifies all tags that should be added to the Table of Contents at level one. If this is specified, it takes precedence over other forms of auto-detection. See the XPath Tutorial in the calibre User Manual for examples.
de: XPath Ausdrücke die alle Tags bestimmen, sollten auf Ebene Eins zum Inhaltsverzeichnis hinzugefügt werden. Falls dieser Ausdruck angegeben ist, hat er Vorrang vor anderen Formen der automatischen Erkennung. Für Beispiele sehen Sie sich das XPath Tutorial im Calibre Benutzerhandbuch an.
fr: Expression XPath indiquant toutes les étiquettes qui doivent être ajoutées au premier niveau de la table des matières. Si elle est spécifiée, elle sera prioritaire par rapport aux autres formes d’auto-détection. Voir le Tutoriel XPath dans le Manuel d’utilisation de calibre pour des exemples.

source: XPath expression that specifies all tags that should be added to the Table of Contents at level two. Each entry is added under the previous level one entry. See the XPath Tutorial in the calibre User Manual for examples.
de: XPath Ausdrücke die alle Tags bestimmen, sollten auf Ebene Zwei zum Inhaltsverzeichnis hinzugefügt werden. Jeder Eintrag wird unter der vorherigen Ebene Eins hinzugefügt. Für Beispiele sehen Sie sich das XPath Tutorial im Calibre Benutzerhandbuch an.
fr: Expression XPath indiquant que toutes les étiquettes doivent être ajoutées au deuxième niveau de la table des matières. Chaque entrée est ajoutée en dessous de la précédente entrée de premier niveau. Voir le Tutoriel XPath dans le Manuel d’utilisation de calibre pour des exemples.

source: XPath expression that specifies all tags that should be added to the Table of Contents at level three. Each entry is added under the previous level two entry. See the XPath Tutorial in the calibre User Manual for examples.
de: XPath Ausdrücke die alle Tags bestimmen, sollten auf Ebene Drei zum Inhaltsverzeichnis hinzugefügt werden. Jeder Eintrag wird unter der vorherigen Ebene Zwei hinzugefügt. Für Beispiele sehen Sie sich das XPath Tutorial im Calibre Benutzerhandbuch an.
fr: Expression XPath indiquant que toutes les étiquettes doivent être ajoutées au troisième niveau de la table des matières. Chaque entrée est ajoutée en dessous de la précédente entrée de second niveau. Voir le Tutoriel XPath dans le Manuel d’utilisation de calibre pour des exemples.

source: Maximum number of links to insert into the TOC. Set to 0 to disable. Default is: 50. Links are only added to the TOC if less than the threshold number of chapters were detected.
de: Höchstzahl der Verknüpfungen, die in das Inhaltsverzeichnis eingefügt werden. Zum Ausschalten auf 0 setzen. Voreinstellung ist: 50. Verknüpfungen werden nur dann zum Inhaltsverzeichnis hinzugefügt, wenn weniger Kapitel als in der Schwellenzahl angegeben erkannt werden.
fr: Nombre maximum de liens à insérer dans la table des matières. Réglez à 0 pour le désactiver. Par défaut : 50. Les liens sont seulement ajoutés à la table des matières si le seuil du nombre de chapitres détectés n’a pas été atteint.

source: Don't add auto-detected chapters to the Table of Contents.
de: Automatisch erkannte Kapitel nicht zum Inhaltsverzeichnis hinzufügen.
fr: Ne pas ajouter à la table des matières les chapitres détectés automatiquement.

source: Remove entries from the Table of Contents whose titles match the specified regular expression. Matching entries and all their children are removed.
de: Einträge vom Inhaltsverzeichnis entfernen, deren Titel dem regulären Ausdruck entsprechen. Entsprechende Einträge und deren untergeordnete Einträge werden entfernt.
fr: Supprime les entrées de la table des matières qui correspondent à l’expression régulière spécifiée. Les entrées correspondantes ainsi que leurs sous-entrées seront supprimées.

source: If fewer than this number of chapters is detected, then links are added to the Table of Contents. Default: 6
de: Wurden weniger Kapitel als hier angegeben erkannt, werden Verknüpfungen zum Inhaltsverzeichnis hinzugefügt. Voreinstellung: 6
fr: Lorsque le nombre de chapitres détectés est inférieur à ce chiffre, les liens sont ajoutés à la Table des Matières. Par défaut : 6

source: Normally, if the source file already has a Table of Contents, it is used in preference to the auto-generated one. With this option, the auto-generated one is always used.
de: Normalerweise wird - soweit vorhanden - das Inhaltsverzeichnis der Ursprungsdatei verwendet anstatt des automatisch erstellten. Mit dieser Einstellung wird immer das automatisch erstellte verwendet.
fr: Normalement, si le fichier source a déjà une table des matières, elle est utilisée de préférence à celle auto-générée. Avec cette option, l’auto-générée est toujours utilisée.

source: Metadata
de: Metadaten
fr: Métadonnées

source: Options to set metadata in the output
de: Einstellungen zum Festlegen von Metadaten in der Ausgabe
fr: Options pour indiquer les métadonnées en sortie
