Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: Disable compression of the file contents.
de: Komprimierung der Datei-Inhalte ausschalten.
fr: Désactiver la compression du contenu du fichier.

source: Extract the contents of the MOBI file to the specified directory. If the directory already exists, it will be deleted.
de: Entpacke den Inhalt der MOBI Datei in ein ausgewähltes Verzeichnis. Wenn das Verzeichnis bereits existiert, wird es gelöscht.
fr: Extraire le contenu du fichier MOBI dans le répertoire spécifié. Si le répertoire existe déjà, il sera supprimé.

source: When adding the Table of Contents to the book, add it at the start of the book instead of the end. Not recommended.
de: Fügt das Inhaltsverzeichnis am Anfang eines Buches hinzu anstatt an dessen Ende. Nicht empfohlen.
fr: Lors de l’ajout de la table des matières au livre, l’insérer au début du livre plutôt qu’à la fin. Non recommandé.

source: Don't add Table of Contents to the book. Useful if the book has its own table of contents.
de: Fügt dem Buch kein Inhaltsverzeichnis hinzu. Nützlich, wenn das Buch sein eigenes Inhaltsverzeichnis hat.
fr: Ne pas ajouter de table des matières au livre. Utile si le livre a déjà sa propre table des matières.

source: When present, use author sort field as author.
de: Soweit möglich Autor-Sortierung als Autor verwenden.
fr: Si présent, utiliser le champ de tri par auteur comme auteur.

source: If specified, the output plugin will try to create output that is as human readable as possible. May not have any effect for some output plugins.
de: Falls angegeben, versucht das Ausgabe-Plugin ein für Menschen verständliches Ergebnis zu erzeugen. Das heißt aber nicht, dass das auch gelingen muss.
fr: Si spécifié, l’extension de sortie essaiera de créer une sortie qui sera aussi lisible que possible pour un être humain. Peut être sans effet avec certaines extensions de sortie.

source: Enable sharing of book content via Facebook etc. on the Kindle. WARNING: Using this feature means that the book will not auto sync its last read position on multiple devices. Complain to Amazon.
de: Aktivieren des Austauschs von Buchinhalten über Facebook u.a. auf dem Kindle. WARNUNG: Die Nutzung dieser Funktion bedeutet, dass die letzte Leseposition nicht automatisch zwischen mehreren Geräten synchronisiert wird. Beschwerden an Amazon.
fr: Activer le partage de contenu des livres via Facebook etc. sur le Kindle. ATTENTION: L’utilisation de cette option entraîne l’impossibilité d’utiliser l’option de synchronisation automatique de la dernière position de lecture sur plusieurs appareils. C'est un problème dû à Amazon.

source: Title for any generated in-line table of contents.
de: Titel für alle erstellten Inline-Inhaltsverzeichnisse.
fr: Titre pour les tables des matières générées.

source: EPUB Output Options
de: EPUB-Ausgabeoptionen
fr: Options de sortie EPUB

source: Turn off splitting at page breaks. Normally, input files are automatically split at every page break into two files. This gives an output ebook that can be parsed faster and with less resources. However, splitting is slow and if your source file contains a very large number of page breaks, you should turn off splitting on page breaks.
de: Das Aufteilen bei Seitenwechseln ausschalten. Normalerweise werden Eingabe-Dateien automatisch bei jedem Seitenwechsel in zwei Dateien aufgeteilt. Damit erhält man in der Ausgabe ein eBook, das schneller mit weniger Resourcen analysiert werden kann. Das Aufteilen ist jedoch langsam und falls die Ausgangsdatei sehr viele Seitenwechsel enthält, sollten Sie das Aufteilen bei Seitenwechseln ausschalten.
fr: Désactiver le sectionnement aux sauts de page. En temps normal, le fichier d’entrée est sectionné à chaque saut de page pour former deux fichiers; vous bénéficiez ainsi du livre numérique susceptible d’être analysé plus rapidement et avec moins de ressources. Toutefois, sectionner les fichier est un processus lent, donc il est recommandé de désactiver le sectionnement si le fichier d’entrée contient de nombreux sauts de page.

source: This option is needed only if you intend to use the EPUB with FBReaderJ. It will flatten the file system inside the EPUB, putting all files into the top level.
de: Diese Option ist nur nötig, wenn Sie beabsichtigen das EPUB mit einem FBReaderJ zu benutzen. Diese Option wird die Ordnerstruktur des EPUB's vereinfachen, indem alle Dateien in der obersten Ebene abgelegt werden.
fr: Cette option est nécessaire si vous avez l’intention d’utiliser l’EPUB avec FBReaderJ. Elle va aplatir la structure du système de fichiers à l’intérieur de l’EPUB, mettant tous les fichiers sur le niveau supérieur.

source: Insert an inline Table of Contents that will appear as part of the main book content.
de: Ein lineares Inhaltsverzeichnis (ToC) einfügen, das im Buch selber erscheinen wird.
fr: Insérez une table des matières intégrée qui apparaîtra en tant qu'élément du contenu principal du livre.

source: Put the inserted inline Table of Contents at the end of the book instead of the start.
de: Legt das eingefügte, lineare Inhaltsverzeichnis (ToC) am Ende des Buches, anstatt zu Anfang ab.
fr: Insérez la table des matières intégrée à la fin du livre plutôt qu'au début.

source: Extract the contents of the generated EPUB file to the specified directory. The contents of the directory are first deleted, so be careful.
de: Extrahieren den Inhalt der generierten EPUB-Datei in das angegebene Verzeichnis. Der Inhalt des Verzeichnisses wird zuerst gelöscht, also seien Sie vorsichtig.
fr: Extraire le contenu du fichier EPUB généré vers le répertoire spécifié. Le contenu du répertoire sera d’abord effacé, donc faites attention.

source: Split all HTML files larger than this size (in KB). This is necessary as most EPUB readers cannot handle large file sizes. The default of 260KB is the size required for Adobe Digital Editions.
de: Alle HTML-Dateien, die größer als diese Angabe (in KB) sind, teilen. Dies ist notwendig, da die meisten EPUB-Reader nicht mit großen Dateien umgehen können. Die Voreinstellung von 260KB ist die für Adobe Digital Editions benötigte Größe.
fr: Divise tous les fichiers HTML plus grand que cette taille (en KB). Ceci est nécessaire car la plupart des lecteurs EPUB ne prennent pas en charge des fichiers de grande taille. Par défaut 260KB est la taille requise par Adobe Digital Editions.

source: Normally, if the input file has no cover and you don't specify one, a default cover is generated with the title, authors, etc. This option disables the generation of this cover.
de: Normalerweise wird, falls die Eingabe-Datei kein Coverbild hat und Sie keines angeben, ein voreingestelltes Coverbild mit Titel, Autoren, usw. erstellt. Diese Einstellung schaltet die Erstellung dieses Coverbildes aus.
fr: Normalement, si le fichier d’entrée n’a pas de couverture et que vous n’en avez pas spécifié une, une couverture par défaut est générée avec le titre, les auteurs, etc. Cette option désactive la génération de cette couverture.

source: Do not use SVG for the book cover. Use this option if your EPUB is going to be used on a device that does not support SVG, like the iPhone or the JetBook Lite. Without this option, such devices will display the cover as a blank page.
de: SVG nicht für Coverbilder benutzen. Aktivieren Sie diese Option falls Ihre EPUB-Datei auf einem Gerät benutzt werden soll, welches SVG nicht unterstützt (z.B. iPhone oder JetBook Lite). Ohne diese Option werden solche Geräte eine leere Seite als Coverbild anzeigen.
fr: Ne pas utiliser le format SVG pour la couverture du livre. Utiliser cette option si votre EPUB va être utilisé sur un appareil qui ne prend pas en charge SVG, comme l’iPhone ou le JetBook Lite. Sans cette option, ce type d’appareil affichera une page blanche comme couverture.

source: When using an SVG cover, this option will cause the cover to scale to cover the available screen area, but still preserve its aspect ratio (ratio of width to height). That means there may be white borders at the sides or top and bottom of the image, but the image will never be distorted. Without this option the image may be slightly distorted, but there will be no borders.
de: Bei Verwendung eines SVG Coverbildes führt diese Einstellung dazu, dass das Coverbild auf die verfügbare Bildschirmgröße skaliert wird, aber dennoch sein Seitenverhältnis (Verhältnis von Breite zu Höhe) erhalten bleibt. Das heißt, es können weiße Ränder an den Seiten oder oben und unten auf dem Bild sein, aber das Bild wird nie verzerrt werden. Ohne diese Einstellung kann das Bild leicht verzerrt sein, aber es gibt dafür keine Ränder.
fr: Lors de l’utilisation d’une image SVG en couverture, cette option va entraîner une mise à l’échelle permettant de couvrir tout l’écran, mais va toujours garder les proportions (ratio hauteur/largeur) de l’image d’origine. Ceci signifie qu’il peut y avoir des bordures blanches sur les cotés, en haut ou en bas de l’image, mais que celle-ci ne sera jamais distordue. Sans cette option l’image peut être légèrement distordue, mais il n’y aura pas de bordures.

source: FB2 Output Options
de: FB2-Ausgabeoptionen
fr: Options de sortie FB2

source: Genre for the book. Choices: sf_history, sf_action, sf_epic, sf_heroic, sf_detective, sf_cyberpunk, sf_space, sf_social, sf_horror, sf_humor, sf_fantasy, sf, det_classic, det_police, det_action, det_irony, det_history, det_espionage, det_crime, det_political, det_maniac, det_hard, thriller, detective, prose_classic, prose_history, prose_contemporary, prose_counter, prose_rus_classic, prose_su_classics, love_contemporary, love_history, love_detective, love_short, love_erotica, adv_western, adv_history, adv_indian, adv_maritime, adv_geo, adv_animal, adventure, child_tale, child_verse, child_prose, child_sf, child_det, child_adv, child_education, children, poetry, dramaturgy, antique_ant, antique_european, antique_russian, antique_east, antique_myths, antique, sci_history, sci_psychology, sci_culture, sci_religion, sci_philosophy, sci_politics, sci_business, sci_juris, sci_linguistic, sci_medicine, sci_phys, sci_math, sci_chem, sci_biology, sci_tech, science, comp_www, comp_programming, comp_hard, comp_soft, comp_db, comp_osnet, computers, ref_encyc, ref_dict, ref_ref, ref_guide, reference, nonf_biography, nonf_publicism, nonf_criticism, design, nonfiction, religion_rel, religion_esoterics, religion_self, religion, humor_anecdote, humor_prose, humor_verse, humor, home_cooking, home_pets, home_crafts, home_entertain, home_health, home_garden, home_diy, home_sport, home_sex, home See: http://www.fictionbook.org/index.php/Eng:FictionBook_2.1_genres for a complete list with descriptions.
de: Genre des Buches. Auswahl: sf_history, sf_action, sf_epic, sf_heroic, sf_detective, sf_cyberpunk, sf_space, sf_social, sf_horror, sf_humor, sf_fantasy, sf, det_classic, det_police, det_action, det_irony, det_history, det_espionage, det_crime, det_political, det_maniac, det_hard, thriller, detective, prose_classic, prose_history, prose_contemporary, prose_counter, prose_rus_classic, prose_su_classics, love_contemporary, love_history, love_detective, love_short, love_erotica, adv_western, adv_history, adv_indian, adv_maritime, adv_geo, adv_animal, adventure, child_tale, child_verse, child_prose, child_sf, child_det, child_adv, child_education, children, poetry, dramaturgy, antique_ant, antique_european, antique_russian, antique_east, antique_myths, antique, sci_history, sci_psychology, sci_culture, sci_religion, sci_philosophy, sci_politics, sci_business, sci_juris, sci_linguistic, sci_medicine, sci_phys, sci_math, sci_chem, sci_biology, sci_tech, science, comp_www, comp_programming, comp_hard, comp_soft, comp_db, comp_osnet, computers, ref_encyc, ref_dict, ref_ref, ref_guide, reference, nonf_biography, nonf_publicism, nonf_criticism, design, nonfiction, religion_rel, religion_esoterics, religion_self, religion, humor_anecdote, humor_prose, humor_verse, humor, home_cooking, home_pets, home_crafts, home_entertain, home_health, home_garden, home_diy, home_sport, home_sex, home. Siehe: http://www.fictionbook.org/index.php/Eng:FictionBook_2.1_genres für eine vollständige Liste mit Beschreibungen.
fr: Genre pour le livre. Choix: sf_history, sf_action, sf_epic, sf_heroic, sf_detective, sf_cyberpunk, sf_space, sf_social, sf_horror, sf_humor, sf_fantasy, sf, det_classic, det_police, det_action, det_irony, det_history, det_espionage, det_crime, det_political, det_maniac, det_hard, thriller, detective, prose_classic, prose_history, prose_contemporary, prose_counter, prose_rus_classic, prose_su_classics, love_contemporary, love_history, love_detective, love_short, love_erotica, adv_western, adv_history, adv_indian, adv_maritime, adv_geo, adv_animal, adventure, child_tale, child_verse, child_prose, child_sf, child_det, child_adv, child_education, children, poetry, dramaturgy, antique_ant, antique_european, antique_russian, antique_east, antique_myths, antique, sci_history, sci_psychology, sci_culture, sci_religion, sci_philosophy, sci_politics, sci_business, sci_juris, sci_linguistic, sci_medicine, sci_phys, sci_math, sci_chem, sci_biology, sci_tech, science, comp_www, comp_programming, comp_hard, comp_soft, comp_db, comp_osnet, computers, ref_encyc, ref_dict, ref_ref, ref_guide, reference, nonf_biography, nonf_publicism, nonf_criticism, design, nonfiction, religion_rel, religion_esoterics, religion_self, religion, humor_anecdote, humor_prose, humor_verse, humor, home_cooking, home_pets, home_crafts, home_entertain, home_health, home_garden, home_diy, home_sport, home_sex, home Voir : http://www.fictionbook.org/index.php/Eng:FictionBook_2.1_genres pour une liste complète avec descriptions.

source: Specify the sectionization of elements. A value of "nothing" turns the book into a single section. A value of "files" turns each file into a separate section; use this if your device is having trouble. A value of "Table of Contents" turns the entries in the Table of Contents into titles and creates sections; if it fails, adjust the "Structure Detection" and/or "Table of Contents" settings (turn on "Force use of auto-generated Table of Contents").
de: Bestimmen Sie eine Methode zur Bildung von Abschnitten. 'Keine' behandelt das ganze Buch als einen einzigen Abschnitt. 'Dateien' erstellt aus jeder Datei einen einzelnen Abschnitt; dies kann Probleme bei bestimmten Geräten vermeiden. 'Inhaltsverzeichnis' verwandelt jeden Eintrag im Inhaltsverzeichnis in einen eigenen Abschnitt mit Titel; falls dies nicht klappt, ändern Sie die Einstellungen zur 'Strukturerkennung' bzw. zum 'Inhaltsverzeichnis' (aktivieren Sie 'Automatisches Inhaltsverzeichnis erzwingen').
fr: Spécifie le découpage en sections. Une valeur de "nothing" transforme le livre en une seule section. Une valeur de "files" transforme chaque fichier en une section séparée. En cas d'échec, ajuster les paramètres « Détection de structure » ou « Table des matières » (active « Forcer l’utilisation d’une table des matières auto-générée »).

source: HTML Output Options
de: HTML-Ausgabeoptionen
fr: Options de sortie HTML

source: Extract the contents of the generated ZIP file to the specified directory. WARNING: The contents of the directory will be deleted.
de: Extrahiere den Inhalt der erstellten ZIP Datei in den gewählten Ordner. ACHTUNG: Der Inhalt des Ordners wird dabei gelöscht.
fr: Extraire le contenu du fichier ZIP généré vers le répertoire spécifié. AVERTISSEMENT : Le contenu du répertoire sera supprimé.

source: CSS file used for the output instead of the default file
de: Zur Ausgabe statt der Standarddatei verwendete CSS-Datei
fr: Fichier CSS utilisé pour la sortie au lieu du fichier par défaut

source: Template used for the generation of the html contents of the book instead of the default file
de: FÜr die Erstellung der HTML-Dateien des Buchinhalts anstelle der Standarddatei benutzte Vorlage
fr: Modèle utilisé pour la génération du contenu html du livre au lieu du fichier par défaut

source: Template used for generation of the html index file instead of the default file
de: Für die Erstellung der HTML-Indexdatei anstelle der Standarddatei benutzte Vorlage
fr: Modèle utilisé pour la génération du fichier d’index html au lieu du fichier par défaut

source: HTMLZ Output Options
de: HTMLZ-Ausgabeoptionen
fr: Options de sortie HTMLZ

source: How to handle the CSS when using css-type = 'class'. Default is external. external: Use an external CSS file that is linked in the document. inline: Place the CSS in the head section of the document.
de: Legt den Umgang mit CSS bei Nutzung des CSS-Typs 'class' fest. Standardeinstellung ist Extern. Extern: Nutzt eine im Dokument verknüpfte externe CSS-Datei. Inline: Setzt das CSS in die head-Sektion des Dokuments.
fr: Comment gérer le CSS quand le css-type = 'class' est utilisé. Par défaut: external. external : Utilise un fichier CSS externe qui est lié dans le document. inline : Place le CSS dans la section d’en-tête du document.

source: Specify the handling of CSS. Default is class. class: Use CSS classes and have elements reference them. inline: Write the CSS as an inline style attribute. tag: Turn as many CSS styles as possible into HTML tags.
de: Legt den Umgang mit CSS fest. Standardeinstellung ist Klasse. Klasse: Nutze CSS-Klassen, Elemente referenzieren diese. Inline: Schreibt CSS als Inline-Stilattribute. Tag: Überführt möglichst viele CSS-Stile in HTML-Tags.
fr: Précise la gestion du CSS. Par défaut: class. class : Utilise les classes CSS et les éléments référençant celles-ci. inline : Écrit le CSS comme un attribut de style en ligne. tag : Transforme autant que possible les styles CSS en balises HTML.

source: If set this option causes the file name of the html file inside the htmlz archive to be based on the book title.
de: Wenn diese Option aktiviert ist, wird der Name der HTML-Datei in dem HTMLZ-Archiv auf dem Buchtitel basieren.
fr: Si cette option est activée, le nom du fichier html à l'intérieur du htmlz sera basé sur le titre du livre.

source: LIT Output Options
de: LIT-Ausgabeoptionen
fr: Options de sortie LIT

source: LRF Output Options
de: LRF-Ausgabeoptionen
fr: Options de sortie LRF

source: Enable autorotation of images that are wider than the screen width.
de: Automatische Rotation von Bildern, die breiter als die Bildschirmbreite sind, einschalten.
fr: Activer l’autorotation des images plus larges que la largeur de l’écran.

source: Add a header to all the pages with title and author.
de: Kopfzeile mit Titel und Autor für alle Seiten einfügen.
fr: Ajouter un en-tête à toutes les pages avec le titre et l’auteur.

source: Set the format of the header. %a is replaced by the author and %t by the title. Default is %t by %a
de: Wählen Sie das Format der Kopfzeile. %a wird durch den Autor und %t durch den Titel ersetzt. Die Voreinstellung ist %t von %a
fr: Définit le format de l’en-tête de page. %a est remplacé par l’auteur et %t par le titre. Par défaut : %t par %a

source: Add extra spacing below the header. Default is 0 pt.
de: Zusätzlichen Abstand unter der Überschrift hinzufügen. Voreinstellung ist 0 pt.
fr: Ajouter un interligne supplémentaire sous l’en-tête. Par défaut: 0 pt.

source: Minimum paragraph indent (the indent of the first line of a paragraph) in pts. Default: 0
de: Mindest-Zeileneinzug von Absätzen (Zeileneinzug der ersten Zeile eines Absatzes) in pts. Voreinstellung: 0
fr: Indentation minimum du paragraphe (l’indentation de la première ligne d’un paragraphe) en pts. Par défaut : 0

source: The monospace family of fonts to embed
de: Nichtproportionale Schriftartfamilie einbetten
fr: La famille de police monospace à inclure

source: Render tables in the HTML as images (useful if the document has large or complex tables)
de: Tabellen in HTML als Bilder rendern (hilfreich, wenn das Dokument große oder komplexe Tabellen enthält)
fr: Convertir les tableaux dans le HTML en images (utile si le document a des tableaux larges ou complexes)

source: The sans-serif family of fonts to embed
de: Serifenlose Schriftartfamilie einbetten
fr: La famille de police sans-serif à inclure

source: The serif family of fonts to embed
de: Serife Schriftartfamilie einbetten
fr: La famille de police serif à inclure

source: Multiply the size of text in rendered tables by this factor. Default is 1.0
de: Textgröße in gerenderten Tabellen um diesen Faktor erhöhen. Voreinstellung ist 1.0
fr: Multiplie la taille du texte des tableaux convertis par ce facteur. Valeur par défaut: 1.0

source: Set the space between words in pts. Default is 2.5
de: Wählen Sie den Abstand in pts zwischen einzelnen Wörtern. Die Voreinstellung ist 2.5
fr: Définit les espaces entre les mots en pts. Par défaut: 2.5

source: MOBI Output Options
de: MOBI-Ausgabeoptionen
fr: Options de sortie MOBI

source: By default calibre generates MOBI files that contain the old MOBI 6 format. This format is compatible with all devices. However, by changing this setting, you can tell calibre to generate MOBI files that contain both MOBI 6 and the new KF8 format, or only the new KF8 format. KF8 has more features than MOBI 6, but only works with newer Kindles.
de: Standardmäßig erzeugt Calibre MOBI Dateien im alten MOBI 6 Format. Dieses Format ist mit allen Geräten kompatibel. Wenn Sie allerdings diese EInstellung ändern, können Sie Calibre dazu veranlassen, MOBI-Dateien zu erzeugen, die sowohl das MOBI 6, als auch das neue KF8 Format enthalten, oder nur das neue KF8 Format. KF8 bietet mehr Features als MOBI 6, aber funktioniert nur mit neueren Kindles.
fr: Par défaut calibre génères des fichiers MOBI qui contiennent l'ancien format MOBI 6. Ce format est compatible avec tous les périphériques. Néanmoins, en changeant les paramètres, vous pouvez demander à calibre de générer des fichiers MOBI qui contiennent à la fois du MOBI 6 et le nouveau format KF8, ou seulement le nouveau format KF8. Le KF8 offre plus de fonctionnalités que le MOBI 6, mais il ne fonctionne qu'avec les nouveaux Kindle.

source: Ignore margins in the input document. If False, then the MOBI output plugin will try to convert margins specified in the input document, otherwise it will ignore them.
de: Ignoriere die Seitenränder des Quelldokumentes. Wenn False, dann wird das MOBI Ausgabe Plugin versuchen, die gegebenen Seitenränder zu konvertieren. Andernfalls werden sie ignoriert.
fr: Ignorer les marges dans le document d’entrée. Si cette valeur est fausse, alors le module d’extension de sortie MOBI va tenter de convertir les marges spécifiées dans le document d’entrée, sinon il va les ignorer.

source: By default calibre converts all images to JPEG format in the output MOBI file. This is for maximum compatibility as some older MOBI viewers have problems with other image formats. This option tells calibre not to do this. Useful if your document contains lots of GIF/PNG images that become very large when converted to JPEG.
de: Calibre wandelt alle Bilder in einer MOBI-Ausgabedatei standardmäßig in das JPEG-Format um. Das sorgt für eine maximale Kompatibilität, da einige ältere MOBI-Leser Probleme mit anderen Bildformaten haben. Diese Option wird hiermit deaktiviert. Das ist nützlich, wenn die Dokomente viele GIF/PNG-Bilder enthalten, die bei der Umwandlung in das JPEG-Format sehr groß werden.
fr: Par défaut calibre convertit toutes les images au format JPEG dans le fichier de sortie MOBI. C'est pour une compatibilité maximale car certains anciennes visionneuses MOBI ont des problèmes avec d'autres formats d'image. Cette option indique à calibre de ne pas le faire. Elle est utile si votre document contient beaucoup d'images GIF / PNG qui deviennent alors très grandes lors de la conversion au format JPEG
