Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: For full documentation of the conversion system see :ref:`conversion`
de: Für eine vollständige Dokumentation des Konvertierungssystems siehe :ref:`conversion`
fr: Pour la documentation complète du système de conversion voir :ref:`conversion`

source: Whenever you pass arguments to :command:`ebook-convert` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`ebook-convert` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`ebook-convert` qui comportent des espaces, mettez ces arguments entre guillemets.

source: The options and default values for the options change depending on both the input and output formats, so you should always check with::
de: Die Optionen und Standardwerte für die Optionen ändern sich je nach dem gewählten Ein- und Ausgabeformat. Überprüfen Sie deshalb diese immer mit nachfolgendem Befehl::
fr: Les options et les valeurs par défaut pour les options changent selon les formats d'entrée et sortie, ainsi vous devriez toujours vérifier avec : :

source: Below are the options that are common to all conversion, followed by the options specific to every input and output format
de: Nachfolgend sind die Optionen beschrieben, die für alle Konvertierungen gleich sind, gefolgt von den spezifischen Optionen zu jedem Input- und Output-Format.
fr: Ci-dessous se trouvent les options qui sont communes à toute conversion, suivies des options spécifiques à chaque format d'entrée et de sortie

source: Specify the input profile. The input profile gives the conversion system information on how to interpret various information in the input document. For example resolution dependent lengths (i.e. lengths in pixels). Choices are:cybookg3, cybook_opus, default, hanlinv3, hanlinv5, illiad, irexdr1000, irexdr800, kindle, msreader, mobipocket, nook, sony, sony300, sony900
de: Definiert das Eingabe-Profil. Das Eingabe-Profil beschreibt dem Konvertierungssystem, wie die verschiedenen Informationen aus dem Eingabe-Dokument zu interpretieren sind. Zum Beispiel auflösungsabhängige Längen (z. B. Längen in Pixel). Wählbar ist::cybookg3, cybook_opus, default, hanlinv3, hanlinv5, illiad, irexdr1000, irexdr800, kindle, msreader, mobipocket, nook, sony, sony300, sony900
fr: Spécifier le profil d’entrée. Ce profil d’entrée indique au système de conversion comment interpréter les diverses informations dans le document d’entrée. Par exemple, la résolution dépend des longueurs. (c.-à-d. longueurs en pixels). Les choix sont : cybookg3, cybook_opus, default, hanlinv3, hanlinv5, illiad, irexdr1000, irexdr800, kindle, msreader, mobipocket, nook, sony, sony300, sony900

source: List builtin recipe names. You can create an ebook from a builtin recipe like this: ebook-convert "Recipe Name.recipe" output.epub
de: Anzeigen der Namen der vorinstallierten Nachrichtenquellen. Sie können aus einer vorinstallierten Quelle ein eBook wie folgt erstellen: ebook-convert "Recipe Name.recipe" output.epub
fr: Liste les noms des recettes intégrées. Vous pouvez créer un livre numérique depuis une recette intégrée de la manière suivante : ebook-convert "Nom Recette.recipe" sortie.epub

source: Specify the output profile. The output profile tells the conversion system how to optimize the created document for the specified device. In some cases, an output profile can be used to optimize the output for a particular device, but this is rarely necessary. Choices are:cybookg3, cybook_opus, default, generic_eink, generic_eink_large, hanlinv3, hanlinv5, illiad, ipad, ipad3, irexdr1000, irexdr800, jetbook5, kindle, kindle_dx, kindle_fire, kindle_pw, kobo, msreader, mobipocket, nook, nook_color, nook_hd_plus, pocketbook_900, pocketbook_pro_912, galaxy, bambook, sony, sony300, sony900, sony-landscape, sonyt3, tablet
de: Definiert das Ausgabeprofil. Das Ausgabeprofil beschreibt dem Konvertierungssystem, wie das zu erstellende Dokument für das angegebene Gerät zu optimieren ist. In einigen Fällen kann ein Ausgabeprofil dazu verwendet werden, um die Ausgabe für ein bestimmtes Gerät zu optimieren, dies ist jedoch nur selten notwendig. Zur Auswahl stehen: cybookg3, cybook_opus, default, generic_eink, generic_eink_large, hanlinv3, hanlinv5, illiad, ipad, ipad3, irexdr1000, irexdr800, jetbook5, kindle, kindle_dx, kindle_fire, kindle_pw, kobo, msreader, mobipocket, nook, nook_color, nook_hd_plus, pocketbook_900, pocketbook_pro_912, galaxy, bambook, sony, sony300, sony900, sony-landscape, sonyt3, tablet
fr: Spécifiez le profil de sortie. Le profil de sortie indique au système de conversion comment optimiser le document créé pour le dispositif spécifié. Dans certains cas, un profil de sortie peut être utilisé pour optimiser la sortie pour un dispositif particulier, mais c'est rarement nécessaire. Les choix sont : cybookg3, cybook_opus, default, generic_eink, generic_eink_large, hanlinv3, hanlinv5, illiad, ipad, ipad3, irexdr1000, irexdr800, jetbook5, kindle, kindle_dx, kindle_fire, kindle_pw, kobo, msreader, mobipocket, nook, nook_color, nook_hd_plus, pocketbook_900, pocketbook_pro_912, galaxy, bambook, sony, sony300, sony900, sony-landscape, sonyt3, tablette

source: Look And Feel
de: Layout
fr: Apparence et Présentation

source: Options to control the look and feel of the output
de: Einstellungen zur Steuerung des Layouts der Ausgabe
fr: Options pour contrôler l’apparence de la sortie

source: Transliterate unicode characters to an ASCII representation. Use with care because this will replace unicode characters with ASCII. For instance it will replace "Михаил Горбачёв" with "Mikhail Gorbachiov". Also, note that in cases where there are multiple representations of a character (characters shared by Chinese and Japanese for instance) the representation based on the current calibre interface language will be used.
de: Setzt Unicode-Schriftzeichen in ASCII um. Benutzen Sie dies mit Vorsicht, da es Unicode-Zeichen durch ASCII ersetzen wird. Beispielsweise wird "Михаил Горбачёв" durch "Mikhail Gorbachiov" ersetzt. Beachten sie auch, dass in Fällen, in denen mehrere Umsetzungen eines Zeichens möglich sind (beispielsweise in Zeichen, die im Japanischen und Chinesischen gemeinsam verwendet werden), die Umsetzung verwendet wird, die der eingestellten Oberflächensprache von Calibre entspricht.
fr: Transcrire les caractères unicode en représentation ASCII. A utiliser avec précaution car cela remplacera les caractères unicode par de l’ASCII. Par exemple cela remplacera "Михаил Горбачёв" par "Mikhail Gorbachiov". Notez également que dans les cas où il y a plusieurs représentations d’un caractère (caractères communs au chinois et au japonais par exemple), c’est la représentation basée sur la langue de l’interface de votre calibre qui sera utilisée.

source: The base font size in pts. All font sizes in the produced book will be rescaled based on this size. By choosing a larger size you can make the fonts in the output bigger and vice versa. By default, the base font size is chosen based on the output profile you chose.
de: Die Bezugsschriftgröße in pts. Alle Schriftgrößen im erstellten E-Book werden basierend auf dieser Größe skaliert. Mit einer größeren Schriftgröße erhalten Sie eine größere Schrift in der Ausgabe und umgekehrt. Laut Voreinstellung basiert die Bezugsschriftgröße auf dem gewählten Ausgabe-Profil.
fr: La taille de base pour la police de caractère en pts. Toutes les tailles de police dans le livre produit seront redimensionnées par rapport à cette taille. En choisissant une taille large, vous pouvez obtenir des polices plus grandes en sortie et vice versa. Par défaut, la taille de base pour la police est choisie par rapport au profil de sortie que vous avez choisi.

source: Change text justification. A value of "left" converts all justified text in the source to left aligned (i.e. unjustified) text. A value of "justify" converts all unjustified text to justified. A value of "original" (the default) does not change justification in the source file. Note that only some output formats support justification.
de: Ändern der Textausrichtung. Die Angabe "Links" ändert den gesamten Blocksatz der Quelle zu Links ausgerichtet. Die Angabe "Blocksatz" ändert die Ausrichtung zu Blocksatz. Und die Angabe "Original" (Voreinstellung) ändert die Ausrichtung gegenüber der Quelldatei nicht. Beachten Sie, dass nicht alle Ausgabeformate die Textausrichtung unterstützen .
fr: Changer la justification du texte. Une valeur à "left" convertit tout le texte justifié dans la source vers un alignement de texte à gauche (c.à.d non justifié). Une valeur à "justify" convertit le texte non justifié en justifié. Une valeur à "original" (par défaut) ne change pas la justification du fichier source. Noter que seuls certains formats prennent en charge la justification.

source: Disable all rescaling of font sizes.
de: Skalierung von Schriftgrößen ausschalten.
fr: Désactiver tous les redimensionnements des tailles de polices.

source: Embed every font that is referenced in the input document but not already embedded. This will search your system for the fonts, and if found, they will be embedded. Embedding will only work if the format you are converting to supports embedded fonts, such as EPUB, AZW3 or PDF. Please ensure that you have the proper license for embedding the fonts used in this document.
de: Alle Schriftarten einbetten, die im Eingabe-Dokument referenziert, aber bisher noch nicht eingebunden sind. Hierbei werden Schriften auf Ihrem System gesucht und eingebettet, wenn sie gefunden werden. Einbettungen werden nur funktionieren, wenn das Zielformat diese Schriftarten unterstützt, wie es bei EPUB, AZW3 oder PDF der Fall ist. Bitte stellen SIe sicher, dass Sie über die richtige Lizenz für die Einbettung dieser Schriftarten verfügen.
fr: Incorporer toutes les polices qui sont référencées dans le document mais pas encore intégrées. Une recherche sera effectuée sur votre ordinateur et si les polices sont retrouvées, elles seront intégrées dans le document. Veuillez vous assurer que vous possédez la licence appropriée pour incorporer les polices utilisées dans ce document.

source: Embed the specified font family into the book. This specifies the "base" font used for the book. If the input document specifies its own fonts, they may override this base font. You can use the filter style information option to remove fonts from the input document. Note that font embedding only works with some output formats, principally EPUB and AZW3.
de: Die angegebene Schriftfamilie in das Buch einbetten. Dadurch wird die »Basisschrift« festgelegt, die für das Buch verwendet wird. Falls das Eingangsdokument seine eigenen Schriften bestimmt, können diese die Basisschrift überschreiben. Sie können Stilangaben filtern, um Schriften aus dem Eingangsdokument zu entfernen. Beachten Sie, dass das Einbetten von Schriften nur mit einigen Ausgabeformaten funktioniert; prinzipiell sind das die Formate EPUB und AZW3.
fr: Inclut la famille de polices spécifiée dans le livre. Ceci précise la police de "base" utilisée pour le livre. Si le document d'entrée spécifie ses propres polices, elles peuvent primer sur la police de "base". Vous pouvez utilisez l'option de filtre de style pour enlever les polices du document d'entrée. Notez que l'inclusion de polices fonctionne seulement avec certains formats de sortie, principalement l'EPUB et l'AZW3.

source: By default, calibre will use the shorthand form for various css properties such as margin, padding, border, etc. This option will cause it to use the full expanded form instead. Note that CSS is always expanded when generating EPUB files with the output profile set to one of the Nook profiles as the Nook cannot handle shorthand CSS.
de: Standardmäßig wird Calibre die Kurzform bei verschiedenen CSS Eigenschaften wie margin, padding, border, usw. verwenden. Diese Option wird stattdessen die Verwendung der ungekürzte Form aktivieren. Beachten Sie, dass CSS immer erweitert wird, wenn EPUB Dateien generiert werden, bei denen das Ausgabeprofil auf eines der Nook Profile eingestellt ist, da der Nook verkürztes CSS nicht verarbeiten kann.
fr: Par défaut, calibre va utiliser la forme abrégée des diverses propriétés CSS comme les marges, les bordures, etc. Cette option permet d'utiliser la forme étendue à la place. Notez que le CSS sera toujours sous sa forme étendue lors de la génération de fichiers EPUB avec le profil de sortie définit pour Nook car le Nook ne sait pas gérer la forme abrégée du CSS.

source: Either the path to a CSS stylesheet or raw CSS. This CSS will be appended to the style rules from the source file, so it can be used to override those rules.
de: Entweder der Pfad zu einem CSS-Stylesheet oder Original-CSS. Dieses CSS wird an die Stilregeln der Ursprungsdatei angehängt, so dass es zum Überschreiben dieser Regeln verwendet werden kann.
fr: Soit le chemin d’une feuille de style CSS ou un CSS brut. Ce CSS sera ajouté aux règles de style du fichier source, ainsi il pourra être utilisé pour surcharger ces règles.

source: A comma separated list of CSS properties that will be removed from all CSS style rules. This is useful if the presence of some style information prevents it from being overridden on your device. For example: font-family,color,margin-left,margin-right
de: Eine durch Kommata getrennte Liste aller CSS-Eigenschaften die aus der CSS-Stilvorlage entfernt werden. Diese Liste ist sinnvoll, falls bestimmte Eigenschaften das Übertragen auf Ihr Gerät unmöglich machen. Beispiele hierfür sind: font-family (Schriftart), color (Farbe), margin-left (Randbreite rechts), margin-right (Randbreite links)
fr: Une liste de propriétés CSS, séparées par des virgules, qui seront supprimées de toutes les règles de style CSS. Utile si la présence de certaines informations de style les empêche d’être ignorées par votre appareil. Par exemple: font-family,color,margin-left,margin-right

source: Mapping from CSS font names to font sizes in pts. An example setting is 12,12,14,16,18,20,22,24. These are the mappings for the sizes xx-small to xx-large, with the final size being for huge fonts. The font rescaling algorithm uses these sizes to intelligently rescale fonts. The default is to use a mapping based on the output profile you chose.
de: Zuordnung von CSS Schriftnamen zu Schriftgrößen in pts. Eine Beispieleinstellung ist 12,12,14,16,18,20,22,24. Dies sind die Zuordnungen für die Größen xx-small bis xx-large mit der letzten Größe für riesige Schriften. Der Schriftskalierungs-Algorithmus verwendet diese Größen für die intelligente Skalierung von Schriften. Voreinstellung ist die Verwendung einer Zuordnung auf der Grundlage des gewählten Ausgabe-Profils.
fr: Correspondance à partir de noms de police CSS vers des tailles de polices en pts. Un exemple de paramétrage est : 12,12,14,16,18,20,22,24. Ce sont les correspondances pour les tailles de xx-small à xx-large, la taille finale est utilisée pour les très grandes polices. Le redimensionnement de la police utilise ces tailles pour redimensionner intelligemment les polices. Le comportement par défaut est d’utiliser une correspondance basée sur le profil de sortie que vous avez choisis.

source: Insert a blank line between paragraphs. Will not work if the source file does not use paragraphs (<p> or <div> tags).
de: Leerzeile zwischen Absätzen einfügen. Funktioniert nur, wenn die Quelldatei Absätze verwendet (<p> oder <div> Tags).
fr: Insérer une ligne blanche entre les paragraphes. Ne fonctionnera pas si le fichier source n’utilise pas de paragraphes. (balises <p> ou <div>)

source: Set the height of the inserted blank lines (in em). The height of the lines between paragraphs will be twice the value set here.
de: Setzt die Höhe der eingefügten Leerzeilen (in em). Die Höhe der Zeilen zwischen den Absätzen wird das Doppelte des hier gesetzten Wertes betragen.
fr: Définit la hauteur des lignes blanches insérées (en em). La hauteur des lignes entre deux paragraphes fera le double de la valeur spécifiée ici.

source: Preserve ligatures present in the input document. A ligature is a special rendering of a pair of characters like ff, fi, fl et cetera. Most readers do not have support for ligatures in their default fonts, so they are unlikely to render correctly. By default, calibre will turn a ligature into the corresponding pair of normal characters. This option will preserve them instead.
de: Ligaturen im Eingabe-Dokument erhalten. Eine Ligatur ist eine besondere Form von einem Zeichenpaar wie ff, fi, fl, usw. Die meisten Lesegeräte haben keine Unterstützung für Ligaturen in ihren Standard-Schriftarten, so dass Sie sie kaum korrekt wiedergeben. Standardmäßig wird Calibre eine Ligatur in das entsprechende normale Zeichenpaar verwandeln. Diese Einstellung ist dazu da, sie stattdessen zu erhalten.
fr: Conserver les ligatures présentes dans le document d’entrée. Une ligature est d’une paire de caractères comme ff, fi, fl, œ, æ et cætera. La plupart des polices par défaut des lecteurs ne prennent pas en charge les ligatures, aussi un rendu correct de celles-ci semble improbable sur le lecteur. Par défaut, calibre va transformer une ligature en la paire de caractères correspondants. A l’opposé, cette option va conserver la ligature.

source: The line height in pts. Controls spacing between consecutive lines of text. Only applies to elements that do not define their own line height. In most cases, the minimum line height option is more useful. By default no line height manipulation is performed.
de: Die Zeilenhöhe in pts. Steuert den Abstand zwischen aufeinander folgenden Zeilen Text. Gilt nur für Elemente, welche Ihre eigene Zeilenhöhe nicht selber festlegen. In den meisten Fällen ist das setzen der minimalen Zeilenhöhe besser. Standardmäßig wird keine Änderung der Zeilenhöhe durchgeführt.
fr: La hauteur de ligne en pts. Contrôle l’espacement entre les lignes consécutives du texte. Ne s’applique qu’aux éléments qui ne définissent pas leur propre hauteur de ligne. Dans la plupart des cas, l’option hauteur de ligne minimum est plus utile. Par défaut, aucune modification de hauteur de ligne n’est effectuée.

source: Some badly designed documents use tables to control the layout of text on the page. When converted these documents often have text that runs off the page and other artifacts. This option will extract the content from the tables and present it in a linear fashion.
de: Einige schlecht gestaltete Dokumente verwenden Tabellen für das Layout des Textes auf der Seite. Bei der Konvertierung entstehen dann häufig unvollständige Textstellen und andere Artefakte. Diese Einstellung extrahiert den Inhalt von Tabellen und gibt ihn linear wieder.
fr: Certains documents mal conçus utilisent les tableaux pour contrôler l’affichage du texte dans la page. Convertis, ces documents ont souvent le texte qui déborde de la page et d’autres dysfonctionnements. Cette option extraira le contenu des tableaux et le présentera dans un mode linéaire.

source: Set the bottom margin in pts. Default is 5.0. Setting this to less than zero will cause no margin to be set (the margin setting in the original document will be preserved). Note: 72 pts equals 1 inch
de: Festlegen des unteren Randes in pts. Standard ist 5.0. Durch das setzen auf Null wird kein Rand erzeugt (die Randeinstellungen im Originaldokument bleiben erhalten). Anmerkung: 72 pts sind gleich 1 Inch gleich 2.54cm
fr: Règle la marge basse en pts. Le réglage par défaut est %default. Aucune marge ne sera définie si le nombre est inférieur à zéro (le réglage des marges dans le document d'origine est préservé). Note: 72 pts égalent 2,54 cm.

source: Set the left margin in pts. Default is 5.0. Setting this to less than zero will cause no margin to be set (the margin setting in the original document will be preserved). Note: 72 pts equals 1 inch
de: Festlegen des linken Randes in pts. Standard ist 5.0. Durch das setzen auf Null wird kein Rand erzeugt (die Randeinstellungen im Originaldokument bleiben erhalten). Anmerkung: 72 pts sind gleich 1 Inch gleich 2.54cm
fr: Règle la marge gauche en pts. Réglage par défaut est 5.0. Aucune marge ne sera définie si le nombre est inférieur à zéro (le réglage des marges dans le document d'origine est préservé). Note: 72 pts égalent 2,54 cm.

source: Set the right margin in pts. Default is 5.0. Setting this to less than zero will cause no margin to be set (the margin setting in the original document will be preserved). Note: 72 pts equals 1 inch
de: Festlegen des rechten Randes in pts. Standard ist 5.0. Durch das setzen auf Null wird kein Rand erzeugt (die Randeinstellungen im Originaldokument bleiben erhalten). Anmerkung: 72 pts sind gleich 1 Inch gleich 2.54cm
fr: Règle la marge droite en pts. Réglage par défaut est 5.0. Régler cela à moins de zéro entraînera qu'aucune marge ne sera définie (le réglage des marges dans le document d'origine est préservé). Note: 72 pts égalent 2,54 cm.

source: Set the top margin in pts. Default is 5.0. Setting this to less than zero will cause no margin to be set (the margin setting in the original document will be preserved). Note: 72 pts equals 1 inch
de: Festlegen des oberen Randes in pts. Standard ist 5.0. Durch das setzen auf Null wird kein Rand erzeugt (die Randeinstellungen im Originaldokument bleiben erhalten). Anmerkung: 72 pts sind gleich 1 Inch gleich 2.54cm
fr: Règle la marge haute en pts. Réglage par défaut est 5.0. Aucune marge ne sera définie si le nombre est inférieur à zéro (le réglage des marges dans le document d'origine est préservé). Note: 72 pts égalent 2,54 cm.

source: The minimum line height, as a percentage of the element's calculated font size. calibre will ensure that every element has a line height of at least this setting, irrespective of what the input document specifies. Set to zero to disable. Default is 120%. Use this setting in preference to the direct line height specification, unless you know what you are doing. For example, you can achieve "double spaced" text by setting this to 240.
de: Die minimale Zeilenhöhe, ausgedrückt als Prozentsatz der berechneten Schriftgröße des Elementes. Calibre wird sicherstellen, dass jedes Element diese eingestellte Mindesthöhe hat, unabhängig von der Vorlage. Zum deaktivieren null einsetzen. Standard ist 120%. Benutzen Sie dieses Feld zum Einstellen der Zeilenhöhe wenn Sie wissen was Sie tun. Zum Beispiel können Sie einen zweizeiligen Text erreichen, wenn Sie den Wert auf 240 setzten.
fr: La hauteur de ligne minimum, en pourcentage de la taille de la police de l’élément. calibre s’assurera que chaque élément a une hauteur de ligne correspondant au moins à cette valeur, quelle que soit la spécification du document d’entrée. Fixer à 0 pour désactiver. Par défaut 120%. Utiliser cette option préférentiellement à une spécification de ligne directe, à moins de savoir ce que vous faites. Par exemple, vous pouvez obtenir un texte en "double interligne" en fixant cette valeur à 240%.

source: Remove spacing between paragraphs. Also sets an indent on paragraphs of 1.5em. Spacing removal will not work if the source file does not use paragraphs (<p> or <div> tags).
de: Abstand zwischen Absätzen entfernen. Fügt einen Zeileneinzug bei Absätzen von 1,5 em ein. Die Entfernung des Abstands funktioniert nur bei Quelldateien, die Absätze verwenden (<p> oder <div> Tags).
fr: Supprimer l’interligne entre les paragraphes. Positionne aussi une indentation sur les paragraphes de 1.5em. La suppression de l’interligne ne fonctionnera pas si le fichier source n’utilise pas les paragraphes (balises<p> or <div>).
