Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: Launch the main :command:`calibre` Graphical User Interface and optionally add the ebook at path_to_ebook to the database.
de: Startet die Grafische Benutzeroberfläche von :command:`calibre` fügt optional ein eBook der Datenbank im Verzeichnis path_to_ebook hinzu.
fr: Lancer l'Interface Graphique Utilisateur Principale :command:`calibre` et optionnellement ajouter le livre a path_to_ebook à la base de données.

source: Whenever you pass arguments to :command:`calibre` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`calibre` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`calibre` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Detach from the controlling terminal, if any (linux only)
de: Trennt Calibre vom Terminal-Fenster ab, falls vorhanden (nur für Linux)
fr: Détacher du terminal, s'il y en a un (linux uniquement)

source: show this help message and exit
de: Zeigt diesen Hilfetext an und beendet die Ausführung
fr: affiche ce message d'aide et quitte

source: Ignore custom plugins, useful if you installed a plugin that is preventing calibre from starting
de: Benutzerdefinierte Plugins ignorieren. Nützlich, wenn Sie eine Plugin installiert haben, das Calibre am Starten hindert
fr: Ignorer les extensions personnalisées, utile si vous installez une extension qui empêche calibre de démarrer.

source: Do not check for updates
de: Nicht nach neuen Versionen suchen
fr: Ne pas vérifier les mises à jour

source: Cause a running calibre instance, if any, to be shutdown. Note that if there are running jobs, they will be silently aborted, so use with care.
de: Erzwingt das Ende einer eventuell laufenden Instanz von Calibre. Unbedingt beachten: Eventuell laufende Aufträge werden ohne Nachfrage beendet.
fr: Provoque la fermeture de la session de calibre en cours (si elle existe). Remarquez que s’il y a des tâches en cours, elles seront annulées sur le champ. À utiliser avec prudence.

source: Start minimized to system tray.
de: Minimiert im Systembereich der Kontrollleiste starten.
fr: Démarrer en mode minimisé dans la zone de notification.

source: Ignored, do not use. Present only for legacy reasons
de: Ignoriert, bitte nicht verwenden. Nur wegen Altsystemen vorhanden
fr: Ignoré, ne pas utilser. Présent uniquement pour d'anciennes raisons

source: show program's version number and exit
de: Programmversion anzeigen und beenden
fr: affiche le numéro de version du logiciel et quitte

source: Use the library located at the specified path.
de: Verwende die Bibliothek unter dem angegebenen Pfad.
fr: Utiliser la bibliothèque présente dans le répertoire spécifié.

source: calibre-customize
fr: calibre-personnaliser

source: Customize calibre by loading external plugins.
de: Calibre durch das Laden externer Plugins anpassen.
fr: Personnaliser calibre en chargeant des extensions tierces.

source: Whenever you pass arguments to :command:`calibre-customize` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`calibre-customize` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`calibre-customize` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Add a plugin by specifying the path to the zip file containing it.
de: Hinzufügen eines Plugins durch die Angabe des Pfads zur ZIP-Datei, die das Plugin enthält.
fr: Ajouter une extension en précisant le chemin de l'archive zip qui la contient.

source: For plugin developers: Path to the directory where you are developing the plugin. This command will automatically zip up the plugin and update it in calibre.
de: Für Plugin Entwickler: Pfad zu dem Verzeichnis, in dem Sie das Plugin entwickeln. Dieser Befehl wird das Plugin automatisch als Zip-Archiv packen und in Calibre aktualisieren.
fr: Pour les développeurs de plugin: chemin vers le répertoire où vous développez le plugin. Cette commande va automatiquement compresser le plugin et le mettre à jour dans calibre.

source: Customize plugin. Specify name of plugin and customization string separated by a comma.
de: Plugin anpassen. Geben Sie den Namen des Pugins und die Anpassung durch ein Komma getrennt an.
fr: Personnaliser l'extension. Spécifier le nom de l’extension et la chaîne de personnalisation en les séparant par une virgule.

source: Disable the named plugin
de: Das genannte Plugin deaktivieren
fr: Désactiver l’extension nommée

source: Enable the named plugin
de: Das genannte Plugin aktivieren
fr: Activer l’extension nommée

source: List all installed plugins
de: Installierte Plugins auflisten
fr: Lister toutes les extensions installées

source: Remove a custom plugin by name. Has no effect on builtin plugins
de: Entfernt ein benutzerdefiniertes Plugin mit Namen. Dies hat keinen Einfluss auf fest installierte Plugins
fr: Supprimer une extension personnalisée d’après son nom. Ceci n’a pas d’effet sur les extensions intégrées

source: calibre-debug
fr: calibre-dépanner

source: Various command line interfaces useful for debugging calibre. With no options, this command starts an embedded python interpreter. You can also run the main calibre GUI, the calibre viewer and the calibre editor in debug mode.
de: Verschiedene nützliche Kommandozeilen-Interfaces zum Debuggen von Calibre. Dieser Befehl startet ohne Optionen den eingebetteten Python-Interpreter. Sie können auch die Calibre GUI, den eBook-Betrachter und den eBook-Editor im Debugmodus ausführen.
fr: Diverses interfaces en ligne de commande utiles pour corriger calibre. Sans options, cette commande met en marche un interprète incorporé de python. Vous pouvez également exécuter le GUI principal de calibre, la visionneuse de calibre et l'éditeur de calibre en mode dépannage.

source: It also contains interfaces to various bits of calibre that do not have dedicated command line tools, such as font subsetting, the ebook diff tool and so on.
de: Es enthält auch Schnittstellen zu verschiedenen Teilen von Calibre, die nicht über dedizierte Kommandozeilen-Tools verfügen, z. B. die Erstellung von Schriftart-Teilmengen, den Buchvergleich und so weiter.
fr: Il contient également des interfaces pour divers éléments de calibre qui n'ont pas d'outils en ligne de commande consacrés, tels que le sous ensemble de police, l'outil de diff d'e-livre et ainsi de suite.

source: You can also use :command:`calibre-debug` to run standalone scripts. To do that use it like this:
de: Sie können :command:`calibre-debug` auch benutzen um standalone scripts auszuführen. Dazu verwenden Sie es so:
fr: Vous pouvez aussi utiliser :command:`calibre-debug` pour exécuter des scripts indépendants. Pour faire cela, utilisez la comme ceci :

source: :command:`calibre-debug` myscript.py ``--`` :option:`--option1` :option:`--option2` file1 file2 ...
fr: :command:`calibre-debug` myscript.py ``--`` :option:`--option1` :option:`--option2` fichier1 fichier2 ...

source: Everything after the ``--`` is passed to the script.
de: Alles nach ``--`` wird an das Skript übergeben.
fr: Tout ce qui se trouve après ``--`` est transmis au script.

source: Whenever you pass arguments to :command:`calibre-debug` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`calibre-debug` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`calibre-debug` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Add a simple plugin (i.e. a plugin that consists of only a .py file), by specifying the path to the py file containing the plugin code.
de: Hinzufügen eines einfachen Plugins (d. h. ein Plugin, welches nur aus einer *.py-Datei besteht), indem der Pfad zur *.py-Datei des Plugin-Codes angeben wird.
fr: Ajouter une extension simple (par ex. une extension qui consiste en un unique fichier .py), en spécifiant le chemin vers le fichier py qui contient le code de l'extension.

source: Run python code.
de: Python-Code ausführen.
fr: Exécuter du code python.

source: Debug device detection
de: Fehlerdiagnose bei der Geräteerkennung
fr: Déboguer la détection de l’appareil

source: Run the calibre diff tool. For example: calibre-debug :option:`--diff` file1 file2
de: Startet das Werkzeug Calibre Dateivergleich. Beispiel: calibre-debug :option:`--diff` Datei1 Datei2
fr: Exécuter l'outil calibre diff. Par exemple : calibre-debug :option:`--diff` fichier1 fichier2

source: Launch the calibre Edit Book tool in debug mode.
de: Startet den Buch Editor im Debug-Modus.
fr: Lancez l’Éditeur de Livre calibre en mode dépannage

source: Run the python code in file.
de: Den Python-Code in der Datei ausführen.
fr: Exécuter le code python dans le fichier

source: Explode the book (exports the book as a collection of HTML files and metadata, which you can edit using standard HTML editing tools, and then rebuilds the file from the edited HTML. Makes no additional changes to the HTML, unlike a full calibre conversion).
de: Zerlegt ein Buch (exportiert das Buch als eine Sammlung von HTML-Dateien und Metadaten, die mit Standard-HTML Editor-Werkzeugen bearbeitet werden können. Danach wird die Datei aus dem bearbeiteten HTML neu erstellt. Erzeugt, im Gegensatz zu einer vollständigen Calibre-Konvertierung, keine weiteren Änderungen am HTML-Code).
fr: Décompacte le livre (exporte le livre comme une collection de fichiers HTML et de métadonnées, qui peuvent être édités en utilisant des outils standards d'édition d'HTML, et ensuite reconstruire le fichier depuis les fichiers HTML édités. Ne fait aucun changement additionnel à l'HTML, contrairement à une conversion complète par calibre).

source: Run the GUI with debugging enabled. Debug output is printed to stdout and stderr.
de: Startet die GUI mit aktiviertem Debugging. Die Debug Ausgabe wird an Stdout und Stderr ausgegeben.
fr: Exécute le GUI avec le dépannage activé. La sortie de dépannage est inscrite dans stdout et stderr.

source: Run the GUI with a debug console, logging to the specified path. For internal use only, use the -g option to run the GUI in debug mode
de: Startet die GUI mit einer Debug-Konsole und Protokollierung im angegebenen Verzeichnis. Nur zur internen Verwendung. Verwenden Sie die Option -g um die GUI im Debug-Modus auszuführen
fr: Exécute le GUI avec une console de dépannage, enregistré à l'emplacement spécifié. Pour usage interne uniquement, utiliser l'option -g pour exécuter le GUI en mode dépannage.

source: Inspect the MOBI file(s) at the specified path(s)
de: Untersucht MOBI-Datei(en) im angegebenen Verzeichniss(en)
fr: Inspecte le(s) fichier(s) MOBI à/aux (l') emplacement(s) spécifié(s)

source: Output the paths necessary to setup the calibre environment
de: Gibt Verzeichnispfade aus. Notwendig, um Calibre Umgebungsvariablen einzurichten
fr: Sort les emplacements nécessaires pour configurer l'environnement de calibre

source: Run python console
de: Python-Konsole ausführen
fr: Exécuter une console python

source: Re-initialize the sqlite calibre database at the specified path. Useful to recover from db corruption.
de: Neuinitialisierung der Sqlite Calibre-Datenbank. Im angegebenen Verzeichnis. Hilfreich zur Wiederherstellung einer defekten Datenbank.
fr: Réinitialise la base de données sqlite de calibre à l'emplacement spécifié. Utile pour récupérer une base de données corrompue.

source: Run a plugin that provides a command line interface. For example: calibre-debug -r "Add Books" ``--`` file1 :option:`--option1` Everything after the ``--`` will be passed to the plugin as arguments.
de: Eine Plugin ausführen, das eine Schnittstelle für Befehlszeile bereitstellt. Zum Beispiel: calibre-debug -r "Bücher hinzufügen" ``--`` Datei1:option:`--option1` Alles nach dem ``--`` wird der Erweiterung als Argument übergeben.
fr: Exécuter une extension qui fournit une interface en ligne de commande. Par exemple: calibre-debug -r "Add Books" ``--`` file1 :option:`--option1` Tout ce qui se trouve après le -- sera transmis à l'extension en tant qu'arguments.

source: Display the specified log file. For internal use only.
de: Anzeige der angegebene Protokolldatei. Nur zur internen Verwendung.
fr: Affiche le fichier journal spécifié. Pour usage interne uniquement.

source: Subset the specified font
de: Die angegebene Schriftart reduzieren
fr: Sous-ensemble la police spécifiée

source: Test binary modules in build
de: Testet die internen binären Module
fr: Testez les modules binaires en construction

source: Run the ebook viewer
de: Den Ebook-Viewer starten
fr: Exécuter la visionneuse d'e-livre

source: Start the calibre content server. The calibre content server exposes your calibre library over the internet. The default interface allows you to browse you calibre library by categories. You can also access an interface optimized for mobile browsers at /mobile and an OPDS based interface for use with reading applications at /opds.
de: Startet den Calibre Content Server. Der Inhalte-Server macht die Calibre-Bibliothek über das Internet verfügbar. In der Standardoberfläche kann die Calibre-Bibliothek nach Kategorien durchsucht werden. Sie können ebenfalls auf eine für mobile Browser optimierte Anzeige mit /mobile, sowie auf eine für OPDS basierte Schnittstelle für den Einsatz von Leseanwendungen mit /opds, zugreifen.
fr: Démarrer le serveur de contenu calibre. Le serveur de contenu calibre publie votre bibliothèque calibre sur internet. L’interface par défaut vous permet de parcourir la bibliothèque calibre par catégories. Vous pouvez aussi accéder à une interface optimisée pour les navigateurs mobiles à /mobile et une interface basée sur OPDS pour utiliser avec des applications de lecture à /opds.

source: The OPDS interface is advertised via BonJour automatically.
de: Die OPDS-Schnittstelle wird automatisch über BonJour angekündigt.
fr: L’interface OPDS est affichée automatiquement via BonJour.

source: Whenever you pass arguments to :command:`calibre-server` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`calibre-server` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`calibre-server` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Auto reload server when source code changes. May not work in all environments.
de: Server automatisch bei Quellcode-Änderungen neu laden. Funktioniert unter Umständen nicht in allen Umgebungen.
fr: Recharger automatiquement le serveur quand le code source est modifié. Peut ne pas fonctionner dans tous les environnements.

source: Run process in background as a daemon. No effect on windows.
de: Führt den Prozess im Hintergrund als Daemon aus. Keine Auswirkung auf Windows.
fr: Exécute le processus en tâche de fond comme un daemon. Aucun effet sur les fenêtres.

source: Development mode. Server automatically restarts on file changes and serves code files (html, css, js) from the file system instead of calibre's resource system.
de: Entwicklungsmodus. Server führt automatisch bei Dateiänderungen einen Neustart durch und benutzt Codedateien (html, Css, Js) aus dem Dateisystem anstelle der Ressourcen des Calibre-Systems.
fr: Mode développement. Le serveur redémarre automatiquement lors d'un changement de fichier et sert les fichiers code (html, css, js) depuis le système de fichiers à la place des ressources système de calibre.

source: The maximum size for displayed covers. Default is '600x800'.
de: Die maximale Größe des angezeigten Titelbild. Voreinstellung ist '600x800'.
fr: La taille maximum pour les couvertures affichées. Par défaut est à '600x800'.

source: The maximum number of matches to return per OPDS query. This affects Stanza, WordPlayer, etc. integration.
de: Maximale Anzahl an Treffern bei Ergebnissen von ODPS Anfragen. Dies betrifft Stanza, WordPlayer, etc. Integration.
fr: Le nombre maximum de correspondances retournées par une requête OPDS. Ceci affecte l’intégration dans Stanza, Wordplayer, etc.

source: Group items in categories such as author/tags by first letter when there are more than this number of items. Default: 100. Set to a large number to disable grouping.
de: Gruppiere Elemente in Kategorien wie Autoren/Schlagwörter nach dem ersten Buchstaben, wenn es mehr als diese Anzahl von Elementen gibt. Voreinstellung: 100. Zum Abschalten der Gruppierung einen größeren Wert eingeben.
fr: Groupe les éléments en catégories telles que auteur/étiquettes à l’aide de la première lettre quand il y a plus que ce nombre d’articles. Par défaut : 100. Définir à une valeur élevée pour désactiver le groupement.

source: Set a password to restrict access. By default access is unrestricted.
de: Verwenden Sie ein Kennwort zur Zugriffsbeschränkung. In der Voreinstellung besteht keine Zugriffsbeschränkung.
fr: Indiquer un mot de passe pour restreindre l’accès. Par défaut, l’accès n’est pas restreint.

source: Write process PID to the specified file
de: Prozess PID in die angegebene Datei schreiben
fr: Ecrire le PID du processus dans le fichier spécifié

source: The port on which to listen. Default is 8080
de: Überwachter Server Port. Voreinstellung ist 8080
fr: Le port sur lequel écouter. Par défaut est à 8080

source: Specifies a virtual library to be used for this invocation. This option overrides any per-library settings specified in the GUI. For compatibility, if the value is not a virtual library but is a saved search, that saved search is used. Also note that if you do not specify a restriction, the value specified in the GUI (if any) will be used.
de: Gibt die zu Verwendente virtuelle Bibliothek für diesen Aufruf an. Diese Option überschreibt alle per GUI vorgenommenen Bibliothekseinstellungen. Zur Kompatibilität, wenn der Wert ist keine virtuelle Bibliothek, sondern ist eine gespeicherte Suche ist, wird die gespeicherte Suche verwendet. Beachten Sie, dass bei keiner Einschränkung die Einstellung der GUI (sofern vorhanden) verwendet wird.
fr: Indique une bibliothèque virtuelle à employer pour cette appel. Cette option remplace les paramètres par bibliothèque spécifiés dans l'interface graphique. Pour la compatibilité, si la valeur n'est pas une bibliothèque virtuelle mais est une recherche enregistrée, cette recherche enregistrée est utilisée. Notez également que si vous ne spécifiez pas de restriction, la valeur spécifique dans dans l'interface graphique (le cas échéant) sera utilisée.

source: The max number of worker threads to use. Default is 30
de: Höchstzahl der verwendeten Arbeitsaufträge. Die Standardeinstellung ist 30
fr: Le nombre de processus de travail à utiliser. Par défaut est à 30

source: The server timeout in seconds. Default is 120
de: Die Server Zeitüberschreitung in Sekunden. Die Standardeinstellung ist 120
fr: Délai d’attente du serveur en secondes. Par défaut : 120

source: Prefix to prepend to all URLs. Useful for reverseproxying to this server from Apache/nginx/etc.
de: Ein vor alle URLs angehängter Prefix. Nützlich für die Anwendung von Reverse-Proxy der Server von Apache/ngingx/etc.
fr: Préfixe à ajouter avant toutes les URLs. Utile pour faire du reverse proxy sur ce serveur à partir d’Apache/nginx/etc.

source: Username for access. By default, it is: 'calibre'
de: Benutzername für den Zugriff. Voreinstellung ist 'calibre'
fr: Nom d’utilisateur pour le contrôle d’accès. Par défaut , c'est : 'calibre'

source: Path to the library folder to serve with the content server
de: Pfad zum Verzeichnis der Bibliothek für die Bereitstellung im Inhalte-Server
fr: Chemin vers le dossier de la bibliothèque à utiliser avec le serveur de contenu

source: Send mail using the SMTP protocol. :command:`calibre-smtp` has two modes of operation. In the compose mode you specify from to and text and these are used to build and send an email message. In the filter mode, :command:`calibre-smtp` reads a complete email message from STDIN and sends it.
de: Senden von E-Mail-Nachrichten über das SMTP-Protokoll. :command:`calibre-smtp` kennt zwei Betriebsmodi. Im Modus Verfassen wird die Angabe von from =Nachrichtenversender, to =Nachrichtenempfänger und text =Nachrichtentext verwendet, um eine E-Mail-Nachricht zu erstellen und diese zu versenden. Im Filter-Modus liest :command:`calibre-smtp` eine komplette E-Mail-Nachricht über die Standardeingabe STDIN und versendet diese.
fr: Envoyer des courriels en utilisant le protocole SMTP. :command:`calibre-smtp` a deux mode de fonctionnement. Dans le mode composer vous spécifiez de à et le texte et ceux-ci sont utilisés pour construire et envoyer le courriel. En mode filtré, :command:`calibre-smtp` reçoit un courriel complet depuis STDIN et l'envoie.

source: text is the body of the email message. If text is not specified, a complete email message is read from STDIN. from is the email address of the sender and to is the email address of the recipient. When a complete email is read from STDIN, from and to are only used in the SMTP negotiation, the message headers are not modified.
de: text ist der Inhalt einer E-Mail-Nachricht. Wenn text nicht angegeben ist, wird eine vollständige E-Mail-Nachricht von der Standardeingabe STDIN gelesen. from ist die E-Mail-Adresse des Absenders und to ist die E-Mail-Adresse des Empfängers. Wurde eine komplette E-Mail von STDIN gelesen, dienen from und to nur zum Austausch des SMTP-Protokolls, die Nachrichtenkopfzeile wird nicht geändert.
fr: le texte est le corps du message. Si le texte n'est pas spécifié, un message complet est reçu depuis STDIN. de est l'adresse courriel de l'expéditeur et à est l'addresse courriel du destinataire. Quand un courriel complet est reçu depuis STDIN, de et à sont uniquement utilisés dans la négociation SMTP, l'en-tête de message n'est pas modifié.

source: Whenever you pass arguments to :command:`calibre-smtp` that have spaces in them, enclose the arguments in quotation marks.
de: Wann immer Sie Argumente mit Leerzeichen an :command:`calibre-smtp` übergeben, müssen diese in Anführungszeichen geschrieben werden.
fr: Chaque fois que vous donnez des arguments à :command:`calibre-smtp` qui comportent des espaces, mettez ces arguments entre guillemets.

source: Host name of localhost. Used when connecting to SMTP server.
de: Rechnername des localhost. Dieser wird bei der Verbindung zum SMTP-Server verwendet.
fr: Nom d'hôte de l'hôte local. Utilisé lors d'une connexion à un serveur SMTP.

source: Path to maildir folder to store failed email messages in.
de: Pfad zum maildir-Verzeichnis zum Speichern von fehlerhafte e-Mail-Nachrichten.
fr: Chemin du répertoire courriel pour y stocker les courriels qui ont échoué.

source: Timeout for connection
de: Zeitüberschreitung für die Verbindung
fr: Délai d'attente pour la connexion

source: Be more verbose
de: Zeigt mehr Informationen
fr: Soyez plus détaillé

source: COMPOSE MAIL
de: MAIL VERFASSEN
fr: REDIGER UN COURRIEL

source: Options to compose an email. Ignored if text is not specified
de: Optionen zum Verfassen einer E-Mail. Wird ignoriert, wenn kein Text angegeben wird
fr: Options pour rédiger un courriel. Ignoré si le texte n'est pas spécifié

source: File to attach to the email
de: Datei, die an die eMail angehängt werden soll
fr: Fichier à attacher au courriel

source: Subject of the email
de: Betreff der eMail
fr: Sujet de l'e-mail

source: SMTP RELAY
fr: RELAIS SMTP
