Repository: Easonqsp/calibre-translations
Catalog: manual/*/cli.po
Languages: de, fr

source: String to be used when sorting by author.
de: Zeichenfolge, die für die Sortierung nach Autor verwendet werden soll.
fr: Chaîne à utiliser lors du tri par auteur.

source: Set the authors. Multiple authors should be separated by ampersands.
de: Geben Sie den Autor an. Mehrere Autoren sollten durch UND-Zeichen getrennt angegeben werden.
fr: Indiquer les auteurs. Les auteurs multiples doivent être séparés par des &.

source: Set the book producer.
de: Geben Sie den Hersteller des Buches an.
fr: Indiquer le producteur du livre.

source: Set the ebook description.
de: Geben Sie die Beschreibung des eBooks an.
fr: Indiquer la description du livre numérique.

source: Set the cover to the specified file or URL
de: Geben Sie das Coverbild für die angegebene Datei oder URL an
fr: Indiquer la couverture à partir du fichier spécifié ou de l’URL

source: Set the ISBN of the book.
de: Geben Sie die ISBN des Buches an.
fr: Indiquer l’ISBN du livre.

source: Set the language.
de: Geben Sie die Sprache an.
fr: Indiquer la langue.

source: Set the publication date.
de: Geben Sie das Erscheinungsdatum an.
fr: Indiquer la date de publication.

source: Set the ebook publisher.
de: Geben Sie den Verlag des eBooks an.
fr: Indiquer l’éditeur du livre numérique.

source: Set the rating. Should be a number between 1 and 5.
de: Geben Sie die Bewertung an. Dies sollte eine Zahl zwischen 1 und 5 sein.
fr: Indiquer la note. Doit être un nombre entre 1 et 5.

source: Read metadata from the specified OPF file. Metadata read from this file will override any metadata in the source file.
de: Metadaten aus angegebener OPF-Datei lesen. Die aus dieser Datei gelesenen Metadaten überschreiben jegliche Metadaten in der Ursprungsdatei.
fr: Lire les métadonnées du fichier OPF spécifié. Les métadonnées lues à partir de ce fichier écraseront les métadonnées dans le fichier source.

source: Set the series this ebook belongs to.
de: Geben Sie die Serie an, zu der dieses eBook gehört.
fr: Indiquer la série à laquelle appartient ce livre numérique.

source: Set the index of the book in this series.
de: Geben Sie den Index des Buches in dieser Serie an.
fr: Indiquer l’index de ce livre numérique dans cette série.

source: Set the tags for the book. Should be a comma separated list.
de: Geben Sie die Schlagwörter für das Buch an. Die Einträge müssen durch ein Komma getrennt werden.
fr: Indiquer les étiquettes du livre. Doit être une liste séparée par des virgules.

source: Set the book timestamp (no longer used anywhere)
de: Buch Zeitstempel festlegen (wird nicht mehr überall verwendet)
fr: Définir l’horodatage (plus utilisé nulle part)

source: Set the title.
de: Geben Sie den Titel an.
fr: Indiquer le titre.

source: The version of the title to be used for sorting.
de: Titel-Version, die für die Sortierung verwendet werden soll.
fr: La version du titre à utiliser pour le tri.

source: Debug
de: Fehlerdiagnose
fr: Débogage

source: Options to help with debugging the conversion
de: Einstellungen zur Hilfe mit der Fehlerdiagnose bei der Konvertierung
fr: Options d’aide pour le débogage de la conversion

source: Save the output from different stages of the conversion pipeline to the specified directory. Useful if you are unsure at which stage of the conversion process a bug is occurring.
de: Speichert die Ausgabe der verschiedenen Ebenen des Konvertierungsprozesses in das angegebene Verzeichnis. Hilfreich, wenn Sie nicht sicher sind, auf welcher Ebene des Konvertierungsprozesses ein Fehler auftritt.
fr: Enregistre le résultat des différents cycles du processus de conversion dans le répertoire spécifié. Utile si vous ne savez pas à quel moment du cycle de conversion le bug est généré.

source: Level of verbosity. Specify multiple times for greater verbosity.
de: Einstellung der Ausführlichkeit. Für größere Ausführlichkeit mehrmals angeben.
fr: Niveau de verbosité. Spécifier le plusieurs fois pour augmenter la verbosité.

source: AZW4 Input Options
de: AZW4-Eingabeoptionen
fr: Options d'entrée AZW4

source: Specify the character encoding of the input document. If set this option will override any encoding declared by the document itself. Particularly useful for documents that do not declare an encoding or that have erroneous encoding declarations.
de: Geben Sie die Zeichenkodierung des Eingabe-Dokuments an. Falls verwendet, werden alle im Dokument angegebenen Kodierungen überschrieben. Teilweise hilfreich bei Dokumenten, die keine oder eine fehlerhafte Encodierung angegeben haben.
fr: Spécifier l’encodage des caractères pour le document d’entrée. Si cette option est indiquée, elle écrasera tout encodage déjà déclaré dans le document. Particulièrement utile pour les documents ne déclarant pas d’encodage ou ayant des déclarations d’encodage incorrectes.

source: CHM Input Options
de: CHM-Eingabeoptionen
fr: Options d'entrée CHM

source: Comic Input Options
de: Comic-Eingabeoptionen
fr: Options d'entrée bande dessinée

source: Number of colors for grayscale image conversion. Default: 256. Values of less than 256 may result in blurred text on your device if you are creating your comics in EPUB format.
de: Anzahl der Farben für Graustufen-Konvertierung. Voreinstellung: 256. Ein Wert geringer als 256 kann auf dem Gerät unscharfen Text erzeugen, falls Sie Ihre Comics im EPUB-Format erstellen.
fr: Nombre de couleurs pour la conversion des images en niveaux de gris. Par défaut: 256. Les valeurs inférieures à 256 peuvent rendre le texte illisible sur votre lecteur si vous créez vos bandes dessinées au format EPUB.

source: Specify the image size as widthxheight pixels. Normally, an image size is automatically calculated from the output profile, this option overrides it.
de: Angabe der Bildgröße als Breite x Höhe Pixel. Normalerweise wird die Bildgröße automatisch aus dem Ausgabeprofil bestimmt, diese Option hat darüber Vorrang.
fr: Indiquer la taille de l’image en pixels : largeurxhauteur. Normalement, une taille d’image est automatiquement calculé à partir du profil de sortie, cette option la remplace.

source: Enable Despeckle. Reduces speckle noise. May greatly increase processing time.
de: Entkörnung einschalten. Reduziert die Körnigkeit. Kann die Bearbeitungszeit stark verlängern.
fr: Autoriser le flou. Réduit le bruit. Peut augmenter sensiblement les durées d’exécution.

source: Disable trimming of comic pages. For some comics, trimming might remove content as well as borders.
de: Beschneiden von Comic-Seiten ausschalten. Bei einigen Comics könnte sonst neben dem Rahmen auch Inhalt entfernt werden.
fr: Désactive le découpage des pages de BD. Pour certaines BD, le découpage peut supprimer le contenu aussi bien que les bordures.

source: When converting a CBC do not add links to each page to the TOC. Note this only applies if the TOC has more than one section
de: Bei Konvertierung von CBC keine Links für jede Seite des TOC hinzufügen. Hinweis: Dies gilt nur, wenn die TOC mehr als einem Abschnitt hat
fr: Lors de la conversion d’un CBC n’ajoute pas de liens pour chaque page à la table des matières. Notez que ceci ne s’applique que si la table des matières comporte plus d’une section

source: Do not convert the image to grayscale (black and white)
de: Wandele das Bild nicht in Graustufen (schwarz/weiß)
fr: Ne pas convertir les images en niveaux de gris (noir et blanc)

source: Disable normalize (improve contrast) color range for pictures. Default: False
de: Deaktivieren der Normalisierung (verbessert den Kontrast) des Farbbereichs für Bilder. Voreinstellung: False
fr: Désactiver l’effet de normalisation (améliore le contraste) de la gamme de couleurs pour les images. Par défaut : désactivé

source: Disable sharpening.
de: Schärfen deaktivieren.
fr: Désactiver l’effet d’accentuation.

source: Maintain picture aspect ratio. Default is to fill the screen.
de: Seitenverhältnis des Bildes beibehalten. Voreingestellt ist die bildschirmfüllende Darstellung.
fr: Maintient les proportions de l’image. Par défaut: plein écran.

source: Don't split landscape images into two portrait images
de: Querformat Bilder nicht in zwei Hochformat Bilder aufteilen
fr: Ne pas diviser les images au format paysage en deux images au format portrait

source: Apply no processing to the image
de: Auf das Bild keine Verarbeitung anwenden
fr: N’applique aucun traitement sur l’image

source: Don't sort the files found in the comic alphabetically by name. Instead use the order they were added to the comic.
de: Dateien, die im Comic gefunden wurden, nicht alphabetisch nach Namen sortieren, sondern die Reihenfolge verwenden, in der sie zum Comic hinzugefügt wurden.
fr: Ne pas trier les fichiers trouvés dans la bande-dessinée par nom et dans l’ordre alphabétique. Utiliser plutôt l’ordre dans lequel ils ont été ajoutés dans la bande dessinée.

source: The format that images in the created ebook are converted to. You can experiment to see which format gives you optimal size and look on your device.
de: Format, in das Bilder im erstellten eBook konvertiert werden. Sie können experimentieren um herauszufinden, welches Format eine optimale Größe und Aussehen auf dem Gerät zur Folge hat.
fr: Format dans lequel les images du livre numérique créé seront converties. Vous pouvez tester pour voir quel format vous donne une taille et un rendu optimal sur votre appareil.

source: Used for right-to-left publications like manga. Causes landscape pages to be split into portrait pages from right to left.
de: Benutzt für rechts-nach-links Publikationen wie Mangas. Querformatige Seiten werden von rechts nach links in mehrere hochformatige Seiten unterteilt.
fr: Utilisé pour les publications affichées de droite à gauche comme les mangas. Peut entraîner une division des pages au format paysage en pages au format portrait affichées de droite à gauche.

source: Keep aspect ratio and scale image using screen height as image width for viewing in landscape mode.
de: Seitenverhältnis beibehalten und Bild so skalieren, dass die Bildschirmhöhe als Bildbreite in der Querformatansicht verwendet wird.
fr: Garde les proportions de l’image et la redimensionne en utilisant la hauteur de l’écran comme largeur d’image pour une visualisation en mode paysage.

source: DJVU Input Options
de: DJVU-Eingabeoptionen
fr: Options d'entrée DJVU

source: DOCX Input Options
de: DOCX-Eingabeoptionen
fr: Options d'entrée DOCX

source: Normally, if a large image is present at the start of the document that looks like a cover, it will be removed from the document and used as the cover for created ebook. This option turns off that behavior.
de: Normalerweise, falls sich am Anfang des Dokuments ein großes Bild befindet, das aussieht wie ein Cover, wird es aus dem Dokument entfernt und als Titelbild für das erzeugte eBook verwendet. Diese Option schaltet dieses Verhalten aus.
fr: Normalement, si une grande image est présente en début de document qui ressemble à une couverture, elle sera supprimée du document et utilisé comme couverture pour le livre numérique créé. Cette option désactive ce comportement.

source: EPUB Input Options
de: EPUB-Eingabeoptionen
fr: Options d'entrée EPUB

source: FB2 Input Options
de: FB2-Eingabeoptionen
fr: Options d'entrée FB2

source: Do not insert a Table of Contents at the beginning of the book.
de: Kein Inhaltsverzeichnis am Anfang des Buches einfügen.
fr: Ne pas insérer une table des matières au début du livre.

source: HTLZ Input Options
de: HTLZ-Eingabeoptionen
fr: Options d'entrée HTLZ

source: HTML Input Options
de: HTML-Eingabeoptionen
fr: Options d'entrée HTML

source: Traverse links in HTML files breadth first. Normally, they are traversed depth first.
de: Links in HTML-Dateien in der Breite durchlaufen. Normalerweise werden Links in die Tiefe durchlaufen.
fr: Suivre les liens dans les fichier HTML en adoptant un parcours en largeur au lieu d'un parcours en profondeur.

source: Normally this input plugin re-arranges all the input files into a standard folder hierarchy. Only use this option if you know what you are doing as it can result in various nasty side effects in the rest of the conversion pipeline.
de: Normalerweise ordnet dieses Plugin alle eingegebenen Dateien in eine Standard Ordnerhierarchie an. Nutzen Sie diese Option nur, wenn Sie wissen, was Sie tun, da es zu verschiedenen Nebeneffekten in der restlichen Konvertierung kommen kann.
fr: Normalement, l'extension de gestion des entrées ré-arrange tous les fichiers en entrée selon une hiérarchie de répertoires standard. Utilisez cette option seulement si vous savez ce que vous faites, car il peut en résulter des effets de bords dérangeant pour le reste du processus de conversion.

source: Maximum levels of recursion when following links in HTML files. Must be non-negative. 0 implies that no links in the root HTML file are followed. Default is 5.
de: Maximale Höhe der Rekursion bei der Verfolgung von Links in HTML-Dateien. Darf nicht negativ sein. 0 gibt an, dass keine Links in der ursprünglichen HTML-Datei verfolgt werden. Voreinstellung ist 5.
fr: Niveaux maximum de récursivité pour le suivi des liens dans les fichiers HTML. Ne doit pas être négatif. 0 implique qu’aucun lien à la racine du fichier HTML ne sera suivi. Par défaut : 5.

source: LIT Input Options
de: LIT-Eingabeoptionen
fr: Options d'entrée LIT

source: LRF Input Options
de: LRF-Eingabeoptionen
fr: Options d'entrée LRF

source: MOBI Input Options
de: MOBI-Eingabeoptionen
fr: Options d'entrée MOBI

source: ODT Input Options
de: ODT-Eingabeoptionen
fr: Options d'entrée ODT

source: PDB Input Options
de: PDB-Eingabeoptionen
fr: Options d'entrée PDB

source: PDF Input Options
de: PDF-Eingabeoptionen
fr: Options d'entrée PDF

source: Use the new PDF conversion engine.
de: Die neue PDF-Konvertierung benutzen.
fr: Utiliser le nouveau moteur de conversion de PDF.

source: Do not extract images from the document
de: Bilder nicht aus dem Dokument extrahieren
fr: Ne pas extraire les images du document

source: Scale used to determine the length at which a line should be unwrapped. Valid values are a decimal between 0 and 1. The default is 0.45, just below the median line length.
de: Wert, der festlegt, bei welcher Zeilenlänge der Zeilenumbruch gelöscht werden sollte. Gültige Werte sind Dezimalzahlen zwischen 0 und 1. Die Standardeinstellung ist 0,45, knapp unter dem Median der Zeilenlänge.
fr: Échelle utilisée pour déterminer la longueur à partir de laquelle une ligne doit être redéfinie. Les valeurs acceptables sont les décimaux compris entre 0 et 1. La valeur par défaut est de 0.45, juste en dessous de la valeur médiane de la longueur de ligne.

source: PML Input Options
de: PML-Eingabeoptionen
fr: Options d'entrée PML

source: RB Input Options
de: RB-Eingabeoptionen
fr: Options d'entrée RB

source: RTF Input Options
de: RTF-Eingabeoptionen
fr: Options d'entrée RTF

source: Ignore WMF images instead of replacing them with a placeholder image.
de: Ignoriere WMF-Bilder statt sie mit einem Platzhalter-Bild zu ersetzen.
fr: Ne pas prendre en compte les images WMF au lieu de les signaler par un emplacement vide.

source: Recipe Input Options
de: Nachrichtenschema-Eingabeoptionen
fr: Options d'entrée de recette

source: Do not download latest version of builtin recipes from the calibre server
de: Letzte Versionen der Nachrichtenschemen nicht vom Calibre Server laden
fr: Ne pas télécharger la dernière version des recettes intégrées à partir du serveur calibre.

source: Optimize fetching for subsequent conversion to LRF.
de: Optimiert den Abruf für die anschließende Konvertierung in LRF.
fr: Optimise la récupération pour la conversion LRF suivante.

source: Password for sites that require a login to access content.
de: Passwort für Webseiten, die einen Login für den Abruf von Inhalten benötigen.
fr: Mot de passe pour les sites devant se connecter pour accéder au contenu

source: Useful for recipe development. Forces max_articles_per_feed to 2 and downloads at most 2 feeds. You can change the number of feeds and articles by supplying optional arguments. For example: :option:`--test` 3 1 will download at most 3 feeds and only 1 article per feed.
de: Nützlich für "Schema"-Entwicklung. Die Einstellung max_articles_per_feed 2 erzwingt das Herunterladen von maximal 2 RSS-Feeds. Sie können die Zahl der Feeds und Artikel bestimmen, indem Sie optionale Argumente anführen. Beispiel: :option:`--test` 3 1 wird bis zu 3 Feeds mit nur 1 Artikel pro Feed herunterladen.
fr: Utile pour le développement de recette. Force max_articles_per_feed à 2 et téléchargements à tout au plus 2 flux. Vous pouvez changer le nombre de flux et d'articles en fournissant des arguments facultatifs. Par exemple: :option:`--test` 3 1 téléchargera tout au plus 3 flux et seulement 1 article par flux.

source: Username for sites that require a login to access content.
de: Benutzername für Webseiten, die einen Login für den Inhaltsabruf benötigen.
fr: Nom d’utilisateur pour les sites devant se connecter pour accéder au contenu.

source: SNB Input Options
de: SNB-Eingabeoptionen
fr: Options d'entrée SNB

source: TCR Input Options
de: TCR-Eingabeoptionen
fr: Options d'entrée TCR

source: TXT Input Options
de: TXT-Eingabeoptionen
fr: Options d'entrée TXT

source: Formatting used within the document.\* auto: Automatically decide which formatting processor to use. \* plain: Do not process the document formatting. Everything is a paragraph and no styling is applied. \* heuristic: Process using heuristics to determine formatting such as chapter headings and italic text. \* textile: Processing using textile formatting. \* markdown: Processing using markdown formatting. To learn more about markdown see http://daringfireball.net/projects/markdown/
de: Formatierung, die im Dokument genutzt wird. \* auto: Automatische Automatische Auswahl der Formatierungsverarbeitung. \* plain: Die Formatierung des Dokuments nicht verarbeiten. Alles ist ein Absatz und kein Styling wird angewendet. \* heuristic: Mit Heuristik verarbeiten, um die Formatierung zu bestimmen, wie z. B. Kapitelüberschriften und kursiver Text. \* textile: Verarbeitung mit Textile-Formatierung. \* markdown: Verarbeitung mit Markdown Formatierung. Um mehr über markdown zu lernen siehe http://daringfireball.net/projects/markdown/
fr: Formatage utilisé dans le document. \* auto: Décide automatiquement quel traitement de formatage utiliser. \* plain: Ne pas traiter le formatage du document. Tout est un seul paragraphe et aucun style n’est appliqué. \* heuristique: Traitement heuristique afin de déterminer les formatages tels que les entêtes de chapitre ou du texte en italique. \* textile: Traitement utilisant le formatage textile. \* markdown: Traitement utilisant le formatage markdown. Pour en savoir plus sur Markdown voir http://daringfireball.net/projects/markdown/

source: Enable extensions to markdown syntax. Extensions are formatting that is not part of the standard markdown format. The extensions enabled by default: footnotes, tables, toc. To learn more about markdown extensions, see http://pythonhosted.org/Markdown/extensions/index.html This should be a comma separated list of extensions to enable: \* abbr: Abbreviations \* def_list: Definition lists \* fenced_code: Alternative code block syntax \* footnotes: Footnotes \* headerid: Allow ids as part of a header \* meta: Metadata in the document \* tables: Support tables \* toc: Generate a table of contents \* wikilinks: Wiki style links
de: Aktiviert die Markdown-Syntax-Erweiterungen. Erweiterungen sind Formatierungen, die nicht Bestandteil des Standard Markdown-Formates sind. Diese Erweiterungen standardmäßig aktiviert: Fußnoten, Tabellen, Toc. Um mehr über markdown zu lernen siehe http://pythonhosted.org/Markdown/extensions/index.html. Die Erweiterungen werden mit einer durch Kommas getrennte Liste von Befehlen aktiviert: \* abbr: Abkürzungen \* def_list: Definition für Listen \* fenced_code: Alternative Code-Block-Syntax \* footnotes: Fußnoten \* headerid: Id's als Teil eines Headers zulassen \* meta: Metadaten im Dokument \* tables: Unterstützung von Tabellen \* toc: Generieren eines Inhaltsverzeichnisses \* wikilinks: Dokumentenaufbau im Wikilink-Stil.
fr: Active les extensions pour la syntaxe markdown. Les extensions sont formatées comme ne faisant pas partie du format standard markdown. Les extensions activées par défaut : notes de bas de page, tables, tdm. Pour en apprendre plus sur les extensions markdown, voir http://pythonhosted.org/Markdown/extensions/index.html . Ce devra être une liste séparée par des virgules à activer : \* abbr: Abbréviations \* def_list: Listes de définitions \* fenced_code: bloc de code de syntaxe alternatif \* footnotes: Notes de bas de page \* headerid: Permet les ids comme partie de l'entête \* meta: Métadonnées dans le document \* tables: Tables supportées \* toc: Générer une table des matières \* wikilinks: Liens de style Wiki

source: Paragraph structure. choices are ['auto', 'block', 'single', 'print', 'unformatted', 'off'] \* auto: Try to auto detect paragraph type. \* block: Treat a blank line as a paragraph break. \* single: Assume every line is a paragraph. \* print: Assume every line starting with 2+ spaces or a tab starts a paragraph. \* unformatted: Most lines have hard line breaks, few/no blank lines or indents. Tries to determine structure and reformat the differentiate elements. \* off: Don't modify the paragraph structure. This is useful when combined with Markdown or Textile formatting to ensure no formatting is lost.
de: Absatz-Struktur: Sie haben die Wahl zwischen ['auto', 'block', 'single', 'print', 'unformatted', 'off'] \* auto: Versucht den Absatz-Typ automatisch zu ermitteln \* block: Behandelt eine leere Zeile als Absatzumbruch \* single: Nimmt an, dass es sich bei jeder Zeile um einen Absatz handelt \* print: Nimmt an, dass es sich bei jeder Zeile mit 2+ Leerzeichen oder mit einem Absatz am Anfang um ein Absatz handelt \* unformatted: Die meisten Zeilen haben harte Umbrüche, wenige bis keine Leerzeilen oder Einzüge. Versucht die Struktur zu erkennen. \* off: Absatz-Struktur nicht verändern. Nützlich bei Benutzung in Kombination mit Markdown- oder Textile-Formaten um sicherzustellen, dass keine Formatierungen verloren gehen.
fr: Structure de paragraphe. les choix sont ['auto', 'bloc', 'simple', 'livre', 'non-formaté', 'désactivé'] \* auto: Essaie de détecter automatiquement le type de paragraphe. \* bloc: Interprète une ligne vierge comme un saut de paragraphe. \* simple: Suppose que chaque ligne est un paragraphe. \* livre: Suppose que chaque ligne commençant par au moins 2 espaces ou une tabulation débute un paragraphe. \* non-formaté: Retours à la ligne très fréquents, peu ou pas de lignes vierges ou d'alinéas. Essaie de déterminer la structure et de reformater les éléments distingués. \* désactivé: Ne modifie pas la structure du paragraphe. Utile en combinaison avec le formatage Markdown ou Textile pour s'assurer qu'aucun format n'est perdu.

source: Normally extra spaces are condensed into a single space. With this option all spaces will be displayed.
de: Normalerweise werden extra Leerzeichen zu einem einzigen Leerzeichen zusammengeführt. Mit dieser Option werden alle Leerzeichen angezeigt.
fr: Normalement les espaces surnuméraires sont condensés en une seule espace. Avec cette option, toutes les espaces seront affichées.

source: Normally extra space at the beginning of lines is retained. With this option they will be removed.
de: Üblicherweise werden zusätzliche Leerzeichen am Zeilenanfang erhalten. Mit dieser Option werden sie entfernt.
fr: Normalement les espaces en début de ligne sont conservés. Avec cette option, ils seront supprimés.

source: AZW3 Output Options
de: AZW3-Ausgabeoptionen
fr: Options de sortie AZW3
