Repository: Easonqsp/calibre-translations
Catalog: manual/*/creating_plugins.po
Languages: es, sv

source: A single editor plugin can provide multiple tools each tool corresponds to a single button in the toolbar and entry in the :guilabel:`Plugins` menu in the editor. These can have sub-menus in case the tool has multiple related actions.
es: Un editor de complemento puede proporcionar múltiples herramientas; cada herramienta corresponde a un único botón en la barra de herramientas y entrada en el menú :guilabel:`Plugins` del editor. Estos pueden tener sub-menús en el caso que la herramienta posea múltiples acciones relacionadas.
sv: En enda tilläggseditor kan ge flera verktyg varje verktyg motsvarar en knapp i verktygsfältet och posten i :guilabel: `Tilläggs`-menyn i editorn. Dessa kan ha undermenyer om verktyget har flera relaterade åtgärder.

source: The tools must all be defined in the file ``main.py`` in your plugin. Every tool is a class that inherits from the :class:`calibre.gui2.tweak_book.plugin.Tool` class. Let's look at ``main.py`` from the demo plugin, the source code is heavily commented and should be self-explanatory. Read the API documents of the :class:`calibre.gui2.tweak_book.plugin.Tool` class for more details.
es: Todas las herramientas deben ser definidas en el archivo ``main.py``. Cada herramienta es una clase que hereda de la clase :class:`calibre.gui2.tweak_book.plugin.Tool`. Echemos un vistazo a ``main.py`` del complemento demo; el código fuente está suficientemente comentado y debería explicarse por sí mismo. Lea los documentos de la API de la clase :clase:`calibre.gui2.tweak_book.plugin.Tool` para más detalles.
sv: Verktygen bör definieras i filen ``main.py`` i ditt tillägg. Varje verktyg är en klass som ärver från :class:`calibre.gui2.tweak_book.plugin.Tool` klass. Låt oss titta på ``main.py`` från demotillägget, källkoden är tungt kommenterade och bör vara självförklarande. Läs API handlingar: class: `calibre.gui2.tweak_book.plugin.Tool` klass för mer information.

source: Here we will see the definition of a single tool that will multiply all font sizes in the book by a number provided by the user. This tool demonstrates various important concepts that you will need in developing your own plugins, so you should read the (heavily commented) source code carefully.
es: Aquí vamos a ver la definición de una herramienta que multiplicará todos los tamaños de fuente en el libro por un número proporcionado por el usuario. Esta herramienta demuestra varios conceptos importantes que se necesitarán para desarrollar sus propios complementos, por lo que debe leer el código fuente (muy comentado) cuidadosamente.
sv: Här kommer vi att se definitionen av ett enda verktyg som kommer att multiplicera alla teckenstorlekar i boken av ett nummer som användaren ger. Detta verktyg visar olika viktiga begrepp som du behöver för att utveckla dina egna tillägg, så du bör läsa (tungt kommenterade) källkoden noggrant.

source: Let's break down ``main.py``. We see that it defines a single tool, named *Magnify fonts*. This tool will ask the user for a number and multiply all font sizes in the book by that number.
es: Vamos a destripar ``main.py``. Vemos que define una única herramienta, llamada *Agrandar fuentes*. Esta herramienta le preguntará al usuario por un número. Dicho número aumentará todos los tamaños de fuentes presentes en el libro.
sv: Låt oss bryta ner ``main.py``. Vi ser att den definierar ett enda verktyg, som heter *Förstora teckensnitt *. Detta verktyg kommer att be användaren om ett nummer och multiplicera alla teckenstorlekar i boken med det numret.

source: The first important thing is the tool name which you must set to some relatively unique string as it will be used as the key for this tool.
es: La primera cosa importante es el nombre de la herramienta que debe establecer a alguna cadena relativamente única, ya que se utilizará como clave para esta herramienta.
sv: Det första viktiga är verktygsnamnet som du måste ställa in till någon relativt unik sträng som den kommer att användas som nyckel för detta verktyg.

source: The next important entry point is the :meth:`calibre.gui2.tweak_book.plugin.Tool.create_action`. This method creates the QAction objects that appear in the plugins toolbar and plugin menu. It also, optionally, assigns a keyboard shortcut that the user can customize. The triggered signal from the QAction is connected to the ask_user() method that asks the user for the font size multiplier, and then runs the magnification code.
es: El siguiente punto de entrada importante es :meth:`calibre.gui2.tweak_book.plugin.Tool.create_action`. Este método crea los objetos QAction que aparecen en la barra de herramientas y el menú de complementos. También, opcionalmente, asigna un atajo de teclado que el usuario puede personalizar. La señal disparada desde QAction está conectada con el método ask_user() que pide al usuario por el tamaño de fuente multiplicador, y luego ejecuta el código de ampliación.
sv: Nästa viktiga inkörsport är :meth:`calibre.gui2.tweak_book.plugin.Tool.create_action`. Denna metod skapar QAction objekt som visas i tilläggsverktygsfältet och tilläggsmenyn. Det också eventuellt tilldelar ett kortkommando som användaren kan skräddarsy. Den utlösta signalen från QAction är ansluten till ask_user () metoden som frågar användaren om teckenstorlekensmultiplikator och sedan kör förstoringskoden

source: The magnification code is well commented and fairly simple. The main things to note are that you get a reference to the editor window as ``self.gui`` and the editor *Boss* as ``self.boss``. The *Boss* is the object that controls the editor user interface. It has many useful methods, that are documented in the :class:`calibre.gui2.tweak_book.boss.Boss` class.
es: El código de aumento etsá bien comentado y bastante simple. Las principales cosas a destacar son que obtiene una referencia a la ventana del editor como `` self.gui`` y el editor *Boss* como ``self.boss``. El *Boss * es el objeto que controla la interfaz de usuario del editor. Tiene muchos métodos útiles, que se documentan en la clase :clas:`calibre.gui2.tweak_book.boss.Boss`.
sv: Förstoringskoden är väl kommenterad och ganska enkel. De viktigaste saker att notera är att du får en referens till redigeringsfönstret som ``self.gui`` och editorn *Boss* som ` self.boss``. *Boss* är objektet som styr redigerarens användargränssnitt. Den har många användbara metoder, som dokumenteras i :class:`calibre.gui2.tweak_book.boss.Boss` klass.

source: Finally, there is ``self.current_container`` which is a reference to the book being edited as a :class:`calibre.ebooks.oeb.polish.container.Container` object. This represents the book as a collection of its constituent HTML/CSS/image files and has convenience methods for doing many useful things. The container object and various useful utility functions that can be reused in your plugin code are documented in :ref:`polish_api`.
es: Finalmente, existe ``self.current_container`` el cual es una referencia al libro siendo editado como un objeto :class:`calibre.ebooks.oeb.polish.container.Container`. Este representa el libro como una colección de archivos HTML/CSS/imágenes y posee diversos métodos para hacer varias cosas útiles. El objeto contenedor y varias funciones utilitarias que pueden ser reusadas en el código de su complemento están documentadas en :ref:`polish_api`.
sv: Slutligen finns det ``self.current_container`` som är en referens till boken som redigeras som :class:`calibre.ebooks.oeb.polish.container.Container` objekt. Detta representerar boken som en samling av sina konstituerande HTML / CSS / bildfiler och har bekvämliga metoder för att göra många användbara saker. Objektbehållaren och olika användbara nyttofunktioner som kan återanvändas i din tilläggskod är dokumenterade i :ref:`polish_api`.

source: Adding translations to your plugin
es: Agregando traducciones a su complemento
sv: Lägger till översättningar till ditt tillägg

source: You can have all the user interface strings in your plugin translated and displayed in whatever language is set for the main calibre user interface.
es: Puede tener todoas los cadenas de texto de la interfaz de usuario de su complemento traducido y mostrado en el idioma en que está configurado la interfaz principal de usuario de calibre.
sv: Du kan ha alla användargränssnitts strängar i ditt tillägg översatta och visas i vilket språk som är satt för huvudanvändargränssnitt i calibre.

source: The first step is to go through your plugin's source code and mark all user visible strings as translatable, by surrounding them in _(). For example::
es: El primer paso es ir al código fuente de su complemento y marcar todas las cadenas de texto visibles por el usuario como traducibles, rodeándolas con un _(). Por ejemplo::
sv: Det första steget är att gå igenom din tilläggskällkod och markera alla användarsynliga strängar som översättningsbara, genom att omge dem _(). Till exempel::

source: Then use some program to generate .po files from your plugin source code. There should be one .po file for every language you want to translate into. For example: de.po for German, fr.po for French and so on. You can use the `poedit <http://www.poedit.net/>`_ program for this.
es: Después utilice algún programa para generar archivos .po archivos del código fuente de su complemento. Debe haber un archivo .po por cada idioma que desea traducir. Por ejemplo: de.po para el alemán, fr.po para el francés y así sucesivamente. Puede utilizar el programa `Poedit <http://www.poedit.net/>` _ para esto.
sv: Använd sedan något program för att generera .po-filer från din tilläggskällkod. Det bör finnas en .po-fil för varje språk du vill översätta till. Till exempel: sv.po för svenska, fr.po för franska och så vidare. Du kan använda `poedit <http://www.poedit.net/>` _ programmet för detta

source: Send these .po files to your translators. Once you get them back, compile them into .mo files. You can again use poedit for that, or just do::
es: Envíe estos archivos .po a sus traductores. Una vez que les sean devueltos los archivos traducidos, compílelos en archivos .mo. Puede utilizar nuevamente Poedit para realizarlo, o simplemente hacer::
sv: Skicka dessa .po-filer till översättarna. När du får tillbaka dem, sammanställ dem i .mo-filer. Du kan återigen använda poedit för det, eller bara göra::

source: Put the .mo files into the ``translations`` folder in your plugin.
es: Ponga los archivos .mo en la carpeta ``translations`` del complemento.
sv: Placera .mo filer i ``translations`` mapp i ditt tillägg.

source: The last step is to simply call the function `load_translations()` at the top of your plugin's .py files. For performance reasons you should only call this function in those .py files that actually have translatable strings. So in a typical User Interface plugin you would call it at the top of ``ui.py`` but not ``__init__.py``.
es: El último paso es simplemente llamar la función `load_translations()` en la parte superior de los archivos .py de su complemento. Por motivos de rendimiento, sólo debe llamar a esta función en aquellos archivos .py que actualmente poseen cadenas de texto traducibles. Así que en una interfaz de usuario típica de un complemento, lo llamaría en la parte superior de ``ui.py`` pero no ``__init__.py``.
sv: Det sista steget är att helt enkelt kalla funktionen `load_translations ()` högst upp av dina tilläggs .py-filer. Av prestandaskäl bör du bara kalla denna funktion i de .py-filer som faktiskt har översättbara strängar. Så i ett typiskt användargränssnittstillägg som du skulle kalla det högst upp i ``ui.py`` men inte `` __init __. py``.

source: You can test the translations of your plugins by changing the user interface language in calibre under Preferences->Look & Feel or by running calibre like this::
es: Puede probar las traducciones de sus complementos cambiando el idioma de la interfaz de usuario en calibre bajo Preferencias->Apariencia o ejecutando calibre así::
sv: Du kan testa översättningarna av dina tillägg genom att ändra språk i användargränssnittet i calibre i Inställningar->Utseende eller genom att köra calibre så här::

source: Replace ``de`` with the language code of the language you want to test.
es: Reemplace ``de``con el código de idioma con el idioma que desea probar.
sv: Ersätt ``sv`` med språkkoden för det språk som du vill testa.

source: The plugin API
es: La API del complemento
sv: Tilläggs-API

source: As you may have noticed above, a plugin in calibre is a class. There are different classes for the different types of plugins in calibre. Details on each class, including the base class of all plugins can be found in :ref:`plugins`.
es: Como se habrá dado cuenta, un complemento en calibre es una clase. Hay diferentes clases para los diferentes tipos de complementos en calibre. Los detalles de cada clase, incluyendo la clase base de todos los complementos se pueden encontrar en :ref: `complementos`.
sv: Som ni kanske har märkt ovan, är ett tillägg i calibre en klass. Det finns olika klasser för de olika typer av tillägg i kaliber. calibre om varje klass, inklusive basklassen för alla tillägg finns i :ref:`plugins`.

source: Your plugin is almost certainly going to use code from calibre. To learn how to find various bits of functionality in the calibre code base, read the section on the calibre :ref:`code_layout`.
es: Su complemento es casi seguro que va a usar el código de calibre. Para saber cómo encontrar varios bits de funcionalidad en el código base de calibre, lea la sección :ref:`code_layout`.
sv: Ditt tillägg kommer nästan säkert att använda kod från calibre. Om du vill veta hur man hittar olika bitar av funktionalitet i calibres kodbas, läs avsnittet om calibre :ref:`code_layout`.

source: Debugging plugins
es: Depurar complementos
sv: Felsök tilläggen

source: The first, most important step is to run calibre in debug mode. You can do this from the command line with::
es: El primer paso, el más importante, es ejecutar calibre en modo de depuración. Puede hacer esto desde la línea de órdenes con::
sv: Den första och viktigaste steget är att köra calibre i felsökningsläge. Du kan göra det från kommandoraden med::

source: Or from within calibre by right-clicking the preferences button or using the `Ctrl+Shift+R` keyboard shortcut.
es: O desde el mismo calibre, clic derecho en el botón de las Preferencias o usando el atajo de teclado `Ctrl+Shift+R`.
sv: Eller inifrån calibre med kortkommandot att högerklicka på knappen inställningar eller genom att använda `Ctrl + Skift + R`.

source: When running from the command line, debug output will be printed to the console, when running from within calibre the output will go to a txt file.
es: Cuando se ejecuta desde la línea de comando, la salida de depuración será enviada a la consola, si es ejecutado dentro de calibre, el archivo de salida será un archivo txt.
sv: När du kör från kommandoraden, kommer felsäkningsutskrifter skrivas ut till konsolen, när man kör inifrån calibre kommer de att gå till en txt-fil.

source: You can insert print statements anywhere in your plugin code, they will be output in debug mode. Remember, this is python, you really shouldn't need anything more than print statements to debug ;) I developed all of calibre using just this debugging technique.
es: Puede insertar declaraciones de impresión en cualquier lugar en el código fuente de su complemento, éstas serán emitidas en el modo de depuración. Recuerde, esto es python, realmente no es necesario nada más que declaraciones de impresión para depurar ;) He desarrollado todo calibre usando sólo esta técnica de depuración.
sv: Du kan sätta in utskriftssatser var som helst i din tilläggskod, de kommer att vara utdata i felsökningsläge. Kom ihåg att det här är python, du borde verkligen inte behöver något mer än utskriftsatser för felsöka;) jag har utvecklat hela calibre med att använda just denna felsökningsteknik.

source: You can quickly test changes to your plugin by using the following command line::
es: Puede probar rápidamente los cambios en su complemento mediante el uso de la siguiente línea de comando::
sv: Du kan snabbt testa ändringar i tillägget med hjälp av följande kommandorad::

source: This will shutdown a running calibre, wait for the shutdown to complete, then update your plugin in calibre and relaunch calibre.
es: Esto cerrará calibre, espere hasta que se cierre completamente, después actualice el complemento en calibre y vuelva a iniciar calibre.
sv: Detta kommer att stänga en köande calibre, vänta på avstängning för att slutföra och sedan uppdatera tillägg i calibre och starta om calibre.

source: More plugin examples
es: Más ejemplos de complementos
sv: Fler tilläggsexempel

source: You can find a list of many, sophisticated calibre plugins `here <http://www.mobileread.com/forums/showthread.php?t=118764>`_.
es: Puede encontrar una lista muchos complementos de calibre más complejos `aqui <http://www.mobileread.com/forums/showthread.php?t=118764>`_.
sv: Du kan finna en lista av många sofistikerade calibre tillägg `här <http://www.mobileread.com/forums/showthread.php?t=118764>`_.

source: Sharing your plugins with others
es: Compartir sus complementos con otros
sv: Dela dina tillägg med andra

source: If you would like to share the plugins you have created with other users of calibre, post your plugin in a new thread in the `calibre plugins forum <http://www.mobileread.com/forums/forumdisplay.php?f=237>`_.
es: Si desea compartir los complementos que ha creado con otros usuarios de calibre, cree una entrada adjuntando su complemento en los `Foros de complementos de calibre <http://www.mobileread.com/forums/forumdisplay.php?f=237>`_.
sv: Om du vill dela med dig dina tlllägg du skapat till andra, posta dem i en ny tråd i `calibre plugins forum <http://www.mobileread.com/forums/forumdisplay.php?f=237>`_.
