Repository: Easonqsp/calibre-translations
Catalog: manual/*/creating_plugins.po
Languages: es, sv

source: Writing your own plugins to extend calibre's functionality
es: Escribir sus propios complementos para extender la funcionalidad de calibre
sv: Skriva dina egna tillägg för att utöka calibres funktionalitet

source: calibre has a very modular design. Almost all functionality in calibre comes in the form of plugins. Plugins are used for conversion, for downloading news (though these are called recipes), for various components of the user interface, to connect to different devices, to process files when adding them to calibre and so on. You can get a complete list of all the built-in plugins in calibre by going to :guilabel:`Preferences->Plugins`.
es: calibre tiene un diseño muy modular. Casi todas las funciones de calibre vienen en forma de complementos. Los complementos se utilizan para la conversión, para la descarga de noticias (aunque éstos se llaman fórmulas), para diversos componentes de la interfaz de usuario, para conectarse a diferentes dispositivos, para procesar archivos cuando se añaden a calibre, etcétera. Puede obtener una lista completa de todos los complementos integrados en calibre en :guilabel:`Preferencias > Complementos`.
sv: calibre är en väldigt modulär konstruktion. Nästan alla funktioner i calibre kommer i form av tilläggsprogram. Tilläggsprogram används för omvandling, för nedladdning av nyheter ( även om dessa kallas för recept), för diverse komponenter av användargränssnitt, för anslutning av olika enheter, för bearbetning av filer när de läggs till calibre och så vidare. Du kan få en komplett lista av alla inbyggda tilläggsprogram i calibre genom att gå till :guilabel:`Preferences->Plugins`.

source: Here, we will teach you how to create your own plugins to add new features to calibre.
es: Aquí, le enseñaremos como crear sus propios complementos para agregar funciones a calibre.
sv: Här kommer vi att lära dig att skapa dina egna tillägg för att lägga till nya funktioner för att calibre.

source: Contents
es: Índice
sv: Innehåll

source: This only applies to calibre releases >= 0.8.60
es: Esto sólo se aplica a versiones calibre >= 0.8.60
sv: Detta gäller bara calibreversioner >= 0.8.60

source: Anatomy of a calibre plugin
es: Anatomía de un complemento de calibre
sv: Anatomi av ett calibre-tillägg

source: A calibre plugin is very simple, it's just a zip file that contains some python code and any other resources like image files needed by the plugin. Without further ado, let's see a basic example.
es: Un complemento calibre es muy simple, es sólo un archivo zip que contiene algo de código python y otros recursos como archivos de imagen necesarios por el complemento. Sin más preámbulos, vamos a ver un ejemplo básico.
sv: Ett calibre-tillägg är mycket enkel, det är bara en zip-fil som innehåller en del python-kod och alla andra resurser som bildfiler som behövs av tillägget. Utan vidare väsem, låt oss se ett grundläggande exempel.

source: Suppose you have an installation of calibre that you are using to self publish various e-documents in EPUB and MOBI formats. You would like all files generated by calibre to have their publisher set as "Hello world", here's how to do it. Create a file named :file:`__init__.py` (this is a special name and must always be used for the main file of your plugin) and enter the following Python code into it:
es: Suponga que tiene una instalación de calibre que está utilizando para autopublicar diversos documentos electrónicos en formatos EPUB y MOBI. ¿Le gustaría que todos los archivos generados por calibre tengan establecido como editor "Hola, mundo"? Aquí le mostramos cómo hacerlo. Crear un archivo llamado :file:`__init __.py` (este es un nombre especial y siempre debe ser utilizado para el archivo principal de su complemento) e introduzca el siguiente código Python en el mismo:
sv: Anta att du har en installation av calibre som du använder för att själv publicera olika e-dokument i EPUB- och MOBI-format. Du vill att alla filer som genereras av calibre att få sin förläggare in som "Hej världen", här är hur man gör det. Skapa en fil med namnet: file: `__init __ py` (detta är ett särskilt namn och ska alltid användas för huvudfilen för ditt tillägg) och skriv in följande Python-kod i den.:

source: That's all. To add this code to calibre as a plugin, simply run the following in the directory in which you created :file:`__init__.py`::
es: Eso es todo. Para agregar este código a calibre como un complemento, simplemente ejecute lo siguiente en la carpeta en que creó el archivo :file:`__init__.py`::
sv: Det är allt. För att lägga till denna kod till calibre som ett tillägg, bara kör följande i katalogen där du skapade: file: `__init __ py` ::.

source: On OS X, the command line tools are inside the calibre bundle, for example, if you installed calibre in :file:`/Applications` the command line tools are in :file:`/Applications/calibre.app/Contents/console.app/Contents/MacOS/`.
es: En OS X, las herramientas de línea de órdenes están dentro del paquete calibre, por ejemplo, si ha instalado calibre en :file:`&#x2F;Aplicaciones` las herramientas de línea de órdenes están en :file:`&#x2F;Aplicaciones&#x2F;calibre.app&#x2F;Contents&#x2F;console.app&#x2F;Contents&#x2F;MacOS&#x2F;`.
sv: På OS x, kommandoradverktyget är inne i calibre paketet, till exempel om du installerar Calibre i :file:`/Applications` är kommandoradverktyget i :file:`/Applications/calibre.app/Contents/console.app/Contents/MacOS/`.

source: You can download the Hello World plugin from `helloworld_plugin.zip <http://calibre-ebook.com/downloads/helloworld_plugin.zip>`_.
es: Puede descargar el complemento Hello World `helloworld_plugin.zip <http://calibre-ebook.com/downloads/helloworld_plugin.zip>`_.
sv: Du kan ladda ner Hello World plugin från `helloworld_plugin.zip <http://calibre-ebook.com/downloads/helloworld_plugin.zip>` _.

source: Every time you use calibre to convert a book, the plugin's :meth:`run` method will be called and the converted book will have its publisher set to "Hello World". This is a trivial plugin, lets move on to a more complex example that actually adds a component to the user interface.
es: Cada vez que utiliza calibre para convertir un libro, el método del complemento :meth:`run` será utilizado y el libro convertido tendrá como editor predeterminado "Hello World". Este es un complemento intranscendente, traslademonos a un ejemplo más complejo que agrega un componente a la interface de usuario.
sv: Varje gång du använder calibre att konvertera en bok, kommer tillägget: meth: `run` metod att anropas och den konverterade boken kommer att ha sin förläggare satt till" Hello World ". Detta är ett trivialt tillägg, låt oss gå vidare till ett mer komplext exempel som faktiskt lägger till en komponent till användargränssnittet.

source: A User Interface plugin
es: Un complemento de interfaz de usuario
sv: Ett gränssnittstillägg

source: This plugin will be spread over a few files (to keep the code clean). It will show you how to get resources (images or data files) from the plugin zip file, allow users to configure your plugin, how to create elements in the calibre user interface and how to access and query the books database in calibre.
es: Este complemento se extenderá sobre unos pocos archivos (para mantener el código fuente limpio). Se le mostrará cómo obtener recursos (imágenes o archivos de datos) desde el archivo zip del complemento, permitir a los usuarios configurar su complemento, cómo crear elementos en la interfaz de usuario de calibre y la forma de acceder y consultar la base de datos de libros en calibre.
sv: Detta tillägg kommer att spridas över några filer (för att hålla koden ren). Det kommer att visa dig hur du får resurser (bilder eller datafiler) från tilläggs zip-filen, tillåta användare att konfigurera tillägg, hur man skapar element i calibres användargränssnittet och hur man kommer åt och söka i böcker databasen i calibre.

source: You can download this plugin from `interface_demo_plugin.zip <http://calibre-ebook.com/downloads/interface_demo_plugin.zip>`_
es: Puede descargar este complemento desde `interface_demo_plugin.zip <http://calibre-ebook.com/downloads/interface_demo_plugin.zip>`_
sv: Du kan ladda ner tillägg från `interface_demo_plugin.zip <http://calibre-ebook.com/downloads/interface_demo_plugin.zip>`_

source: The first thing to note is that this zip file has a lot more files in it, explained below, pay particular attention to ``plugin-import-name-interface_demo.txt``.
es: La primera cosa a tener en cuenta es que este archivo zip tiene mucho más archivos en si mismo, explicado a continuación, preste especial atención a `plugin-import-name-interface_demo.txt``.
sv: Det första att notera är att denna zip-filen har mycket fler filer i sig, som förklaras nedan, ta särskild hänsyn till ``plugin-import-name-interface_demo.txt``.

source: An empty text file used to enable the multi-file plugin magic. This file must be present in all plugins that use more than one .py file. It should be empty and its filename must be of the form: plugin-import-name-**some_name**.txt The presence of this file allows you to import code from the .py files present inside the zip file, using a statement like::
es: Un archivo de texto vacío utilizado para activar la magia del complemento multi-archivo. Este archivo debe estar presente en todos los complementos que utilizan más de un archivo .py. Debe quedar vacía y su nombre de archivo debe ser de la siguiente forma: complemento-importación-nombre-**some_name**.txt. La presencia de este archivo le permite importar código de los archivos .py presentes dentro del archivo zip, usando una declaración como ésta::
sv: En tom textfil som används för att göra det möjligt för multifils tilläggsmagi. Filen måste finnas i alla tillägg som använder mer än en .py fil. Den ska vara tom och filnamnet måste vara på formen: plugin-import-namn - ** some_name ** txt Förekomsten av denna fil tillåter dig att importera koden från .py filerna som finns inne i zip-filen, med hjälp av ett uttalande. liknande::

source: The prefix ``calibre_plugins`` must always be present. ``some_name`` comes from the filename of the empty text file. ``some_module`` refers to :file:`some_module.py` file inside the zip file. Note that this importing is just as powerful as regular python imports. You can create packages and subpackages of .py modules inside the zip file, just like you would normally (by defining __init__.py in each sub directory), and everything should Just Work.
es: El prefijo ``calibre_plugins`` siempre debe estar presente. ``some_name`` proviene del nombre del archivo de texto vacío. ``some_module`` se refiere al archivo :file:`some_module.py` dentro del archivo zip. Tenga en cuenta que esta importación es tan poderoso como las importaciones regulares python. Puede crear paquetes y subpaquetes de módulos .py dentro del archivo zip, igual que lo haría normalmente (definiendo __init__.py en cada subdirectorio), y todo debería funcionar.
sv: Prefixet ``calibre_plugins`` måste alltid vara närvarande. ``some_name`` kommer från filnamnet på den tomma textfilen. ``some_module`` avser: file: `some_module.py` fil inne i zip-filen. Observera att denna import är lika kraftfull som valig python-importering. Du kan skapa paket och underpaket för .py moduler inuti zip-filen, precis som du normalt skulle (genom att definiera __init__.py i varje underkatalog), och allt ska bara fungera.

source: The name you use for ``some_name`` enters a global namespace shared by all plugins, **so make it as unique as possible**. But remember that it must be a valid python identifier (only alphabets, numbers and the underscore).
es: El nombre que utiliza para ``algun_nombre`` lo introduce en un espacio global de nombres compartido por todos los complementos, **hágalo tan único como sea posible**. Pero recuerde que debe ser un identificador válido python (sólo abecedario, números y guión bajo).
sv: Namnet du använda för ``some_name`` går in i en globala namnrymden delas av alla plugins, ** så gör det så unikt som möjligt **. Men kom ihåg att det måste vara en giltigt python-identifierare (endast alfabet, siffror och understreck).

source: As before, the file that defines the plugin class
es: Como antes, el archivo que define la clase del complemento
sv: Liksom tidigare filen som definierar tilläggsklassen

source: This file contains the actual code that does something useful
es: Este archivo contiene el código actual que realiza algo útil
sv: Den här filen innehåller den faktiska koden som gör något nyttigt

source: This file defines the interface part of the plugin
es: Este archivo define la parte de la interfaz del complemento
sv: Denna fil definierar gränssnittsdelen av tillägget

source: The icon for this plugin
es: El ícono para este complemento
sv: Ikonen för detta tillägg

source: A text file with information about the plugin
es: Un archivo de texto con información acerca de este complemento
sv: En textfil med information om tillägget

source: **translations**
es: **traducciones**
sv: **translationer**

source: A folder containing .mo files with the translations of the user interface of your plugin into different languages. See below for details.
es: Una carpeta que contiene los archivos .mo con las traducciones de la interfaz de usuario de su complemento en diferentes idiomas. Véase más abajo para más detalles.
sv: En mapp innehåller .mo filer med översättningar av användargränssnittet i ditt tillägg till olika språk. Se nedan för detaljer.

source: Now let's look at the code.
es: Ahora veamos el código.
sv: Låt oss nu titta på koden.

source: First, the obligatory ``__init__.py`` to define the plugin metadata:
es: Primero, el ``__init__.py`` obligatorio para definir los metadatos del complemento:
sv: örst den obligatoriska `` __init __ py`` för att definiera tilläggsmetadata.:

source: The only noteworthy feature is the field :attr:`actual_plugin`. Since calibre has both command line and GUI interfaces, GUI plugins like this one should not load any GUI libraries in __init__.py. The actual_plugin field does this for you, by telling calibre that the actual plugin is to be found in another file inside your zip archive, which will only be loaded in a GUI context.
es: La única característica notable es el campo :attr:`actual_plugin`. calibre posee línea de comandos y la interface gráfica de usuario, los complementos con GUI como éste no cargan ninguna biblioteca GUI en __init__.py. El actual_plugin lo hace por usted, notificando a calibre el actual complemento se encuentra en otro archivo dentro de su archivo zip, que sólo es cargado dentro de un contexto de interface gráfica.
sv: Det enda anmärkningsvärda funktionen är planen :attr:`actual_plugin`. Eftersom calibre har både kommandoraden och användargränssnitt bör tilläggets användargränssnitt som denna inte läser in bibliotekets användargränssnitt i __init__.py. Den actual_plugin fältet gör detta åt dig, genom att berätta för calibre att det faktiska tillägget är att finna i en annan fil i ditt zip-arkiv, som endast kommer att laddas i ett användargränssnittssammanhang.

source: Remember that for this to work, you must have a plugin-import-name-some_name.txt file in your plugin zip file, as discussed above.
es: Recuerde que para que esto funcione, debe poseer un archivo complemento-importar-nombre-algún_nombre.txt en el archivo zip del complemento, como se discutió anteriormente.
sv: Kom ihåg att för att detta ska fungera måste du ha ett plugin-import-name-some_name.txt filen i din tilläggs zip-fil, som diskuterats ovan.

source: Also there are a couple of methods for enabling user configuration of the plugin. These are discussed below.
es: También hay un par de métodos para permitir la configuración de usuario del complemento. Éstos se discuten a continuación.
sv: Också finns det ett par olika metoder för att möjliggöra konfiguration användare av tillägg. Dessa diskuteras nedan.

source: Now let's look at ui.py which defines the actual GUI plugin. The source code is heavily commented and should be self explanatory:
es: Ahora veamos en ui.py el cual define la interface gráfica de usuario del complemento. El código fuente está explícitamente comentado y debe explicarse por sí mismo:
sv: Låt oss nu titta på ui.py som definierar själva användargränssnittstillägget. Källkoden är kraftigt kommenterade och bör vara självförklarande:

source: The actual logic to implement the Interface Plugin Demo dialog.
es: La actual lógica para implementar el cuadro de diálogo de la interfaz de la demo de su complemento.
sv: Själva logiken för att implementera gränssnittsdialogen för tilläggsdemon.

source: Getting resources from the plugin zip file
es: Obteniendo recursos desde el archivo zip del complemento
sv: Att få resurser från tilläggs zip-filen

source: calibre's plugin loading system defines a couple of built-in functions that allow you to conveniently get files from the plugin zip file.
es: El sistema de carga de complementos de calibre define un par de funciones incorporadas que le permiten cómodamente obtener archivos desde el archivo zip del complemento.
sv: calibres tilläggsladdningsssystem definierar ett par inbyggda funktioner som gör att du bekvämt hämta filer från tilläggets zip-fil.

source: This function should be called with a list of paths to files inside the zip file. For example to access the file icon.png in the directory images in the zip file, you would use: ``images/icon.png``. Always use a forward slash as the path separator, even on windows. When you pass in a single name, the function will return the raw bytes of that file or None if the name was not found in the zip file. If you pass in more than one name then it returns a dict mapping the names to bytes. If a name is not found, it will not be present in the returned dict.
es: Esta función debe ser llamada con una lista de rutas de acceso a los archivos dentro del archivo zip. Por ejemplo, para acceder al archivo icon.png en la carpeta de imágenes del archivo zip, utilizaría: ``images/icon.png``. Siempre use una barra diagonal como separador de ruta, incluso en Windows. Cuando se pasa un solo nombre, la función devolverá los bytes esenciales de ese archivo o Ninguno si el nombre no se encontró en el archivo zip. Si pasa más de un nombre, entonces devuelve un dictionario de mapeo de nombres a bytes. Si no se encuentra un nombre, no estará presente en el diccionario devuelto.
sv: Denna funktion bör anropas med en lista av sökvägar till filer i zip-filen. Till exempel för att komma åt filen icon.png i katalogen bilder i zip-filen, skulle du använda: ``images / icon.png``. Använd alltid ett snedstreck som sökvägsavgränsare, även på fönstren. När du skickar vidare ett enda namn, kommer funktionen returnera råa oktettfilen eller Ingen om namnet inte hittades i zip-filen. Om du skickar mer än ett namn så är det returneras en ordlista passande namn till oktett. Om ett namn inte hittas, kommer det inte att finnas i den returnerade listan.

source: A convenience wrapper for get_resources() that creates QIcon objects from the raw bytes returned by get_resources. If a name is not found in the zip file the corresponding QIcon will be null.
es: Una envoltura útil para get_resources () que crea objetos QIcon de los bytes devueltos por get_resources. Si un nombre no se encuentra en el archivo zip, el QIcon correspondiente será nulo.
sv: Ett bekvämligt omslag för get_resources () som skapar QIcon objekt från rådata returneras av get_resources. Om ett namn inte finns i zip-filen blir motsvarande QIcon null.

source: Enabling user configuration of your plugin
es: Habilitando configuración de usuario de su complemento
sv: Aktivera konfiguration användare av ditt tillägg

source: To allow users to configure your plugin, you must define three methods in your base plugin class, '**is_customizable**, **config_widget** and **save_settings** as shown below:
es: Para permitir a los usuarios configurar su complemento, debe definir tres métodos en la clase base de complementos, '**is_customizable**, **config_widget** y **save_settings** como se muestra a continuación:
sv: För att tillåta användare att konfigurera tillägg måste du definiera tre metoder i din bastilläggsklass, '**is_customizable**, **config_widget** och **save_settings** enligt nedan:

source: calibre has many different ways to store configuration data (a legacy of its long history). The recommended way is to use the **JSONConfig** class, which stores your configuration information in a .json file.
es: calibre tiene muchas maneras diferentes de almacenar datos de configuración (un legado de su larga historia). El método recomendado es usar la clase **JSONConfig**, que almacena la información de configuración en un archivo .json.
sv: calibre har många olika sätt att lagra konfigurationsdata (ett arv av sin långa historia). Det rekommenderade sättet är att använda **JSONConfig** klass, som lagrar konfigurationsinformationen i en .json-fil.

source: The code to manage configuration data in the demo plugin is in config.py:
es: El código para gestionar los datos de configuración en el complemento demo está en config.py:
sv: Koden för att hantera konfigurationsdata i demotillägget är i config.py:

source: The ``prefs`` object is now available throughout the plugin code by a simple::
es: El objeto ``prefs`` está ahora disponible en todo el código del complemento por un simple::
sv: Den ``prefs``-objekt är nu tillgängligt i hela tilläggskoden med en enkel::

source: You can see the ``prefs`` object being used in main.py:
es: Puede observar el objeto ``prefs`` siendo usado en main.py:
sv: Du kan se ``prefs``-objekt användas i main.py:

source: Edit Book plugins
es: Complementos para modificar libros
sv: Redigera boktillägg

source: Now let's change gears for a bit and look at creating a plugin to add tools to the calibre book editor. The plugin is available here: `editor_demo_plugin.zip <http://calibre-ebook.com/downloads/editor_demo_plugin.zip>`_.
es: Ahora vamos a cambiar los engranajes un poco y enfocarnos en crear un complemento para añadir herramientas al editor de libros de calibre. El complemento está disponible aquí: `editor_demo_plugin.zip <http://calibre-ebook.com/downloads/editor_demo_plugin.zip>` _.
sv: Nu ska växla för lite och ser till att skapa ett tillägg för att lägga verktyg till för calibre-bokeditorn. Tillägget finns här: `editor_demo_plugin.zip <http://calibre-ebook.com/downloads/editor_demo_plugin.zip>`_.

source: The first step, as for all plugins is to create the import name empty txt file, as described :ref:`above <import_name_txt>`. We shall name the file ``plugin-import-name-editor_plugin_demo.txt``.
es: El primer paso, como para todos los complementos es crear un archivo :ref:`above <import_name_txt>`. Vamos a nombrar el archivo ``plugin-import-name-editor_plugin_demo.txt``.
sv: Det första steget, som för alla tillägg är att skapa importnamnet tom txt-fil, som beskrivs :ref:`above <import_name_txt>`. Vi ska namnge filen ``plugin-import-name-editor_plugin_demo.txt``.

source: Now we create the mandatory ``__init__.py`` file that contains metadata about the plugin -- its name, author, version, etc.
es: Ahora creamos el archivo obligatorio ``__init__.py`` que contiene metadatos acerca del complemento - su nombre, autor, versión, etc.
sv: Nu skapar vi den obligatoriska ``__init __ py``-filen som innehåller metadata om tillägget -. Sitt namn, författare, version, etc.
