Repository: Easonqsp/calibre-translations
Catalog: manual/*/customize.po
Languages: cs, de, es, fr, sv

source: Customizing calibre
cs: Přizpůsobení calibre
de: calibre anpassen
es: Personalizar calibre
fr: Personnaliser calibre
sv: Anpassa calibre

source: calibre has a highly modular design. Various parts of it can be customized. You can learn how to create *recipes* to add new sources of online content to calibre in the Section :ref:`news`. Here, you will learn, first, how to use environment variables and *tweaks* to customize calibre's behavior, and then how to specify your own static resources like icons and templates to override the defaults and finally how to use *plugins* to add functionality to calibre.
cs: calibre má vysoce modulární provedení. Různé jeho části mohou být upraveny. Jak vytvořit *předpisy* pro přidání nových zdrojů online obsahu do calibre se můžete naučit v oddílu :ref:`news`. Zde se nejdříve naučíte, jak používat proměnné prostředí a *vylepšení* pro přizpůsobení chování calibre, a potom jak zadat své vlastní statické zdroje, jako jsou ikony a šablony, pro přepsání výchozího nastavení a nakonec jak používat *moduly* pro přidávání funkcí do calibre.
de: calibre ist sehr modular aufgebaut. Viele Teile können angepasst werden. Im Abschnitt :ref:`news` Sie können lernen, wie man *Rezepte* für neue Nachrichtenquellen von Online-Inhalten erstellt und diese zu calibre hinzufügt. Hier lernen Sie zuerst, wie mithilfe von Umgebungsvariablen und *Tweaks* calibre's Verhalten anpasst wird und danach, wie man eigene statische Ressourcen wie z. B. Symbole und Vorlagen verwendet, um Standardwerte zu überschreiben und zuletzt, wie man *Plugins* verwendet um in calibre Funktionalitäten zu erweitern.
es: calibre tiene un diseño altamente modular. Sus distintas partes se pueden personalizar. Puede aprender cómo crear *fórmulas* para añadir nuevas fuentes de contenido en línea en calibre en la sección :ref:`news`. Aquí, aprenderá, en primer lugar, el uso de variables de entorno y *ajustes* para personalizar el comportamiento de calibre, y luego cómo especificar sus propios recursos estáticos como iconos y plantillas para reemplazar los valores predeterminados y, finalmente, cómo utilizar *complementos* para añadir funcionalidad a calibre.
fr: calibre possède un design hautement modulaire. Diverses parties de celui-ci peuvent être personnalisées. Vous pouvez apprendre comment créer des *recettes* pour ajouter de nouvelles sources d'actualité de contenu en ligne à calibre dans la Section :ref:`news`. Ici, vous apprendrez, tout d'abord, comment utiliser les variables d'environnement et les *ajustements* pour personnaliser le comportement de calibre, et donc comment spécifier vos propres ressources statiques comme les icônes et les modèles pour outrepasser ceux par défaut et finallement comment utiliser *les extensions* pour ajouter des fonctionnalités à calibre.
sv: calibre är en mycket modulär konstruktion. Diverse delar av den kan anpassas. Du kan lära dig skapa *recpt* som läggs till källan av tillängliga innehållet av calibre i sektionen :ref:`news`. Här kommer du för lära dig använda miljövarabler och *justera* för att anpassa calibreers beteende, och sedan hur du specifierar dina statiska resurser som ikoneroch mallar för att överrida grundinställningar och slutligen hur *tilläggsprogram* kan användas för att lägga till funktionalitet till calibre.

source: Environment variables
cs: Proměnné prostředí
de: Umgebungsvariablen
es: Variables de entorno
fr: Variables d'environnement
sv: Miljövariabler

source: ``CALIBRE_CONFIG_DIRECTORY`` - sets the directory where configuration files are stored/read.
cs: ``CALIBRE_CONFIG_DIRECTORY`` – Nastaví adresář, kde jsou uložené konfigurační soubory.
de: ``CALIBRE_CONFIG_DIRECTORY`` - legt das Verzeichnis fest, in dem die Konfigurationsdateien gespeichert/gelesen werden.
es: ``CALIBRE_CONFIG_DIRECTORY`` - establece el directorio donde se guardan y de donde se leen los archivos de configuración
fr: ``CALIBRE_CONFIG_DIRECTORY`` - paramètre le répertoire où les fichiers de configuration sont stockés/lus.
sv: ``CALIBRE_CONFIG_DIRECTORY`` - anger katalog var konfigurationsfiler lagras och läses.

source: ``CALIBRE_TEMP_DIR`` - sets the temporary directory used by calibre
cs: ``CALIBRE_TEMP_DIR`` –Nastaví dočasný adresář používaný calibre.
de: ``CALIBRE_TEMP_DIR`` - legt das verwendete temporäre Verzeichnis von calibre fest
es: ``CALIBRE_TEMP_DIR`` - establece el directorio temporal utilizado por calibre
fr: ``CALIBRE_TEMP_DIR`` - paramètre le répertoire temporaire utilisé par calibre
sv: ``CALIBRE_TEMP_DIR`` - anger temporärkatalog som används av Calibre

source: ``CALIBRE_CACHE_DIRECTORY`` - sets the directory calibre uses to cache persistent data between sessions
cs: ``CALIBRE_CACHE_DIRECTORY`` - nastaví adresář, který Calibre používá pro ukládání trvalých dat do mezipaměti mezi relacemi
de: ``CALIBRE_CACHE_DIRECTORY`` - legt das Verzeichnis fest, in dem calibre Daten zwischen den Sitzungen zwischenspeichert.
fr: ``CALIBRE_CACHE_DIRECTORY`` - défini le répertoire utilisé pour un cache persistant des données entre les sessions
sv: ``CALIBRE_CACHE_DIRECTORY`` - anger katalog calibre använder för att mellanlagra persistent data mellan sessioner

source: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - allows you to specify the full path to metadata.db. Using this variable you can have metadata.db be in a location other than the library folder. Useful if your library folder is on a networked drive that does not support file locking.
cs: ``CALIBRE_OVERRIDE_DATABASE_PATH`` –Umožňuje vám zadat úplnou cestu k metadata.db. Pomocí této proměnné můžete mít metadata.db v jiném umístění než ve složce knihovny. Užitečné, pokud je vaše složka knihovny na síťové jednotce, která nepodporuje uzamykání souboru.
de: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - erlaubt die Angabe des vollständigen Pfads zur metadata.db. Durch Benutzung dieser Variable kann sich die metadata.db an einem anderen Speicherort befinden als im normalerweise vorgesehenen Bibliotheks-Ordner. Dies ist nützlich, wenn Ihr Bibliotheksordner sich auf einem Netzlaufwerk befindet und das Sperren von Dateien nicht unterstützt wird.
es: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - permite especificar la ruta completa a metadata.db. Usando esta variable metadata.db puede tener metadata.db en una ubicación distinta de la carpeta de la biblioteca. Esto es útil si la carpeta de la biblioteca está en una unidad de red que no admite el bloqueo de archivos.
fr: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - vous permet de spécifier le chemin de fichier complet vers metadata.db. En utilisant cette variable vous pouvez avoir metadata.db dans un autre emplacement que le répertoire de la bibliothèque. Utile si votre répertoire de bibliothèque est sur un lecteur réseau qui ne supporte pas le verrouillage de fichier.
sv: ``CALIBRE_OVERRIDE_DATABASE_PATH`` - tillåter dig att ange fulla sökvägen till metadata.db. Genom att använda denna variabel kan du ha metadata.db i en annan plats än bibliotekskatalogen. Användbart om din bibliotekskatalog är på ett nätverk som inte stöder låsning av filer.

source: ``CALIBRE_DEVELOP_FROM`` - Used to run from a calibre development environment. See :ref:`develop`.
cs: ``CALIBRE_DEVELOP_FROM`` – Použito pro spuštění z vývojového prostředí calibre. Podívejte se na :ref:`develop`.
de: ``CALIBRE_DEVELOP_FROM`` - wird verwendet, um calibre in einer Entwicklungsumgebung zu starten. Siehe :ref:`develop`.
es: ``CALIBRE_DEVELOP_FROM`` - Se utiliza para ejecutar desde un entorno de desarrollo de calibre. Vea :ref:`develop`.
fr: ``CALIBRE_DEVELOP_FROM`` - Utilisé pour exécuter à partir d'un environnement de développement calibre. Voir :ref:`develop`.
sv: ``CALIBRE_DEVELOP_FROM`` - Används för att köra från en Calibre-utvecklingsmijö. Se :ref:`develop`.

source: ``CALIBRE_OVERRIDE_LANG`` - Used to force the language used by the interface (ISO 639 language code)
cs: ``CALIBRE_OVERRIDE_LANG`` – Použito pro vynucení jazyka použitého rozhraním (kód jazyka ISO 639).
de: ``CALIBRE_OVERRIDE_LANG`` - wird verwendet, um die Sprache der Benutzeroberfläche zu erzwingen (ISO 639-Sprachcode).
es: ``CALIBRE_OVERRIDE_LANG`` - Se utiliza para forzar el idioma de la interfaz (código de idioma ISO 639)
fr: ``CALIBRE_OVERRIDE_LANG`` - langue utilisée par l'interface(code de langue ISO 639)
sv: ``CALIBRE_OVERRIDE_LANG`` - Används för att styra språket som används av gränssnittet (ISO 639 language code)

source: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Causes calibre to not use native file dialogs for selecting files/directories. Set it to 1 to enable.
cs: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` – Způsobuje, že calibre nepoužívá nativní dialogová okna souboru pro výběr souborů nebo adresářů. Nastavte na 1 pro povolení.
de: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - veranlasst calibre nicht die nativen Dateidialoge für die Auswahl von Dateien/Verzeichnisse zu verwenden. Zur Aktivierung auf 1 setzen.
es: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Hace que calibre no utilice los cuadros de diálogo nativos para la selección de archivos y directorios. Para activar, asigne el valor 1.
fr: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Entraîne calibre à ser les fichiers de dialogues natifs pour la sélection des fichiers/répertoires. Réglez le à 1 pour l'activer.
sv: ``CALIBRE_NO_NATIVE_FILEDIALOGS`` - Får Calibre att inte använda ursprungliga fildialoger för att välja filer/kataloger. Sätt den till 1 för att använda.

source: ``CALIBRE_NO_NATIVE_MENUBAR`` - Causes calibre to not create a native (global) menu on Ubuntu Unity and similar linux desktop environments. The menu is instead placed inside the window, as traditional.
cs: ``CALIBRE_NO_NATIVE_MENUBAR`` - Způsobí, aby Calibre nevytvářelo nativní (globální) nabídku v Ubuntu Unity a podobných desktopových prostředí Linux. Nabídka je místo toho umístěna do okna, jako obvykle.
de: ``CALIBRE_NO_NATIVE_MENUBAR`` - Veranlasst calibre kein natives (globales) Menü auf Ubuntu Unity und ähnliche Linux-Desktop-Umgebungen zu erstellen. Das Menü wird stattdessen wie üblich innerhalb des Fensters platziert.
es: ``CALIBRE_NO_NATIVE_MENUBAR`` - Hace que calibre no cree un menú nativo (global) en Ubuntu Unity y otros entornos de escritorio de linux. El menú se crea dentro de la ventana, que es más tradicional.
fr: ``CALIBRE_NO_NATIVE_MENUBAR`` - entraîne le fait que calibre ne crée pas de menu natif (global) sur Ubuntu Unity et les environnements bureau linux similaires. A la place, le menu est placé dans la fenêtre, comme d'habitude.
sv: ``CALIBRE_NO_NATIVE_MENUBAR`` - Orsakar att calibre inte skapar en grund- (global) menyn på Ubuntu Unity och liknande linux skrivbordsmiljöer. Menyn är istället placerad inuti fönstret, som vanligt.

source: ``CALIBRE_IGNORE_SYSTEM_THEME`` - Causes calibre to ignore any system Qt style plugins and use its builtin style plugin instead. Useful to workaround crashes caused by the system Qt plugin being incompatible with the version of Qt shipped with calibre.
cs: ``CALIBRE_IGNORE_SYSTEM_THEME`` - Způsobí, že Calibre bude ignorovat všechny systémové moduly stylu Qt a namísto toho použije svůj vestavěný modul stylu. Užitečné pro vyřešení pádů způsobených systémovým modulem Qt, který je nekompatibilní s verzí Qt dodanou s Calibre.
de: ``CALIBRE_IGNORE_SYSTEM_THEME`` - verursacht, dass calibre alle System Qt Style Plugins ignoriert. Statt dessen wird das integrierte Style Plugin verwendet. Diese Funktion kann dazu verwendet werden, Probleme zu umgehen, wenn die Qt Version die mit calibre kommt mit den System Qt Plugins inkompatibel ist und Crashes verursacht.
es: ``CALIBRE_IGNORE_SYSTEM_THEME`` - Hace que calibre no tenga en cuenta los complementos de estilo de Qt del sistema y use el estilo incorporado. Es útil para evitar fallos causados por una incompatibilidad entre el complemento de Qt del sistema y la versión de Qt incluida en calibre.
fr: ``CALIBRE_IGNORE_SYSTEM_THEME`` - amène calibre à ignorer toute extension de style Qt et à utiliser ses styles intégrés à la place. Utile pour contourner les pannes causées par l'extension système Qt étant incompatible avec la version embarquée avec calibre.
sv: ``CALIBRE_IGNORE_SYSTEM_THEME`` - Får calibre att ignorera några system Qt stiltillägg och använda sitt inbyggda stiltillägg istället. Användbar för att komma runt krascher som orsakas av systemet Qt-tillägg som är oförenligt med den version av Qt som levereras med calibre.

source: ``CALIBRE_SHOW_DEPRECATION_WARNINGS`` - Causes calibre to print deprecation warnings to stdout. Useful for calibre developers.
de: ``CALIBRE_SHOW_DEPRECATION_WARNINGS`` - Veranlasst Calibre eine 'veraltet'-Warnung auf stdout auszugeben. Nützlich für Calibre-Entwickler.
sv: ``CALIBRE_SHOW_DEPRECATION_WARNINGS`` - Får calibre att skriva ut deprecieringsvarningar till stdout. Användbart för calibre-utvecklare.

source: ``SYSFS_PATH`` - Use if sysfs is mounted somewhere other than /sys
cs: ``SYSFS_PATH`` – Použijte, pokud je sysfs připojeno někde jinde než /sys.
de: ``SYSFS_PATH`` - zu benutzen, wenn wenn sysfs irgendwo anders als unter /sys eingebunden ist.
es: ``SYSFS_PATH`` - Úsela si sysfs está montado en una ubicación distinta de /sys
fr: ``SYSFS_PATH`` - Utiliser si sysfs est monté autre part que /sys
sv: ``SYSFS_PATH`` - Använd om sysfs är monterad någon annanstans än /sys

source: ``http_proxy`` - Used on linux to specify an HTTP proxy
cs: ``http_proxy`` – Použito v Linuxu pro zadání proxy HTTP.
de: ``http_proxy`` - wird unter Linux verwendet, um einen HTTP-Proxy anzugeben.
es: ``http_proxy`` - Utilizado en linux para especificar un proxy HTTP
fr: ``http_proxy`` - Utilisé sous Linux pour spécifier un proxy HTTP
sv: ``http_proxy`` - Används på linux för att ange en specifik HTTP proxy

source: See `How to set environment variables in windows <http://www.computerhope.com/issues/ch000549.htm>`_ or `How to set environment variables in OS X <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-home-slash-dot-macosx-slash-environment-dot-plist/>`_.
cs: Podívejte se na `Jak nastavit proměnné prostředí ve Windows <http://www.computerhope.com/issues/ch000549.htm>`_ nebo `Jak nastavit proměnné prostředí v OS X <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-home-slash-dot-macosx-slash-environment-dot-plist/>`_.
de: Siehe `How to set environment variables in windows <http://www.computerhope.com/issues/ch000549.htm>`_ oder `How to set environment variables in OS X <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-home-slash-dot-macosx-slash-environment-dot-plist/>`_.
es: Vea `Cómo configurar variables de entorno en Windows <http://www.computerhope.com/issues/ch000549.htm>`_ o `Cómo configurar variables de entorno en OS X <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-home-slash-dot-macosx-slash-environment-dot-plist/>`_ (ambos en inglés).
fr: Voir `Comment paramétrer les variables d'environnement dans Windows <http://www.computerhope.com/issues/ch000549.htm>` ou `Comment paramétrer les variables d'environnement dans OS X <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-home-slash-dot-macosx-slash-environment-dot-plist/>`_.
sv: Se `Hur du ställer in miljövariabler i Windows <http://www.computerhope.com/issues/ch000549.htm>`_ eller `Hur du ställer in miljövariabler i OS X <http://www.dowdandassociates.com/blog/content/howto-set-an-environment-variable-in-mac-os-x-home-slash-dot-macosx-slash-environment-dot-plist/>`_.

source: Tweaks
cs: Vylepšení
es: Ajustes
fr: Ajustements
sv: Justeringar

source: Tweaks are small changes that you can specify to control various aspects of calibre's behavior. You can change them by going to Preferences->Advanced->Tweaks. The default values for the tweaks are reproduced below
cs: Vylepšení jsou malé změny, které můžete zadat pro určení různých aspektů chování calibre. Můžete je změnit v Předvolby->Rozšířené->Vylepšení. Výchozí hodnoty pro vylepšení jsou zopakovány níže
de: Tweaks oder auch Optimierungen sind kleine Änderungen, die Sie angeben können, um verschiedene Aspekte von calibre's Verhalten zu steuern. Sie können diese ändern, indem Sie auf Einstellungen -> Erweitert-> Tweaks gehen. Die Standardwerte für alle Tweaks sind nachfolgend beschrieben.
es: Los ajustes son pequeños cambios que puede especificar para controlar varios aspectos del comportamiento de calibre. Puede cambiarlos en Preferencias > Avanzado > Ajustes. Los valores predeterminados para los ajustes se muestran a continuación
fr: Les ajustements sont de petits changements que vous pouvez spécifier pour contrôler divers aspects du comportement de calibre. Vous pouvez les changer en allant dans Préférences->Avancé->Ajustements. Les valeurs par défaut pour les ajustements sont reproduits ci-dessous
sv: Justeringar är små förändringar som du kan ange för att styra diverse aspekter av calibreens beteende. Du kan ändra dem genom att gå till inställningar Preferences->Advanced->Tweaks. Grundinställningsvärde för justeringar visas nedan

source: Overriding icons, templates, et cetera
cs: Přepsání ikon, šablon atd.
de: Überschreiben von Symbolen, Vorlagen, etc.
es: Reemplazar iconos, plantillas, etcétera
fr: Outrepasser les Icônes, les modèles, etc.
sv: Överrider ikoner, mallar, etc

source: calibre allows you to override the static resources, like icons, javascript and templates for the metadata jacket, catalogs, etc. with customized versions that you like. All static resources are stored in the resources sub-folder of the calibre install location. On Windows, this is usually :file:`C:\\Program Files\\Calibre2\\resources`. On OS X, :file:`/Applications/calibre.app/Contents/Resources/resources/`. On linux, if you are using the binary installer from the calibre website it will be :file:`/opt/calibre/resources`. These paths can change depending on where you choose to install calibre.
cs: Calibre vám umožňuje přepsat statické zdroje, jako jsou ikony, javascript a šablony, pro přebal s metadaty, katalogy atd. upravenými verzemi, které se vám líbí. Všechny statické zdroje jsou uložené v podsložce resources instalačního umístění Calibre. Ve Windows je to obvykle :file:`C:\\Program Files\\Calibre2\resources`. V OS X :file:`/Applications/calibre.app/Contents/Resources/resources/`. V Linuxu, pokud používáte binární instalační balíček z webové stránky Calibre, to bude :file:`/opt/calibre/resources`. Tyto cesty se můžou měnit v závislosti na tom, kam si zvolíte nainstalovat Calibre.
de: calibre ermöglicht das Überschreiben der statischen Ressourcen wie Icons, Javascript und Vorlagen für die Metadaten-Buchumschläge, Kataloge, usw. durch angepasste Versionen, die Ihnen gefallen. Alle statische Ressourcen werden im Ressourcen-Unterordner im calibre-Installationsverzeichnis gespeichert. Für Windows ist dies in der Regel unter :file:`C:\\Program Files\\Calibre2\\resources`. Für OS X ist dies unter :file:`/Applications/calibre.app/Contents/Resources/resources/`. Für Linux ist dies, falls Sie den binären Installer der calibre-Website verwenden, unter :file:`/opt/calibre/resources`. Diese Pfade können sich, je nachdem wo Sie calibre installiert haben, ändern.
es: calibre le permite reemplazar los recursos estáticos, como iconos, javascript y plantillas para la sobrecubierta de metadatos, catálogos, etc., con versiones personalizadas. Todos los recursos estáticos se almacenan en la subcarpeta :file:`resources`. En Windows, se encuentra por lo general en :file:`C:\\Archivos de programa\\Calibre2\\resources`. En OS X, :file:`/Aplicaciones/calibre.app/Contents/Resources/resources/`. En Linux, si está usando el instalador binario del sitio web de calibre, será :file:`/opt/calibre/resources`. Estas rutas de acceso pueden cambiar dependiendo de dónde decida instalar calibre.
fr: calibre vous permet d'outrepasser les ressources statiques, comme les icônes, le javascript et les modèles pour les jaquettes de métadonnées, catalogues, etc. avec des versions personnalisées que vous préférez. Toutes les ressources statiques sont stockées dans le sous-répertoire ressources de l'emplacement d'installation de calibre. Sous Windows c'est habituellement :file:`C:\\Program Files\\Calibre2\\resources`. Sous OS X, :file:`/Applications/calibre.app/Contents/Resources/resources/`. Sous Linux, si vous utilisez l'installateur de binaires depuis le site web de calibre il sera :file:`/opt/calibre/resources`. Ces chemins peuvent changer dépendant de où vous choisissez d'installer calibre.
sv: calibre gör att du kan överrida de statiska resurser, som ikoner, javascript och mallar för metadata omslag, kataloger, etc. med anpassade versioner som du gillar. Alla statiska resurser sparas i resursundermappar i calibres installationsplats. I Windows är det oftast :file:`C:\\Program Files\\Calibre2\\resources`. På OS X :file:`/Applications/calibre.app/Contents/Resources/resources/`. På Linux, om du använder det binära installationsprogrammet från calibres webbplats blir det :file:`/opt/calibre/resources`. Dessa vägar kan ändras beroende på var du väljer att installera calibre.
