Repository: Easonqsp/calibre-translations
Catalog: manual/*/customize.po
Languages: cs, de, es, fr, sv

source: You should not change the files in this resources folder, as your changes will get overwritten the next time you update calibre. Instead, go to :guilabel:`Preferences->Advanced->Miscellaneous` and click :guilabel:`Open calibre configuration directory`. In this configuration directory, create a sub-folder called resources and place the files you want to override in it. Place the files in the appropriate sub folders, for example place images in :file:`resources/images`, etc. calibre will automatically use your custom file in preference to the built-in one the next time it is started.
cs: Soubory v této složce zdrojů byste neměli měnit, protože vaše změny budou přepsaány při příští aktualizaci calibre. Namísto toho přejděte do :guilabel:`Předvolby->Rozšířené->Různé` a klikněte na :guilabel:`Otevřít konfigurační adresář calibre`. V tomto konfiguračním adresáři vytvořte podsložku nazvanou resources a umístěte do ní soubory, které chcete přepsat. Umístěte soubory do příslušných podsložek, například obrázky umístěte do :file:`resources/images` atd. calibre automaticky použije při příštím spuštění váš vlastní soubor přednostně před vestavěným.
de: Sie sollten die Dateien in diesem Ressourcenordner nicht ändern, da die Änderungen bei der nächsten Aktualisierung von calibre überschrieben werden. Stattdessen gehen Sie zu :guilabel:`Einstellungen -> Erweitert -> Verschiedenes` und klicken Sie auf :guilabel:`calibre Einstellungsverzeichnis öffnen`. Erstellen Sie in diesem Konfigurationsverzeichnis einen Unterordner namens Resources, und speichern dort die Dateien, die Sie überschreiben möchten. Speichern Sie Dateien in die entsprechenden Unterordner, z. B. platzieren Sie Bildern im Verzeichnis :file:`resources/images`, usw.. calibre wird automatisch die benutzerdefinierte Datei anstelle der integrierten beim nächsten Programmstart verwenden.
es: No debe modificar los archivos de esta carpeta de recursos, ya que los cambios serán reemplazados la próxima vez que actualice calibre. En lugar de ello, vaya a :guilabel:`Preferencias > Avanzado > Miscelánea` y pulse :guilabel:`Abrir el directorio de configuración calibre`. En este directorio de configuración, cree una subcarpeta llamada :file:`resources` y coloque los archivos que quiere reemplazar. Coloque los archivos en las subcarpetas apropiadas, por ejemplo coloque las imágenes en :file:`resources/images`, etc. calibre usará automaticamente los archivos personalizados la próxima vez que se inicie.
fr: Vous ne devriez pas changer les fichiers de ce répertoire ressources, vu que vos changements seront écrasés lors de votre prochaine mise à jour de calibre. A la place, allez dans :guilabel:`Préférences->Avancé->Divers` et cliquez :guilabel:`Ouvrir le répertoire de configuration de calibre`. Dans ce répertoire de configuration, créer un sous répertoire appelé resources et placez y les fichiers que vous voulez remplacer. Placer les fichiers dans le sous répertoire approprié, par exemple placez les images dans :file:`resources/images`, etc. calibre utilisera automatiquement votre fichier personnalisé en préférence à celui intégré la prochaine fois qu'il est démarré.
sv: Du ska inte ändra filer i denna resurskatalog, eftersom dina ändringar kommer skrivas över nästa gång du uppdaterar calibre. Gå i stället till :guilabel:`Inställningar->Avancerat->Diverse` och klicka :guilabel:`Öppna calibres inställningsmapp`. I denna konfigurationskatalog skapa en underkatalog med namnet resurser och placera filerna du vill överrida i den. Placera filer i lämplig underkatalog, som till exempel för bilder :file:`resources/images`, etc. calibre kommer automatisk använda dessa anpassade inställningar i stället för de inbyggda nästa gång det startar.

source: For example, if you wanted to change the icon for the :guilabel:`Remove books` action, you would first look in the built-in resources folder and see that the relevant file is :file:`resources/images/trash.png`. Assuming you have an alternate icon in PNG format called :file:`mytrash.png` you would save it in the configuration directory as :file:`resources/images/trash.png`. All the icons used by the calibre user interface are in :file:`resources/images` and its sub-folders.
cs: Například pokud chcete změnit ikonu pro akci :guilabel:`Odebrat knihy`, nejdříve byste se podívali do vestavěné složky resources a viděli byste, že odpovídající soubor je :file:`resources/images/trash.png`. Pokud máte alternativní ikonu ve formátu PNG nazvanou :file:`mytrash.png`, uložili byste ji do konfiguračního adresáře jako :file:`resources/images/trash.png`. Všechny ikony použité uživatelským rozhraním calibre jsou v :file:`resources/images` a jeho podsložkách.
de: Wenn Sie beispielsweise das Symbol für die Aktion :guilabel:`Bücher entfernen` ändern wollten, würde Sie zuerst in integrierten Ressourcenordner schauen und sehen, dass die entsprechende Datei :file:`resources/images/trash.png` heißt. Angenommen, Sie haben ein alternatives Symbol im PNG-Format mit dem Namen :file:`mytrash.png`, sollte diese im Konfigurationsverzeichnis als :file:`resources/images/trash.png` gespeichert werden. Alle Symbole, die von der calibre -Benutzeroberfläche verwendet werden, sind unter :file:`resources/images` und dessen Unterordnern zu finden.
es: Por ejemplo, si quisiera cambiar el icono para la acción :guilabel:`Eliminar libros`, primero debería examinar la carpeta de recursos de calibre y ver que el archivo relevante es :file:`resources/images/trash.png`. Asumiendo que cuenta con un icono alternativo en formato PNG llamado :file:`mytrash.png`, lo guardaría en la carpeta de configuración como :file:`resources/images/trash.png`. Todos los iconos usados por la interfaz de usuario de calibre están en :file:`resources/images` y sus subcarpetas.
fr: Par exemple, si vous désirez changer l'icône pour l'action :guilabel:`Supprimer des livres`, vous devrez d'abord regarder dans le répertoire resources intégré et voir que le ficher pertinent est :file:`resources/images/trash.png`. Supposons que vous avez une icône alternative appelée :file:`mytrash.png` vous devriez la sauver dans le répertoire de configuration comme file:`resources/images/trash.png`. Toutes les icônes par l'interface utilisateur calibre sont dans :file:`resources/images` et ses sous.répertoires.
sv: Till exempel, om du vill anvnda ikonen för :guilabel:`Ta bort böcker` åtgärd, ska du för titta i den inbyggda resurskatalogen och se att den relevanta filen är :file:`resources/images/trash.png`. Med antagandet att du har en alternativ ikon i PNG-format kallad :file:`mytrash.png` kommer du spara den i konfigurationskatalogen som :file:`resources/images/trash.png`. Alla ikoner som används av Calibres-användargränssnitt är i :file:`resources/images` och dess underkataloger.

source: Creating your own icon theme for calibre
sv: Skapa dina egna ikonteman för calibre

source: Customizing calibre with plugins
cs: Přizpůsobení calibre pomocí modulů
de: calibre mit Plugins anpassen
es: Personalizar calibre con complementos
fr: Personnalisation de calibre avec des extensions
sv: Anpassa calibre med tilläggsprogram

source: calibre has a very modular design. Almost all functionality in calibre comes in the form of plugins. Plugins are used for conversion, for downloading news (though these are called recipes), for various components of the user interface, to connect to different devices, to process files when adding them to calibre and so on. You can get a complete list of all the built-in plugins in calibre by going to :guilabel:`Preferences->Plugins`.
cs: calibre má velice modulární provedení. Téměř všechny funkce jsou ve formě modulů. Moduly jsou použity pro převod, stahování zpráv (ačkoliv ty jsou nazvány předpisy), různé komponenty uživatelského rozhraní, připojení k různým zařízením, zpracování souborů při jejich přidávání do calibre a tak dále. Kompletní seznam všech vestavěných modulů můžete získat v |calibre| v :guilabel:`Předvolby->Moduly`.
de: calibre ist sehr modular aufgebaut. Fast alle Funktionen in calibre sind als Plugins integriert. Plugins werden verwendet für die Konvertierung, für das Herunterladen von Nachrichten (obwohl man dies Rezepte oder auch Recipes nennt), für verschiedene Komponenten der Benutzeroberfläche, zum Herstellen einer Verbindung zu verschiedener Geräten, um Dateien zu verarbeiten, wenn diese zu calibre hinzugefügt werden und so weiter. Eine vollständige Liste aller integrierten Plugins erhalten Sie in calibre, indem Sie zu :guilabel:`Einstellungen Erweitert ->Plugins` gehen.
es: calibre tiene un diseño muy modular. Casi todas las funciones en calibre viene en forma de complementos. Los complementos se utilizan para la conversión, para la descarga de noticias (aunque éstos se llaman fórmulas), para diversos componentes de la interfaz de usuario, para conectarse a diferentes dispositivos, para procesar archivos cuando se añaden a calibre, etcétera. Puede obtener una lista completa de todos los complementos integrados en calibre en :guilabel:`Preferencias > Complementos`.
fr: calibre a un design hautement modulaire. Presque toutes les fonctionnalités dans calibre viennent sous a forme d'extensions. Les extensions sont utilisées pour la conversion, pour télécharger des actualités (bien que celles-ci s'appellent des recettes), pour divers composants de l'interface utlisateur, pour connecter différents dispositifs, pour traiter les fichiers lorsque vous les ajouter à calibre. Vous pouvez obtenir une liste complète de toutes les extensions intégrées dans calibre en allant à :guilabel:`Préférences->Extensions`.
sv: calibre är en väldigt modulär konstruktion. Nästan alla funktioner i calibre kommer i form av tilläggsprogram. Tilläggsprogram används för omvandling, för nedladdning av nyheter (även om dessa kallas för recept), för diverse komponenter av användargränssnitt, för anslutning av olika enheter, för bearbetning av filer när de läggs till calibre och så vidare. Du kan få en komplett lista av alla inbyggda tilläggsprogram i calibre genom att gå till :guilabel:`Inställningar->Tillägg`.

source: You can write your own plugins to customize and extend the behavior of calibre. The plugin architecture in calibre is very simple, see the tutorial :ref:`pluginstutorial`.
cs: Pro přizpůsobení a rozšíření chování calibre můžete napsat své vlastní moduly. Architektura modulu v calibre je velice jednoduchá, podívejte se na kurz :ref:`pluginstutorial`.
de: Sie können Ihre eigenen Plugins schreiben um das Verhalten von calibre anzupassen und zu erweitern. Die Plugin-Architektur in calibre ist sehr einfach, siehe hierzu das Tutorial :ref:`pluginstutorial`.
es: Puede escribir sus propios complementos para personalizar y extender el comportamiento de calibre. La arquitectura de complementos en calibre es muy simple, vea el cursillo :ref:`pluginstutorial`.
fr: Vous pouvez écrire vos propres extensions pour personnaliser et améliorer le coportement de calibre. L'architecture extension dans calibre est vraiment simple, voir le tutoriel :ref:`pluginstutorial`.
sv: Du kan skriva dina egna tilläggsprogram för att anpassa och utöka beteendet av calibre. Tilläggsprogramarkiteturen i calibre är mycket enkel, se handledningen :ref:`pluginstutorial`.

source: There are several replacement icon sets for calibre created by users over the years. You can find them gathered together in this `forum thread <http://www.mobileread.com/forums/showthread.php?t=151397>`_.
cs: Pro Calibre existuje několik náhradních sad ikon, které vytvořili uživatelé v průběhu let. Můžete je nalézt shromážděné v tomto `vlákně fóra <http://www.mobileread.com/forums/showthread.php?t=151397>`_.
de: Es gibt mehrere Ersatz-Icon-Sets für calibre, die von Benutzern im Laufe der Jahre erstellt urden. Eine Zusammenstellung finden Sie in diesem `Forumsbeitrag <http://www.mobileread.com/forums/showthread.php?t=151397>`_.
es: Hay varios conjuntos de iconos de reemplazo específicos para calibre creados por usuarios a lo largo de los años. Puede encontrarlos en este `hilo del foro <http://www.mobileread.com/forums/showthread.php?t=151397>`_.
fr: Il y a plusieurs ensembles de remplacement des icônes calibre créées par les utilisateurs au fil des années. Vous pouvez Vous pouvez les trouver rassemblées dans ce `fil de forum <http://www.mobileread.com/forums/showthread.php?t=151397>`_.
