Repository: Easonqsp/calibre-translations
Catalog: manual/*/db_api.po
Languages: sv

source: API Documentation for the database interface
sv: API-dokumentation för databasgränssnittet

source: This API is thread safe (it uses a multiple reader, single writer locking scheme). You can access this API like this::
sv: Detta API är trådsäkert (det används en flerläsare, singelskrivare utelåsningsschema). Du kan access detta API så här::

source: If you are in a calibre plugin that is part of the main calibre GUI, you get access to it like this instead::
sv: Om du är i ett Calibre-tilläggsprogram, som är del av Calibres huvudgränssnitt, får du i stället access till det så här::

source: An in-memory cache of the metadata.db file from a calibre library. This class also serves as a threadsafe API for accessing the database. The in-memory cache is maintained in normal form for maximum performance.
sv: En inminnesbuffer av metadata.db-filen från Calibres bibliotek. Denna klass fungerar också som ett trådsäkert API för accessa databasen. Inminnesbufferten hanteras på normalt sätt för maximal prestanda.

source: SQLITE is simply used as a way to read and write from metadata.db robustly. All table reading/sorting/searching/caching logic is re-implemented. This was necessary for maximum performance and flexibility.
sv: SQLITE används helt enkelt som ett stabilt sätt att läsa och skriva från metadata.db.

source: Add the specified books to the library. Books should be an iterable of 2-tuples, each 2-tuple of the form :code:`(mi, format_map)` where mi is a Metadata object and format_map is a dictionary of the form :code:`{fmt: path_or_stream}`, for example: :code:`{'EPUB': '/path/to/file.epub'}`.
sv: Lägg till angivna böcker till biblioteket. Böcker bör vara en uppräknelig mängd i multipel av 2, varje 2-mängdsgrupp i form av :code:`(mi, format_map)` var mi är ett metadataobjekt och format_map är en ordlista i formen :code:`{fmt: path_or_stream}`, till exempel :code:`{'EPUB': '/path/to/file.epub'}`.

source: Returns a pair of lists: :code:`ids, duplicates`. ``ids`` contains the book ids for all newly created books in the database. ``duplicates`` contains the :code:`(mi, format_map)` for all books that already exist in the database as per the simple duplicate detection heuristic used by :meth:`has_book`.
sv: Returnerar ett listpar: :code:`ids, duplicates`. ``ids`` innehållande bokens identiteter för all nyligen skapade böcker i databasen. "duplikat" innehåller :code:`(mi, format_map)` for alla böcker som redan finns i databasen genom enkel duplikdetektionheuristik använd av :meth:`has_book`.

source: Add data for name where val_map is a map of book_ids to values. If delete_first is True, all previously stored data for name will be removed.
sv: Lägg till data för namn där val_map är en karta över book_ids till värden. Om delete_first är Sann kommer alla tidigare lagrade data för namn tas bort.

source: Add a format to the specified book. Return True of the format was added successfully.
sv: Lägg ett format till angiven bok. Returnerar True om formatet lyckades att läggas till.

source: If True replace existing format, otherwise if the format already exists, return False.
sv: Om True ersätt existerande format, annars om formatet redan finns, returneras False

source: If True, file type plugins are run on the format before and after being added.
sv: Om True, körs filtypstillägg på formatet innan och efter tillägg.

source: Internal use only.
sv: Bara för internt bruk.

source: Frozen set of all known book ids.
sv: Frusen uppsättning av alla kända bokidentiteter.

source: Same as field_for, except that it operates on multiple books at once
sv: Samma som field_for, förutom att den opererar på flera böcker på samma gång

source: Frozen set of ids for all values in the field ``name``.
sv: Frusen uppsättning av identiteter för alla värden i fältet "namn".

source: Frozen set of all fields names (should only be used for many-one and many-many fields)
sv: Frusen uppsättning av alla fältnamn (bör bara användas för många till en och många till många fält)

source: Return author data as a dictionary with keys: name, sort, link
sv: Returnerar författardata som ordlista med nycklar: namn, sort, länk

source: If no authors with the specified ids are found an empty dictionary is returned. If author_ids is None, data for all authors is returned.
sv: Om inga författare med angivna identiteter hittas returneras en tom ordlista. Om author_ids är None, returneras data för alla författare.

source: Given a list of authors, return the author_sort string for the authors, preferring the author sort associated with the author over the computed string.
sv: Givet en lista av författare, returnerar author_sort sträng för författare, framför författarsortering associerad med författare över bearbetade strängen.

source: Return all the books associated with the item identified by ``item_id``, where the item belongs to the field ``name``.
sv: Returnerar alla böcker associerade med posten identifierad av ``item_id``, där posten tillhör fältet ``name``.

source: Returned value is a set of book ids, or the empty set if the item or the field does not exist.
sv: Returnerat värde är en mängd av bokidentiteter eller den tomma mängden om posten eller fältet inte finns.

source: Copy the cover to the file like object ``dest``. Returns False if no cover exists or dest is the same file as the current cover. dest can also be a path in which case the cover is copied to it if and only if the path is different from the current path (taking case sensitivity into account).
sv: Kopiera omslag till filen som objektet ``dest``. Returnerar Falsk om inget omslag finns eller dest är samma fil som det aktuella omslaget. dest kan också vara en sökväg i vilket fall omslaget kopieras till det om och endast om sökvägen är en annan än den aktuella sökvägen (med små bokstäver i beräkningen).

source: Copy the format ``fmt`` to the file like object ``dest``. If the specified format does not exist, raises :class:`NoSuchFormat` error. dest can also be a path, in which case the format is copied to it, iff the path is different from the current path (taking case sensitivity into account).
sv: Kopiera formatet ``fmt`` till filen som posten ``dest``. Om angivet format inte existerar, ger :class:`NoSuchFormat` fel. dest kan också vara en sökväg, i så fall kopieras formatet till den, om (och endast om) sökvägen är skilt i från aktuell sökväg (med beaktning på teckenskiftläge). Returnerar Sann om (och endast om) formatet existerar på disk

source: Return the cover image or None. By default, returns the cover as a bytestring.
sv: Returnerar omslagsbild eller inget. Som standard, returneras omslag som en oktettsträng.

source: WARNING: Using as_path will copy the cover to a temp file and return the path to the temp file. You should delete the temp file when you are done with it.
sv: VARNING: Att använda as_path kommer att kopiera omslaget till en temp-fil och returnera sökvägen till temp-filen. Du bör ta bort temp-filen när du är klar med den.

source: If True return the image as an open file object (a SpooledTemporaryFile)
sv: Om Sann returnerar bilden som ett öppet filobjekt (en SpooledTemporaryFile)

source: If True return the image as a QImage object
sv: Om Sann returnera bilden som ett Q-bildobjekt

source: If True return the image as a path pointing to a temporary file
sv: Om Sann returnera bilden som en sökväg till en temporärfil

source: Return data that can be used to implement :meth:`find_identical_books` in a worker process without access to the db. See db.utils for an implementation.
sv: Returnerar uppgifter som kan användas för att implementera :meth:`find_identical_books` i en arbetsprocess utan tillgång till db. Se db.utils för en implementering

source: Return data suitable for use in :meth:`has_book`. This can be used for an implementation of :meth:`has_book` in a worker process without access to the db.
sv: Returnerar data som är lämpliga för användning i :meth:'has_book`. Detta kan användas för en implementering av :meth:`has_book` i en arbetsprocess utan tillgång till db.

source: Delete data for name. By default deletes all data, if you only want to delete data for some book ids, pass in a list of book ids.
sv: Ta bort uppgifter om namn. Av raderar som standard all data, om du bara vill ta bort data för vissa bok ids, passera i en lista med bok ids.

source: Update metadata in all formats of the specified book_ids to current metadata in the database.
sv: Uppdatera metadata i alla format av de angivna bok_ids till aktuell metadata i databasen.

source: Same as field_for, except that it avoids the extra lookup to get the field object
sv: Samma som field_for, förutom att den undviker extra uppslag för att få fältobjektet

source: Return the value of the field ``name`` for the book identified by ``book_id``. If no such book exists or it has no defined value for the field ``name`` or no such field exists, then ``default_value`` is returned.
sv: Returnera värdet av fältet ``name`` för boken som identifieras av ``book_id``. Om ingen sådan bok existerar eller inte har något definierat värde för fältet ``name`` eller inget sådant fält finns, så returneras ``default_value``.

source: ``default_value`` is not used for title, title_sort, authors, author_sort and series_index. This is because these always have values in the db. ``default_value`` is used for all custom columns.
sv: ``default_value`` används inte för title, title_sort, authors, author_sort och series_index. Detta för dessa alltid har värden i databasen ``default_value`` används för anpassade kolumner.

source: The returned value for is_multiple fields are always tuples, even when no values are found (in other words, default_value is ignored). The exception is identifiers for which the returned value is always a dict. The returned tuples are always in link order, that is, the order in which they were created.
sv: Det returnerade värdet för is_multiple fält är alltid tupler, även om inga värden finns (med andra ord, default_value ignoreras). Undantaget är identifierare som det returnerade värdet alltid är en 'dict'. De returnerade tupler är alltid länkordning, det vill säga i vilken ordning de skapades.

source: Return the ids (as a tuple) for the values that the field ``name`` has on the book identified by ``book_id``. If there are no values, or no such book, or no such field, an empty tuple is returned.
sv: Returnera id:ar (som en tupel) för de värden som fältet ``namn`` har på boken som identifieras av ``book_id``. Om det inte finns några värden, eller ingen sådan bok, eller något sådant fält, returneras en tom tupel tillbaka.

source: Finds books that have a superset of the authors in mi and the same title (title is fuzzy matched). See also :meth:`data_for_find_identical_books`.
sv: Hittar böcker som har en övermängd av författarna i mi och samma titel (titeln är luddig matchas). Se även :meth:'data_for_find_identical_books`.

source: Return the ebook format as a bytestring or `None` if the format doesn't exist, or we don't have permission to write to the ebook file.
sv: Returnera e-bokformat som en oktettsträng eller `None` om formatet inte finns, eller att vi inte har behörighet att skriva till e-bokfilen.

source: If True the ebook format is returned as a file object. Note that the file object is a SpooledTemporaryFile, so if what you want to do is copy the format to another file, use :meth:`copy_format_to` instead for performance.
sv: Om Sann returneras e-bokformat som ett filobjekt. Observera att filobjektet är en SpooledTemporaryFile, så om vad du vill göra är att kopiera formatet till en annan fil, använd: meth: `copy_format_to` stället för utförande.

source: Copies the format file to a temp file and returns the path to the temp file
sv: Kopierar formatet filen till en temp-fil och returnerar sökvägen till temp-fil

source: If True and returning a path the filename is the same as that used in the library. Note that using this means that repeated calls yield the same temp file (which is re-created each time)
sv: Om Sann och returneras en sökväg, filnamnet är samma som den som används i biblioteket. Observera att detta innebär att upprepade anrop ger samma temp-fil (som återskapas varje gång)

source: Return absolute path to the ebook file of format `format`. You should almost never use this, as it breaks the threadsafe promise of this API. Instead use, :meth:`copy_format_to`.
sv: Returnera absolut sökväg till e-bokfilen i formatet `format`. Du bör nästan aldrig använda det, eftersom det bryter trådsäkerhetsgarantin i detta API. Använd istället, :meth:`copy_format_to`.

source: Currently used only in calibredb list, the viewer, edit book, compare_format to original format, open with and the catalogs (via get_data_as_dict()).
sv: Används för närvarande endast i calibredb listan, visaren, redigera boken, compare_format till originalformat, öppna med och katalogerna (via get_data_as_dict ()).

source: Apart from the viewer, open with and edit book, I don't believe any of the others do any file write I/O with the results of this call.
sv: Bortsett från visaren, öppna med och redigera boken, tror jag inte någon av de andra gör någon filskrivnings-I/O med resultaten av detta anrop.

source: Return the hash of the specified format for the specified book. The kind of hash is backend dependent, but is usually SHA-256.
sv: Returnera hash för det angivna formatet för den angivna boken. Den typ av hash är algoritmberoende, men är oftast SHA-256.

source: Return the path, size and mtime for the specified format for the specified book. You should not use path unless you absolutely have to, since accessing it directly breaks the threadsafe guarantees of this API. Instead use the :meth:`copy_format_to` method.
sv: Returnerar sökväg, storlek och mtime för det specifika formatet för den specifika boken. Du bör inte använda sökväg annat om du absolut måste, eftersom direktaccess av den förstör trådsäkerhetsgarantin av detta API(gränssnitt). I stället använd :meth:`copy_format_to` metoden.

source: If ``True`` cached values are used, otherwise a slow filesystem access is done. The cache values could be out of date if access was performed to the filesystem outside of this API.
sv: Om Sann, används buffrade värden, annars sker en långsam filsystemaccess . Buffrade värden kan vara utdaterade om access sker till filsystem utanför detta API (gränssnitt).

source: If ``True`` The max_size field of the database is updates for this book.
sv: Om Sann är max_size-fältet av databasen uppdatering av denna bok.

source: Return tuple of all formats for the specified book. If verify_formats is True, verifies that the files exist on disk.
sv: Returnerar tupel av alla format för den specifika boken. Om verify_formats är Sann verifieras att filer existerar på disken.

source: Used internally to implement the Tag Browser
sv: Används internt för att implementera etikettbläddraren

source: Get data for name. By default returns data for all book_ids, pass in a list of book ids if you only want some data. Returns a map of book_id to values. If a particular value could not be decoded, uses default for it.
sv: Hämta data för namn. Som standard returneras data för alla book_ids, förse med en lista av bok identiteter om du bara vill ha några data. Returnerar en översikt av book_id till värden. Om en speciellt värde inte kan identifieras, används i stället standardvärde för den.

source: Return a mapping of id numbers to values for the specified field. The field must be a many-one or many-many field, otherwise a ValueError is raised.
sv: Returnerar en översik av id nummer till värden för specifika fält. Fältet måste vara en många-en eller många-många fält, annars genereras ett ValueError.

source: Return the set of book ids for which name has data.
sv: Returnerar en uppsättning bok id för vilket namn har data.

source: Return the item id for item_name (case-insensitive)
sv: Returnerar posten id för item_name (skiftlägesokänslig)

source: Return the item name for the item specified by item_id in the specified field. See also :meth:`get_id_map`.
sv: Returnerar postnamnet för posten som anges av item_id i specificerat fält. Se också :meth:`get_id_map`.

source: Return metadata for the book identified by book_id as a :class:`Metadata` object. Note that the list of formats is not verified. If get_cover is True, the cover is returned, either a path to temp file as mi.cover or if cover_as_data is True then as mi.cover_data.
sv: Returnerar metadata för boken identifierat av book_id som ett :class:`Metadata` objekt. Notera att listan av format inte är verifierad. Om get_cover är Sann, kommer omslag att returneras, antingen som en sökväg till temporärfilen mi.cover eller om cover_as_data är Sant som mi.cover_data.

source: Return the next series index for the specified series, taking into account the various preferences that control next series number generation.
sv: Returnerar nästa serieindex för den specifika serien, med beaktning av olika förval som styr generering av nästa serienummer.

source: The series-like field (defaults to the builtin series column)
sv: Serielikt fält (som standard för inbyggda seriekolumnen)

source: If True, returns a mapping of book_id to current series_index value instead.
sv: Om Sann, returnerar en översikt av book_id till aktuell serie_index-värde i stället.

source: Like :meth:`get_metadata` except that it returns a ProxyMetadata object that only reads values from the database on demand. This is much faster than get_metadata when only a small number of fields need to be accessed from the returned metadata object.
sv: Liksom: meth: `get_metadata` förutom att den returnerar ett ProxyMetadata-objekt som bara läser värden från databasen på förfrågan. Det är mycket snabbare än get_metadata när endast ett mindre antal fält behöver nås från returnerat metadataobjekt.

source: Return a mapping of id to usage count for all values of the specified field, which must be a many-one or many-many field.
sv: Returnerar en översikt av id till räkningsanvändning för alla värden på det angivna området, som måste vara en många-en eller många-många fält.

source: Return True iff the database contains an entry with the same title as the passed in Metadata object. The comparison is case-insensitive. See also :meth:`data_for_has_book`.
sv: Returnerar Sann om och endast om databasen innehåller en post med samma titel som den angivna i metadataobjektet. Jämförelsen är skiftlägeskänsliga . Se även :meth:'data_for_has_book`.

source: Return True iff the format exists on disk
sv: Returnerar Sann om (och endast om) formatet existerar på disk

source: Return True iff the specified book_id exists in the db
sv: Returnerar Sann om (och endast om) specificerat bok_id existerar i db

source: Initialize this cache with data from the backend.
sv: Initialisera denna buffring med data från fjärrsidan.

source: Return a list of sorted book ids. If ids_to_sort is None, all book ids are returned.
sv: Returnerar en lista av sorterade bok id. Om ids_to_sort är None, kommer alla all bok id att returneras.

source: fields must be a list of 2-tuples of the form (field_name, ascending=True or False). The most significant field is the first 2-tuple.
sv: fälten måste vara en lista av 2-tupler på formatet (field_name, ascending=True eller False). Det mest signifikata fältet är den första 2-tupeln.

source: Return the value for the specified preference or the value specified as ``default`` if the preference is not set.
sv: Returnerar värdet för det specifika förvalet eller värdet angivet som ``standard`` om inget förval är angivet.

source: Return the OPF metadata backup for the book as a bytestring or None if no such backup exists.
sv: Returnerar OPF-metadatalagringen för boken som en oktettsträng eller None om ingen sådan lagrad finns.

source: Remove the books specified by the book_ids from the database and delete their format files. If ``permanent`` is False, then the format files are not deleted.
sv: Ta bort böcker angivna av book_ids från databasen eller tar bort deras formatfiler. Om ``permanent`` är False, så kommer inte formatfiler tas bort.

source: Remove the specified formats from the specified books.
sv: Ta bort angivna format från angivna böcker.

source: A mapping of book_id to a list of formats to be removed from the book.
sv: En översikt av book_id till en lista av format som ska tas bort från boken.

source: If True, only remove the record for the format from the db, do not delete the actual format file from the filesystem.
sv: Om Sann, tas bara handlingen av format från databasen, tar inte bort de aktuella filformaten från filsystemet.

source: Delete all items in the specified field with the specified ids. Returns the set of affected book ids. ``restrict_to_book_ids`` is an optional set of books ids. If specified the items will only be removed from those books.
sv: Radera alla poster i det angivna området med de angivna ids. Returnerar uppsättningen påverkade bok-id. ``restrict_to_book_ids`` är en valfri uppsättning bok-id. Om specificerat, kommer endast objekten att tas bort från dessa böcker.

source: Rename items from a many-one or many-many field such as tags or series.
sv: Döp om poster från många-en eller många-många fält som etiketter eller serier.

source: When renaming in a series-like field also change the series_index values.
sv: Vi omdöpning i en serielikt fält förändras även series_index värden.

source: An optional set of book ids for which the rename is to be performed, defaults to all books.
sv: En valfri uppsättning bok-id där namnbyte skall utföras, standard för alla böcker.

source: Restore the book entry in the database for a book that already exists on the filesystem
sv: Återställer bokuppslaget i databasen för en bok som redan finns i filsystemet.

source: Restore the specified format from the previously saved ORIGINAL_FORMAT, if any. Return True on success. The ORIGINAL_FORMAT is deleted after a successful restore.
sv: Återställer det angivna formatet från tidigare sparat ORIGINAL_FORMAT, om något. Returnerar Sann vid framgång. The ORIGINAL_FORMAT tas bort efter en lyckad återställning.

source: A safe read lock is a lock that does nothing if the thread already has a write lock, otherwise it acquires a read lock. This is necessary to prevent DowngradeLockErrors, which can happen when updating the search cache in the presence of composite columns. Updating the search cache holds an exclusive lock, but searching a composite column involves reading field values via ProxyMetadata which tries to get a shared lock. There may be other scenarios that trigger this as well.
sv: Ett säker läsningslås är ett lås som gör ingenting om tråden redan har en skrivlås, annars begärs ett läslås. Detta är nödvändigt för att förhindra DowngradeLockErrors, vilket kan ske vid uppdatering av sökningen bufferten i närvaro av kompositkolumner. Uppdatering av sökningen bufferten har ett exklusivt lås, men söker en sammansatt kolumn vilket innebär läsning av fältvärden via ProxyMetadata som försöker att få ett delat lås. Det kan finnas andra scenarier som utlöser detta.

source: This property returns a new lock object on every access. This lock object is not recursive (for performance) and must only be used in a with statement as ``with cache.safe_read_lock:`` otherwise bad things will happen.
sv: Den här egenskapen returnerar ett nytt låsobjekt på varje access. Detta låsobjekt är inte rekursivt (för prestanda) och får endast användas i ett med uttalande som ``with cache.safe_read_lock:`` annars kommer dåliga saker att hända.

source: Save a copy of the specified format as ORIGINAL_FORMAT, overwriting any existing ORIGINAL_FORMAT.
sv: Spara en kopia i angivet format som ORIGINAL_FORMAT, skriver över alla befintliga ORIGINAL_FORMAT.
