Repository: Easonqsp/calibre-translations
Catalog: manual/*/db_api.po
Languages: sv

source: Search the database for the specified query, returning a set of matched book ids.
sv: Söker i databasen med angiven sökning, returnerar en uppsättning av passande bok id:ar.

source: A restriction that is ANDed to the specified query. Note that restrictions are cached, therefore the search for a AND b will be slower than a with restriction b.
sv: En begränsning som är AND-ad med angiven förfrågan. Observera att restriktioner mellanlagras, alltså sökandet efter a AND b kommer att vara långsammare än en med a restriktions b.

source: Used internally (virtual fields such as on_device to search over).
sv: Använt internt (virtuella fält som on_device för söka efter)

source: If not None, a set of book ids for which books will be searched instead of searching all books.
sv: Om inte None, en uppsättning bok id:ar där böckerna kommer att sökas i stället för att söka alla böcker.

source: options must be a map of the form {book_id:conversion_options}
sv: alternativ måste vara en översikt på formen {book_id:conversion_options}

source: Set the cover for this book. data can be either a QImage, QPixmap, file object or bytestring. It can also be None, in which case any existing cover is removed.
sv: Ange omslag för denna bok. data kan antingen vara en QImage, QPixmap, filobjekt eller oktettsträng. Det kan också vara None, i fallet omslag är borttaget.

source: Set the values of the field specified by ``name``. Returns the set of all book ids that were affected by the change.
sv: Ange värden av fält angivna av ``namn``. Returnerar uppsättningen av bok id:ar som påverkades av förändringen.

source: Mapping of book_ids to values that should be applied.
sv: Översikt av book_ids till värden som ska tillämpas.

source: If True, the case of many-one or many-many fields will be changed. For example, if a book has the tag ``tag1`` and you set the tag for another book to ``Tag1`` then the both books will have the tag ``Tag1`` if allow_case_change is True, otherwise they will both have the tag ``tag1``.
sv: Om Sann, i fall det rör sig om många-en eller många-många områden förändras. Till exempel, om en bok har etiketten ``tag1`` och du anger etiketten för en annan bok till ``Tag1`` då kommer båda böckerna att ha etiketten ``Tag1`` om allow_case_change är Sann, annars kommer de båda ha etiketten ``tag1``.

source: Used internally, you should never change it.
sv: Används internt, du bör aldrig ändra den.

source: Set metadata for the book `id` from the `Metadata` object `mi`
sv: Ange metadata för boken `id` från `Metadata`-objektet `mi`

source: Setting force_changes=True will force set_metadata to update fields even if mi contains empty values. In this case, 'None' is distinguished from 'empty'. If mi.XXX is None, the XXX is not replaced, otherwise it is. The tags, identifiers, and cover attributes are special cases. Tags and identifiers cannot be set to None so then will always be replaced if force_changes is true. You must ensure that mi contains the values you want the book to have. Covers are always changed if a new cover is provided, but are never deleted. Also note that force_changes has no effect on setting title or authors.
sv: När man sätter force_changes = Sann tvingas set_metadata att uppdatera fält, även om mi innehåller tomma värden. I det här fallet är "None" skiljt från "empty". Om mi.XXX är None ersätts XXX inte, annars görs det. Etiketter, identifierare, och omslagsattribut är specialfall. Etiketter och identifierare kan inte ställas in på None för då kommer de alltid ersättas om force_changes är Sann. Du måste se till att mi innehåller de värden som du vill att boken ska ha. Omlslag förändras alltid om ett nytt omslag finns, men de raderas aldrig . Observera också att force_changes har ingen effekt på inställningen titel eller författare.

source: Set the specified preference to the specified value. See also :meth:`pref`.
sv: Ange angivna förval till de angivna värdet. Se också :meth:`pref`.

source: Return the ids of all books having the tag ``tag`` that are older than the specified time. tag comparison is case insensitive.
sv: Returnera ids av alla böcker som har etiketten `` etikett`` som är äldre än den angivna tiden. etikettenjämförelse är skiftlägesoberoende.

source: A timedelta object or None. If None, then all ids with the tag are returned.
sv: En timedelta-objekt eller None. Om None kommer alla id:ar med etiketten returneras.

source: If not None the list of matches will be restricted to books that have this tag
sv: Om inte None listan av träffar kommer begränsas till böcker som har denna etikett

source: A list of authors. If not None the list of matches will be restricted to books that have these authors (case insensitive).
sv: En lista av författare. Om inte None listan av träffar kommer begränsas till böcker som har dessa författare (skiftlägesokänslig).

source: Return the user categories for the specified books. proxy_metadata_map is optional and is useful for a performance boost, in contexts where a ProxyMetadata object for the books already exists. It should be a mapping of book_ids to their corresponding ProxyMetadata objects.
sv: Returnera användarkategorier för de angivna böckerna. proxy_metadata_map är valfritt och är användbar för en prestandaökning, i sammanhang där ett ProxyMetadata objekt för böckerna redan finns. Det bör vara en korsreferens av book_ids till deras motsvarande ProxyMetadata objekt.
