Repository: Easonqsp/calibre-translations
Catalog: manual/*/develop.po
Languages: sv

source: Setting up a calibre development environment
sv: Konfigurera calibre utvecklingsmiljö

source: calibre is completely open source, licensed under the `GNU GPL v3 <http://www.gnu.org/copyleft/gpl.html>`_. This means that you are free to download and modify the program to your heart's content. In this section, you will learn how to get a calibre development environment set up on the operating system of your choice. calibre is written primarily in `Python <https://www.python.org>`_ with some C/C++ code for speed and system interfacing. Note that calibre is not compatible with Python 3 and requires at least Python 2.7.
sv: calibre är helt öppen källkod, licensierat under `GNU GPL v3 <http://www.gnu.org/copyleft/gpl.html>`_. Det innebär att du är fri att ladda ner och ändra programmet till ditt hjärtas innehåll. I det här avsnittet får du lära dig hur du inrättar en calibre-utvecklingsmiljö på vilket operativsystem du valt. calibre är skriven främst i `Python <https://www.python.org>`_ med lite C/C++ kod för hastighet och systemets gränssnitt. Observera att calibre inte är kompatibel med Python 3 och kräver minst Python 2.7.

source: Contents
sv: Innehåll

source: Design philosophy
sv: Konstruktionsfilosofi

source: calibre has its roots in the Unix world, which means that its design is highly modular. The modules interact with each other via well defined interfaces. This makes adding new features and fixing bugs in calibre very easy, resulting in a frenetic pace of development. Because of its roots, calibre has a comprehensive command line interface for all its functions, documented in :doc:`generated/en/cli-index`.
sv: calibre har sina rötter i Unix världen, vilket innebär att dess konstruktions är mycket modulärt. Modulerna interagerar med varandra via väl definierade gränssnitt. Detta gör att lägga till nya funktioner och rätta fel i calibre mycket lätt, vilket resulterar i en frenetisk takt i utvecklingen. På grund av sina rötter, har calibre ett omfattande kommandoradsgränssnitt för alla dess funktioner, dokumenterade i :doc:`generated/sv/cli-index`.

source: The modular design of calibre is expressed via ``Plugins``. There is a :ref:`tutorial <customize>` on writing calibre plugins. For example, adding support for a new device to calibre typically involves writing less than a 100 lines of code in the form of a device driver plugin. You can browse the `built-in drivers <https://github.com/kovidgoyal/calibre/tree/master/src/calibre/devices>`_. Similarly, adding support for new conversion formats involves writing input/output format plugins. Another example of the modular design is the :ref:`recipe system <news>` for fetching news. For more examples of plugins designed to add features to calibre, see the `plugin index <http://www.mobileread.com/forums/showthread.php?p=1362767#post1362767>`_.
sv: Den modulära konstruktionen av calibre uttrycks via ``tillägg``s/insticksprogram. Det finns en :ref:`handledning <customize>` om att skriva calibre tilläggsprogram. Till exempel, för att lägga till stöd för en ny enhet till calibre vanligtvis innebär att skriva mindre än 100 rader kod i form av en drivrutinstillägg. Du kan bläddra i `inbyggda drivrutiner <https://github.com/kovidgoyal/calibre/tree/master/src/calibre/devices>`_. På samma sätt lägga till stöd för nya konverteringsformat involverar skrivande indata- / utdataformat tillägg. Ett annat exempel på den modulära konstruktionen är :ref:`receptsystemet <news>` för att hämta nyheter. För fler exempel på tilläggsprogram som syftar till att lägga till funktioner till calibre, se `plugin index <http://www.mobileread.com/forums/showthread.php?p=1362767#post1362767>`_.

source: Code layout
sv: Kodutformning

source: All the calibre python code is in the ``calibre`` package. This package contains the following main sub-packages
sv: All calibre pythonkod finns i ``caliber`` paketet. Paketet innehåller följande huvud-underpaket

source: devices - All the device drivers. Just look through some of the built-in drivers to get an idea for how they work.
sv: enheter - Alla drivrutiner. Bara titta igenom några av de inbyggda drivrutiner för att få en uppfattning om hur de fungerar.

source: For details, see: ``devices.interface`` which defines the interface supported by device drivers and ``devices.usbms`` which defines a generic driver that connects to a USBMS device. All USBMS based drivers in calibre inherit from it.
sv: För mer information, se: ``devices.interface`` som definierar gränssnitt stöds av drivrutiner och ``devices.usbms`` som definierar en generisk drivrutin som ansluter till en USBMS enhet. Alla USBMS baserade drivrutiner i calibre ärver från den.

source: ebooks - All the ebook conversion/metadata code. A good starting point is ``calibre.ebooks.conversion.cli`` which is the module powering the :command:`ebook-convert` command. The conversion process is controlled via ``conversion.plumber``. The format independent code is all in ``ebooks.oeb`` and the format dependent code is in ``ebooks.format_name``.
sv: e-böcker - All e-bokkonvertering / metadatakod. En bra utgångspunkt är ``calibre.ebooks.conversion.cli`` vilken är modulen som driver :command:`ebook-convert` kommandot. Konverteringen styrs via ``conversion.plumber`` . Formatoberoende kod är alla i ``ebooks.oeb`` och formatberoende kod finns i ``ebooks.format_name`` .

source: Metadata reading, writing, and downloading is all in ``ebooks.metadata``
sv: Metadataläsning, skrivning, och nedladdning är allt i ``ebooks.metadata``

source: Conversion happens in a pipeline, for the structure of the pipeline, see :ref:`conversion-introduction`. The pipeline consists of an input plugin, various transforms and an output plugin. The code that constructs and drives the pipeline is in :file:`plumber.py`. The pipeline works on a representation of an ebook that is like an unzipped epub, with manifest, spine, toc, guide, html content, etc. The class that manages this representation is OEBBook in ``ebooks.oeb.base``. The various transformations that are applied to the book during conversions live in :file:`oeb/transforms/*.py`. And the input and output plugins live in :file:`conversion/plugins/*.py`.
sv: Konvertering sker i en "rörledning", för strukturen av rörledningen, se Introduktion . Rörledningen består av ett indataprogram, olika omvandlingar och ett utdataprogram. Den kod som konstruerar och driver rörledningen i :file:`plumber.py`. Rörledningen fungerar på en representation av en e-bok som är som en uppackade epub, med manifest, rygg, innehållsförteckning, guide, html innehåll, etc. Den klass som hanterar denna representation är OEBBook i ``ebooks.oeb.base`` . De olika omvandlingar som tillämpas på boken under omvandlingar finns i :file:`oeb/transforms/*.py`. Och input och output plugins bor i :file:`conversion/plugins/*.py`.

source: Ebook editing happens using a different container object. It is documented in :ref:`polish_api`.
sv: E-bokredigering sker med hjälp av en annat kontainerobjekt. Det är dokumenterat i :ref:`polish_api`.

source: db - The database back-end. See :ref:`db_api` for the interface to the calibre library.
sv: db - Databasens bakända. Se API-dokumentation för databasgränssnitt för gränssnittet till calibre-biblioteket.

source: content server: ``library.server`` is the calibre Content Server.
sv: mediaserver: ``library.server`` är calibres mediaserver.

source: gui2 - The Graphical User Interface. GUI initialization happens in ``gui2.main`` and ``gui2.ui``. The ebook-viewer is in ``gui2.viewer``. The ebook editor is in ``gui2.tweak_book``.
sv: gui2 - Det grafiska användargränssnittet (GUI). GUI initialiseringen händer i ``gui2.main``och ``gui2.ui``. Den e-bokvisaren i ``gui2.viewer``. E-bokeditor finns i ``gui2.tweak_book``.

source: If you want to locate the entry points for all the various calibre executables, look at the ``entry_points`` structure in `linux.py <https://github.com/kovidgoyal/calibre/blob/master/src/calibre/linux.py>`_.
sv: Om du vill hitta startplatser för alla de olika calibres körbara delar, titta på ``entry_points`` struktur i `linux.py <https://github.com/kovidgoyal/calibre/blob/master/src/calibre/linux.py>`_.

source: If you need help understanding the code, post in the `development forum <http://www.mobileread.com/forums/forumdisplay.php?f=240>`_ and you will most likely get help from one of calibre's many developers.
sv: Om du behöver hjälp att förstå koden, post i `development forum <http://www.mobileread.com/forums/forumdisplay.php?f=240>`_ och du kommer sannolikt att få hjälp av en av calibres många utvecklare.

source: Getting the code
sv: Få koden

source: You can get the calibre source code in two ways, using a version control system or directly downloading a `tarball <http://status.calibre-ebook.com/dist/src>`_.
sv: Du kan få calibre-källkoden på två sätt, med hjälp av ett versionshanteringssystem eller direkt ladda ner en `tarball <http://status.calibre-ebook.com/dist/src>`_.

source: calibre uses `Git <http://www.git-scm.com/>`_, a distributed version control system. Git is available on all the platforms calibre supports. After installing Git, you can get the calibre source code with the command::
sv: calibre använder `Git <http://www.git-scm.com/>`_ , ett distribuerat versionshanteringssystem. Git är tillgänglig på alla plattformar calibre stöder. När du har installerat Git kan du få calibre-källkod med kommandot:

source: On Windows you will need the complete path name, that will be something like :file:`C:\\Program Files\\Git\\git.exe`.
sv: I Windows behöver du den fullständiga sökvägen, som kommer att vara något i stil med :file:`C:\\Program Files\\Git\\git.exe`.

source: calibre is a very large project with a very long source control history, so the above can take a while (10 mins to an hour depending on your internet speed).
sv: calibre är ett mycket stort projekt med en mycket lång källkontrollshistoria, så ovanstående kan ta ett tag (10 minuter till en timme beroende på din internet hastighet).

source: If you want to get the code faster, the source code for the latest release is always available as an `archive <http://status.calibre-ebook.com/dist/src>`_.
sv: Om du vill få koden snabbare, är källkoden för den senaste versionen alltid tillgänglig som `archive <http://status.calibre-ebook.com/dist/src>`_.

source: To update a branch to the latest code, use the command::
sv: För att uppdatera en filial till den senaste koden använder du kommandot:

source: Submitting your changes to be included
sv: Skicka in dina ändringar som skall ingå

source: If you only plan to make a few small changes, you can make your changes and create a "merge directive" which you can then attach to a ticket in the calibre `bug tracker <https://bugs.launchpad.net/calibre>`_. To do this, make your changes, then run::
sv: Om du bara planerar att göra några små förändringar kan du göra dina ändringar och skapa ett "merge direktivet" som du sedan kan fästa på ett ärende i calibre bug tracker <https://bugs.launchpad.net/calibre>`_. För att göra detta, gör ändringarna, kör sedan::

source: This will create a :file:`my-changes` file in the current directory, simply attach that to a ticket on the calibre `bug tracker <https://bugs.launchpad.net/calibre>`_. Note that this will include *all* the commits you have made. If you only want to send some commits, you have to change ``origin/master`` above. To send only the last commit, use::
sv: Detta kommer att skapa en file:`my-changes`-fil i den aktuella katalogen, helt enkelt bifoga det till ett ärende i calibre `bug tracker <https://bugs.launchpad.net/calibre>`_. Observera att detta kommer att omfatta *alla* de åtgärder du har gjort. Om du bara vill skicka några åtgärder, måste du ändra ``origin/master`` ovan. Om du vill skicka bara den senaste bekräftelsen, använd::

source: To send the last *n* commits, replace *1* with *n*, for example, for the last 3 commits::
sv: Om du vill skicka de senaste *n* ändringar, byt *1* med *n* , till exempel under de senaste 3 ändringarna:

source: Be careful to not include merges when using ``HEAD~n``.
sv: Var noga med att inte inkludera sammanslagningar när ``HEAD~n`` .

source: If you plan to do a lot of development on calibre, then the best method is to create a `GitHub <https://github.com>`_ account. Below is a basic guide to setting up your own fork of calibre in a way that will allow you to submit pull requests for inclusion into the main calibre repository:
sv: If you plan to do a lot of development on calibre, then the best method is to create a `GitHub <https://github.com>`_ account. Below is a basic guide to setting up your own fork of calibre in a way that will allow you to submit pull requests for inclusion into the main calibre repository: Om du planerar att göra en hel del calibre-utveckling, då det bästa sättet är att skapa ett `GitHub <https://github.com>`_ -konto. Här är en grundläggande guide till att ställa in din egen förgrening av calibre på ett sätt som gör att du kan skicka in hämtansökningar för införande i calibres huvudarkiv/gren:

source: Setup git on your machine as described in this article: `Setup Git <https://help.github.com/articles/set-up-git>`_
sv: Installering av git på maskinen som beskrivs i denna artikel: `Setup Git <https://help.github.com/articles/set-up-git>`_

source: Setup ssh keys for authentication to GitHub, as described here: `Generating SSH keys <https://help.github.com/articles/generating-ssh-keys>`_
sv: Installera ssh nycklar för autentisering till GitHub, som beskrivs här: `Generating SSH keys <https://help.github.com/articles/generating-ssh-keys>`_

source: Go to https://github.com/kovidgoyal/calibre and click the :guilabel:`Fork` button.
sv: Gå till https://github.com/kovidgoyal/calibre och klicka på :guilabel:`Förgrenings` knappen.

source: In a Terminal do::
sv: I en terminal utför:

source: Replace <username> above with your github username. That will get your fork checked out locally.
sv: Ersätt <användarnamn> ovan med ditt github användarnamn. Det kommer att få din förgrening utcheckat lokalt.

source: You can make changes and commit them whenever you like. When you are ready to have your work merged, do a::
sv: Du kan göra ändringar och överlämna dem när du vill. När du är redo att ha ditt arbete ihopslaget, gör en::

source: and go to ``https://github.com/<username>/calibre`` and click the :guilabel:`Pull Request` button to generate a pull request that can be merged.
sv: och gå till ``https://github.com/<username>/calibre`` och klicka på :guilabel:`Hämtbegäran` knappen för att generera en hämtbegäran som kan slås samman.

source: You can update your local copy with code from the main repo at any time by doing::
sv: Du kan uppdatera din lokala kopia med kod från huvudarkivet när som helst genom att göra::

source: You should also keep an eye on the calibre `development forum <http://www.mobileread.com/forums/forumdisplay.php?f=240>`_. Before making major changes, you should discuss them in the forum or contact Kovid directly (his email address is all over the source code).
sv: Du bör också hålla ett öga på calibre `development forum <http://www.mobileread.com/forums/forumdisplay.php?f=240>`_. Innan du gör stora förändringar, bör du diskutera dem i forumet eller kontakta Kovid direkt (hans e-postadress är hela källkoden).

source: Windows development environment
sv: Windows utvecklingsmiljö

source: You must also get the calibre source code separately as described above.
sv: Du måste också få calibre-källkod för sig enligt ovan.

source: Install calibre normally, using the Windows installer. Then open a Command Prompt and change to the previously checked out calibre code directory. For example::
sv: Installera calibre normalt, med hjälp av installationsprogrammet för Windows. Öppna sedan en kommandotolk och ändra till tidigare utcheckad calibre-kodkatalogen. Till exempel:

source: calibre is the directory that contains the src and resources sub-directories.
sv: calibre är den katalog som innehåller src och resurser underkataloger.

source: The next step is to set the environment variable ``CALIBRE_DEVELOP_FROM`` to the absolute path of the src directory. So, following the example above, it would be ``C:\Users\kovid\work\calibre\src``. `Here is a short guide <https://docs.python.org/2/using/windows.html#excursus-setting-environment-variables>`_ to setting environment variables on Windows.
sv: Nästa steg är att ställa in miljövariabeln ``CALIBRE_DEVELOP_FROM`` till den absoluta sökvägen till src-katalog. Så, efter exemplet ovan skulle det vara ``C:\Users\kovid\work\calibre\src``. `Här är en kort guide till <https://docs.python.org/2/using/windows.html#excursus-setting-environment-variables>`_ att sätta miljövariabler i Windows.

source: Once you have set the environment variable, open a new command prompt and check that it was correctly set by using the command::
sv: När du har ställt in miljövariabeln, öppna en ny kommandotolk och kontrollera att den blev rätt inställd med kommandot::

source: Setting this environment variable means that calibre will now load all its Python code from the specified location.
sv: Ställa denna miljövariabel innebär att calibre kommer nu laddar all sin Python kod från den angivna platsen.

source: That's it! You are now ready to start hacking on the calibre code. For example, open the file :file:`src\\calibre\\__init__.py` in your favorite editor and add the line::
sv: Det är allt! Du är nu redo att börja hacka på calibre-koden. Till exempel öppna filen :file:`src\\calibre\\__init__.py` i din favoriteditor och lägg till raden::

source: near the top of the file. Now run the command :command:`calibredb`. The very first line of output should be ``Hello, world!``.
sv: nära toppen av filen. Nu kör kommandot :command:`calibredb` . Den allra första raden av produktionen bör vara Hej världen! .

source: You can also setup a calibre development environment inside the free Microsoft Visual Studio, if you like, following the instructions `here <http://www.mobileread.com/forums/showthread.php?t=251201>`_.
sv: Du kan även konfigurera en calibres utvecklingsmiljö inuti gratis Microsoft Visual Studio, om man så vill, att följa instruktionerna `här <http://www.mobileread.com/forums/showthread.php?t=251201>`_.

source: OS X development environment
sv: OS X utvecklingsmiljö

source: Install calibre normally using the provided .dmg. Then open a Terminal and change to the previously checked out calibre code directory, for example::
sv: Installera calibre normalt med den medföljande .dmg. Öppna sedan en terminal och ändra till den tidigare utcheckad calibre-kodkatalogen, till exempel::

source: calibre is the directory that contains the src and resources sub-directories. Ensure you have installed the calibre commandline tools via :guilabel:`Preferences->Advanced->Miscellaneous` in the calibre GUI.
sv: calibre är den katalog som innehåller src och resurser underkataloger. Se till att du har installerat den calibre kommandoradsverktyg via :guilabel:`Inställningar->Avancerat->Diverse` i calibre-grafiska gränssnitt.

source: The next step is to create a bash script that will set the environment variable ``CALIBRE_DEVELOP_FROM`` to the absolute path of the src directory when running calibre in debug mode.
sv: Nästa steg är att skapa ett bash skript som kommer att sätta miljövariabeln ``CALIBRE_DEVELOP_FROM`` till den absoluta sökvägen till katalogen src när man kör calibre i felsökningsläge.

source: Create a plain text file::
sv: Skapa en vanlig textfil::

source: Save this file as ``/usr/bin/calibre-develop``, then set its permissions so that it can be executed::
sv: Spara filen som ``/usr/bin/calibre-develop`` , ställ sedan dess rättigheter, så att den kan köras::

source: Once you have done this, run::
sv: När du har gjort det, kör::

source: You should see some diagnostic information in the Terminal window as calibre starts up, and you should see an asterisk after the version number in the GUI window, indicating that you are running from source.
sv: Du bör se några diagnostisk information i terminalfönstret som calibre startar, och du bör se en asterisk efter versionsnumret i grafiska gränssnittsfönstret, vilket indikerar att du kör från källkod.

source: Linux development environment
sv: Linux utvecklingsmiljö

source: calibre is primarily developed on Linux. You have two choices in setting up the development environment. You can install the calibre binary as normal and use that as a runtime environment to do your development. This approach is similar to that used in Windows and OS X. Alternatively, you can install calibre from source. Instructions for setting up a development environment from source are in the INSTALL file in the source tree. Here we will address using the binary at runtime, which is the recommended method.
sv: calibre är i första hand utvecklad för Linux. Du har två val i inrättandet av utvecklingsmiljön. Du kan installera calibre-binär som vanligt och använda den som en runtime-miljö för att göra din utveckling. Detta tillvägagångssätt liknar det som används i Windows och OS X. Du kan installera calibre från källan. Instruktioner för hur du installerar en utvecklingsmiljö från källan är i filen INSTALL i källkodsträdet. Här kommer vi att ta itu med den binära vid körning, vilket är den rekommenderade metoden.

source: Install calibre using the binary installer. Then open a terminal and change to the previously checked out calibre code directory, for example::
sv: Installera calibre att använda den binära installationsprogrammet. Öppna sedan en terminal och ändra till den tidigare utcheckade calibre-kodkatalogen, till exempel:

source: The next step is to set the environment variable ``CALIBRE_DEVELOP_FROM`` to the absolute path of the src directory. So, following the example above, it would be ``/home/kovid/work/calibre/src``. How to set environment variables depends on your Linux distribution and what shell you are using.
sv: Nästa steg är att ställa in miljövariabeln ``CALIBRE_DEVELOP_FROM`` till den absoluta sökvägen till src katalog. Så, efter exemplet ovan skulle det vara ``/home/kovid/work/calibre/src``. Så ställer du in miljövariabler beror på din Linux-distribution och vad kommandoskal du använder.

source: Once you have set the environment variable, open a new terminal and check that it was correctly set by using the command::
sv: När du har ställt in miljövariabeln, öppna en ny terminal och kontrollera att den blev rätt inställd med kommandot::

source: That's it! You are now ready to start hacking on the calibre code. For example, open the file :file:`src/calibre/__init__.py` in your favorite editor and add the line::
sv: Det är allt! Du är nu redo att börja hacka på calibre-koden. Till exempel öppna filen :file:`src/calibre/__init__.py` i din favorit editor och lägg till raden:

source: Having separate "normal" and "development" calibre installs on the same computer
sv: Att ha separata "normal" och "utveckling" calibre-installereringar på samma dator
