Repository: Easonqsp/calibre-translations
Catalog: manual/*/develop.po
Languages: sv

source: The calibre source tree is very stable and rarely breaks, but if you feel the need to run from source on a separate test library and run the released calibre version with your everyday library, you can achieve this easily using .bat files or shell scripts to launch calibre. The example below shows how to do this on Windows using .bat files (the instructions for other platforms are the same, just use a shell script instead of a .bat file)
sv: calibre-källkodsträd är mycket stabila och sällan brytes sönder, men om du känner behov av att köras från källan på ett separat testbibliotek och kör släppt calibre-version med ditt vardagliga biblioteket kan du uppnå detta enkelt med hjälp bat-filer eller skalskript för att starta calibre. Exemplet nedan visar hur man gör detta på Windows med bat-filer (instruktionerna för andra plattformar är samma, bara använda ett skalskript i stället för en bat-fil)

source: To launch the release version of calibre with your everyday library:
sv: För att starta den utgivna versionen av calibre med din vardagliga biblioteket:

source: Debugging tips
sv: Felsökningstips

source: Python is a dynamically typed language with excellent facilities for introspection. Kovid wrote the core calibre code without once using a debugger. There are many strategies to debug calibre code:
sv: Python är ett dynamiskt typat språk med utmärkta faciliteter för introspektion. Kovid skrev kärndelar av calibrekod utan en gång med hjälp av ett avlusningsprogram. Det finns många strategier för att felsöka calibrekod:

source: Using print statements
sv: Användsa print-satser

source: This is Kovid's favorite way to debug. Simply insert print statements at points of interest and run your program in the terminal. For example, you can start the GUI from the terminal as::
sv: Det här är Kovids favorit sätt att felsöka. Sätt bara in utskrift-satser vid intressanta punkter och köra ditt program i terminalen. Till exempel kan du starta det grafiska gränssnittet från terminalen som::

source: Similarly, you can start the ebook-viewer as::
sv: På samma sätt kan du starta e-bokläsaren med::

source: The ebook-editor can be started as::
sv: Den e-bokeditorn kan startas med::

source: Using an interactive python interpreter
sv: Med hjälp av en interaktiv python-tolk

source: You can insert the following two lines of code to start an interactive python session at that point::
sv: Du kan infoga följande två rader kod för att starta en interaktiv python-session på den punkten::

source: When running from the command line, this will start an interactive Python interpreter with access to all locally defined variables (variables in the local scope). The interactive prompt even has TAB completion for object properties and you can use the various Python facilities for introspection, such as :func:`dir`, :func:`type`, :func:`repr`, etc.
sv: När du kör från kommandoraden, kommer detta att starta en interaktiv python-tolk med tillgång till alla lokalt definierade variabler (variabler i den lokala omfattning). Den interaktiva prompten har till och med TAB komplettering för objektegenskaper och du kan använda de olika python-finnesser för introspektion, såsom :func:`dir`, :func:`type`, :func:`repr`, etc.

source: Using the python debugger as a remote debugger
sv: Använda python-felsökare som fjärrfelsökare

source: You can use the builtin python debugger (pdb) as a remote debugger from the command line. First, start the remote debugger at the point in the calibre code you are interested in, like this::
sv: Du kan använda den inbyggda python-felsökare (PDB) som fjärrfelsökare från kommandoraden. Först startar fjärrfelsökaren vid den punkt i calibre-koden du är intresserad av, så här:

source: Then run calibre, either as normal, or using one of the calibre-debug commands described in the previous section. Once the above point in the code is reached, calibre will freeze, waiting for the debugger to connect.
sv: Kör sedan calibre, antingen som vanligt, eller använda någon av calibre-felsökningskommandon som beskrivs i föregående avsnitt. När ovanstående punkt i koden är nådd kommer calibre frysa, väntar på felsökaren för att ansluta.

source: Now open a terminal or command prompt and use the following command to start the debugging session::
sv: Nu öppna en terminal eller kommandotolk och använd följande kommando för att starta felsökningssessionen::

source: You can read about how to use the python debugger in the `python stdlib docs for the pdb module <https://docs.python.org/2/library/pdb.html#debugger-commands>`_.
sv: Du kan läsa om hur man använder python-felsökaren i `python stdlib docs för pdb modulen <https://docs.python.org/2/library/pdb.html#debugger-commands>`_.

source: By default, the remote debugger will try to connect on port 4444. You can change it, by passing the port parameter to both the set_trace() and the cli() functions above, like this: ``set_trace(port=1234)`` and ``cli(port=1234)``.
sv: Som standard kommer fjärrfelsökaren försöker ansluta på port 4444. Du kan ändra det, genom att skicka portparametern till både set_trace()- och cli()-funktioner ovan, så här: ``set_trace(port=1234)`` och ``cli(port=1234)``.

source: The python debugger cannot handle multiple threads, so you have to call set_trace once per thread, each time with a different port number.
sv: Python-felsökaren kan inte hantera flera trådar, så du måste anropa set_trace en gång per tråd, varje gång med ett annat portnummer.

source: Using the debugger in your favorite python IDE
sv: Använda felsökaren i din favorit python IDE

source: It is possible to use the builtin debugger in your favorite python IDE, if it supports remote debugging. The first step is to add the calibre src checkout to the ``PYTHONPATH`` in your IDE. In other words, the directory you set as ``CALIBRE_DEVELOP_FROM`` above, must also be in the ``PYTHONPATH`` of your IDE.
sv: Det är möjligt att använda den inbyggda felsökaren i din favorit python-IDE, om den stödjer fjärrfelsökning. Det första steget är att lägga till utcheckat calibre src till ``PYTHONPATH`` i IDE. Med andra ord, den katalog du anger som ``CALIBRE_DEVELOP_FROM`` måste ovan, också vara i ``PYTHONPATH`` din IDE.

source: Then place the IDE's remote debugger module into the :file:`src` subdirectory of the calibre source code checkout. Add whatever code is needed to launch the remote debugger to calibre at the point of interest, for example in the main function. Then run calibre as normal. Your IDE should now be able to connect to the remote debugger running inside calibre.
sv: Placera sedan IDE fjärrfelsökarmodulen i src katalog till calibre-källkod kassan. Lägg allt vad kod som behövs för att starta fjärrfelsökaren för calibre på den intressanta, till exempel i huvudfunktionen. Kör sedan calibre som vanligt. Din IDE bör nu kunna ansluta till fjärrfelsökaren kör inne i calibre.

source: Executing arbitrary scripts in the calibre python environment
sv: Kör godtyckliga skript i calibre python-miljön

source: The :command:`calibre-debug` command provides a couple of handy switches to execute your own code, with access to the calibre modules::
sv: :command:`calibre-debug`-kommandot ger ett par praktiska flaggor för att köra egen kod, med tillgång till calibre-moduler::

source: is great for testing a little snippet of code on the command line. It works in the same way as the -c switch to the python interpreter::
sv: är bra för att testa en liten kodsträng på kommandoraden. Det fungerar på samma sätt som den -c flaggan till python-tolken::

source: can be used to execute your own Python script. It works in the same way as passing the script to the Python interpreter, except that the calibre environment is fully initialized, so you can use all the calibre code in your script. To use command line arguments with your script, use the form::
sv: kan användas för att köra din egen Python-skript. Det fungerar på samma sätt som att skicka skriptet till Python-tolken, förutom att calibre miljön är helt initierad, så att du kan använda alla calibre-kod i skriptet. För att använda kommandoradsargument med ditt manus, använd formuläret:

source: The ``--`` causes all subsequent arguments to be passed to your script.
sv: Den ``--`` leder till att alla efterföljande argument skickas till ditt skript.

source: Using calibre in your projects
sv: Använda calibre i dina projekt

source: It is possible to directly use calibre functions/code in your Python project. Two ways exist to do this:
sv: Det är möjligt att direkt använda calibrefunktioner / kod i Python-projektet. Två sätt finns för att göra detta:

source: Binary install of calibre
sv: Binär installation av calibre

source: If you have a binary install of calibre, you can use the Python interpreter bundled with calibre, like this::
sv: Om du har en binär installation av calibre, kan du använda Python-tolken som medföljer calibre, så här::

source: Source install on Linux
sv: Installera källkod på Linux

source: In addition to using the above technique, if you do a source install on Linux, you can also directly import calibre, as follows::
sv: Förutom att använda ovanstående teknik, om du gör en källkodsinstallation på Linux, kan du också direkt importera calibre, enligt följande::

source: It is essential that you import the init_calibre module before any other calibre modules/packages as it sets up the interpreter to run calibre code.
sv: Det är viktigt att du importerar init_calibre modulen innan någon annan calibre modules/packages som det sätter upp tolken att köra calibre-kod.

source: API documentation for various parts of calibre
sv: API-dokumentation för olika delar av calibre
