Repository: Easonqsp/calibre-translations
Catalog: manual/*/diff.po
Languages: de, es, fr, sv

source: Comparing E-books
de: eBooks Vergleichen
es: Comparando libros electrónicos
fr: Comparaison de livres numériques
sv: Jämför e-böcker

source: calibre includes an integrated e-book comparison tool that can be used to see what has changed inside an ebook after editing or converting it. It can compare books in the EPUB and AZW3 formats.
de: calibre enthält ein integriertes Tool zum eBook-Vergleich und wird verwendet, um Veränderungen innerhalb des eBooks nach einer Bearbeitung oder Konvertierung darzustellen. Das Tool vergleicht Bücher im EPUB- und AZW3-Format.
es: calibre incluye una herramienta integrada de comparación de libros electrónicos que se puede utilizar para ver lo que ha cambiado en el interior de un libro electrónico después de editarlo o convertirlo. Puede comparar libros en los formatos EPUB y AZW3.

source: To use it, either open the ebook in the tool for :ref:`edit` and then click :guilabel:`File->Compare to other book` or use the :ref:`book_details` panel. If you do a conversion from EPUB to EPUB, the original EPUB file will be saved as ORIGINAL_EPUB. Simply right click on the ORIGINAL_EPUB entry in the Book Details panel and choose :guilabel:`Compare to EPUB format`.
de: Zur Verwendung öffnet man entweder das eBook über den :ref:`edit` und klickt dann auf :guilabel:`Datei ->Mit einem anderen Buch vergleichen` oder verwendet in der calibre Hauptansicht das Fenster :ref:`Buchdetails`. Bei einer Konvertierung EPUB in EPUB wird die ursprüngliche EPUB-Datei als ORIGINAL_EPUB gesichert. Durch einen einfachen Rechtsklick auf den Eintrag ORIGINAL_EPUB im Bereich Buchdetails und der Auswahl :guilabel:`Mit dem EPUB-Format vergleichen` wird der eBook-Vergleich geöffnet.
es: Para usarlo, sea abrir el libro electrónico para :ref:`editar` y después clic :guilabel:`Archivo->Comparar con otro libro` o usar el panel :ref:`book_details`. Si hace una conversion desde EPUB a EPUB, el archivo EPUB original será guardado como ORIGINAL_EPUB. Simplemente haga clic derecho en la entrada ORIGINAL_EPUB en el panel de los detalles del libro y seleccione :guilabel:`Comparar con formato EPUB`.
fr: Pour l'utiliser, ouvrir soit le livre dans l'outil :ref:`edit` et cliquez alors :guilabel:`Fichier->Comparer à un autre livre` ou utilisez le panneau :ref:`book_details`. Si vous faites une conversion d'EPUB à EPUB, l'EPUB original sera sauvegardé comme ORIGINAL_EPUB. Faites simplement un clic droit sur l'entrée ORIGINAL_EPUB dans le panneau Détails du Livre et choisissez :guilabel:`Comparer au format EPUB`.
sv: För att använda den, antingen öppna e-bok i verktyget för :ref:`edit` och sedan klicka på :guilabel:`File->Compare med andra bok` eller använd :ref:`book_details` panel. Om du gör en konvertering från EPUB till EPUB, kommer den ursprungliga EPUB-filen sparas som ORIGINAL_EPUB. Högerklicka på ORIGINAL_EPUB posten i Bokdetaljpanelen och välj :guilabel:`Compare till EPUB-format`.

source: The comparison tool that opens will look like the screenshot below. It shows you the differences in text, styles and images in the chosen books.
de: Das sich öffnende Vergleichstool wird ähnlich der Abbildung unten aussehen. Es zeigt Unterschiede im Text, Formatvorlagen und Bildern in den ausgewählten Büchern.
es: La herramienta de comparación que se abre se verá como la siguiente imagen. Muestra las diferencias en el texto, estilos e imágenes en los libros elegidos.
fr: L'outil de comparaison qui s'ouvre ressemblera à la capture d'écran ci-dessous. Il vous montre les différences dans le texte, le style et les images dans les livres choisis.
sv: Jämförelseverktyg som öppnas kommer att se ut som skärmdumpen nedan. Det visas skillnader i text, färger och bilder i de valda böckerna.

source: Understanding the comparison view
de: Die Vergleichsansicht verstehen
es: Comprendiendo la vista de comparación
fr: Compréhension de la vue de comparaison
sv: Förstå jämförelsevyn

source: As can be seen in the screenshot above, the comparison view shows the differences between the two books side by side. Only the differences, with a few lines of context around them are shown. This makes it easy to see at a glance only what was changed inside a large document like a book.
de: Wie im Screenshot oben zu sehen, zeigt der Vergleichsansicht die Unterschiede zwischen den beiden Büchern nebeneinander. Es werden nur die Unterschiede mit einigen Zeilen um den Kontext angezeigt. Dies erleichtert es auf einen Blick zu erkennen, was in einem großen Dokument, wie beispielsweise in einem Buch, geändert wurde.
es: Como se puede ver en la imagen anterior, la vista comparación muestra las diferencias entre los dos libros palmo a palmo. Sólo se muestran las diferencias con unas pocas líneas de contexto que les rodea. Esto hace que sea fácil ver de un vistazo lo que sólo se ha cambiado dentro de un documento de gran tamaño como un libro.
fr: Comme cela peut être vu dans la capture d'écran plus haut, la vue de comparaison montre les différences entre les les deux livres côte à côte. Seules les différences, avec quelques lignes de contexte autour d'elles sont montrées. Ceci rend facile de voir d'un coup d'oeil seulement ce qui a été changé à l'intérieur d'un grand document comme un livre.
sv: Som framgår av skärmdumpen ovan, jämförelse vyn visar skillnaderna mellan de två böcker sida vid sida. Endast skillnaderna, med några rader av sammanhang runt dem visas. Detta gör det enkelt att snabbt se bara vad som har ändrats i ett stort dokument som en bok.

source: Added text is shown with a green background, removed text with a red background and changed text with a blue background.
de: Hinzugefügter Text wird mit einem grünen Hintergrund, entfernt Text mit rotem Hintergrund und geänderter Text mit blauem Hintergrund angezeigt.
es: Texto añadido se muestra con un fondo verde, texto eliminado con un fondo rojo y texto modificado con un fondo azul.
fr: Le texte ajouté est montré avec un fond vert, le texte supprimé avec un fond rouge et le texte changé avec un fond bleu.
sv: Tillagd text visas med en grön bakgrund, borttagen text med en röd bakgrund och ändrad text med en blå bakgrund.

source: The line numbers of all changed text are show at the sides, making it easy to go to a particular change in the editor. When you open the comparison tool from within the editor, you can also double click on a line in the right panel to go to that line in the editor automatically.
de: Die Zeilennummern aller geänderten Textstellen stehen an den Seiten, sodass es einfach ist, um zu einer bestimmten Änderung im Editor zu gelangen. Wenn Sie das Vergleichstool von mit dem Editor öffnen, können Sie auch im rechten Teilfenster mit einem Doppelklick automatisch zu der entsprechende Zeile im Editor springen.
es: Los números de línea de todo el texto modificado se muestran en los lados, por lo que es fácil ir a un cambio determinado en el editor. Al abrir la herramienta de comparación desde el editor, también puede hacer doble clic en una línea en el panel de la derecha para ir a esa línea en el editor de forma automática.
fr: Les numéros de ligne de tout le texte changé sont montrées sur les côtés, rendant facile de se rendre à un changement particulier dans l'éditeur. Quand vous ouvrez l'outil de comparaison depuis l'éditeur, vous pouvez aussi double cliquez sur une ligne dans le panneau de droite pour aller automatiquement à cette ligne dans l'éditeur.
sv: Radnummer för all text som förändrats visas på sidorna, vilket gör det lätt att gå till en viss förändring i editorn. När du öppnar jämförelseverktyget inifrån editorn, kan du också dubbelklicka på en rad i den högra panelen för att gå till den raden i editorn automatiskt.

source: One useful technique when comparing books is to tell the comparison tool to beautify the text and style files before calculating differences. This can often result in cleaner and easier to follow differences. To do this, click the :guilabel:`Options` button in the bottom right and choose :guilabel:`Beautify files before comparing`. Note that beautifying can sometimes have undesired effects, as it can cause invalid markup to be altered to make it valid. You can also change the number of lines of context shown around differences via the :guilabel:`Options` button.
de: Es ist ein nützliches Verfahren beim Vergleich von Büchern, das Vergleichstool vor der eigentlichen Berechnung der Unterschiede zu veranlassen, alle Dateien im Text und Stil zu verschönern. Danach ist der besser strukturierte Text für die Unterschiede einfacher zu verfolgen. Klicken Sie hierzu auf die Schaltfläche :guilabel:`Optionen` in der unteren Ecke und wählen Sie dort :guilabel:`Dateien vor dem Vergleichen verschönern` aus. Beachten Sie, dass verschönern manchmal unerwünschte Effekte haben kann. Beispielsweise kann es bei gültigen Markup's dazu führen, dass diese zu ungültigen Markup's geändert werden. Die Anzahl der angezeigten Zeilen für die Unterschiede im Kontext können Sie ebenfalls über die Schaltfläche :guilabel:`Optionen` ändern.
es: Una técnica útil cuando se comparan libros es decirle a la herramienta de comparación que embellezca los archivos de texto y el estilo antes de calcular las diferencias. Esto a menudo puede resultar en diferencias más limpias y más faciles de seguir. Para ello, haga clic en el botón :guilabel: `Opciones` en la parte inferior derecha y elija :guilabel:`Embellecer archivos antes de comparar`. Tenga en cuenta que el embellecimiento a veces puede tener efectos no deseados, ya que puede causar que un atributo no válido al ser alterado pase a ser válido. También puede cambiar el número de líneas de contexto que se muestran en torno a las diferencias a través del botón :guilabel: `Opciones`.
fr: Une technique utile en comparant des livres est de dire à l'outil de comparaison d'embellir les fichiers de texte et de style avant de calculer les différences. Ceci peut souvent avoir comme conséquence d'obtenir des résultats plus propre et plus de facilité à suivre les différences. Pour faire ceci, cliquez sur le bouton :guilabel:`Options` en bas à droite et choisir :guilabel:`Embellir les fichiers avant de comparer`. Notez que l'embellissement peut parfois avoir des effets peu désirés, comme altéré un balisage invalide pour le rendre valide. Vous pouvez également changer le nombre de lignes de contexte autour des différences via le bouton guilabel:`Options`.
sv: En användbar teknik när man jämför böcker är att tala om för jämförelse verktyg för att försköna de text-och Style-filer innan du beräknar skillnader. Detta kan ofta resultera i renare och lättare att följa skillnader. Det gör du genom att klicka på :guilabel:`Options`-knappen i det nedre högra och välj :guilabel:`Beautify files before comparing`. Observera att förskönande kan ibland ha oönskade effekter, eftersom det kan orsaka ogiltig uppmärkning ändras för att göra det giltigt. Du kan också ändra antalet rader av sammanhang visade runt skillnader via :guilabel:`Options` knappen.

source: You can search for any text in the differences via the search bar at the bottom. You will need to specify which panel to search, the :guilabel:`Left` or the :guilabel:`Right`.
de: Sie können über die Suchleiste unten nach jedem Text innerhalb der Unterschiede suchen. Sie müssen für die Suche angeben, in welchem Fensterbereich gesucht werden soll :guilabel:`Linkes Feld` oder :guilabel:`Rechtes Feld`.
es: Puede buscar cualquier texto en las diferencias a través de la barra de búsqueda en la parte inferior. Tendrá que especificar en qué panel buscar, la :guilabel:`Izquierda` o la :guilabel:`Derecha`.
fr: Vous pouvez chercher après n'importe quel texte dans les différences par l'intermédiaire de la barre de recherche en bas. Vos aurez besoin de spécifier dans quel panneau rechercher, le :guilabel:`Gauche` ou le :guilabel:`Droit`.
sv: Du kan söka efter all text i skillnaderna via sökfältet längst ner. Du måste ange vilken panel för att söka, :guilabel:`Left` eller :guilabel:`Right`.

source: How to launch the comparison tool
de: Wie eBooks Vergleichen verwendet wird
es: Cómo iniciar la herramienta de comparación
fr: Comment lancer l'outil de comparaison
sv: Hur att starta jämförelseverktyget

source: The comparison tool is most useful when you have two versions of the same book and you want to see what is different between them. To that end, there are several ways to launch the tool.
de: eBooks Vergleichen ist besonders hilfreich, wenn Sie zwei Versionen des gleichen Buches haben und der Unterschied zwischen diesen gefunden werden soll. Zu diesem Zweck gibt es mehrere Möglichkeiten, um das Tool zu starten.
es: La herramienta de comparación es más útil cuando se tienen dos versiones de un mismo libro y quieres ver lo que es diferente entre ellos. Para ello, hay varias formas de iniciar la herramienta.
fr: L'outil de comparaison est le plus utile quand vous avez deux versions du mêmes livre et que vous voulez voir ce qui est différent entre elles. À cet effet, il y a plusieurs manières de lancer l'outil.
sv: Jämförelse verktyget är mest användbart när du har två versioner av samma bok och du vill se vad som skiljer mellan dem. För detta ändamål finns det flera sätt att starta verktyget.

source: Comparing two ebook files
de: Zwei eBook-Dateien vergleichen
es: Comparando dos archivos de libros electrónicos
fr: Comparer deux fichiers de livre numérique
sv: Jämför två e--bokfiler

source: Open the first file in the :ref:`edit` tool. Now click :guilabel:`File->Compare to another book` and choose the second file (it must be in the same format as the first). The comparison view will open with the file being edited on the right and the second file on the left.
de: Öffnen Sie die erste Datei mit dem :ref:`edit`. Klicken Sie auf :guilabel:`Datei ->Mit einem anderen Buch vergleichen` und wählen dann die zweite Datei aus (Diese muss im gleichen Format wie die erste vorliegen). Die Vergleichsansicht öffnet die zur Zeit bearbeitende Datei des Editors in der rechten Fensterseite und die zweite Datei in der linken Fensterseite.
es: Abrar el primer archivo en la herramienta :ref:`editar`. Ahora clic :guilabel:`Archivo->Comparar con otro libro` y elija el segundo archivo (idebe estar en el mismo formato que el primero). La vista comparación se abrirá con el archivo siendo editado a la derecha y el otro a su izquierda.
fr: Ouvrez le premier fichier dans l'outil :ref:`edit`. Maintenant cliquez :guilabel:`Fichier->Comparer à un autre livre` et choisissez le deuxième livre. (il doit être dans le même format que le premier). La vue comparaison s'ouvrira avec le fichier en cours d'édition sur la droite et le second fichier sur la gauche.
sv: Öppna den första filen i :ref:`edit` verktyget. Klicka nu på :guilabel:`File->Compare med en annan bok` och välj den andra filen (det måste vara i samma format som den första). Jämförelsen vyn öppnas med filen som redigeras till höger och den andra filen till vänster.

source: Comparing the ORIGINAL_FMT to FMT
de: Vergleich von ORIGINAL_FMT mit FMT
es: Comparando el ORIGINAL_FMT tde FMT
fr: Comparaison de ORIGINAL_FMT à FMT
sv: Jämför ORIGINAL_FMT med FMT

source: When you do a conversion in calibre from a FMT to itself, the original file is saved as ORIGINAL_FMT. You can see what was changed by the conversion, by right clicking on the ORIGINAL_FMT entry in the :ref:`book_details` panel in the main calibre window and selecting :guilabel:`Compare to FMT`. The comparison view will open with ORIGINAL_FMT on the left and FMT on the right.
de: Wenn Sie in calibre eine Konvertierung ins gleiche Format FMT vornehmen, wird die ursprüngliche Datei als ORIGINAL_FMT gespeichert. FMT steht hierbei stellvertretend als Platzhalter für das Format, wie z. B. für EPUB. Die Veränderung bei einer Konvertierung im Buch können Sie durch Rechtsklick auf den Eintrag ORIGINAL_FMT im Fenster :ref:`Buchdetails` der calibre Hauptansicht und anschließender Auswahl von :guilabel:`Mit dem FMT Format vergleichen` sehen. In der Vergleichsansicht wird das ORIGINAL_FMT auf der linken Fensterseite und FMT auf der rechten Fensterseite geöffnet.
es: Cuando realiza una conversión en calibre desde un FMT a si mismo, el archivo original es guardado como ORIGINAL_FMT. Puede ver que fue cambiado en la conversión, haciendo clic derecho en la entrada ORIGINAL_FMT en el panel :ref:`book_details` en la ventana principal de calibre y seleccionando :guilabel:`Comparar con FMT`. La vista de comparación se abrirá con el ORIGINAL_FMT a la izquierda y el FMT a la derecha.

source: Comparing a checkpoint to the current state of the book while editing
de: Vergleich eines Checkpoints zum aktuellen Zustand des Buches während der Bearbeitung
es: Comparando un punto de chequeo con el estado actual del libro durante su edición
fr: Comparer un point de contrôle à l'état actuel du livre tout en l'éditant
sv: Jämför en kontrollpunkt för det aktuella tillståndet av boken under redigering

source: The :ref:`edit` tool has a very useful feature, called :ref:`checkpoints`. This allows you to save the current state of the book as a named *checkpoint*, to which you can revert if you do not like the changes you have made since creating the checkpoint. Checkpoints are also created automatically when you perform various automated actions in the editor. You can see the list of checkpoints by going to :guilabel:`View->Checkpoints` and then use the :guilabel:`Compare` button to compare the book at the selected checkpoint with the current state. The comparison tool will show the checkpoint on the left and the current state on the right.
de: Der :ref:`edit` hat ein sehr nützliches Feature, genannt :ref:`checkpoints`. Hiermit können Sie den aktuellen Zustand des Buches als einen benannten *Sicherungspunkt* speichern. Durch Auswahl des *Sicherungspunkts* können Sie wieder zum Zustand vor der Änderung zurückkehren, falls Ihnen die Änderung nach Erstellung des Sicherungspunkts nicht gefallen. Prüfpunkte werden auch automatisch bei der Durchführung verschiedene automatisierte Aktionen im Editor erstellt. Sie können die Liste der Sicherungspunkte über :guilabel:`Anzeigen ->Sicherungspunkte` anzeigen lassen und dann die Taste :guilabel:`Vergleichen` verwenden, um das Buch beim ausgewählten Prüfpunkt mit dem aktuellen Zustand zu vergleichen. Das Vergleichstool zeigt den ausgewählten Sicherungspunkt auf der linken Fensterseite und den aktuellen Stand des Dokuments im Editor auf der rechten Fensterseite.
es: La herramienta :ref:`edición` posee una función muy útil, llamada :ref:`checkpoints`. Esto le permite guardar el estado actual de un libro como un *punto de chequeo*, al cual puede retornar si no le agrada los cambios que ha hecho desde que creo el punto de chequeo. Estos puntos de chequeo también son creados automáticamente cuando lleva varias acciones automatizadas en el editor. Puede ver el listado de puntos de chequeo yendo a :guilabel:`Ver->Checkpoints` y después usar el botón :guilabel:`Comparar` para comparar el libro en el punto de chequeo seleccionado con el estado actual. La herramienta de comparación mostrar el punto de chequeo a la izquierda y el estado actual a la derecha.
fr: L'outil :ref:`edit ` possède une caractéristique très utile :ref:`points de contrôle`. Ceci vous permet de sauver l'état actuel du livre comme *point de contrôle* nommé, auquel vous pouvez retourner si vous n'aimez pas les modifications que vous avez apportées depuis que vous avez créé le point de contrôle. Des points de contrôle sont également créés automatiquement quand vous effectuez diverses actions automatisées dans l'éditeur. Vous pouvez voir la liste de points de contrôle en allant :guilabel:`Aperçu->Points de contrôle` et employez alors le bouton :guilabel:`Comparer` pour comparer le livre au point de contrôle sélectionné à l'état actuel. L'outil de comparaison montrera le point de contrôle sur la gauche et la version actuelle sur la droite.
sv: :ref:`edit` verktyget har en mycket användbar funktion, som kallas :ref:`checkpoints`. Detta gör att du kan spara det aktuella tillståndet i boken som en namngiven *kontrollpunkt*, som du kan återgå till, om du inte gillar de ändringar du har gjort sedan skapa kontrollpunkten. Kontrollpunkter skapas också automatiskt när du utför olika automatiska åtgärder i editorn. Du kan se listan med kontrollpunkter genom att gå till :guilabel:`View->Checkpoints` och använd sedan :guilabel:`Compare` knappen för att jämföra boken på den valda kontrollpunkten med det aktuella läget. Jämförelsen Verktyget visar kontrollpunkt till vänster och det aktuella läget till höger.

source: |app| includes an integrated e-book comparison tool that can be used to see what has changed inside an ebook after editing or converting it. It can compare books in the EPUB and AZW3 formats.
fr: |app| inclut un outil intégré de comparaison de livre numérique qui peut être utilisé pour voir ce qui a été changé à l'intérieur d'un livre numérique après son édition ou sa conversion. Il peut comparer des livres aux formatsEPUB et AZW3.
sv: |app| innehåller en integrerad e-boks jämförelseverktyg som kan användas för att se vad som har förändrats inuti en e-bok efter redigering eller konvertera den. Det kan jämföra böcker i ePub-och AZW3 format.

source: When you do a conversion in |app| from a FMT to itself, the original file is saved as ORIGINAL_FMT. You can see what was changed by the conversion, by right clicking on the ORIGINAL_FMT entry in the :ref:`book_details` panel in the main |app| window and selecting :guilabel:`Compare to FMT`. The comparison view will open with ORIGINAL_FMT on the left and FMT on the right.
fr: Quand vous faites une conversion dans |app| à partir d'un FMT vers lui-même, le fichier original est sauvegardé comme ORIGINAL_FMT. Vous pouvez voir ce qui a été changé par la conversion, en faisant un clic droit sur l'entrée ORIGINAL_FMT dans le panneau ref:`book_details` dans la fenêtre principale de |app| et en sélectionnant :guilabel:`Comparer à FMT`. La vue comparaison s'ouvrira avec le ORIGINAL_FMT sur la gauche et le FMT sur la droite.
sv: När du gör en omvandling i |app| från en FMT till sig själv, den ursprungliga filen sparas som ORIGINAL_FMT. Du kan se vad som har ändrats genom omvandling, genom att högerklicka på ORIGINAL_FMT posten i :ref:`book_details` panelen i huvud |app| fönstret och välj :guilabel:`Compare to FMT`. Jämförelsevyn öppnas med ORIGINAL_FMT till vänster och FMT till höger.
