Repository: Easonqsp/calibre-translations
Catalog: manual/*/edit.po
Languages: de

source: For books that do not have a pre-existing Table of Contents, the tool gives you various options to auto-generate a Table of Contents from the text. You can generate from the headings in the document, from links, from individual files and so on.
de: Für Bücher ohne ein bestehendes Inhaltsverzeichnis bietet Ihnen dieses Werkzeug verschiedene Möglichkeiten eines aus dem Text anzulegen. Sie können dafür die Überschriften, Links im Dokument verwenden oder eigene Dateien.

source: You can edit individual entries by clicking on them and then clicking the :guilabel:`Change the location this entry points to` button. This will open up a mini-preview of the book, simply move the mouse cursor over the book view panel, and click where you want the entry to point to. A thick green line will show you the location. Click OK once you are happy with the location.
de: Sie können einzelne Beiträge bearbeiten, indem Sie diese anklicken und dann :guilabel:`Den Ort ändern, auf den dieser Eintrag zeigt`. Danach öffnet sich eine Mini-Vorschau des Buches. Bewegen Sie den Mauszeiger einfach über die Buchansicht und klicken Sie dahin, wohin der Eintrag verweisen soll. Eine dicke grüne Linie zeigt die Position an. Bestätigen Sie danach mit OK.

source: Check Book
de: Buch prüfen

source: The :guilabel:`Check Book` tool searches your book for problems that could prevent it working as intended on actual reader devices. Activate it via :guilabel:`Tools->Check Book`.
de: Das Werkzeug :guilabel:`Buch prüfen` überprüft Ihr Buch auf Probleme, die verhindern könnten, dass es wie geplant auf E-Book-Readern angezeigt wird. Aktivieren Sie es über `Werkzeuge ->Buch prüfen`.

source: Any problems found are reported in a nice, easy to use list. Clicking any entry in the list shows you some help about that error as well as giving you the option to auto-fix that error, if the error can be fixed automatically. You can also double click the error to open the location of the error in an editor, so you can fix it yourself.
de: Falls Fehler aufgetreten sind, werden sie übersichtlich aufgelistet. Wenn Sie auf einen der Einträge klicken, bekommen Sie Hinweise zum Fehler und können ihn unter Umständen automatisch reparieren lassen. Mit einem Doppelklick gelangen Sie in einem Editor zu der Stelle, an der der Fehler aufgetreten ist um ihn selbst zu korrigieren.

source: Some of the checks performed are:
de: Was geprüft wird:

source: Malformed or unknown CSS styles. Any CSS that is not valid or that has properties not defined in the CSS 2.1 standard (plus a few from CSS 3) are reported. CSS is checked in all stylesheets, inline style attributes and <style> tags in HTML files.
de: Nicht wohlgeformte oder unbekannte CSS Stile. Jedes ungültige CSS oder solche mit Eigenschaften, die nicht in den CSS 2.1-Standards (plus ein paar aus CSS 3) definiert wurden, werden gemeldet. CSS wird in allen Stylesheets, Inline Style Attributen und <style> tags in den HTML-Dateien überprüft.

source: Broken links. Links that point to files inside the book that are missing are reported.
de: Tote Links. Alle Links, die zu Dateien führen, die es im Buch nicht gibt, werden aufgelistet.

source: Unreferenced files. Files in the book that are not referenced by any other file or are not in the spine are reported.
de: Verwaiste Dateien. Dateien, auf die es weder im Buchrücken noch in einer anderen Datei einen Hinweis gibt, werden aufgelistet.

source: Various common problems in OPF files such as duplicate spine or manifest items, broken idrefs or meta cover tags, missing required sections and so on.
de: Verschiedene übliche Probleme in OPF-Dateien, wie z.B. doppelte Buchrücken oder manifeste Bestandteile, kaputte idrefs oder Meta-Cover-Marker, fehlende Bereiche und so weiter.

source: Various compatibility checks for known problems that can cause the book to malfunction on reader devices.
de: Verschiedene Kompatibilitätsprüfungen für bekannte Probleme, die verhindern, dass das Buch auf einem E-Book-Reader angezeigt wird.

source: Add a cover
de: Ein Cover hinzufügen

source: You can easily add a cover to the book via :guilabel:`Tools->Add cover`. This allows you to either choose an existing image in the book as the cover or import a new image into the book and make it the cover. When editing EPUB files, the HTML wrapper for the cover is automatically generated. If an existing cover in the book is found, it is replaced. The tool also automatically takes care of correctly marking the cover files as covers in the OPF.
de: Sie können ein Cover über :guilabel:`Werkzeuge ->Cover hinzufügen` hinzufügen. Wählen Sie ein bestehendes Bild aus oder importieren Sie ein neues in das Buch um es zum Cover zu machen. Bei der Bearbeitung von EPUB-Dateien, wird der HTML-Wrapper automatisch erzeugt. Gibt es schon ein Cover für das Buch, wird dieses ersetzt. Das Werkzeug markiert die Cover-Dateien auch automatisch als Cover im OPF.

source: Embedding referenced fonts
de: Referenzierte Schriftarten einbinden

source: Accessed via :guilabel:`Tools->Embed reference fonts`, this tool finds all fonts referenced in the book and if they are not already embedded, searches your computer for them and embeds them into the book, if found. Please make sure that you have the necessary copyrights for embedding commercially licensed fonts, before doing this.
de: Über :guilabel:`Werkzeuge ->Einbetten von referenzierten Schriftarten` finden Sie alle Schriftarten, die im Buch referenziert sind und ob sie bereits eingebunden wurden. Das Werkzeug durchsucht Ihren Computer und bindet die Schriftarten im Buch ein, wenn sie vorhanden sind. Stellen Sie bitte sicher, dass Sie die nötigen Nutzungsrechte für kommerziell genutzte Schriftarten haben, bevor Sie dieses Werkzeug nutzen.

source: Subsetting embedded fonts
de: Eingebettete Schriften reduzieren

source: Accessed via :guilabel:`Tools->Subset embedded fonts`, this tool reduces all the fonts in the book to only contain glyphs for the text actually present in the book. This commonly reduces the size of the font files by ~ 50%. However, be aware that once the fonts are subset, if you add new text whose characters are not previously present in the subset font, the font will not work for the new text. So do this only as the last step in your workflow.
de: Über :guilabel:`Werkzeuge ->Eingebettete Schriften reduzieren` können Sie alle Schriftarten im Buch auf die tatsächlich verwendeten Zeichen reduzieren. In der Regel werden die Schriftart-Dateien dadurch um ca. 50 % kleiner. Beachten Sie dabei aber bitte, dass jeglicher neuer Text, der eingefügt wird nur die auch schon bisher in dieser Schriftart vorhandenen Zeichen enthalten kann, weil die Schriftart sonst nicht funktioniert. Die Reduktion sollte also immer erst als letzter Schritt erfolgen.

source: Smartening punctuation
de: Intelligente Satzzeichen

source: Convert plain text dashes, ellipsis, quotes, multiple hyphens, etc. into their typographically correct equivalents. Note that the algorithm can sometimes generate incorrect results, especially when single quotes at the start of contractions are involved. Accessed via :guilabel:`Tools->Smarten punctuation`.
de: Striche, Auslassungszeichen, Zitate, multiple Anführungszeichen usw. in typographisch korrekte Zeichen konvertieren. Beachten Sie, dass der Algorithmus zu falschen Ergebnissen führen kann, besonders, wenn einfache Anführungszeichen zu Beginn einer Zusammenziehung verwendet werden. Auf dieses Werkzeug haben Sie Zugriff unter :guilabel:`Werkzeuge ->Intelligente Zeichensetzung`.

source: Removing unused CSS rules
de: Nicht verwendete CSS Regeln entfernen

source: Fix HTML
de: HTML reparieren

source: Beautifying files
de: Dateien verschönern

source: This tool is used to auto-format all HTML and CSS files so that they "look pretty". The code is auto-indented so that it lines up nicely, blank lines are inserted where appropriate and so on. Note that beautifying also auto-fixes broken HTML/CSS. Therefore, if you dont want any auto-fixing to be performed, first use the Check Book tool to correct all problems and only then run beautify. Accessed via :guilabel:`Tools->Beautify all files`.
de: Dieses Werkzeug wird verwendet um alle HTML- und CSS-Dateien automatisch so zu formatieren, dass sie 'hübsch' aussehen. Die Einrückung des Code wird automatisch angepasst, dass zusammengehörende Teile auf einer Linie sind, an passender Stelle Leerzeilen eingefügt werden usw. Beachten Sie dass dadurch auch ungültiger HTML/CSS-Code korrigiert wird. Deshalb sollten Sie das 'Buch überprüfen'-Werkzeug verwenden um alle Fehler in Ihrem Sinne zu korrigieren, bevor Sie 'Alle Dateien verschönern' verwenden. Zugriff auf dieses Werkzeug haben Sie über :guilabel:`Werkzeuge ->Alle Dateien verschönern`.

source: In HTML any text can have significant whitespace, via the CSS white-space directive. Therefore, beautification could potentially change the rendering of the HTML. To avoid this as far as possible, the beautify algorithm only beautifies block level tags that contain other block level tags. So, for example, text inside a <p> tag will not have its whitespace changed. But a <body> tag that contains only other <p> and <div> tags will be beautified. This can sometimes mean that a particular file will not be affected by beautify as it has no suitable block level tags. In such cases you can try different beautification tools, that are less careful, for example: `HTML Tidy <http://infohound.net/tidy/>`_.
de: In HTML kann jeder Text über die CSS Whitespace-Direktive einen deutlichen Whitespace haben. Deshalb kann die Verschönerung die Umsetzung des HTML-Code möglicherweise verändern. Um das so weit wie möglich zu verhindern, verschönert der Algorithmus nur Block Level Marker, die andere Block Level Marker enthalten. Damit wird zum Beispiel der Whitespace von Text in einem <p> Marker nicht verändert. Aber ein <body> Marker, der nur andere <p> und <div> Marker enthält, wird verschönert. Das bedeutet manchmal dass eine bestimmte Datei nicht von der Verschönerung verändert wird, da sie keine passenden Block Level Marker enthält. In diesen Fällen können Sie verschiedene Werkzeuge zur Verschönerung verwenden, die weniger vorsichtig vorgehen, z.B.: `HTML Tidy <http://infohound.net/tidy/>`_.

source: Insert inline Table of Contents
de: Inline-Inhaltsverzeichnis (Inline-TOC) einfügen

source: Normally in ebooks, the Table of Contents is separate from the main text and is typically accessed via a special Table of Contents button/menu in the ebook reading device. You can also have calibre automatically generate an *inline* Table of Contents that becomes part of the text of the book. It is generated based on the currently defined Table of Contents.
de: In E-Books liegt das Inhaltsverzeichnis normalerweise getrennt vom Haupttext vor und wird über eine eigene Schaltfläche aufgerufen. Sie können von Calibre auch ein *eingebundenes* Inhaltsverzeichnis automatisch erstellen lassen, das Teil des Haupttextes ist. Es wird basierend auf dem aktuellen Inhaltsverzeichnis erzeugt.

source: If you use this tool multiple times, each invocation will cause the previously created inline Table of Contents to be replaced. The tool can be accessed via :guilabel:`Tools->Table of Contents->Insert inline Table of Contents`.
de: Wenn Sie dieses Werkzeug mehrmals verwenden, wird jedesmal das zuvor erstellte Inhaltsverzeichnis ersetzt. Sie können hier auf das Werkzeug zugreifen: :guilabel:`Werkzeuge ->Inhaltsverzeichnis ->Inline-Inhaltsverzeichnis (Inline-TOC) einfügen`.

source: Set Semantics
de: Semantik festlegen

source: This tool is used to set *semantics* in EPUB files. Semantics are simply, links in the OPF file that identify certain locations in the book as having special meaning. You can use them to identify the foreword, dedication, cover, table of contents, etc. Simply choose the type of semantic information you want to specify and then select the location in the book the link should point to. This tool can be accessed via :guilabel:`Tools->Set semantics`.
de: Dieses Werkzeug dient dazu eine *Semantik* in EPUB-Dateien festzulegen. Die Semantik wird einfach durch Links in der OPF-Datei gebildet, die bestimmte Orte im Buch mit einer besonderen Bedeutung kennzeichnen. Sie können sie verwenden, um das Vorwort, die Widmung, das Cover, das Inhaltsverzeichnis usw. zu kennzeichnen. Wählen Sie einfach die Art der Semantik-Informationen aus, die Sie festlegen möchten und danach den Ort im Buch, worauf der Link verweisen soll. Sie können auf dieses Werkzeug über :guilabel:`Werkzeuge ->Semantik festlegen` zugreifen.

source: Filter style information
de: CSS Style-Attribute filtern

source: This tool can be used to easily remove specified CSS style properties from the entire book. You can tell it what properties you want removed, for example, ``color, background-color, line-height`` and it will remove them from everywhere they occur --- stylesheets, ``<style>`` tags and inline ``style`` attributes. After removing the style information, a summary of all the changes made is displayed so you can see exactly what was changed. The tool can be accessed via :guilabel:`Tools->Filter style information`.
de: Sie können dieses Werkzeug verwenden um festgelegte CSS-Style-Attribute aus dem kompletten Buch zu entfernen. Sie können bestimmen, welche Eigenschaften entfernt werden sollen, zum Beispiel "Farbe, Hintergrundfarbe, Linienhöhe" und das Werkzeug wird sie überall, wo sie vorkommen, löschen --- Stylesheets, ``<style>`` Tags und Inline-``style``-Attribute. Nach dem Entfernen der Style-Informationen wird eine Zusammenfassung aller Änderungen angezeigt, damit Sie diese nachvollziehen können. Das Werkzeug finden Sie unter :guilabel:`Werkzeuge ->Style-Attribute filtern`.

source: Checkpoints
de: Sicherungspunkte

source: :guilabel:`Checkpoints` are a way to mark the current state of the book as "special". You can then go on to do whatever changes you want to the book and if you dont like the results, return to the checkpointed state. Checkpoints are automatically created every time you run any of the automated tools described in the previous section.
de: :guilabel:`Sicherungspunkte` ist eine Möglichkeit den momentanen Stand des Buches als "besonders" zu kennzeichnen. Sie können das Buch dann ändern und jederzeit zu diesem besonderen Stand zurückkehren, wenn Ihnen die Änderungen nicht gefallen. Sicherungspunkte werden automatisch erstellt, wenn sie eines der automatischen Werkzeuge verwenden, von denen in den vorhergehenden Abschnitten die Rede war.

source: You can create a checkpoint via :guilabel:`Edit->Create checkpoint`. And go back to a previous checkpoint with :guilabel:`Edit->Revert to ...`
de: Sie können einen Sicherungspunkt über :guilabel:`Bearbeiten ->Sicherungspunkt erstellen` anlegen. Zurück zu einem vorherigen Sicherungspunkt kommen Sie über :guilabel:`Bearbeiten ->Rückgägig zu "..."`.

source: The checkpointing functionality is in addition to the normal Undo/redo mechanism when editing individual files. Checkpoints are particularly useful for when changes are spread over multiple files in the book or when you wish to be able to revert a large group of related changes as a whole.
de: Die Sicherungspunkt-Funktion ist eine Ergänzung zur vorhandenen Funktion Rückgängig / Wiederherstellen für die Bearbeitung einzelner Dateien. Sicherungspunkte sind besonders nützlich, wenn sich die Veränderungen auf viele Dateien eines Buches erstrecken oder wenn Sie auf einen Schlag viele Änderungen rückgängig machen wollen.

source: You can see a list of available checkpoints via :guilabel:`View->Checkpoints`. You can compare the current state of the book to a specified checkpoint using the :ref:`diff` tool -- by selecting the checkpoint of interest and clicking the :guilabel:`Compare` button. The :guilabel:`Revert to` button restores the book to the selected checkpoint, undoing all changes since that checkpoint was created.
de: Sie finden unter :guilabel:`Anzeigen ->Sicherungspunkte` eine Liste der verfügbaren Sicherungspunkte. Die aktuelle Version des Buches lässt sich über das :ref:`diff` Werkzeug mit anderen vergleichen, indem Sie den entsprechenden Sicherungspunkt auswählen und auf die :guilabel:`Vergleichen` Schaltfläche klicken. Die Schaltfläche :guilabel:`Rückgängig zu "..."` stellt den Zustand des Buchs zum ausgewählten Sicherungspunkt wieder her und verwirft alle Änderungen, die seit Anlegen dieses Sicherungspunkts gemacht wurden.

source: The Live Preview panel
de: Das Dateivorschau-Fenster

source: The :guilabel:`File Preview` gives you an overview of the various files inside The live preview panel shows you the changes you are making live (with a second or two of delay). As you edit HTML or CSS files, the preview panel is updated automatically to reflect your changes. As you move the cursor around in the editor, the preview panel will track its location, showing you the corresponding location in the book. Clicking in the preview panel, will cause the cursor in the editor to be positioned over the element you clicked. If you click a link pointing to another file in the book, that file will be opened in the edit and the preview panel, automatically.
de: Die :guilabel:`Dateivorschau` gibt Ihnen einen Überblick von den einzelnen Dateien. In der Dateivorschau sehen Sie die Ihre Änderungen in Echtzeit (mit einer kurzen Verzögerung). Wenn Sie HTML- oder CSS-Dateien bearbeiten, wird das Vorschaufenster automatisch aktualisiert um die Änderungen zu zeigen. Wenn Sie den Cursor im Editor bewegen, zeigt das Vorschaufenster die jeweilige Position im Buch an. Mit einem Klick ins Vorschaufenster springt der Cursor im Editor auf das angeklickte Element. Wenn Sie einen Link anklicken, der zu einer anderen Datei im Buch führt. wird diese Datei automatisch im Editor und im Vorschaufenster geöffnet.

source: You can turn off the automatic syncing of position and live preview of changes -- by buttons under the preview panel. The live update of the preview panel only happens when you are not actively typing in the editor, so as not to be distracting or slow you down, waiting for the preview to render.
de: Sie können die automatische Synchronisierung der Position und der Live-Vorschau der Änderungen mit den Schaltflächen unter dem Vorschaufenster deaktivieren. Das Live-Update des Vorschaufenster wird nur dann ausgeführt, wenn Sie gerade nichts in den Editor eingeben, damit Sie nicht abgelenkt werden oder Zeit verlieren, weil Sie auf die Vorschau warten.

source: The preview panel shows you how the text will look when viewed. However, the preview panel is not a substitute for actually testing your book an actual reader device. It is both more, and less capable than an actual reader. It will tolerate errors and sloppy markup much better than most reader devices. It will also not show you page margins, page breaks and embedded fonts that use font name aliasing. Use the preview panel while you are working on the book, but once you are done, review it in an actual reader device or software emulator.
de: Das Vorschaufenster zeigt Ihnen, wie der Text in der Anzeige aussehen wird. Sie sollten Ihr Buch aber dennoch unbedingt auf einem Gerät testen, denn das Vorschaufenster kann teils mehr, teils weniger als ein E-Reader. Es toleriert Fehler und schlampige Markups viel besser als die meisten Geräte. Außerdem zeigt es keine Seitenränder, Seitenumbrüche und eingebettete Schriftarten, die das Aliasing von Schriftartnamen verwenden. Nutzen Sie das Vorschaufenster für die Arbeit an einem Buch und wechseln Sie zur Kontrolle zu einem Reader oder einem Software-Emulator.

source: The preview panel does not support embedded fonts if the name of the font inside the font file does not match the name in the CSS @font-face rule. You can use the Check Book tool to quickly find and fix any such problem fonts.
de: Das Vorschaufenster unterstützt keine eingebetteten Schriftarten, wenn der Name der Schriftart, der in der Schriftart-Datei abgelegt ist, nicht dem Namen in der CSS @font-face-Regel entspricht. Sie können das Werkzeug Buch überprüfen nutzen, um solche problematischen Schriftarten schnell zu finden und das Problem zu beheben.

source: Splitting HTML files
de: HTML-Dateien aufteilen

source: One, perhaps non-obvious, use of the preview panel is to split long HTML files. While viewing the file you want to split, click the :guilabel:`split mode` button under the preview panel |spmb|. Then simply move your mouse to the place where you want to split the file and click. A thick green line will show you exactly where the split will happen as you move your mouse. Once you have found the location you want, simply click and the split will be performed.
de: Eine Möglichkeit, die das Vorschaufenster bietet, die vielleicht nicht auf der Hand liegt, ist es lange HTML-Dateien aufzuteilen. Wenn Sie die Datei betrachten, die Sie aufteilen wollen, können Sie auf die Schaltfläche :guilabel:`Datei Teilen`. Bewegen Sie den Mauszeiger danach einfach zu der Stelle, an der die Datei geteilt werden soll und klicken Sie darauf. Eine dicke grüne Linie zeigt an, wo die Datei geteilt wird. Wenn Sie mit der Aufteilung zufrieden sind, klicken Sie einfach um die Teilung auszuführen.

source: Splitting the file will automatically update all links and references that pointed into the bottom half of the file and will open the newly split file in an editor.
de: Beim Teilen einer Datei werden automatisch alle Links und Verweise aktualisiert, die auf die untere Hälfte der Datei verwiesen haben. Außerdem wird die gerade geteilte Datei im Editor geöffnet.

source: You can also split a single HTML file at multiple locations automatically, by right clicking inside the file in the editor and choosing :guilabel:`Split at multiple locations`. This will allow you to easily split a large file at all heading tags or all tags having a certain class and so on.
de: Sie können auch eine einzelne HTML-Datei an mehreren Stellen automatisch aufteilen lassen, indem Sie innerhalb der Datei mit der rechten Maustaste in den Editor klicken und :guilabel:`An unterschiedlichen Stellen teilen` auswählen. Damit können Sie eine große Datei ganz einfach bei allen Markern für Überschriften oder allen Markern, die zu einer bestimmte Klasse gehören, aufteilen.

source: It is a great way to quickly see which style rules apply to any tag. The view also has clickable links (in blue), which take you directly to the location where the style was defined, in case you wish to make any changes to the style rules. Style rules that apply directly to the tag, as well as rules that are inherited from parent tags are shown.
de: Damit kann man schnell sehen, welche Style-Regel für einen Marker gilt. Die Ansicht hat auch klickbare Links (in Blau), mit denen Sie direkt zur Position gelangen, an der der Stil definiert wird um diese zu ändern. Regeln, die direkt zum Marker gehören und Regeln, die von übergeordneten Markern geerbt werden, werden ebenfalls angezeigt.

source: The panel also shows you what the finally calculated styles for the tag are. Properties in the list that are superseded by higher priority rules are shown with a line through them.
de: Das Fenster zeigt Ihnen auch, was die zuletzt berechneten Stile für den Marker sind. Eigenschaften in der Liste, die durch Regeln mit höherer Priorität ersetzt wurden, werden durchgestrichen angezeigt.

source: Miscellaneous Tools
de: Verschiedene Werkzeuge

source: There are a few more tools that can be useful while you edit the book.
de: Es gibt noch ein paar weitere Werkzeuge, die für die Bearbeitung eines Buches nützlich sind.

source: The Table of Contents View
de: Die Inhaltsverzeichnis-Ansicht

source: Checking the spelling of words in the book
de: Rechtschreibprüfung der Wörter im Buch
