Repository: Easonqsp/calibre-translations
Catalog: manual/*/edit.po
Languages: de

source: Words are shown with the number of times they occur in the book and the language the word belongs to. Language information is taken from the books metadata and from ``lang`` attributes in the HTML files. This allows the spell checker to work well even with books that contain text in multiple languages. For example, in the following HTML extract, the word color will be checked using American English and the word colour using British English::
de: Die Wörter werden zusammen mit der Zahl, wie oft sie verwendet wurden und der Sprache angezeigt. Die Sprache wird aus den Metadaten des Buchen und den "lang"-Attributen in den HTML-Dateien ermittelt. Damit kann die Rechtschreibprüfung auch dann problemlos arbeiten, wenn das Buch Text in verschiedenen Sprachen enthält. Im folgenden HTML-Beispiel wird das Wort "Color" nach der Rechtschreibung des amerikanischen Englisch und das Wort "Colour" nach der Rechtschreibung des britischen Englisch überprüft.

source: Adding new dictionaries
de: Hinzufügen von neuen Wörterbüchern

source: Inserting special characters
de: Einfügen von Sonderzeichen

source: The code inspector view
de: Die Codeinspektor-Ansicht

source: Arrange files into folders by type
de: Dateien nach Typ in Ordner sortieren

source: Importing files in other e-book formats as EPUB
de: Dateien in anderen eBook-Formaten als EPUB importieren
