Repository: Easonqsp/calibre-translations
Catalog: manual/*/edit.po
Languages: de

source: Editing E-books
de: E-Books bearbeiten

source: calibre has an integrated e-book editor that can be used to edit books in the EPUB and AZW3 (Kindle) formats. The editor shows you the HTML and CSS that is used internally inside the book files, with a live preview that updates as you make changes. It also contains various automated tools to perform common cleanup and fixing tasks.
de: calibre hat einen integrierten eBook Editor, der zum Bearbeiten von Büchern in den Formaten EPUB und AZW3 (Kindle) verwendet werden kann. Der Editor stellt Ihnen HTML und CSS dar, die innerhalb eines Buches verwendet werden. Dabei werden Änderungen direkt in der Live-Vorschau angezeigt. Der Editor beinhaltet auch verschiedene Werkzeuge zum automatischen Säubern und Reparieren von eBooks.

source: You can use this editor by right clicking on any book in calibre and selecting :guilabel:`Edit book`.
de: Sie können den Editor starten, indem Sie im calibre auf ein Buch rechts-klicken und :guilabel:`Buch bearbeiten` auswählen.

source: Contents
de: Inhaltsverzeichnis

source: Basic workflow
de: Grundlagen

source: A video tour of the calibre editor is available `here <http://calibre-ebook.com/demo#tutorials>`_.
de: Eine Videotour zum calibre Editor ist `hier <http://calibre-ebook.com/demo#tutorials>`_ verfügbar.

source: When you first open a book with the Edit book tool, you will be presented with a list of files on the left. These are the individual HTML files, stylesheets, images, etc. that make up the content of the book. Simply double click on a file to start editing it. Note that if you want to do anything more sophisticated than making a few small tweaks, you will need to know `HTML Tutorial <http://html.net/tutorials/html/>`_ and `CSS Tutorial <http://html.net/tutorials/css/>`_.
de: Wenn Sie ein Buch zum ersten Mal im Editor öffnen, wird Ihnen eine Dateiliste auf der linken Seite angezeigt. Dort befinden sich die HTML Dateien, Stylesheets, Bilder, usw. die den Inhalt eines eBooks ausmachen. Klicken Sie einfach doppelt auf eine Datei, um mit dem Bearbeiten zu beginnen. Beachten Sie, dass Sie für anspruchsvollere Änderungen Kenntnisse in `HTML Tutorial <http://html.net/tutorials/html/>`_ und `CSS Tutorial <http://html.net/tutorials/css/>`_ haben sollten.

source: As you make changes to the HTML or CSS in the editor, the changes will be previewed, live, in the preview panel to the right. When you are happy with how the changes you have made look, click the Save button or use :guilabel:`File->Save` to save your changes into the ebook.
de: Wenn Sie Änderungen an HTML oder CSS Dateien im Editor vornehmen, werden die Änderungen direkt in der Vorschau zur Rechten angezeigt. Wenn Sie mir dem Aussehen der Änderungen zufrieden sind, klicken Sie auf den Speichern Button oder verwenden :guilabel:`Datei ->Speichern` um Ihre Änderungen im eBook zu speichern.

source: One useful feature is :guilabel:`Checkpoints`. Before you embark on some ambitious set of edits, you can create a checkpoint. The checkpoint will preserve the current state of your book, then if in the future you decide you dont like the changes you have made to you can go back to the state when you created the checkpoint. To create a checkpoint, use :guilabel:`Edit->Create checkpoint`. Checkpoints will also be automatically created for you whenever you run any automated tool like global search and replace. The checkpointing functionality is in addition to the normal Undo/redo mechanism when editing individual files. Checkpoints are useful for when changes are spread over multiple files in the book.
de: Eine sehr nützliche Funktion ist :guilabel:`Sicherungspunkte`. Bevor Sie ehrgeizig mit einer Reihe von Änderungen beginnen, sollten Sie einen Sicherungspunkt erstellen. Der Sicherungspunkt wird den aktuellen Buchstatus sichern. So können Sie auch in Zukunft Änderungen wieder rückgängig machen und zum alten Zustand zurückkehren, an dem Sie den Sicherungspunkt angelegt haben. Um einen Sicherungspunkt zu erstellen, verwenden Sie :guilabel:`Bearbeiten ->Sicherungspunkt` erstellen. Sicherungspunkte werden auch automatisch erstellt, wenn Sie ein automatisches Werkzeug wie globales Suchen und Ersetzen nutzen. Die Funktion Sicherungspunkte wird zusätzlich zur normalen Rückgängig/Wiederholen Funktion verwendet. Sicherungspunkte sind nützlich, wenn Sie Änderungen an unterschiedlichen Dateien im Buch durchführen.

source: That is the basic work flow for editing books -- Open a file, make changes, preview and save. The rest of this manual will discuss the various tools and features present to allow you to perform specific tasks efficiently.
de: Das ist das normale Vorgehen im Editor -- Eine Datei öffnen, Änderungen vornehmen, Vorschau ansehen und Speichern. Der Rest dieses Handbuches wird sich mit den verschiedenen Werkzeugen und Funktionen auseinandersetzen, die es Ihnen erlauben, bestimmte Aufgaben effizient zu lösen.

source: The Files Browser
de: Der Datei-Browser

source: The :guilabel:`Files Browser` gives you an overview of the various files inside the book you are editing. The files are arranged by category, with text (HTML) files at the top, followed by stylesheet (CSS) files, images and so on. Simply double click on a file to start editing it. Editing is supported for HTML, CSS and image files. The order of text files is the same order that they would be displayed in, if you were reading the book. All other files are arranged alphabetically.
de: Der :guilabel:`Datei-Browser` gibt Ihnen einen Überblick über die verschiedenen Dateien innerhalb des Buches, das Sie bearbeiten. Die Dateien sind nach Kategorie sortiert, mit Text (HTML) Dateien am Anfang, gefolgt von Stylesheet (CSS) Dateien, Bildern und so weiter. Klicken Sie einfach auf eine Datei, um mit dem Bearbeiten zu beginnen. Es können HTML, CSS und Bilddateien bearbeitet werden. Die Textdateien werden in der gleichen Reihenfolge angezeigt, in der Sie das Buch lesen würden. Alle anderen Dateien werden alphabetisch sortiert.

source: By hovering your mouse over an entry, you can see its size, and also, at the bottom of the screen, the full path to the file inside the book. Note that files inside ebooks are compressed, so the size of the final book is not the sum of the individual file sizes.
de: Wenn Sie die Maus über einen Eintrag bewegen, können Sie seine Größe und am unteren Fensterrand den vollen Pfad der Datei im Buch sehen. Beachten Sie, dass Dateien innerhalb eines eBooks komprimiert sind, sodass sich die Größe des fertigen Buches nicht aus der Summe der individuellen Dateigrößen ergibt.

source: Many files have special meaning, in the book. These will typically have an icon next to their names, indicating the special meaning. For example, in the picture to the left, you can see that the files :guilabel:`cover_image.jpg` and :guilabel:`titlepage.xhtml` have the icon of a cover next to them, this indicates they are the book cover image and titlepage. Similarly, the :guilabel:`content.opf` file has a metadata icon next to it, indicating the book metadata is present in it and the the :guilabel:`toc.ncx` file has a T icon next to it, indicating it is the Table of Contents.
de: Einige Dateien im Buch haben eine spezielle Bedeutung. Diese haben normalerweise ein Icon neben ihrem Namen, dass auf die spezielle Bedeutung hinweist. Im Bild links können Sie sehen, dass die Dateien :guilabel:`cover_image.jpg` und :guilabel:`titlepage.xhtml` ein Icon eines Covers haben, was bedeutet, dass es sich um das Coverbild des Buches und die Titelseite handelt. In ähnlicher Weise hat die :guilabel:`content.opf` Datei ein Metadaten Icon, was bedeutet, dass die Metadaten des Buches in dieser Datei vorhanden sind. Die :guilabel:`toc.ncx` Datei wird durch ein "T"-Icon gekennzeichnet, was für das Inhaltsverzeichnis steht.

source: You can perform many actions on individual files, by right clicking them.
de: Sie können viele verschiedene Aktionen auf unterschiedliche Dateien anwenden, indem Sie mit der rechten Maustaste darauf klicken.

source: Renaming files
de: Dateien umbenennen

source: You can rename an individual file by right clicking it and selecting :guilabel:`Rename`. Renaming a file automatically updates all links and references to it throughout the book. So all you have to do is provide the new name, calibre will take care of the rest.
de: Sie können Dateien individuell umbenennen, indem Sie darauf rechtsklicken und :guilabel:`Umbenennen` auswählen. Wenn Sie eine Datei umbenennen werden automatisch alle Links und Referenzen im Buch aktualisiert. So brauchen lediglich einen neuen Namen zu vergeben und calibre kümmert sich um den Rest.

source: You can also bulk rename many files at once. This is useful if you want the files to have some simple name pattern. For example you might want to rename all the HTML files to have names Chapter-1.html, Chapter-2.html and so on. Select the files you want bulk renamed by holding down the Shift or Ctrl key and clicking the files. Then right click and select :guilabel:`Bulk rename`. Enter a prefix and what number you would like the automatic numbering to start at, click OK and you are done.
de: Sie können auch Dateien massenweise umbenennen. Das ist ganz nützlich, wenn Sie den Dateien einfache, einheitliche Namen geben möchten. Wenn Sie beispielsweise alle HTML Dateien umbenennen möchten, sodass sie den Namen Chapter-1.html, Chapter-2.html usw. haben, wählen Sie einfach die Dateien aus, die Sie massenweise umbenennen möchten. Halten Sie dazu die Shift oder Strg Taste und klicken dabei die Dateien an. Dann führen Sie einen Rechtsklick aus und wählen :guilabel:`Massenweise umbenennen`. Geben Sie einen Präfix an und die Zahl mit der automatisch begonnen werden soll und klicken Sie auf OK und Sie sind Fertig.

source: Merging files
de: Dateien zusammenführen

source: Sometimes, you may want to merge two HTML files or two CSS files together. It can sometimes be useful to have everything in a single file. Be wary, though, putting a lot of content into a single file will cause performance problems when viewing the book in a typical ebook reader.
de: Machmal möchten Sie zwei HTML Dateien oder zwei CSS Dateien zusammenführen. Es ist manchmal nützlich alles in einer einzigen Datei zu haben. Sein Sie aber vorsichtig, wenn Sie viel Inhalt in eine einzige Datei packen, kann es zu Leistungsproblemen beim Betrachten des Buches in normalen eBook-Readern kommen.

source: To merge multiple files together, select them by holding the Ctrl key and clicking on them (make sure you only select files of one type, either all HTML files or all CSS files and so on). Then right click and select merge. That's all, calibre will merge the files, automatically taking care of migrating all links and references to the merged files. Note that merging files can sometimes cause text styling to change, since the individual files could have used different stylesheets.
de: Um mehrere Dateien zusammen zu führen, halten Sie die Strg Taste gedrückt und wählen Sie die gewünschten Dateien aus (stellen Sie sicher, dass Sie nur Dateien des gleichen Dateityps auswählen, entweder HTML oder CSS Dateien). Dann führen Sie einen Rechtsklick aus und wählen Zusammenführen. Das war schon alles, calibre wird die Dateien zusammenführen und dabei automatisch Links und Verweise entsprechend anpassen. Beachten Sie, dass das Zusammenführen von Dateien manchmal das Erscheinungsbild des Texte verändert, da die einzelnen Dateien vorher unterschiedliche Stylesheets verwendet haben könnten.

source: Changing text file order
de: Textdateisortierung ändern

source: You can re-arrange the order in which text (HTML) files are opened when reading the book by simply dragging and dropping them in the Files browser. For the technically inclined, this is called re-ordering the book spine. Note that you have to drop the items *between* other items, not on top of them, this can be a little fiddly until you get used to it.
de: Sie können die Reihenfolge in der Text-Dateien (HTML) geöffnet werden, wenn Sie das Buch lesen, einfach durch Drag-and-Drop im Datei-Browser umstellen. Für technisch Interessierte: Das wird als Umordnen des Buchrückens bezeichnet. Beachten Sie, dass Sie die einzelnen Teile *zwischen* den anderen ablegen müssen und nicht direkt auf ihnen. Es kann ein wenig dauern, bis man sich daran gewöhnt hat.

source: Marking the cover
de: Das Coverbild markieren

source: E-books typically have a cover image. This image is indicated in the Files Browser by the icon of a brown book next to the image name. If you want to designate some other image as the cover, you can do so by right clicking on the file and choosing :guilabel:`Mark as cover`.
de: Normalerweise haben E-Books ein Coverbild. Dieses Bild wird im Dateibrowser durch ein Icon mit einem braunen Buch neben der Bildbezeichnung angezeigt. Wenn Sie ein anderes Bild auf dem Cover möchten, können Sie das per Rechtsklick tun, wenn Sie danach :guilabel:`Als Coverbild markieren` auswählen.

source: In addition, EPUB files has the concept of a *titlepage*. A title page is a HTML file that acts as the title page/cover for the book. You can mark an HTML file as the titlepage when editing EPUBs by right-clicking. Be careful that the file you mark contains only the cover information. If it contains other content, such as the first chapter, then that content will be lost if the user ever converts the EPUB file in calibre to another format. This is because when converting, calibre assumes that the marked title page contains only the cover and no other content.
de: Zusätzlich haben EPUB-Dateien eine *Titelseite*. Eine Titelseite ist eine HTML-Datei, die als das Cover der Titelseite fungiert. Sie können eine HTML-Datei als Titelseite festlegen, wenn Sie EPUBs bearbeiten, indem Sie rechtsklicken. Achten Sie darauf, dass die so markierte Datei nur die Cover-Informationen enthält. Wenn sich dort noch andere Inhalte befinden, wie zum Beispiel das erste Kapitel, werden diese verloren gehen, wenn der Nutzer die EPUB-Datei in calibre in ein anderes Format umwandelt. Der Grund ist, dass calibre beim Konvertieren davon ausgeht, dass die markierte Titelseite ausschließlich das Cover enthält.

source: Deleting files
de: Dateien löschen

source: You can delete files by either right clicking on them or by selecting them and pressing the Delete key. Deleting a file removes all references to the file from the OPF file, saving you that chore. However, references in other places are not removed, you can use the Check Book tool to easily find and remove/replace them.
de: Sie können Dateien löschen indem Sie entweder mit rechts darauf klicken oder indem Sie sie auswählen und dann auf Löschen drücken. Das Löschen entfernt auch alle Verweise zu der Datei aus der OPF-Datei um Ihnen diese Arbeit abzunehmen. Aber andernorts bleiben die Verweise bestehen. Sie können das "Buch prüfen"-Tool verwenden um alle Verweise zu finden und sie zu löschen oder zu ersetzen.

source: Export of files
de: Dateien exportieren

source: You can export a file from inside the book to somewhere else on your computer. This is useful if you want to work on the file in isolation, with specialised tools. To do this, simply right click on the file and choose :guilabel:`Export`.
de: Sie können eine Datei aus einem Buch heraus auf Ihren Computer exportieren. Das ist nützlich wenn Sie isoliert mit speziellen Programmen an dieser Datei arbeiten wollen. Für den Export rechtsklicken Sie auf die Datei und wählen :guilabel:`exportieren`.

source: Once you are done working on the exported file, you can re-import it into the book, by right clicking on the file again and choosing :guilabel:`Replace with file...` which will allow you to replace the file in the book with the previously exported file.
de: Sobald Sie mit dem Bearbeiten der exportierten Datei fertig sind, können Sie diese in das Buch re-importieren, indem Sie erneut auf die Datei rechtsklicken und :guilabel:`Ersetzen durch die Datei ...` auswählen. Damit können Sie die Datei im Buch mit der zuvor exportierten Datei ersetzen.

source: Adding new images/fonts/etc. or creating new blank files
de: Neue Bilder / Fonts / usw. hinzufügen oder neue leere Dateien anlegen.

source: You can add a new image, font, stylesheet, etc. from your computer into the book by clicking :guilabel:`File->New file`. This lets you either import a file by clicking the :guilabel:`Import resource file` button or create a new blank html file or stylesheet by simply entering the file name into the box for the new file.
de: Sie können ein neues Bild, eine Schriftart, ein Stylesheet, usw. von Ihrem Computer in das Buch einfügen, indem Sie auf :guilabel:`Datei ->Neue Datei` klicken. Damit können Sie entweder eine Datei importieren, indem Sie auf :guilabel:`Quelldatei importieren` klicken oder eine neue, leere html-Datei oder ein Stylesheet anlegen. Geben Sie dafür einfach den Dateinamen in das Feld für die neue Datei ein.

source: You can also import multiple files into the book at once using File->Import files into book.
de: Sie können auch mehrere Dateien auf einmal in das Buch einfügen, indem Sie Datei ->Dateien in das Buch importieren auswählen.

source: Replacing files
de: Dateien ersetzen

source: You can easily replace existing files in the book, by right clicking on the file and choosing replace. This will automatically update all links and references, in case the replacement file has a different name than the file being replaced.
de: Sie können ganz einfach bestehende Dateien im Buch ersetzen, indem Sie auf die Datei rechtsklicken und "Ersetzen durch die Datei ..." wählen. Damit werden automatisch alle Links und Verweise aktualisiert, falls die neue Datei einen anderen Namen hat als die alte Datei.

source: Linking stylesheets to HTML files efficiently
de: Stylesheets und HTML-Dateien effizient verlinken

source: As a convenience, you can select multiple HTML files in the Files Browser, right click and choose Link stylesheets to have calibre automatically insert the <link> tags for those stylesheets into all the selected HTML files.
de: Als Erleichterung können Sie mehrere HTML-Dateien im Datei-Browser auswählen, indem Sie rechtsklicken und "Stylesheets verlinken" auswählen, damit calibre automatisch <link>-Tags für diese Stylesheets in alle ausgewählten HTML-Dateien einfügt.

source: Search & Replace
de: Suchen & Ersetzen

source: Edit Book has a very powerful search and replace interface that allows you to search and replace text in the current file, across all files and even in a marked region of the current file. You can search using a normal search or using regular expressions. To learn how to use regular expressions for advanced searching, see :ref:`regexptutorial`.
de: Suchen und Ersetzen in Buch bearbeiten ist sehr hilfreich. Sie können damit einen Text in der aktuellen Datei suchen und ersetzen und das auch über alle Dateien hinweg oder in einem markierten Teil der aktuellen Datei. Sie können eine einfache Suche durchführen oder die bekannten Operatoren verwenden. Um die Verwendung von Operatoren für die Profisuche zu lernen, schlagen Sie unter :ref:`regexptutorial` nach.

source: Start the search and replace via the :guilabel:`Search->Find/replace` menu entry (you must be editing an HTML or CSS file).
de: Starten Sie Suchen/Ersetzen über den Menüeintrag :guilabel:`Suchen ->Suchen/Ersetzen` (wenn Sie dabei sind eine HTML- oder CSS-Datei zu bearbeiten).

source: Type the text you want to find into the Find box and its replacement into the Replace box. You can the click the appropriate buttons to Find the next match, replace the current match and replace all matches.
de: Geben Sie den Text ein, den Sie suchen in das Feld Suchen und den Text, der eingefügt werden soll in das Feld Ersetzen. Es stehen Schaltflächen zur Verfügen um zum nächsten Treffer zu springen, die aktuelle Fundstelle zu ersetzen oder alle zu ersetzen.

source: Using the drop downs at the bottom of the box, you can have the search operate over the current file, all text files, all style files or all files. You can also choose the search mode to be a normal (string) search or a regular expression search.
de: Über die Drop-Down-Menüs am Ende der Box können Sie bestimmen, ob die Suche im aktuellen Text läuft, in allen Text-Dateien, allen Style-Dateien oder generell allen Dateien. Außerdem können Sie auswählen, ob Sie normal (mit einer Zeichenkette) oder mit Operatoren suchen wollen.

source: You can count all the matches for a search expression via :guilabel:`Search->Count all`. The count will run over whatever files/regions you have selected in the dropdown box.
de: Sie können alle Fundstellen für einen Suchausdruck über :guilabel:`Suchen ->Alle(s) zählen` anzeigen. Die Suche dabei umfasst alles, was Sie in der Dropdown-Box ausgewählt haben.

source: You can also go to a specific line in the currently open editor via :guilabel:`Search->Go to line`.
de: Sie können auch mit :guilabel:`Suchen ->Gehe zu Zeile` im momentan geöffneten Editor zu einer bestimmen Zeile wechseln.

source: Remember, to harness the full power of search and replace, you will need to use regular expressions. See :ref:`regexptutorial`.
de: Nutzen Sie alle Möglichkeiten von Suchen und Ersetzen indem Sie reguläre Ausdrücke verwenden. Mehr dazu unter :ref:`regexptutorial`.

source: Saved searches
de: Gespeicherte Suchvorgänge

source: You can save frequently used search/replace expressions and reuse them multiple times. To save a search simply right click in the Find box and select :guilabel:`Save current search`.
de: Sie können Ausdrücke, nach denen Sie häufig suchen, speichern und dann bei Bedarf schnell nutzen. Um eine Suche zu speichern, klicken Sie einfach mit der rechten Maustaste auf die Suchbox und wählen Sie :guilabel:`Aktuelle Suche speichern`.

source: You can bring up the dialog of saved searches via :guilabel:`Search->Saved Searches`. This will present you with a list of search and replace expressions that you can apply. You can even select multiple entries in the list by holding down the Ctrl Key while clicking so as to run multiple search and replace expressions in a single operation.
de: Sie können die gespeicherten Suchen über :guilabel:`Suchen ->Gespeicherte Suchen` aufrufen. Sie bekommen eine Liste von Ausdrücken zum Suchen und Ersetzen, die Sie jederzeit wiederverwenden können. Auch eine Mehrfachauswahl für ist möglich, wenn Sie die "Strg"-Taste gedrückt halten.

source: Automated tools
de: Automatisierte Werkzeuge

source: Edit book has various tools to help with common tasks. These are accessed via the :guilabel:`Tools` menu.
de: 'Buch bearbeiten' hat verschiedene Werkzeuge, die Ihnen bei alltäglichen Aufgaben helfen. Sie sind über das Menü :guilabel:`Werkzeuge` zu erreichen.

source: Edit the Table of Contents
de: Das Inhaltsverzeichnis bearbeiten

source: There is a dedicated tool to ease editing of the Table of Contents. Launch it with :guilabel:`Tools->Table of Contents->Edit Table of Contents`.
de: Es gibt ein eigenes Werkzeug für eine leichtere Bearbeitung des Inhaltsverzeichnisses. Rufen Sie es über :guilabel:`Werkzeuge ->Inhaltsverzeichnis->Inhaltsverzeichnis bearbeiten` auf.

source: The Edit Table of Contents tool shows you the current Table of Contents (if any) on the left. Simply double click on any entry to change its text. You can also re-arrange entries by drag and drop or by using the buttons to the right.
de: Das Werkzeug 'Inhaltsverzeichnis bearbeiten' zeigt Ihnen das aktuelle Inhaltsverzeichnis (soweit vorhanden) auf der linken Seite. Den Text eines Eintrags können Sie nach einem Doppelklick ändern. Sie können Einträge auch durch Drag und Drop oder über die Schaltflächen auf der rechten Seite verschieben.
