Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: Frequently Asked Questions
fr: Questions Fréquemment Posées
sv: Vanliga frågor och svar

source: Contents
fr: Contenu
sv: Innehåll

source: Ebook Format Conversion
fr: Conversion de format de livre numérique
sv: E-bok formatkonvertering

source: What formats does calibre support conversion to/from?
fr: Quels sont les formats que supporte calibre en entrée/sortie pour la conversion ?
sv: Vilka format stöder calibre konvertering till/från?

source: calibre supports the conversion of many input formats to many output formats. It can convert every input format in the following list, to every output format.
fr: calibre supporte la conversion de nombreux formats en entrée vers de nombreux formats en sortie. Il peut convertir tous les formats d'entrée dans la liste ci-dessous, vers chaque format de sortie.
sv: calibre stöder konvertering av många indataformat till många utdataformat. Den kan konvertera alla indataformat i följande list, till alla utdataformat.

source: *Input Formats:* AZW, AZW3, AZW4, CBZ, CBR, CBC, CHM, DJVU, DOCX, EPUB, FB2, HTML, HTMLZ, LIT, LRF, MOBI, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT, TXTZ
fr: *Formats d'entrée :* AZW, AZW3, AZW4, CBZ, CBR, CBC, CHM, DJVU, DOCX, EPUB, FB2, HTML, HTMLZ, LIT, LRF, MOBI, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT, TXTZ
sv: *Indataformat:* AZW, AZW3, AZW4, CBZ, CBR, CBC, CHM, DJVU, DOCX, EPUB, FB2, HTML, HTMLZ, LIT, LRF, MOBI, ODT, PDF, PRC, PDB, PML, RB, RTF, SNB, TCR, TXT, TXTZ

source: *Output Formats:* AZW3, EPUB, DOCX, FB2, HTMLZ, OEB, LIT, LRF, MOBI, PDB, PMLZ, RB, PDF, RTF, SNB, TCR, TXT, TXTZ, ZIP
fr: *Formats de sortie :* AZW3, EPUB, DOCX, FB2, HTMLZ, OEB, LIT, LRF, MOBI, PDB, PMLZ, RB, PDF, RTF, SNB, TCR, TXT, TXTZ, ZIP
sv: *Utdataformat:* AZW3, EPUB, DOCX, FB2, HTMLZ, OEB, LIT, LRF, MOBI, PDB, PMLZ, RB, PDF, RTF, SNB, TCR, TXT, TXTZ, ZIP

source: PRC is a generic format, calibre supports PRC files with TextRead and MOBIBook headers. PDB is also a generic format. calibre supports eReader, Plucker, PML and zTxt PDB files. DJVU support is only for converting DJVU files that contain embedded text. These are typically generated by OCR software. MOBI books can be of two types Mobi6 and KF8. calibre fully supports both. MOBI files often have .azw or .azw3 file extensions. DOCX files from Microsoft Word 2007 and newer are supported.
fr: PRC est un format générique, calibre supporte les fichiers PRC avec des entêtes TextRead et MOBIBook. PDB est aussi un format générique. |app supporte les fichiers eReader, Plucker, PML et zTxt PDB. Le support de DJVU est seulement pour la conversion de fichiers DJVU qui contiennent du texte intégré. Ceux-ci sont typiquement produits par un logiciel OCR. Les livres MOBI peuvent être de deux types Mobi6 et KF8. calibre supporte pleinement chacun des deux. Les fichiers MOBI ont souvent des extensions de fichier .azw ou .azw3. Les fichiers DOCX de Microsoft Word 2007 et ultérieurs sont supportés.
sv: PRC är ett generiskt format calibre stöder PRC-filer med TextRead och MOBIBook rubriker. PDB är också en generisk format. calibre stöder läsplatta, Plucker, PML och zTxt preliminära filer. DjVu stöd endast för att konvertera DjVu-filer som innehåller inbäddade text. Dessa är oftast genereras av OCR-program. MOBI böcker kan vara av två typer Mobi6 och KF8. calibre stöder båda fullt ut. MOBI filer har ofta .azw eller .azw3 filändelser. Docx-filer från Microsoft Word 2007 och nyare stöds.

source: What are the best source formats to convert?
fr: Quels sont les meilleurs formats source pour la conversion ?
sv: Vilka är de bästa källformaten att konvertera?

source: In order of decreasing preference: LIT, MOBI, AZW, EPUB, AZW3, FB2, DOCX, HTML, PRC, ODT, RTF, PDB, TXT, PDF
fr: Par ordre décroissant de préférence : LIT, MOBI, AZW, EPUB, AZW3, FB2, DOCX, HTML, PRC, ODT, RTF, PDB, TXT, PDF
sv: I fallande preferens: LIT, MOBI, AZW, EPUB, AZW3, FB2, DOCX, HTML, PRC, ODT, RTF, PDB, TXT, PDF

source: I converted a PDF file, but the result has various problems?
fr: J'ai converti un fichier PDF, mais le résultat présente divers problèmes ?
sv: Jag konverterade en PDF-fil, men resultatet har diverse problem?

source: PDF is a terrible format to convert from. For a list of the various issues you will encounter when converting PDF, see: :ref:`pdfconversion`.
fr: PDF est un terrible format à partir duquel convertir. Pour une liste des différents problèmes que vous pouvez rencontrer lors de la conversion PDF, voir : :ref:`pdfconversion`.
sv: PDF är ett hemskt format att konvertera från. För en lista av diverse problem du kommer stöta på vid PDF-konvertering, se: :ref:`pdfconversion`.

source: How do I convert my file containing non-English characters, or smart quotes?
fr: Comment puis-je convertir mon fichier contenant des caractères non-anglais, ou des guillemets intelligents ?
sv: Hur konverterar jag min fil som innehåller icke-engelska tecken, eller typografiska citattecken?

source: There are two aspects to this problem:
fr: Il y a deux aspects à ce problème :
sv: Det finns två aspekter på detta problem:

source: Knowing the encoding of the source file: calibre tries to guess what character encoding your source files use, but often, this is impossible, so you need to tell it what encoding to use. This can be done in the GUI via the :guilabel:`Input character encoding` field in the :guilabel:`Look & Feel` section. The command-line tools all have an :option:`--input-encoding` option.
fr: Connaitre l'encodage du fichier source : calibre essaie de deviner quel encodage de caractères vos fichiers sources utilisent, mais souvent, c'est impossible, aussi avez besoin de lui préciser l'encodage à utiliser. Cela peut être fait dans le GUI par l'intermédiaire du champ :guilabel:`Encodage des caractères d'entrée` dans la section :guilabel:`Présentation`. Les outils en lignes de commande ont tous une option : `--input-encoding`.
sv: Att veta kodningen av källfilen: calibre försöker gissa vilken teckenkodning källfilerna använder, men ofta är detta omöjligt, så du måste tala om vad kodning att använda. Detta kan göras i GUI via :guilabel:`Teckenkodning för indata` fältet i :guilabel:`Utseende` sektion. De kommandoradsverktyg alla har: option: `--input-encoding` alternativ.

source: When adding HTML files to calibre, you may need to tell calibre what encoding the files are in. To do this go to :guilabel:`Preferences->Plugins->File Type plugins` and customize the HTML2Zip plugin, telling it what encoding your HTML files are in. Now when you add HTML files to calibre they will be correctly processed. HTML files from different sources often have different encodings, so you may have to change this setting repeatedly. A common encoding for many files from the web is ``cp1252`` and I would suggest you try that first. Note that when converting HTML files, leave the input encoding setting mentioned above blank. This is because the HTML2ZIP plugin automatically converts the HTML files to a standard encoding (utf-8).
fr: Lors de l'ajout de fichiers HTML à calibre, vous devrez peut-être indiquer à calibre quel est l'encodage des fichiers. Pour ce faire, allez dans :guilabel:`Préférences->Avancé-> Extensions->extensions Type de fichier`, et personnalisez l'extension HTML2Zip en lui indiquant quel encodage de caractère vous avez dans vos fichiers HTML Maintenant lorsque vous ajoutez des fichiers HTML dans calibre, ils seront traités correctement. Les fichiers HTML provenant de différentes sources ont souvent des encodages différents, de sorte que vous pouvez avoir à modifier ce paramètre à plusieurs reprises. Un codage courant pour beaucoup de fichiers sur le Web est ``cp1252`` et je vous suggère de commencer par celui-là. Notez que, lors de la conversion des fichiers HTML, laissez le paramètre d'encodage d'entrée mentionné ci-dessus à blanc. Car l'extension HTML2Zip convertit automatiquement les fichiers HTML selon une norme d'encodage (utf-8).
sv: När du lägger till HTML-filer till calibre, kan du behöva tala om för calibre vad filerna är kodade i. För att göra detta går du till :guilabel:`Inställningar->Tillägg->Filtyp tlllägg` och anpassa HTML2Zip-tlllägget, berätta för det vad dina HTML-filer är kodade i. Nu när du lägger HTML-filer till calibre kommer de att behandlas på rätt sätt. HTML-filer från olika källor har ofta olika kodningar, så du kan behöva ändra denna inställning upprepade gånger. En gemensam kodning för många filer från webben är `` cp1252`` och jag föreslår att du prova det först. Observera att när du konverterar HTML-filer, lämna indata kodningsinställningen ovan nämnda tomt. Detta beror på att HTML2Zip-tillägg automatiskt konverterar de HTML-filer till en standardkodning (UTF-8).

source: What's the deal with Table of Contents in MOBI files?
fr: Quel est le problème avec la Table des Matières dans les fichiers MOBI?
sv: Vad är det med innehållsförteckningen i MOBI-filer?

source: The first thing to realize is that most ebooks have two tables of contents. One is the traditional Table of Contents, like the ToC you find in paper books. This Table of Contents is part of the main document flow and can be styled however you like. This ToC is called the *content ToC*.
fr: La première chose à comprendre est que la plupart des livres numériques ont deux tables des matières. L'une est la Table des Matières traditionnelle, comme la TdM que vous trouvez dans les livres papier. Cette Table des Matières est une partie du flux du document principal et peut être mise en page, comme bon vous semble. Cette TdM est appelée *TdM de contenu*.
sv: Det första man måste inse är att de flesta e-böcker har två innehållsförteckningar. Den ena är den traditionella innehållsförteckningen, som innehållsförteckningen du hittar i pappersboken. Denna innehållsförteckning är en del av huvuddokumentflödet och kan titulera hur du vill. Detta innehållsförteckningen kallas *innehålls innehållsförteckningen*.

source: Then there is the *metadata ToC*. A metadata ToC is a ToC that is not part of the book text and is typically accessed by some special button on a reader. For example, in the calibre viewer, you use the Show Table of Contents button to see this ToC. This ToC cannot be styled by the book creator. How it is represented is up to the viewer program.
fr: Ensuite, il y a la *TdM des métadonnées*. Cette TdM ne fait pas partie du texte du livre et elle est généralement accessible par un bouton spécial sur une liseuse. Par exemple, dans la visionneuse de calibre, vous utilisez le bouton Afficher la Table des Matières pour y accéder. Cette TdM ne peut être mise en forme par le créateur du livre. Sa représentation dépend du logiciel de visualisation.
sv: Sedan är det *metadatats innehållsförteckningen*. En metadatas innehållsförteckningen är en innehållsförteckning som inte är en del av bokens text och vanligtvis nås av någon speciell knapp på en läsare. Till exempel i calibre läsare använder du Visa innehållsförteckningen för att se den här innehållsförteckningen. Denna innehållsförteckningen kan inte anpassas av bokens skapare. Hur det representeras är upp till läsarprogrammet.

source: In the MOBI format, the situation is a little confused. This is because the MOBI format, alone amongst mainstream ebook formats, *does not* have decent support for a metadata ToC. A MOBI book simulates the presence of a metadata ToC by putting an *extra* content ToC at the end of the book. When you click Goto Table of Contents on your Kindle, it is to this extra content ToC that the Kindle takes you.
fr: Dans le format MOBI, la situation est un peu confuse. C'est parce que le format MOBI, le seul parmi les formats de livre numérique principaux, *ne gère pas* correctement les TdM de métadonnées. Un livre MOBI simule la présence d'une TdM de métadonnées en ajoutant une TdM de contenu *supplémentaire* à la fin du livre. Lorsque vous cliquez sur Aller à la Table des Matières sur votre Kindle, c'est vers cette TdM de contenu supplémentaire que le Kindle vous emmène.
sv: I MOBI-formatet är situationen lite förvirrad. Detta beror på att MOBI-format, ensamt bland vanliga e-bokformat, inte har ordentlig stöd för ett metadatainnehållsförteckning. En MOBI-bok simulerar närvaron av en metadatainnehållsförteckning genom att sätta en *extra* innehållsförteckning i slutet av boken. När du klickar på Gå Innehållsförteckning på din Kindle, är det denna extra Innehållsförteckning Kindle tar.

source: Now it might well seem to you that the MOBI book has two identical ToCs. Remember that one is semantically a content ToC and the other is a metadata ToC, even though both might have exactly the same entries and look the same. One can be accessed directly from the Kindle's menus, the other cannot.
fr: Maintenant, il pourrait bien vous sembler que le livre MOBI a deux TdM identiques. Rappelez-vous que, sémantiquement parlant, il y a une TdM de contenu et une TdM de métadonnées, même si elles ont le même contenu et le même aspect. L'une est accessible directement depuis le menu Kindle, l'autre ne peut pas l'être.
sv: Nu kan det väl verka för dig att MOBI bok har två identiska innehållsförteckningar. Kom ihåg att en är semantiskt ett innehåll innehållsförteckningen och den andra är en metadatainnehållsförteckningen, även om båda kan ha exakt samma poster och ser likadana ut. Ena kan nås direkt från Kindle menyer, den andra inte kan.

source: When converting to MOBI, calibre detects the *metadata ToC* in the input document and generates an end-of-file ToC in the output MOBI file. You can turn this off by an option in the MOBI Output settings. You can also tell calibre whether to put it and the start or the end of the book via an option in the MOBI Output settings. Remember this ToC is semantically a *metadata ToC*, in any format other than MOBI it *cannot not be part of the text*. The fact that it is part of the text in MOBI is an accident caused by the limitations of MOBI. If you want a ToC at a particular location in your document text, create one by hand. So we strongly recommend that you leave the default as it is, i.e. with the metadata ToC at the end of the book. Also note that if you disable the generation of the end-of-file ToC the resulting MOBI file may not function correctly on a Kindle, since the Kindle's use the metadata ToC for many things, including the Page Flip feature.
fr: Lors de la conversion vers MOBI, calibre détecte la *TdM de métadonnées* dans le document d'entrée et génère une TdM de fin de fichier dans le fichier MOBI de sortie. Vous pouvez désactiver cette fonction par une option dans les paramètres de sortie MOBI. Vous pouvez aussi dire à calibre de la mettre au début ou la fin de l'ouvrage via une option dans les paramètres de sortie MOBI. Rappelez-vous cette TdM est sémantiquement une *TdM de métadonnées*, dans n'importe quel autre format que MOBI elle *ne peut pas faire partie du texte*. Le fait qu'il s'agisse d'une partie du texte dans MOBI est un accident causé par les limitations de MOBI. Si vous voulez une TdM à un endroit particulier dans le document texte, créez-la à la main. Nous vous recommandons fortement de laisser la valeur par défaut, c'est à dire avec la TdM de métadonnées à la fin du livre. Notez également que si vous désactivez la génération d'une TdM de fin de fichier, le fichier MOBI résultant pourrait ne pas fonctionner sur Kindle, depuis que Kindle utilise la TdM de métadonnées pour beaucoup de choses, incluant la fonctionnalité Tourner la Page.
sv: Vid konvertering till MOBI, upptäcker Calibre *metadatainnehållsförteckning* i inmatningsdokumentet och genererar en slut-på-fil innehållsförteckning i utdata MOBI-filen. Du kan stänga av detta med ett alternativ i MOBI-utdatainställningarna. Du kan också berätta för Calibre att sätta den i början eller slutet av boken via ett alternativ i MOBI -utdatainställningarna. Kom ihåg detta innehållsförteckning är semantiskt en metadatainnehållsförteckning, på annat MOBI-format kan det inte vara en del av texten. Det faktum att det är en del av texten i MOBI är en olycka som orsakats av begränsningar i MOBI. Om du vill ha en innehållsförteckning på en viss plats i dokumentets text, skapa en efter hand. Så vi rekommenderar att du lämnar standardinställning som den är, det vill säga med metadatainnehållsförteckningen i slutet av boken. Observera också att om du inaktiverar generering av slut-på-fil innehållsförteckning kanske den resulterande MOBI-filen inte fungerar korrekt på en Kindle, eftersom Kindle använder metadatainnehållsförteckningen för många saker, bland annat sidväxlingsfunktionen.

source: If you have a hand edited ToC in the input document, you can use the ToC detection options in calibre to automatically generate the metadata ToC from it. See the conversion section of the User Manual for more details on how to use these options.
fr: Si vous avez une TdM créée à la main dans le document d'entrée, vous pouvez utiliser les options de détection de TdM dans calibre pour générer automatiquement une TdM de métadonnées à partir de celle-ci. Voir la section sur la conversion du Manuel de l'utilisateur pour plus de détails sur la façon d'utiliser ces options.
sv: Om du har en handredigerad innehållsförteckning i inmatningsdokumentet kan du använda alternativen innehållsförteckningsupptäckt i Calibre för att automatiskt generera metadatainnehållsförteckning från den. Se omvandlingsavsnittet i användarhandboken för mer information om hur du använder de här alternativen.

source: Finally, I encourage you to ditch the content ToC and only have a metadata ToC in your ebooks. Metadata ToCs will give the people reading your ebooks a much superior navigation experience (except on the Kindle, where they are essentially the same as a content ToC).
fr: Enfin, je vous encourage à abandonner la création d’une TdM de contenu et de n'avoir qu'une TdM de métadonnées dans vos lvres numériques. La TdM de métadonnées fournira aux personnes qui lisent vos livres numériques une expérience de navigation très supérieure (sauf sur le Kindle, où elle est essentiellement la même qu’une TdM de contenu).
sv: Slutligen uppmanar jag dig att dumpa innehållet iinnehållsförteckningen och bara har en metadatainnehållsförteckningen i dina e-böcker. Metadatainnehållsförteckningen kommer att ge människor som läser dina e-böcker en mycket överlägsen navigeringserfarenhet (utom på Kindle, där de är i princip samma som en innehållsförteckningen).

source: The newer AZW3 format has proper support for a metadata ToC. However, the Kindle firmware tends to malfunction if you disable the generation of the end-of-file inline ToC. So it is recommended that you leave the generated ToC alone. If you create an AZW3 file with a metadata ToC and no end-of-file generated ToC, some features on the Kindle will not work, such as the Page Flip feature.
fr: Le nouveau format AZW3 a sa propre prise en charge d'une TdM de métadonnées. Cependant, le micrologiciel de la Kindle a tendance à mal fonctionner si vous désactivez la génération de la TdM interne de fin de fichier. Aussi il est recommandé de laisser la TdM générée seule. Si vous créez un fichier AZW3 avec une TdM de métadonnées et pas de TdM générée de fin de fichier, certaines fonctionnalités sur la Kindle ne fonctionneront pas, telle que la fonctionnalité Tourner la Page.
sv: Den nyare AZW3-formatet har ordentligt stöd för metadatainnehållsförteckning. Dock tenderar Kindle firmware inte fungerar om du avaktiverar generationen av slut-påfil-radbaserad innehållsförteckning. Så det rekommenderas att du lämnar den genererade innehållsförteckningen i fred. Om du skapar en AZW3-fil med metadatainnehållsförteckning och inget slut-på-fil som genererad innehållsförteckning, kommer en del funktioner på Kindle inte fungerar, till exempel sidväxlingsfunktionen.

source: The covers for my MOBI files have stopped showing up in Kindle for PC/Kindle for Android/iPad etc.
fr: Les couvertures de mes fichiers MOBI n’apparaissent plus sur mon Kindle pour PC/Kindle pour Android/iPad etc.
sv: Omslagen till mina MOBI-filer har slutat dyka upp i Kindle för PC / Kindle for Android / iPad etc.

source: This is caused by a bug in the Amazon software. You can work around it by going to :guilabel:`Preferences->Output Options->MOBI output` and setting the "Enable sharing of book content" option. If you are reconverting a previously converted book, you will also have to enable the option in the conversion dialog for that individual book (as per book conversion settings are saved and take precedence).
fr: Ceci est causé par un bug du logiciel Amazon. Vous pouvez contourner le problème en allant dans :guilabel:`Préférences->Options de sortie->sortie MOBI` et mettre à oui l'option *Activer le partage du contenu du livre*. Si vous reconvertissez un livre précédemment converti, vous devrez également activer cette option dans la boîte de dialogue de conversion pour ce livre individuel (vu que par livre les paramètres sont enregistrés et ont la priorité).
sv: Detta orsakas av en bugg i Amazonas programmet. Du kan lösa det genom att gå till :guilabel:`Inställningar->Alternativ för utdata-> MOBI utdata` och ställa in "Aktivera delning av bokinnehåll" alternativet. Om du kodar om en tidigare konverterade bok, måste du också aktivera alternativet i omvandlingsdialogrutan för att enskild bok (som per bok konverteringsinställningar sparas och har företräde).

source: Note that doing this will mean that the generated MOBI will show up under personal documents instead of Books on the Kindle Fire and Amazon whispersync will not work, but the covers will. It's your choice which functionality is more important to you. I encourage you to contact Amazon and ask them to fix this bug.
fr: Notez que cela aura pour conséquence que le MOBI généré sera affiché dans les documents personnels à la place de Books sur le Kindle Fire et que l'Amazon whispersync ne fonctionnera pas. Mais les couvertures seront présentes. C'est à vous de voir quelle fonctionnalité est la plus importante pour vous. Je vous encourage à contacter Amazon et leur demander de corriger ce bug.
sv: Observera att detta kommer att innebära att den genererade MOBI kommer att dyka upp i personliga dokument i stället för böcker på Kindle Fire och Amazon Whispersync kommer inte att fungera, men omslagen kommer. Det är ditt val vilken funktion som är viktigare för dig. Jag uppmuntrar dig att kontakta Amazon och be dem att åtgärda detta fel.
