Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: You can change this algorithm by going to Preferences->Tweaks and setting the :guilabel:`author_sort_copy_method` tweak.
fr: Vous pouvez modifier cet algorithme en allant dans Préférences->Ajustements et en paramétrant l'ajustement :guilabel:`author_sort_copy_method`.
sv: Du kan ändra denna algoritm genom att gå till Inställningar->Avancerat->Justeringar och ställa in :guilabel:`author_sort_copy_method` justering.

source: You can force calibre to recalculate the author sort values for every author by right clicking on any author and selecting :guilabel:`Manage authors`, then pushing the `Recalculate all author sort values` button. Do this after you have set the author_sort_copy_method tweak to what you want.
fr: Vous pouvez forcer calibre à recalculer les valeurs de tri d'auteur pour chaque auteur en cliquant droit sur n'importe quel auteur et en sélectionnant :guilabel:`Gérer Auteurs`, puis en cliquant sur le bouton `Recalculer toutes les valeurs de tri par auteur`. Faites cette action, après avoir défini l'ajustement author_sort_copy_method à ce que vous souhaitez .
sv: Du kan tvinga calibre att räkna om författarssorteringsvärdena för varje författare genom att högerklicka på en författare och välja :guilabel:`Hantera Författare`, sedan trycka på `Beräkna om alla författare slags värden`-knappen. Gör detta efter att du har ställt in author_sort_copy_method för att justera vad du vill.

source: You can force calibre to recalculate the author sort values for all books by using the bulk metadata edit dialog (select all books and click edit metadata, check the `Automatically set author sort` checkbox, then press OK.)
fr: Vous pouvez forcer calibre à recalculer les valeurs de tri d'auteur pour tous les livres en utilisant la boîte de dialogue Modifier les métadonnées par lot (sélectionner tous les livres et cliquez sur Modifier les métadonnées. Ensuite, cochez la case `Effectuer un tri automatique par auteur`, puis cliquez sur OK.)
sv: Du kan tvinga calibre att räkna om författarsorteringsvärden för alla böcker med hjälp av mass redigera metadata dialogrutan (välj alla böcker och klicka på redigera metadata, kontrollera `automatiskt ställ in författarsorterings`rutan, tryck sedan på OK.)

source: When recalculating the author sort values for books, calibre uses the author sort values for each individual author. Therefore, ensure that the individual author sort values are correct before recalculating the books' author sort values.
fr: Quand les valeurs de tri de l'auteur sont recalculées pour les livres , calibre utilise les valeurs de tri pour chaque auteur individuel. Par conséquent, assurez-vous que les valeurs de tri individuelles par auteur sont correctes avant de recalculer les valeurs de tri de l'auteur pour les livres.
sv: Vid omräkning av författarsorteringsvärden för böcker, använder calibre författarsorteringsvärden för varje enskild författare. Se därför till att de enskilda författarsorteringsvärden är korrekta innan omräkning av böckernas författarsorteringsvärden.

source: You can control whether the Tag Browser display authors using their names or their sort values by setting the :guilabel:`categories_use_field_for_author_name` tweak in Preferences->Tweaks
fr: Vous pouvez contrôler de quelle manière le Navigateur d'Etiquettes va afficher les auteurs en utilisant leur nom ou en se basant sur leurs valeurs de tri en paramétrant l'ajustement :guilabel:`categories_use_field_for_author_name` dans Préférences->Ajustements.
sv: Du kan styra om de etikettbläddrarens visar författare genom att använda deras namn eller deras sorteringsvärden genom att ställa in :guilabel:`categories_use_field_for_author_name` justering i Inställningar->Avancerat->Justeringar

source: Note that you can set an individual author's sort value to whatever you want using :guilabel:`Manage authors`. This is useful when dealing with names that calibre will not get right, such as complex multi-part names like Miguel de Cervantes Saavedra or when dealing with Asian names like Sun Tzu.
fr: Notez que vous pouvez définir la valeur de tri d'un auteur individuellement de la manière que vous désirez en utilisant :guilabel:`Gérer auteurs`. Cela peut être utile lorsque calibre ne le fait pas correctement,sur les noms composés complexes comme Miguel de Cervantes Saavedra ou lorsqu'il s'agit de noms asiatiques comme Sun Tzu.
sv: Observera att du kan ställa in en enskild författares sorteringsvärde till vad du vill med hjälp av :guilabel:`Hantera Författare`. Detta är användbart när det handlar om namn som calibre inte kommer att få rätt, till exempel komplexa flerdelade namn som Miguel de Cervantes Saavedra eller när behandlar asiatiska namn som Sun Tzu.

source: With all this flexibility, it is possible to have calibre manage your author names however you like. For example, one common request is to have calibre display author names LN, FN. To do this, and if the note below does not apply to you, then:
fr: Avec toute cette flexibilité, il est possible de voir calibre gérer vos noms d'auteurs exactement comme vous le souhaitez. Prenons comme exemple, une demande habituelle : que calibre trie les auteurs par Nom, Prénom. Pour ce faire, et si la note qui se trouve ci-dessous ne s'applique pas à vous, alors :
sv: Med all denna flexibilitet, är det möjligt att ha calibre hantera dina författarnamn som du vill. Till exempel är en gemensam begäran om att få calibre att visa författarnamn LN, FN. För att göra detta, och om anmärkningen nedan inte gäller dig, då:

source: Set the ``author_sort_copy_method`` tweak to ``copy`` as described above.
fr: Paramétrez l'ajustement ``author_sort_copy_method`` à ``copy`` comme décrit ci-dessus.
sv: Ställ in author_sort_copy_method justera ``kopiera`` såsom beskrivits ovan.

source: Restart calibre. Do not change any book metadata before doing the remaining steps.
fr: Redémarrez calibre. Ne pas modifier les métadonnées de livre avant de faire les étapes restantes.
sv: Starta calibre. Ändra inte någon boks metadata innan du gör de återstående stegen.

source: Change all author names to LN, FN using the Manage authors dialog.
fr: Changer tous les noms d'auteurs à Nom, Prénom en utilisant la boîte de dialogue Gérer auteurs.
sv: Ändra alla författarnamn till LN, FN använder dialogrutan Hantera författare.

source: After you have changed all the authors, press the `Recalculate all author sort values` button.
fr: Après avoir changé tous les auteurs, cliquez sur le bouton `Recalculer toutes les valeurs de tri par auteur`.
sv: När du har ändrat alla författare, tryck på `Räkna all författaren slags värden`-knappen.

source: Press OK, at which point calibre will change the authors in all your books. This can take a while.
fr: Appuyez sur OK, à ce moment calibre va modifier les auteurs dans tous vos livres. Cela peut prendre un certain temps.
sv: Tryck på OK, vid vilken punkt calibre kommer att ändra författarna i alla dina böcker. Detta kan ta ett tag.

source: When changing from FN LN to LN, FN, it is often the case that the values in author_sort are already in LN, FN format. If this is your case, then do the following:
fr: Lors du changement depuis Prénom Nom à Nom, Prénom, il est souvent le cas que les valeurs author_sort sont déjà au format Nom, Prénom. Si c'est le cas, procédez comme suit :
sv: Vid byte från FN LN till LN, FN, är det ofta så att värdena i author_sort är redan i LN, FN-format. Om detta är fallet, gör följande:

source: set the ``author_sort_copy_method`` tweak to ``copy`` as described above.
fr: Paramétrez ``author_sort_copy_method`` à ``copy`` comme décrit ci-dessus.
sv: ställa in author_sort_copy_method justera ``kopiera`` såsom beskrivits ovan.

source: restart calibre. Do not change any book metadata before doing the remaining steps.
fr: Redémarrez calibre. Ne pas modifier les métadonnées de livre avant de faire les étapes restantes.
sv: omstarta calibre. Ändra inte någon bok metadata innan du gör de återstående stegen.

source: open the Manage authors dialog. Press the ``copy all author sort values to author`` button.
fr: ouvrez la boîte de dialogue Gérer auteurs. Appuyez le bouton ``Copier toutes les valeurs de tri d'auteur dans auteur``.
sv: Öppna dialogrutan Hantera författare. Tryck på kopian alla författare sortera värden till författaren knappen.

source: Check through the authors to be sure you are happy. You can still press Cancel to abandon the changes. Once you press OK, there is no undo.
fr: Vérifiez les auteurs pour être sûr du résultat. Vous pouvez toujours cliquer sur Annuler pour abandonner les modifications. Une fois que vous aurez cliqué sur OK, il n'y aura plus d'annulation possible.
sv: Kolla igenom författarna för att vara säker på att du är nöjd. Du kan fortfarande trycka på Avbryt för att överge ändringarna. När du trycker på OK, det finns inget att ångra.

source: Why doesn't calibre let me store books in my own directory structure?
fr: Pourquoi Calibre ne me laisse-t'il pas stocker mes livres dans ma propre structure de répertoire ?
sv: Varför inte calibre låta mig lagra böcker i min egen katalogstruktur?

source: The whole point of calibre's library management features is that they provide a search and sort based interface for locating books that is *much* more efficient than any possible directory scheme you could come up with for your collection. Indeed, once you become comfortable using calibre's interface to find, sort and browse your collection, you wont ever feel the need to hunt through the files on your disk to find a book again. By managing books in its own directory structure of Author -> Title -> Book files, calibre is able to achieve a high level of reliability and standardization. To illustrate why a search/tagging based interface is superior to folders, consider the following. Suppose your book collection is nicely sorted into folders with the following scheme::
fr: Le point essentiel de la gestion de la bibliothèque calibre, c’est qu'il fournit une interface de recherche et de tri pour localiser les livres beaucoup plus efficace que n'importe lequel des système de répertoire que vous pourriez concevoir pour votre collection. En effet, une fois que vous serez à l'aise avec l'interface de calibre pour trouver, trier et parcourir votre bibliothèque, vous ne ressentirez plus le besoin de faire la chasse à vos livres sur votre disque dur pour les retrouver. En gérant les livres selon sa propre structure de répertoire Auteur -> Titre -> Fichiers du livre, calibre est capable d'atteindre un haut niveau de fiabilité et de standardisation. Pour illustrer pourquoi une interface de recherche/étiquetage est supérieure à la gestion des répertoires, considérez ce qui suit. Supposons que votre collection de livre est bien classée dans des dossiers avec le schéma suivant :
sv: Hela poängen med calibre-bibliotekhanteringsfunktioner är att de ger en sökning och sortering baserat gränssnitt för att lokalisera böcker som är mycket effektivare än någon eventuell katalogschema du kunde komma på för din samling. Ja, när du blir bekväm med calibre-gränssnitt för att hitta, sortera och bläddra i din samling, kommer du inte någonsin känna ett behov av att jaga igenom filerna på din hårddisk för att hitta en bok igen. Genom att hantera böcker i sin egen katalogstruktur Författare -> Titel -> Boka filer är calibre kan uppnå en hög grad av tillförlitlighet och standardisering. För att illustrera varför en sökning / märkning baserat gränssnitt är överlägsen mappar, tänka på följande. Anta att din boksamling är snyggt sorterade i mappar med följande schema::

source: Now this makes it very easy to find for example all science fiction books by Isaac Asimov in the Foundation series. But suppose you want to find all unread science fiction books. There's no easy way to do this with this folder scheme, you would instead need a folder scheme that looks like::
fr: Dans ce schéma, il est très facile de trouver, par exemple, tous les livres de science-fiction écrits par Isaac Asimov dans la série Fondation. Mais si vous voulez trouver tous les livres de science-fiction - non lus, il n'y a aucun moyen simple de le faire avec ce schéma de dossier. Il aurait fallu choisir un schéma qui ressemble à :
sv: Nu gör det mycket enkelt att hitta till exempel alla science fiction böcker av Isaac Asimov i stiftelsen serien. Men antar att du vill hitta alla olästa science fiction böcker. Det finns inget enkelt sätt att göra detta med den här mappen system, du måste i stället ha en mapp system som ser ut som::

source: In calibre, you would instead use tags to mark genre and read status and then just use a simple search query like ``tag:scifi and not tag:read``. calibre even has a nice graphical interface, so you don't need to learn its search language instead you can just click on tags to include or exclude them from the search.
fr: Dans calibre, vous pouvez utiliser des étiquettes pour indiquer le genre et le statut de lecture et ensuite simplement utiliser une requête de recherche basique comme ``tag:scifi and not tag:read``. calibre a même une interface graphique agréable : vous n'avez pas à apprendre son langage de recherche mais simplement à cliquer sur les étiquettes pour les inclure ou exclure de la recherche.
sv: I calibre, skulle du istället använda etiketter för att markera genre och läsa status och sedan bara använda en enkel sökfråga som "etikett: scifi och inte : läsa``. calibre har även en fint grafiskt gränssnitt, så att du inte behöver lära sig sitt sökspråk istället kan du bara klicka på etiketter för att inkludera eller exkludera dem från sökningen.

source: To those of you that claim that you need access to the filesystem to so that you can have access to your books over the network, calibre has an excellent content server that gives you access to your calibre library over the net.
fr: Pour ceux d'entre vous qui réclament d'avoir besoin d'accéder au système de fichiers pour récupérer vos livres à partir du réseau, calibre a un excellent serveur de contenu qui vous donne accès à votre bibliothèque calibre par le net.
sv: Till er som hävdar att du behöver tillgång till filsystemet på så att du kan få tillgång till dina böcker över nätet, har calibre en utmärkt innehållsserver som ger dig tillgång till ditt calibre-biblioteket över nätet.

source: If you are worried that someday calibre will cease to be developed, leaving all your books marooned in its folder structure, explore the powerful "Save to Disk" feature in calibre that lets you export all your files into a folder structure of arbitrary complexity based on their metadata.
fr: Si vous craignez que calibre cesse un jour d'être développé et laisse tous vos livres en rade, coincés dans sa structure de dossiers, jetez un oeil à la puissante fonctionnalité *Enregistrer sur le disque* dans calibre qui vous permet d'exporter tous vos fichiers dans une arborescence de dossiers d'une complexité arbitraire fondée sur leurs métadonnées.
sv: Om du är orolig att en dag calibre kommer att upphöra att utvecklas och att lämna alla dina böcker strandsatta i sin mappstruktur, utforska den kraftfulla "Spara till disk"-funktionen i calibre som låter dig exportera alla dina filer i en mappstruktur för godtycklig komplexitet baserat på sina metadata.

source: Finally, the reason there are numbers at the end of every title folder, is for *robustness*. That number is the id number of the book record in the calibre database. The presence of the number allows you to have multiple records with the same title and author names. It is also part of what allows calibre to magically regenerate the database with all metadata if the database file gets corrupted. Given that calibre's mission is to get you to stop storing metadata in filenames and stop using the filesystem to find things, the increased robustness afforded by the id numbers is well worth the uglier folder names.
fr: Enfin, la raison pour laquelle il y a des chiffres à la fin de chaque dossier de titre, est la *robustesse*. Ce nombre est le numéro d'identification de l'enregistrement du livre dans la base de données calibre. La présence du numéro vous permet d'avoir plusieurs enregistrements avec le même titre et noms d’auteur. C'est aussi une partie de ce qui permet à calibre de régénérer magiquement la base de données avec toutes les métadonnées si le fichier de base de données est corrompu. Étant donné que la mission de calibre est de vous amener à ne plus stocker les métadonnées dans les noms de fichiers et d'arrêter d'utiliser le système de fichiers pour trouver des choses, la robustesse accrue offerte par les numéros d'identification vaut bien des noms de dossiers plus laids.
sv: Slutligen, anledningen finns det siffror i slutet av varje titelmapp är för robusthet. Det antalet är ID-nummer av bokregistreringen i calibre-databasen. Med närvaron av numret kan du ha flera poster med samma titel och författarnamn. Det är också en del av det som gör calibre magiskt regenerera databas med all metadata om databasfilen blir korrupt. Med tanke på att calibre uppdrag är att få dig att sluta lagra metadata i filnamn och sluta använda filsystemet för att hitta saker, är den ökade robust ges av id-nummer väl värt de fulare mappnamn.

source: If you are still not convinced, then I'm afraid calibre is not for you. Look elsewhere for your book cataloguing needs. Just so we're clear, **this is not going to change**. Kindly do not contact us in an attempt to get us to change this.
fr: Si vous n'êtes toujours pas convaincu, alors j’ai bien peur que calibre ne soit pas pour vous. cherchez ailleurs pour vos besoins catalogage de livres. Pour que tout soit clair, nous ne changerons pas notre méthode. Inutile de nous contacter pour tenter de nous faire changer d’avis.
sv: Om du fortfarande inte övertygad, så jag är rädd calibre är inte för dig. Leta någon annanstans för din bok katalogisering behov. Bara så att vi är klara, detta kommer inte att förändras. Vänligen kontakta inte oss i ett försök att få oss att ändra på detta.

source: Why doesn't calibre have a column for foo?
fr: Pourquoi calibre n’a pas telle ou telle colonne ?
sv: Varför inte calibre har en foo-kolumn?

source: calibre is designed to have columns for the most frequently and widely used fields. In addition, you can add any columns you like. Columns can be added via :guilabel:`Preferences->Interface->Add your own columns`. Watch the tutorial `UI Power tips <http://calibre-ebook.com/demo#tutorials>`_ to learn how to create your own columns, or read `this blog post <http://blog.calibre-ebook.com/2011/11/calibre-custom-columns.html>`_.
fr: calibre est conçu pour avoir des colonnes pour les champs les plus fréquemment et largement utilisés. En outre, vous pouvez ajouter toutes les colonnes que vous désirez. Les colonnes peuvent être ajoutées via :guilabel:`Préférences->Interface->Ajout de colonnes personnalisées`. Regardez le tutoriel `UI Power tips <http://calibre-ebook.com/demo#tutorials>`_ pour apprendre à créer vos propres colonnes, ou lisez `ce poste de blog <http://blog.calibre-ebook.com/2011/11/calibre-custom-columns.html>`_.
sv: calibre är konstruerad för att ha kolumner för de mest frekvent och mest använda fälten. Dessutom kan du lägga till några kolumner som du gillar. Kolumner kan läggas till via Inställningar->Gränssnitt->Lägg till dina egna kolumner. Titta på handledningen `UI Power tips <http://calibre-ebook.com/demo#tutorials>`_ för att lära sig att skapa egna kolumner, eller läs `detta blogginlägg <http://blog.calibre-ebook.com/2011/11/calibre-custom-columns.html>`_.

source: You can also create "virtual columns" that contain combinations of the metadata from other columns. In the add column dialog use the :guilabel:`Quick create` links to easily create columns to show the book ISBN or formats. You can use the powerful calibre template language to do much more with columns. For more details, see :ref:`templatelangcalibre`.
fr: Vous pouvez également créer des "colonnes virtuelles" qui contiennent des combinaisons de métadonnées à partir d'autres colonnes. Dans la boîte de dialogue ajouter une colonne utilisez les liens :guilabel:`Création rapide` pour créer facilement des colonnes pour montrer l'ISBN du livre ou les formats. Vous pouvez utiliser le puissant langage de modèle pour faire beaucoup plus avec les colonnes. Pour plus de détails, voir :ref:`templatelangcalibre`.
sv: Du kan också skapa “virtuella kolumner” som innehåller kombinationer av metadata från andra kolumner. I dialogrutan Lägg till kolumnen använda :guilabel: `Snabb create`-länkar för att enkelt skapa kolumner för att visa bokens ISBN eller format. Du kan använda kraftfulla calibre mallspråk att göra mycket mer med kolumner. För mer information, se :ref:`templatelangcalibre`.

source: Can I have a column showing the formats or the ISBN?
fr: Puis-je avoir une colonne indiquant le format ou le numéro ISBN ?
sv: Kan jag ha en kolumn som visar format eller ISBN?

source: Yes, you can. Follow the instructions in the answer above for adding custom columns.
fr: Oui, vous le pouvez. Suivez les instructions de la réponse ci-dessus pour ajouter des colonnes personnalisées.
sv: Ja, det kan du. Följ instruktionerna i svaret ovan för att lägga till egna kolumner.

source: How do I move my calibre library from one computer to another?
fr: Comment transférer la bibliothèque calibre d'un ordinateur à un autre ?
sv: Hur flyttar jag min calibre-biblioteket från en dator till en annan?
