Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: If I implement a dialog that downloads the update and launches it, instead of going to the website as it does now, that would save the most ardent calibre updater, *at most five clicks a week*. There are far higher priority things to do in calibre development.
fr: Si j’implémentais une boîte de dialogue permettant de télécharger la mise à jour et de la lancer, au lieu d'aller sur le site comme il faut le faire actuellement, cela permettrait d’économiser *tout au plus cinq clics par semaine*. Il y a de bien plus hautes priorités à mettre en place pour le développement de calibre.
sv: Om jag implementerar en dialogruta som hämtar uppdateringen och släpper det, istället för att gå till webbplatsen som det gör nu, som skulle rädda den ivrigaste calibre-uppdaterare, *högst fem klick i veckan*. Det finns betydligt högre prioritet att göra i calibre-utveckling.

source: If you really, really hate downloading calibre every week but still want to be up to the latest, I encourage you to run from source, which makes updating trivial. Instructions are :ref:`available here <develop>`.
fr: Si vous détestez vraiment télécharger la mise à jour calibre toutes les semaines mais tenez à avoir la dernière version, je vous encourage à l'exécuter depuis la source qui rend la mise à jour insignifiante. Les instructions sont :ref:`disponibles ici <develop>`.
sv: Om du verkligen, verkligen hatar att ladda ner calibre varje vecka, men ändå vill vara upp till den senaste, jag uppmuntrar dig att köra från källkod, vilket gör att uppdatera trivialt. Instruktioner: ref: `finns här <utveckla>`.

source: There are third party automatic updaters for calibre made by calibre users in the `calibre forum <http://www.mobileread.com/forums/forumdisplay.php?f=238>`_.
fr: Il y a des installateurs de mise à jour automatiques faits par des utilisateurs calibre dans le `forum calibre <http://www.mobileread.com/forums/forumdisplay.php?f=238>`_.
sv: Det finns automatiska tredjepartsuppdaterare för calibre gjorda av calibre användare på `calibre forum <http://www.mobileread.com/forums/forumdisplay.php?f=238>`_.

source: How is calibre licensed?
fr: Quelle est la licence de calibre ?
sv: Hur är calibre licensierad?

source: calibre is licensed under the GNU General Public License v3 (an open source license). This means that you are free to redistribute calibre as long as you make the source code available. So if you want to put calibre on a CD with your product, you must also put the calibre source code on the CD. The source code is available `for download <http://download.calibre-ebook.com>`_. You are free to use the results of conversions from calibre however you want. You cannot use either code or libraries from calibre in your software without making your software open source. For details, see `The GNU GPL v3 <http://www.gnu.org/licenses/gpl.html>`_.
fr: Calibre est sous licence General Public License v3 (une licence open source). Cela signifie que vous êtes libre de redistribuer Calibre tant que vous rendez le code source disponible. Donc, si vous voulez mettre calibre sur un CD avec votre produit, vous devez également mettre le code source de calibre sur le CD. Le code source est disponible `en téléchargement <http://download.calibre-ebook.com>`_. Vous êtes libre d'utiliser le résultat des conversions de calibre comme vous le souhaitez. Vous ne pouvez pas utiliser le code et les bibliothèques de calibre dans votre logiciel sans rendre votre logiciel open source. Pour plus de détails, voir `The GNU GPL v3 <http://www.gnu.org/licenses/gpl.html>`_.
sv: calibre licensieras under GNU General Public License v3 (en öppen källkod-licens). Det innebär att du är fri att distributera calibre så länge du gör källkoden tillgänglig. Så om du vill sätta calibre på en CD med din produkt, måste du också sätta calibre-källkod på CD. Källkoden är tillgänglig `för nedladdning <http://download.calibre-ebook.com>` _. Du är fri att använda resultaten av konverteringar från calibre hur du vill. Du kan inte använda någon kod eller bibliotek från calibre i programmet utan att göra din programvara med öppen källkod. För mer information, se `GNU GPL v3 <http://www.gnu.org/licenses/gpl.html>` _.

source: How do I run calibre from my USB stick?
fr: Comment exécuter calibre depuis ma clé USB ?
sv: Hur kör jag calibre från mitt USB-minne?

source: A portable version of calibre is available `here <http://calibre-ebook.com/download_portable>`_.
fr: Une version portable de calibre est disponible `ici <http://calibre-ebook.com/download_portable>`_.
sv: En bärbar version av finns `här <http://calibre-ebook.com/download_portable>`_.

source: How do I run parts of calibre like news download and the content server on my own linux server?
fr: Comment puis-je exécuter certaines fonctions de calibre comme le téléchargements des actualités et le serveur de contenu sur mon propre serveur linux ?
sv: Hur kör jag delar av calibre som nyhetsnedladdning och mediaservern på min egen Linux-server?

source: First, you must install calibre onto your linux server. If your server is using a modern linux distro, you should have no problems installing calibre onto it.
fr: Tout d'abord, vous devez installer calibre sur votre serveur linux. Si votre serveur utilise une distribution Linux récente, vous ne devriez avoir aucun problème pour y installer calibre.
sv: Först måste du installera calibre på din Linux-server. Om servern använder en modern Linux-distributioner, bör du inte ha några problem med att installera calibre på den.

source: calibre needs GLIBC >= 2.13 and libstdc++ >= 6.0.17. If you have an older server, you will either need to compile these from source, or use calibre 1.48 which requires only GLIBC >= 2.10. In addition, although the calibre command line utilities do not need a running X server, some of them do require the X server libraries to be installed on your system. This is because the use Qt, which links against these libraries. If you get an ImportError about some Qt modules, you are likely missing some X libraries.
fr: calibre nécessite GLIBC >= 2.13 et libstdc++ >= 6.0.17. Si vous avez un ancien serveur, vous devrez compiler à partir de la source ou utiliser calibre 1.48 qui requiert seulement GLBC >= 2.10. En complément, bien que les utilitaires en ligne de commande calibre n'ont pas besoin un X server en cours d’exécution, certains de ceux-ci requièrent que les les librairies X server soient installées sur votre système. C'est à cause de l'utilisation de Qt, qui fait des liens vers ces librairies. Si vous obtenez une ImportError à propos de certains modules Qt, vous avez apparemment certaines librairies X manquantes.
sv: calibre behöver GLIBC >= 2.13 och libstdc++ >= 6.0.17. Om du har en äldre server, kommer du antingen vara tvungen sammanställa dessa från källan, eller använda calibre 1.48 vilket kräver endast GLIBC >= 2.10. Dessutom, även om calibres kommandoradsverktyg behöver inte ha en körande X-server, kräver en del av dem att X-serverns bibliotek ska installeras på ditt system. Detta beror på att användningen Qt, som länkar mot dessa bibliotek. Om du får en ImportError om några Qt moduler, är det sannolikt du saknar vissa X-bibliotek.

source: You can run the calibre server via the command::
fr: Vous pouvez exécuter le serveur de calibre via la commande::
sv: Du kan köra calibre-servern med kommandot::

source: You can download news and convert it into an ebook with the command::
fr: Vous pouvez télécharger les actualités et les convertir en livre numérique avec la commande::
sv: Du kan ladda ner nyheter och omvandla de till en e-bok med kommandot:

source: If you want to generate MOBI, use outputfile.mobi instead and use ``--output-profile kindle``.
fr: Si vous voulez générer un MOBI, utilisez outputfile.mobi à la place et utiliser ``--output-profile kindle``.
sv: Om du vill generera MOBI, använd outputfile.mobi istället och använd ``--output-profil Kindle``.

source: You can email downloaded news with the command::
fr: Vous pouvez envoyer par courriel les actualités téléchargées avec la commande::
sv: Du kan skicka e-post med nedladdade nyheter med kommandot:

source: I leave figuring out the exact command line as an exercise for the reader.
fr: Je vous laisse trouver la ligne de commande exacte comme un exercice pour le lecteur.
sv: Jag lämnar att lista ut exakt kommandorad som en övning för läsaren.

source: Finally, you can add downloaded news to the calibre library with::
fr: Enfin, vous pouvez ajouter les nouvelles téléchargées vers la bibliothèque calibre avec::
sv: Slutligen kan du lägga till nedladdade nyheter till calibre-biblioteket med:

source: Remember to read the command line documentation section of the calibre User Manual to learn more about these, and other commands.
fr: N'oubliez pas de lire la documentation de la section ligne de commande du Manuel de l'Utilisateur calibre pour en savoir sur celles-ci et sur d'autres commandes.
sv: Kom ihåg att läsa kommandoraden dokumentationsavsnittet av calibre i användarhandboken för mer information om dessa och andra kommandon.

source: Microsoft/Google can disable your account if you use it to send large amounts of email. So, when using Hotmail/Gmail to send mail calibre automatically restricts itself to sending one book every five minutes. If you don't mind risking your account being blocked you can reduce this wait interval by going to Preferences->Tweaks in calibre.
fr: Microsoft/Google peuvent désactiver votre compte si vous l'utilisez pour envoyer de grandes quantités de courriels. Aussi, lors de l'utilisation de Hortmail/Gmail calibre se limite automatiquement à l’envoi d’un livre toutes les cinq minutes. Si vous n'avez pas peur de risquer que votre compte soit bloqué, vous pouvez réduire cet intervalle d'attente en allant dans Préférences-> Ajustements dans calibre.

source: calibre is not starting on OS X?
fr: calibre ne démarre pas sous OS X ?

source: One common cause of failures on OS X is the use of accessibility technologies that are incompatible with the graphics toolkit calibre uses. Try turning off VoiceOver if you have it on. Also go to System Preferences->System->Universal Access and turn off the setting for enabling access for assistive devices in all the tabs.
fr: Une cause fréquente de pannes sur OS X est l'utilisation de technologies d'accessibilité qui sont incompatibles avec la boite à outils graphique utilisée par calibre. Essayez de désactiver VoiceOver si vous l'avez. Puis allez sur Préférences Système->Système->Accès Universel et désactivez-le paramètre pour autoriser l'accès aux périphériques assistés dans tous les onglets.
