Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: Replace ``192.168.1.2`` with the local IP address of the computer running calibre. If you have changed the port the calibre content server is running on, you will have to change ``8080`` as well to the new port. The local IP address is the IP address you computer is assigned on your home network. A quick Google search will tell you how to find out your local IP address.
fr: Remplacer ``192.168.1.2`` par l'adresse IP locale de l’ordinateur exécutant calibre. Si vous avez changé le port du serveur sur lequel se trouve le serveur de contenu calibre, vous devrez remplacer ``8080`` par le nouveau port. L'adresse IP est l'adresse IP que vous a attribuée l’ordinateur sur votre réseau domestique. Une recherche rapide sur Google vous dira comment trouver votre adresse IP locale.
sv: Ersätt 192.168.1.2 med den lokala IP-adressen till den dator som kör calibre. Om du har ändrat porten calibre innehållsservern körs på, måste du ändra 8080 samt till den nya hamnen. Den lokala IP-adress är IP-adressen som du dator tilldelas i ditt hemmanätverk. En snabb Google-sökning kommer att berätta hur du hittar din lokala IP-adress.

source: You will see a list of books in Safari, just click on the epub link for whichever book you want to read, Safari will then prompt you to open it with iBooks.
fr: Vous verrez une liste de livres sur Safari, cliquez simplement sur le lien epub pour n'importe quel livre que vous voulez lire, Safari vous invite ensuite à l'ouvrir avec iBooks.
sv: Du kommer att se en lista över böcker i Safari, klicka bara på länken epub för vilket som bok du vill läsa, kommer Safari då att uppmana dig att öppna den med iBooks.

source: With the USB cable + iTunes
fr: Avec le câble USB + iTunes
sv: Med USB-kabeln + iTunes

source: Use the 'Connect to iTunes' method in the 'Getting started' instructions in `Calibre + Apple iDevices: Start here <http://www.mobileread.com/forums/showthread.php?t=118559>`_.
fr: Utilisez la méthode 'Se connecter à iTunes' dans les instructions du 'Guide de démarrage' dans `Calibre + Apple iDevices: Start here <http://www.mobileread.com/forums/showthread.php?t=118559>`_.
sv: Använd 'Anslut till iTunes' metoden i 'Getting started' instructioner i `Calibre + Apple iDevices: Start here <http://www.mobileread.com/forums/showthread.php?t=118559>`_.

source: This method only works on Windows Vista and higher, and OS X upto 10.8. Linux is not supported (iTunes is not available in linux) and OS X newer than 10.8 is not supported, as Apple removed the facility to use iTunes to manage books, replacing it with iBooks.
fr: Cette méthode ne fonctionne que sur Windows Vista et supérieur, et OS X jusqu'à 10.8. Linux n'est pas supporté (iTunes n'est pas disponible sous Linux) et OS X plus récent que 10.8 n'est pas pris en charge, puisque Apple a supprimé la possibilité d'utiliser iTunes pour gérer les livres, le remplaçant par iBooks.
sv: Denna metod fungerar endast på Windows Vista och senare, och OS X upp till 10.8 och högre. Linux stöds inte (iTunes är inte tillgänglig i Linux) och OS X nyare än 10.8 stöds inte, eftersom Apple tagit bort möjligheten att använda iTunes för att hantera böcker och ersatt den med iBooks.

source: How do I use calibre with my Android phone/tablet or Kindle Fire HD?
fr: Comment utiliser calibre avec mon téléphone/ma tablette Android ou ma Kindle Fire HD ?
sv: Hur använder jag calibre med min Android-telefon / surfplatta eller Kindle Fire HD?

source: There are two ways that you can connect your Android device to calibre. Using a USB cable -- or wirelessly, over the air. The first step to using an Android device is installing an ebook reading application on it. There are many free and paid ebook reading applications for Android: Some examples (in no particular order): `FBReader <https://play.google.com/store/apps/details?id=org.geometerplus.zlibrary.ui.android&hl=en>`_, `Moon+ <https://play.google.com/store/apps/details?id=com.flyersoft.moonreader&hl=en>`_, `Mantano <https://play.google.com/store/apps/details?id=com.mantano.reader.android.lite&hl=en>`_, `Aldiko <https://play.google.com/store/apps/details?id=com.aldiko.android&hl=en>`_, `Kindle <https://play.google.com/store/apps/details?id=com.amazon.kindle&feature=related_apps>`_.
fr: Il existe deux solutions pour connecter votre appareil Android à calibre. En utilisant un câble USB -- ou sans fil, grâce au wifi. La première étape pour un appareil Android est d'installer une application de lecture de livre numérique. Il existe de nombreuses applications de lecture de livre numérique gratuites ou payantes pour Android : quelques exemples (sans ordre particulier) : `FBReader <https://play.google.com/store/apps/details?id=org.geometerplus.zlibrary.ui.android&hl=en>`_, `Moon+ <https://play.google.com/store/apps/details?id=com.flyersoft.moonreader&hl=en>`_, `Mantano <https://play.google.com/store/apps/details?id=com.mantano.reader.android.lite&hl=en>`_, `Aldiko <https://play.google.com/store/apps/details?id=com.aldiko.android&hl=en>`_, `Kindle <https://play.google.com/store/apps/details?id=com.amazon.kindle&feature=related_apps>`_.
sv: Det finns två sätt som du kan ansluta din Android-enhet till calibre. Med hjälp av en USB-kabel - eller trådlöst, via etern. Det första steget till att använda en Android-enhet är att installerar en e-bok att läsa program på den. Det finns många gratis och betalal e-bokläsningsapplikationer för Android: Några exempel (utan inbördes ordning): `FBReader <https://play.google.com/store/apps/details?id=org.geometerplus.zlibrary.ui.android&hl=en>`_, `Moon+ <https://play.google.com/store/apps/details?id=com.flyersoft.moonreader&hl=en>`_, `Mantano <https://play.google.com/store/apps/details?id=com.mantano.reader.android.lite&hl=en>`_, `Aldiko <https://play.google.com/store/apps/details?id=com.aldiko.android&hl=en>`_, `Kindle <https://play.google.com/store/apps/details?id=com.amazon.kindle&feature=related_apps>`_.

source: Using a USB cable
fr: En utilisant un cable USB
sv: Med hjälp av en USB-kabel

source: Simply plug your device into the computer with a USB cable. calibre should automatically detect the device and then you can transfer books to it by clicking the Send to Device button. calibre does not have support for every single android device out there, so if your device is not automatically detected, follow the instructions at :ref:`devsupport` to get your device supported in calibre.
fr: Il suffit de brancher votre périphérique à l'ordinateur avec un câble USB. calibre devrait détecter automatiquement le périphérique et puis vous pouvez transférer des livres en cliquant sur le bouton Envoyer à l'appareil. calibre n'a pas de support pour chaque périphérique Android, si votre appareil n'est pas détecté automatiquement, suivez les instructions de :ref:`devsupport` pour obtenir le support votre périphérique dans calibre.
sv: Anslut bara enheten till datorn med en USB-kabel. calibre ska automatiskt upptäcka enheten och sedan kan du överföra böcker till den genom att klicka på Skicka till enhet knappen. calibre har inte stöd för varje Android-enhet där ute, så om enheten inte identifieras automatiskt, följ instruktionerna i :ref:`devsupport` för att få din enhet stöds i calibre.

source: With newer Android devices, the USB connection is not supported on Windows XP and OS X before Mavericks (10.9). If you are on Windows XP or old versions of OS X, you should use one of the wireless connection methods.
fr: Avec les nouveaux périphériques Android, la connexion USB n'est pas prise en charge sur Windows XP et OS X avant Mavericks (10.9). Si vous êtes sous Windows XP, vous devez utiliser une des méthodes de connexion sans fil.
sv: Med nyare Android-enheter, stöds inte USB-anslutningen i Windows XP och OS X innan Mavericks (10,9). Om du är på Windows XP eller äldre versioner av OS X, bör du använda en av de trådlösa anslutningsmetoder.

source: The easiest way to transfer books wirelessly to your Android device is to use the `Calibre Companion <http://www.multipie.co.uk/calibre-companion/>`_ Android app. This app is maintained by a core calibre developer and allows calibre to connect to your Android device wirelessly, just as though you plugged in the device with a USB cable. You can browse files on the device in calibre and use the :guilabel:`Send to device` button to transfer files to your device wirelessly.
fr: La manière la plus facile de transférer sans fil des livres à votre appareil Android est d'utiliser l'application Android `Calibre Companion <http://www.multipie.co.uk/calibre-companion/>`_. Cette application est maintenue par un développeur du noyau de calibre et permet à calibre de se connecter sans fil à votre appareil Android, comme si vous aviez branché l'appareil avec un câble USB. Vous pouvez parcourir les fichiers sur le périphérique à partir de calibre et utiliser le bouton :guilabel:`Envoyer à l'appareil` pour transférer des fichiers sur votre périphérique sans fil.
sv: Det enklaste sättet att överföra böcker trådlöst till din Android-enhet är att använda `Calibre Companion <http://www.multipie.co.uk/calibre-companion/>`_ Android app. Denna app underhålls av en Calibre utvecklare och låter calibre för att ansluta till din Android-enhet trådlöst, precis som om du satt i enheten med en USB-kabel. Du kan bläddra bland filer på enheten i calibre och använda :guilabel:`Skicka till enhet` för att överföra filer till enheten trådlöst.

source: calibre also has a builtin web server, the :guilabel:`Content Server`. You can browse your calibre collection on your Android device is by using the calibre content server, which makes your collection available over the net. First perform the following steps in calibre
fr: calibre a aussi un serveur web incorporé, le :guilabel:`Serveur de Contenu`. Vous pouvez parcourir votre bibliothèque calibre sur votre appareil Android en utiliseant le serveur de contenu calibre, ce qui rend votre bibliothèque disponible sur le net. Tout d''abord, effectuer les étapes suivantes dans calibre :
sv: calibre har också en inbyggd webbserver, :guilabel:`mediaserver`. Du kan bläddra i din calibre samling på din Android-enhet är att använda calibre mediaservern, vilket gör din samling tillgängligt över nätet. Utför först följande steg i calibre

source: Set the :guilabel:`Preferred Output Format` in calibre to EPUB for normal Android devices or MOBI for Kindles (The output format can be set under :guilabel:`Preferences->Interface->Behavior`)
fr: Paramétrez le :guilabel:`Format Préféré de Sortie` de calibre à EPUB pour les périphériques Android, ou MOBI pour Kindle (Le format de sortie peut être réglé dans :guilabel:`Préférences->Interface->Comportement`)
sv: Ställ in :guilabel:`Önskat utformat` i calibre till EPUB för normala Android-enheter eller MOBI för Kindles (Utdataformatet kan ställas in under :guilabel:`Inställningar->Gränssnitt->Beteende`)

source: Convert the books you want to read on your device to EPUB/MOBI format by selecting them and clicking the Convert button.
fr: Convertir les livres que vous voulez lire sur votre appareil au format EPUB/MOBI en les sélectionnant et en cliquant sur le bouton Convertir.
sv: Konvertera de böcker du vill läsa på din enhet till EPUB / MOBI-format genom att markera dem och klicka på knappen Konvertera.

source: Turn on the Content Server in calibre's preferences and leave calibre running.
fr: Allumez le Serveur de Contenu dans les préférences de calibre et laissez calibre en exécution.
sv: Slå på mediaserver i calibre inställningar och lämna calibre igång.

source: Now on your Android device, open the browser and browse to
fr: Maintenant, sur votre périphérique Androïd, ouvrez le navigateur et naviguez vers
sv: Nu på din Android-enhet, öppna webbläsaren och gå till

source: Replace ``192.168.1.2`` with the local IP address of the computer running calibre. If your local network supports the use of computer names, you can replace the IP address with the network name of the computer. If you have changed the port the calibre content server is running on, you will have to change ``8080`` as well to the new port.
fr: Remplacer ``192.168.1.2`` par l'adresse IP locale de l’ordinateur exécutant calibre. Si votre réseau local supporte l'utilisation des noms d'ordinateurs, vous pouvez remplacer l'adresse IP par le nom réseau de l'ordinateur.Si vous avez changé le port du serveur sur lequel se trouve le serveur de contenu calibre, vous devrez remplacer ``8080`` par le nouveau port.
sv: Ersätt ``192.168.1.2`` med den lokala IP-adressen till den dator som kör calibre. Om ditt lokala nätverk stöder användning av datornamn, kan du byta ut IP-adressen med nätverket namnet på datorn. Om du har ändrat porten calibre-mediaservern körs på, måste du ändra 8080 samt till den nya porten.

source: The local IP address is the IP address you computer is assigned on your home network. A quick Google search will tell you how to find out your local IP address. You can now browse your book collection and download books from calibre to your device to open with whatever ebook reading software you have on your android device.
fr: L'adresse IP locale est l'adresse IP qui est attribuée à l’ordinateur sur votre réseau domestique. Une recherche rapide sur Google vous dira comment trouver votre adresse IP locale. Vous pouvez maintenant naviguer dans votre bibliothèque de livres et télécharger les livres depuis calibre sur votre appareil pour les ouvrir avec n'importe quel logiciel de lecture de livre numérique que vous avez préalablement installé sur votre périphérique Android.
sv: Den lokala IP-adress är IP-adressen som du dator tilldelas i ditt hemmanätverk. En snabb Google-sökning kommer att berätta hur du hittar din lokala IP-adress. Nu kan du bläddra i din boksamling och hämta böcker från calibre till enheten för att öppna med vad e-bokläsprogram du har på din Android-enhet.

source: Some reading programs support browsing the Calibre library directly. For example, in Aldiko, click My Catalogs, then + to add a catalog, then give the catalog a title such as "Calibre" and provide the URL listed above. You can now browse the Calibre library and download directly into the reading software.
fr: Certains programmes de lecture peuvent naviguer directement dans la bibliothèque de calibre. Par exemple, dans Aldiko, cliquez sur Mes Catalogues, puis + pour ajouter une bibliothèque. Donnez à la bibliothèque un titre tel que "Calibre" et indiquez l'URL précisée ci-dessus. Vous pouvez maintenant naviguer dans la bibliothèque calibre et télécharger directement dans le logiciel de lecture.
sv: Vissa läsprogram stöder surfa på calibre-biblioteket direkt. Till exempel i Aldiko Klicka på Mina kataloger, då + lägga till en katalog, sedan ge katalogen en titel som "Calibre" och ge adressen som anges ovan. Nu kan du bläddra i Calibre-biblioteket och ladda ner direkt till läsprogram.

source: Can I access my calibre books using the web browser in my Kindle or other reading device?
fr: Puis-je accéder à mes livres calibre en utilisant le navigateur web sur mon Kindle ou sur une autre liseuse ?
sv: Kan jag komma åt mina calibre-böcker med hjälp av webbläsaren i min Kindle eller annan läsenhet?

source: calibre has a *Content Server* that exports the books in calibre as a web page. You can turn it on under :guilabel:`Preferences->Sharing over the net`. Then just point the web browser on your device to the computer running the Content Server and you will be able to browse your book collection. For example, if the computer running the server has IP address 63.45.128.5, in the browser, you would type::
fr: calibre a un *Serveur de Contenu* qui exporte les livres de calibre comme une page Web. Vous pouvez l'activer sous :guilabel:`Préférences->Partage via Internet`. Il suffit ensuite de rentrer sur le navigateur web de votre dispositif l’adresse de l'ordinateur sur lequel tourne le Serveur de Contenu et vous pourrez parcourir votre bibliothèque de livres. Par exemple, si l'ordinateur sur lequel tourne le serveur est à l’adresse ip 63.45.128.5, dans le navigateur vous devez taper :
sv: calibre har en *mediaerver* som exporterar böcker i calibre som en webbsida. Du kan slå på den under :guilabel:`Inställningar->Dela på nätet`. Sedan är det bara peka webbläsaren på enheten till datorn som kör mediaserver och du kommer att kunna bläddra i din boksamling. Till exempel, om den dator som kör servern har IP-adressen 63.45.128.5 i webbläsaren skriver du::

source: Some devices, like the Kindle (1/2/DX), do not allow you to access port 8080 (the default port on which the content server runs. In that case, change the port in the calibre Preferences to 80. (On some operating systems, you may not be able to run the server on a port number less than 1024 because of security settings. In this case the simplest solution is to adjust your router to forward requests on port 80 to port 8080).
fr: Certains périphériques, comme le Kindle (1/2/DX), ne permettent pas d'accéder au port 8080 (Le port par défaut sur lequel le serveur de contenu fonctionne). Dans ce cas, remplacer le port dans les Préférences de calibre par 80. (Sur certains systèmes d'exploitation, vous pouvez ne pas être en mesure de lancer le serveur sur un numéro de port inférieur à 1024 en raison des paramètres de sécurité. Dans ce cas, la solution la plus simple est de régler votre routeur pour rediriger les requêtes du port 80 vers le port 8080).
sv: Vissa enheter, t.ex. Kindle (1/2/DX), tillåter inte att du kan kommer åt port 8080 (standard port som mediaservern körs. I så fall ändra porten i calibre Inställningar till 80 (på vissa operativsystem, kan du inte att kunna köra servern på ett portnummer under 1024 på grund av säkerhetsinställningar. I detta fall den enklaste lösningen är att anpassa din router att vidarebefordra förfrågningar på port 80 till port 8080).

source: I get the error message "Failed to start content server: Port 8080 not free on '0.0.0.0'"?
fr: Je reçois le message d'erreur “Failed to start content server: Port 8080 not free on ‘0.0.0.0’” ?
sv: Jag får felmeddelandet "Det gick inte att starta mediaservern: Port 8080 inte ledig "0.0.0.0""?

source: The most likely cause of this is your antivirus program. Try temporarily disabling it and see if it does the trick.
fr: La cause la plus probable de cette erreur est votre programme antivirus. Essayez de le désactiver temporairement et de voir si ça fonctionne.
sv: Den troligaste orsaken till detta är antivirusprogrammet. Försök att tillfälligt inaktivera det och se om det gör susen.

source: I cannot send emails using calibre?
fr: Je ne peux pas envoyer des courriels en utilisant calibre ?
sv: Jag kan inte skicka e-post med hjälp av calibre?

source: Because of the large amount of spam in email, sending email can be tricky, as different mail servers use different strategies to block email. The most common problem is if you are sending email directly (without a mail relay) in calibre. Many servers (for example, Amazon) block email that does not come from a well known relay. The most robust way to setup email sending in calibre is to do the following:
fr: En raison de la grande quantité de spams dans les courriers électroniques, l’envoi de courriels peut être délicat, car les différents serveurs de messagerie utilisent différentes stratégies pour bloquer les courriels. Le problème est particulièrement courant si vous envoyez le courriel directement (sans relais de messagerie) par calibre. Beaucoup de serveurs (par exemple, Amazon) bloquent les courriels qui ne proviennent pas d'un relais connu. Pour configurer l'envoi de courrils dans calibre faites ce qui suit :
sv: På grund av den stora mängden av spam e-post, kan e-post sändning vara knepigt, eftersom olika e-postservrar använder olika strategier för att blockera e-post. Det vanligaste problemet är om du skickar e-post direkt (utan postvidarebefordran) i calibre. Många servrar (t.ex. Amazon) blockera e-post som inte kommer från en välkänd vidarebefordran. Det mest robusta sättet att installera e-sändning i calibre är att göra följande:

source: Create a free GMX account at `GMX <http://www.gmx.com>`_.
fr: Créer un compte GMX gratuit sur `GMX <http://www.gmx.com>`_.
sv: Skapa ett gratis GMX konto på `GMX <http://www.gmx.com>`_.

source: Goto :guilabel:`Preferences->Sharing by Email` in calibre and click the :guilabel:`Use GMX` button and fill in the information asked for.
fr: Aller dans :guilabel:`Préférences->Partager des livres par courriel`, cliquez sur le bouton :guilabel:`Utiliser GMX` et remplissez les informations demandées.
sv: Gå till :guilabel:`Inställningar->Dela med e-post` i calibre och klicka på :guilabel:`Använd GMX` knappen och fyll i den information som efterfrågas.

source: calibre will then use GMX to send the mail.
fr: calibre utilisera alors GMX pour envoyer le courriel.
sv: calibre kommer sedan att använda GMX att skicka e-post.

source: If you are sending to your Kindle, remember to update the email preferences on your Amazon Kindle page to allow email sent from your GMX email address. Also note that Amazon does not allow email delivery of AZW3 and new style (KF8) MOBI files.
fr: Si vous envoyez du courrier vers votre Kindle, n'oubliez pas de mettre à jour les préférences e-mail sur votre page d'Amazon Kindle pour permettre l’envoi de l’email à partir de votre adresse GMX. Notez aussi que Amazon ne permet pas la délivrance par courriel des fichiers AZW3 et du nouveau style (KF8) MOBI.
sv: Om du skickar till din Kindle, kom ihåg att uppdatera e-postinställningar på Amazon Kindle-sidan för att möjliggöra att e-post skickas från GMX e-postadress. Observera också att Amazon inte tillåter e-postleverans av AZW3 och ny stil (KF8) MOBI-filer.

source: Even after doing this, you may have problems. One common source of problems is that some poorly designed antivirus programs block calibre from opening a connection to send email. Try adding an exclusion for calibre in your antivirus program.
fr: Même après avoir fait cela, vous pouvez avoir des problèmes. Une source fréquente de problèmes est que certains programmes antivirus, mal conçus, bloquent calibre à l’ouverture de la connexion pour envoyer les courriels. Essayez d'ajouter une exclusion pour calibre dans votre programme antivirus.
sv: Även efter att ha gjort detta, kan du få problem. En vanlig källa till problem är att vissa dåligt utformade antivirusprogram blockerar calibre från att öppna en anslutning för att skicka e-post. Prova att lägga ett undantag för calibre i antivirusprogrammet.

source: Microsoft/Google/Gmx can disable your account if you use it to send large amounts of email. So, when using Hotmail/Gmail to send mail calibre automatically restricts itself to sending one book every five minutes. If you don't mind risking your account being blocked you can reduce this wait interval by going to Preferences->Tweaks in calibre.
sv: Microsoft/Google/GMX kan inaktivera ditt konto om du använder den för att skicka stora mängder e-post. Så, när du använder Hotmail/Gmail att skicka e-post begränsar calibre sig automatiskt till att skicka en bok var femte minut. Om du inte har något emot att riskera ditt konto blockeras kan du minska detta väntintervall genom att gå till Inställningar->Justeringar i calibre.
