Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: Google recently deliberately broke their email sending protocol (SMTP) support in an attempt to force everyone to use their web interface so they can show you more ads. They are trying to claim that SMTP is insecure, that is incorrect and simply an excuse. If you have trouble with gmail you will need to `allow less secure apps as descibed here <https://support.google.com/accounts/answer/6010255>`_.
fr: Google a récemment cassé délibérément son protocole d'envoi de courriel (smtp) afin d'essayer de forcer tout le monde à employer leur interface Web ainsi ils peuvent vous montrer plus d'annonces. Ils essayent de réclamer que le smtp est peu sûr, cela est incorrect et simplement une excuse. Pour employer un compte gmail vous aurez besoin de « permettre les apps moins sûres » comme décrit <a href="https://support.google.com/accounts/answer/6010255">ici</a>.
sv: Google nyligen medvetet bröt sitt protokoll (SMTP) stöd e-post att skicka i ett försök att tvinga alla att använda deras webbgränssnitt så att de kan visa dig flera annonser. De försöker hävda att SMTP är osäkert, det är fel och helt enkelt en ursäkt. Om du har problem med gmail måste du tillåta `allow less secure apps as descibed here <https://support.google.com/accounts/answer/6010255>`_.

source: If you are concerned about giving calibre access to your email account, simply create a new free email account with GMX or Hotmail and use it only for calibre.
fr: Si vous êtes inquiet de donner à calibre accès à votre compte courriel, créez simplement un nouveau compte courriel gratuit avec GMX ou Hotmail et employez-le seulement pour calibre.
sv: Om du är orolig för att ge calibre åtkomst till ditt e-postkonto, helt enkelt skapa en ny gratis e-postkonto med GMX eller Hotmail och använder den endast för calibre.

source: Why is my device not detected in linux?
fr: Pourquoi mon périphérique n’est pas détecté sous Linux ?
sv: Varför är min enhet inte registrerad i linux?

source: calibre needs your linux kernel to have been setup correctly to detect devices. If your devices are not detected, perform the following tests::
fr: calibre a besoin que le noyau linux soit correctement configuré pour détecter les périphériques. Si vos périphériques ne sont pas détectés, effectuer les tests suivants :
sv: calibre behöver att din Linux-kärnan har ställts in på rätt sätt för att upptäcka enheter. Om dina enheter inte upptäcks, utför följande tester::

source: You should see something like ``CONFIG_SYSFS_DEPRECATED_V2 is not set``. Also, ::
fr: Vous devriez voir quelque chose comme ``CONFIG_SYSFS_DEPRECATED_V2 is not set``. Aussi, ::
sv: Du bör se någonting som liknar ``CONFIG_SYSFS_DEPRECATED_V2 är inte inställd``. Också, ::

source: must return ``CONFIG_SCSI_MULTI_LUN=y``. If you don't see either, you have to recompile your kernel with the correct settings.
fr: doit renvoyer ``CONFIG_SCSI_MULTI_LUN=y``. Si vous ne voyez pas non plus, vous devez recompiler votre noyau avec les paramètres corrects.
sv: måste återvända ``CONFIG_SCSI_MULTI_LUN = y``. Om du inte ser någon, måste du kompilera din kärna med rätt inställningar.

source: My device is getting mounted read-only in linux, so calibre cannot connect to it?
fr: Mon périphérique est monté en lecture seule sous Linux et calibre ne peut pas s'y connecter ?
sv: Min enhet är monterat skrivskyddad i linux, så calibre kan inte ansluta till det?

source: Linux kernels mount devices read-only when their filesystems have errors. You can repair the filesystem with::
fr: Les noyaux Linux montent les périphériques en lecture seule lorsque qu’il y a des erreurs dans leur système de fichiers. Vous pouvez les réparer en faisant :
sv: Linuxkärnor montera enheter skrivskyddad när deras filsystem har fel. Du kan reparera filsystemet med::

source: Replace /dev/sdc with the path to the device node of your device. You can find the device node of your device, which will always be under /dev by examining the output of::
fr: Remplacez /dev/sdc avec le chemin pointant vers le fichier représentant votre périphérique. Vous pouvez trouver quel est le nom de fichier représentant votre périphérique, qui sera toujours dans /dev en examinant le résultat de la commande :
sv: Ersätt /dev/sdc med sökvägen till enhetsnoden på din enhet. Du hittar enhetsnoden av enheten, som alltid kommer att vara under /dev genom att undersöka utdata av::

source: Why does calibre not support collections on the Kindle or shelves on the Nook?
fr: Pourquoi calibre ne prend pas en charge les collections sur Kindle ou les étagères sur Nook ?
sv: Varför stöder calibre inte samlingar på Kindle eller hyllor på Nook?

source: Neither the Kindle nor the Nook provide any way to manipulate collections over a USB connection. If you really care about using collections, I would urge you to sell your Kindle/Nook and get a Kobo. Only Kobo seems to understand that life is too short to be entering collections one by one on an e-ink screen :)
fr: Ni Kindle ni le Nook ne fournissent de manière de manipuler des collections sur une connexion USB. Si vous vous inquiétez vraiment d'employer des collections, je vous inviterais à vendre votre Kindle/Nook et à obtenir une Kobo. Seulement Kobo semble comprendre que la vie est trop courte pour écrire des collections une par une sur un écran e-ink :)
sv: Varken Kindle eller Nook ger något sätt att manipulera samlingar över en USB-anslutning. Om du verkligen bryr dig om hur du använder samlingar, vill jag uppmana dig att sälja din Kindle / Nook och få en Kobo. Endast Kobo verkar förstå att livet är för kort för att mata in samlingarna en efter en på en e-ink skärm :)

source: Note that in the case of the Kindle, there is a way to manipulate collections via USB, but it requires that the Kindle be rebooted *every time* it is disconnected from the computer, for the changes to the collections to be recognized. As such, it is unlikely that any calibre developers will ever feel motivated enough to support it. There is however, a calibre plugin that allows you to create collections on your Kindle from the calibre metadata. It is available `from here <http://www.mobileread.com/forums/showthread.php?t=244202>`_.
fr: Notez que, dans le cas du Kindle, il existe un moyen pour manipuler les collections via USB, mais il faut que le Kindle soit réinitialisé à *chaque fois* qu'il est déconnecté de l'ordinateur, pour que les changements apportés aux collections soient reconnus. En tant que tel, il est peu probable que les développeurs de calibre soient assez motivés pour faire les développements nécessaires. Il y a cependant une extension calibre qui vous permet de créer des collections sur votre Kindle à partir des métadonnées calibre. Elle est disponible `ici <http://www.mobileread.com/forums/showthread.php?t=244202>`_.
sv: Observera att i fallet med Kindle, finns det ett sätt att manipulera samlingar via USB, men det kräver att Kindle startas om varje gång den kopplas bort från datorn, för ändringar i samlingarna ska erkännas. Som sådan, är det osannolikt att någon calibre utvecklare någonsin kommer att känna sig motiverade nog att stödja det. Det finns dock en calibre-tillägg som låter dig skapa samlingar på din Kindle från calibre-metadata. Det finns `från här <http://www.mobileread.com/forums/showthread.php?t=244202>`_.

source: Amazon have removed the ability to manipulate collections completely in their newer models, like the Kindle Touch and Kindle Fire, making even the above plugin useless, unless you root your Kindle and install custom firmware.
fr: Amazon a complètement supprimé la possibilité de manipuler les collections sur leurs modèles plus récents, comme le Kindle Touch et Kindle Fire, si bien que même l’extension ci-dessus serait inutile, à moins que vous rootez votre Kindle et installez un micrologiciel personnalisé.
sv: Amazon har tagit bort möjligheten att manipulera samlingar fullständigt i sina nyare modeller, som Kindle Touch och Kindle Fire, vilket även gör ovanstående tillägg värdelöst, om du inte "rootar" din Kindle och installerar anpassad firmware.

source: I am getting an error when I try to use calibre with my Kobo Touch/Glo/etc.?
fr: J'obtiens un message d’erreur lorsque j'essaie d'utiliser calibre avec mon Kobo Touch/Glo/etc.?
sv: Jag får ett felmeddelande när jag försöker använda calibre med min Kobo Touch/Glo/etc.?

source: The Kobo has very buggy firmware. Connecting to it has been known to fail at random. Certain combinations of motherboard, USB ports/cables/hubs can exacerbate this tendency to fail. If you are getting an error when connecting to your touch with calibre try the following, each of which has solved the problem for *some* calibre users.
fr: La Kobo a un firmware très bugué. S'y connecter est connu pour échouer aléatoirement. Certaines combinaisons de carte mère, ports USB/câbles/hubs peuvent exacerber cette tendance. Si vous obtenez une erreur lors de la connexion de votre Touch à votre bibliothèque calibre essayez ce qui suit, chacune a résolu le problème pour *certains* utilisateurs de calibre.
sv: Den Kobo har firmware med mycket fel. Anslutning till den har varit känt att slumpmässigt misslyckas. Vissa kombinationer av moderkort, USB-portar/kablar/hubbar kan förvärra denna tendens att misslyckas. Om du får ett felmeddelande när du ansluter till din beröring med calibre prova följande, som var och en har löst problemet för vissa calibre-användare.

source: Connect the Kobo directly to your computer, not via USB Hub
fr: Connectez la Kobo directement à votre ordinateur, et non via une Hub USB
sv: Anslut Kobo direkt till datorn, inte via USB-hubb

source: Try a different USB cable and a different USB port on your computer
fr: Essayez avec un câble USB et un port USB différents sur votre ordinateur
sv: Försök med en annan USB-kabel och en annan USB-port på datorn

source: Try a different computer, in particular the Kobo does not work well with some Windows XP machines. If you are on Windows XP, try a computer with a newer version of windows.
fr: Essayez un autre ordinateur, en particulier la Kobo ne fonctionne pas bien avec certaines machines sous Windows XP. Si vous êtes sous Windows XP, essayer un ordinateur avec une version ultérieure de Windows.
sv: Försök med en annan dator, i synnerhet Kobo inte fungerar bra med vissa Windows XP-maskiner. Om du är på Windows XP, prova en dator med en nyare version av Windows.

source: Try upgrading the firmware on your Kobo Touch to the latest
fr: Essayez de mettre à jour le firmware de votre Kobo Touch avec la dernière version
sv: Försök uppgradera firmware på Kobo Touch till den senaste

source: Try resetting the Kobo (sometimes this cures the problem for a little while, but then it re-appears, in which case you have to reset again and again)
fr: Essayez de réinitialiser la Kobo (parfois cela résout le problème pendant un petit moment, mais il réapparaît. Dans ce cas, vous devez réinitialiser à plusieurs reprises)
sv: Prova att återställa Kobo (ibland botar problemet för ett tag, men sedan visas på nytt, i vilket fall du måste återställa igen och igen)

source: Try only putting one or two books onto the Kobo at a time and do not keep large collections on the Kobo
fr: Essayez seulement de mettre un ou deux livres à la fois sur la Kobo et de ne pas garder de grandes quantités de livres sur la Kobo
sv: Försök bara att sätta en eller två böcker på Kobo i taget och ha inte stora samlingar på Kobo

source: I transferred some books to my Kindle using calibre and they did not show up?
sv: Jag överförde några böcker till min Kindle använder calibre och de inte dyker upp?

source: Books sent to the Kindle only show up on the Kindle after they have been *indexed* by the Kindle. This can take some time. If the book still does not show up after some time, then it is likely that the Kindle indexer crashed. Sometimes a particular book can cause the indexer to crash. Unfortunately, Amazon has not provided any way to deduce which book is causing a crash on the Kindle. Your only recourse is to either reset the Kindle, or delete all files from its memory using Windows Explorer (or whatever file manager you use) and then send the books to it again, one by one, until you discover the problem book. Once you have found the problem book, delete it off the Kindle and do a MOBI to MOBI or MOBI to AZW3 conversion in calibre and then send it back. This will most likely take care of the problem.
sv: Böcker som skickas till Kindle visas bara upp på Kindle efter att de har blivit *indexerade* av Kindle. Detta kan ta lite tid. Om boken ännu inte dyker upp efter en viss tid, så är det troligt att Kindle indexering misslyckades. Ibland kan en viss bok kan orsaka indexeraren att kraschar. Tyvärr har Amazon inte lämnat något sätt att härleda vilken bok som orsakar en krasch på Kindle. Din enda utväg är att antingen återställa Kindle, eller ta bort alla filer från sitt minne med Windows Explorer (eller vad filhanteraren du använder) och sedan skicka böckerna till det igen, en efter en, tills du upptäcker problemboken. När du har hittat problemboken, ta bort den från Kindle och gör en MOBI till MOBI eller MOBI till AZW3 omvandling i calibre och sedan skicka tillbaka den. Detta kommer med största sannolikhet att ta hand om problemet.

source: Library Management
fr: Gestion de la bibliothèque
sv: Bibliotekshantering

source: What formats does calibre read metadata from?
fr: De quels formats calibre peut-il lire les métadonnées ?
sv: Vilka format läser calibre metadata från?

source: calibre reads metadata from the following formats: CHM, LRF, PDF, LIT, RTF, OPF, MOBI, PRC, EPUB, FB2, IMP, RB, HTML. In addition it can write metadata to: LRF, RTF, OPF, EPUB, PDF, MOBI
fr: calibre lit les métadonnées des formats suivants : CHM, LRF, PDF, LIT, RTF, OPF, MOBI, PRC, EPUB, FB2, IMP, RB, HTML. En outre, il peut écrire des métadonnées sur : LRF, RTF, OPF, EPUB, PDF, MOBI
sv: calibre läser metadata från följande format: CHM, LRF, PDF, LIT, RTF, OPF, MOBI, PRC, EPUB, FB2, IMP, RB, HTML. Dessutom kan skriva metadata till: LRF, RTF, OPF, EPUB, PDF, MOBI

source: Where are the book files stored?
fr: Où sont stockés les fichiers des livres ?
sv: Var finns boken filer som lagras?

source: When you first run calibre, it will ask you for a folder in which to store your books. Whenever you add a book to calibre, it will copy the book into that folder. Books in the folder are nicely arranged into sub-folders by Author and Title. Note that the contents of this folder are automatically managed by calibre, **do not** add any files/folders manually to this folder, as they may be automatically deleted. If you want to add a file associated to a particular book, use the top right area of :guilabel:`Edit metadata` dialog to do so. Then, calibre will automatically put that file into the correct folder and move it around when the title/author changes.
fr: Lorsque vous lancez calibre pour la première fois, il va vous être demandé de préciser un dossier dans lequel stocker vos livres. Chaque fois que vous ajouterez un livre à calibre, il va copier le livre dans ce répertoire. Les livres seront disposés dans des sous-répertories par auteur et titre dans ce répertoire général. Notez que le contenu de ce dossier est automatiquement géré par calibre. **Ne pas** ajouter de fichiers/répertoires manuellement dans ce répertoire, car ils pourraient être supprimés automatiquement. Si vous souhaitez ajouter un fichier associé à un livre précis, utilisez la flèche en haut à droite de la boîte de dialogue :guilabel:`Modifier les métadonnées`. calibre mettra automatiquement ce fichier dans le dossier et le déplacera lorsqu’il y aura des changements sur le titre ou l’auteur.
sv: När du först kör calibre, kommer det att be dig om en mapp där du vill spara dina böcker. När du lägger till en bok till calibre, kommer det att kopiera boken i den mappen. Böcker i mappen snyggt ordnade i undermappar efter författare och titel. Observera att innehållet i den här mappen automatiskt hanteras av calibre, **lägg inte** till några filer / mappar manuellt till den här mappen, eftersom de kan tas bort automatiskt. Om du vill lägga till en fil associerad till en viss bok, använd det övre högra området av dialogrutan :guilabel:`Redigera metadata` för att göra det. Då kommer calibre automatiskt sätta filen i rätt mapp och flytta runt när titeln / författare förändras.

source: Metadata about the books is stored in the file ``metadata.db`` at the top level of the library folder This file is is a sqlite database. When backing up your library make sure you copy the entire folder and all its sub-folders.
fr: Les métadonnées des livres sont stockées dans le fichier ``metadata.db`` au plus haut niveau du répertoire de la bibliothèque. Ce fichier est une base de données SQLite. Lorsque vous sauvegardez votre bibliothèque assurez-vous de copier l'intégralité du répertoire et tous ses sous-répertoires.
sv: Metadata om böckerna lagras i filen ``metadata.db`` på den översta nivån i biblioteksmappen här filen finns en SQLite databas. När du säkerhetskopierar ditt bibliotek att du kopierar hela mappen och alla dess undermappar.

source: The library folder and all it's contents make up what is called a calibre library. You can have multiple such libraries. To manage the libraries, click the calibre icon on the toolbar. You can create new libraries, remove/rename existing ones and switch between libraries easily.
fr: Le dossier de la bibliothèque et tout son contenu constituent ce qu'on appelle une bibliothèque calibre. Vous pouvez avoir plusieurs de ces bibliothèques. Pour gérer les bibliothèques, cliquez sur l'icône calibre sur la barre d'outils. Vous pouvez créer de nouvelles bibliothèques, supprimer/renommer les bibliothèques et basculer facilement entre les bibliothèques existantes.
sv: Mappen biblioteket och alla dess innehåll utgör vad som kallas en calibre bibliotek. Du kan ha flera sådana bibliotek. För att hantera biblioteken, klickar du på ikonen calibre i verktygsfältet. Du kan skapa nya bibliotek, ta bort / byta namn på befintliga och växla mellan biblioteken lätt.

source: You can copy or move books between different libraries (once you have more than one library setup) by right clicking on a book and selecting the :guilabel:`Copy to library` action.
fr: Vous pouvez copier ou déplacer des livres entre les différentes bibliothèques (une fois que vous avez installé plus d'une bibliothèque) en faisant un clic-droit sur le livre et en sélectionnant l'action :guilabel:`Copier dans la bibliothèque`.
sv: Du kan kopiera eller flytta böcker mellan olika bibliotek (när du har mer än ett bibliotek inställning) genom att högerklicka på en bok och välj :guilabel:`Kopiera till bibliotek` åtgärd.

source: How does calibre manage author names and sorting?
fr: Comment calibre gère-t-il le nom des auteurs et les tris ?
sv: Hur hanterar calibre författarnamn och sortering?

source: Author names are complex, especially across cultures, see `this note <http://www.w3.org/International/questions/qa-personal-names.en.php?changelang=en>`_ for some of complexities. calibre has a very flexible strategy for managing author names. The first thing to understand is that books and authors are separate entities in calibre. A book can have more than one author, and an author can have more than one book. You can manage the authors of a book by the edit metadata dialog. You can manage individual authors by right clicking on the author in the Tag Browser on the left of the main calibre screen and selecting :guilabel:`Manage authors`. Using this dialog you can change the name of an author and also how that name is sorted. This will automatically change the name of the author in all the books of that author. When a book has multiple authors, separate their names using the & character.
fr: Les noms d'auteurs sont complexes, spécialement d’une culture à l’autre, voir `cette note <http://www.w3.org/International/questions/qa-personal-names.en.php?changelang=en>`_ pour certaines des complexités. calibre a une stratégie très souple pour la gestion des noms d'auteurs. La première chose à comprendre est que les livres et les auteurs sont des entités distinctes dans calibre. Un livre peut avoir plus d'un auteur, et un auteur peut avoir plus d'un livre. Vous pouvez gérer les auteurs d'un livre à partir de la boite de dialogue Modifier les métadonnées. Vous pouvez gérer les différents auteurs en faisant un clic droit sur l'auteur dans le Navigateur d'étiquettes dans le volet latéral à gauche de l'écran principal de calibre et en sélectionnant :guilabel:`Gérer Auteurs`. En utilisant cette boite de dialogue vous pouvez modifier le nom d'un auteur et la manière dont ce nom est trié. Cela va changer automatiquement le nom de l'auteur pour tous les livres de cet auteur. Quand un livre a plusieurs auteurs, séparez leurs noms en utilisant le caractère &.
sv: Författarnamn är komplexa och i synnerhet de kulturer, se `denna anmärkning <http://www.w3.org/International/questions/qa-personal-names.en.php?changelang=en>`_ för vissa av komplexiteter. calibre har en mycket flexibel strategi för att hantera författarnamn. Det första man måste förstå är att böcker och författare är separata enheter i calibre. En bok kan ha mer än en författare, och en författare kan ha mer än en bok. Du kan hantera författarna till en bok av dialogrutan redigera metadata. Du kan hantera enskilda författare genom att högerklicka på författaren i etikettbläddraren till vänster om calibre-huvudskärmen och välja :guilabel:`Hantera Författare`. Genom att använda den här dialogrutan kan du ändra namnet på en författare och även hur det namnet sorteras. Detta kommer automatiskt att ändra namnet på författaren i alla böcker i denna författare. När en bok har flera författare, separera deras namn med hjälp av och karaktär.

source: Now coming to author name sorting:
fr: Maintenant passons au tri par nom d’auteur :
sv: Nu kommer vi till författarnamnssortering:

source: When a new author is added to calibre (this happens whenever a book by a new author is added), calibre automatically computes a sort string for both the book and the author.
fr: Quand un nouvel auteur est ajouté à calibre (ce qui arrive quand un livre écrit par un nouvel auteur est ajouté), calibre calcule automatiquement une chaîne de tri pour le livre et pour l'auteur.
sv: När en ny författare läggs till calibre (det händer varje gång en bok av en ny författare läggs till), beräknar calibre automatiskt en sorts sträng för både boken och författaren.

source: Authors in the Tag Browser are sorted by the sort value for the **authors**. Remember that this is different from the Author sort field for a book.
fr: Les auteurs dans le Navigateur d’Étiquettes sont triés selon la valeur de tri pour les **auteurs**. Rappelez-vous que ceci est différent du champ Tri par Auteur d'un livre.
sv: Författare i etikettbläddraren sorteras efter sorteringsvärde för författarna. Kom ihåg att detta skiljer sig från den Författaresorteringsfältet för en bok.

source: By default, this sort algorithm assumes that the author name is in ``First name Last name`` format and generates a ``Last name, First name`` sort value.
fr: Par défaut, cet algorithme de tri suppose que le nom de l'auteur est au format ``Prénom Nom`` et génère un valeur de tri ``Nom, Prénom``.
sv: Som standard antar denna sortingsalgoritm att författaren heter i Förnamn Efternamn format och genererar ett Efternamn, Förnamn-sorteringsvärdet.
