Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: When you send a book to the reader, calibre will add the book to collections based on the metadata for that book. By default, collections are created from tags and series. You can control what metadata is used by going to :guilabel:`Preferences->Plugins->Device Interface plugins` and customizing the SONY device interface plugin. If you remove all values, calibre will not add the book to any collection.
fr: Lorsque vous envoyez un livre sur la liseuse, calibre ajoutera le livre aux collections selon les métadonnées du livre. Par défaut, les collections sont créées à partir des étiquettes et des séries. Vous pouvez contrôler les métadonnées utilisées en allant dans :guilabel:`Préférences->Avancé->Extensions->extension Interface du dispositif` et en personnalisant l'extension Interface du dispositif SONY. Si vous supprimez toutes les valeurs, calibre n'ajoutera le livre à aucune collection.
sv: När du skickar en bok till läsaren, kommer calibre lägga boken till samlingar som baseras på metadata för den boken. Som standard kollektioner skapas från etiketter och serier. Du kan styra vilka metadata används genom att gå till :guilabel:`Inställningar->Tillägg->Enhetsgränssnitt tillägg` och anpassa SONY tillägget för enhetsgränssnitt. Om du tar bort alla värden, kommer calibre inte lägga boken till någon samling.

source: Collection management is largely controlled by the 'Metadata management' option found at :guilabel:`Preferences->Import/Export->Sending books to devices`. If set to 'Manual' (the default), managing collections is left to the user; calibre will not delete already existing collections for a book on your reader when you resend the book to the reader, but calibre will add the book to collections if necessary. To ensure that the collections for a book are based only on current calibre metadata, first delete the books from the reader, then resend the books. You can edit collections directly on the device view by double-clicking or right-clicking in the collections column.
fr: La gestion des collections est largement contrôlée par l'option `Gestion des métadonnées` qui se trouve dans :guilabel:`Préférences->Importer/Exporter->Envoi vers un appareil connecté`. Si réglé sur 'Gestion manuelle' (par défaut), la gestion des collections est laissée à l'utilisateur ; calibre ne pourra pas supprimer les collections déjà existantes pour un livre lorsque vous renvoyez le livre sur la liseuse, mais calibre va ajouter le livre aux collections si nécessaire. Pour s'assurer que les collections d'un livre sont basées uniquement sur les métadonnées actuelles de calibre, il faut d'abord supprimer les livres de la liseuse, puis renvoyer les livres. Vous pouvez modifier les collections directement à partir de la vue Appareil par double-clic ou un clic droit dans la colonne des collections.
sv: Samlingshantering styrs till stor del av "Metadatas hantering" alternativet finns på :guilabel:`Inställningar->Import/Export->Skickar böcker till enheter`. Om satt till "Manual" (standard), lämnas hantering av samlingar till användaren; calibre kommer inte att ta bort redan befintliga samlingar för en bok på läsaren när du skicka boken till läsaren, men calibre kommer att lägga boken till samlingar vid behov. För att säkerställa att samlingarna för en bok bygger enbart på aktuell calibre metadata, först ta bort böckerna från läsaren, sedan skicka om böckerna. Du kan redigera samlingar direkt på enhets genom att dubbelklicka eller högerklicka i samlingarna kolumnen.

source: If 'Metadata management' is set to 'Only on send', then calibre will manage collections more aggressively. Collections will be built using calibre metadata exclusively. Sending a book to the reader will correct the collections for that book so its collections exactly match the book's metadata, adding and deleting collections as necessary. Editing collections on the device view is not permitted, because collections not in the metadata will be removed automatically.
fr: Si la `Gestion des métadonnées` est réglée sur `Seulement à l’envoi`, calibre va gérer les collections de manière plus agressive. Les collections seront constituées en utilisant les métadonnées de calibre exclusivement. Envoyer un livre sur la liseuse corrigera les collections pour ce livre si les collections correspondent exactement aux métadonnées du livre, ajoutera et supprimera des collections si nécessaire. Editer des collections à partir de la vue Appareil n'est pas autorisé, puisque les collections qui ne sont pas dans les métadonnées seront automatiquement supprimées.
sv: Om "Metadata hantering" är satt till "Endast vid sändning", så kommer calibre att hantera samlingar mer aggressivt. Samlingar byggs exklusivt med calibre-metadata. Skicka en bok till läsaren kommer att korrigera samlingarna för boken så samlingarna exakt passar bokens metadata, vid behov lägga till och ta bort samlingarna. Redigera samlingar på enhetsvisningen är inte tillåtet, eftersom samlingarna som inte finns i metadata kommer att tas bort automatiskt.

source: If 'Metadata management' is set to 'Automatic management', then calibre will update metadata and collections both when the reader is connected and when books are sent. When calibre detects the reader and generates the list of books on the reader, it will send metadata from the library to the reader for all books on the reader that are in the library (On device is True), adding and removing books from collections as indicated by the metadata and device customization. When a book is sent, calibre corrects the metadata for that book, adding and deleting collections. Manual editing of metadata on the device view is not allowed. Note that this option specifies sending metadata, not books. The book files on the reader are not changed.
fr: Si la `Gestion des métadonnées` est réglée sur `Gestion automatique`, alors calibre mettra à jour les métadonnées et les collections sur la liseuse dès qu’elle sera connectée et au moment où les livres seront envoyés. Quand calibre détecte la liseuse et génère la liste des livres de la liseuse, il enverra les métadonnées à partir de la bibliothèque vers la liseuse pour tous les livres se trouvant sur la liseuse qui sont dans la bibliothèque (On device is True) , ajoutant et supprimant des livres des collections comme indiqué par les métadonnées et la personnalisation du périphérique. Quand un livre est envoyé, calibre corrige les métadonnées pour ce livre, ajoutant et supprimant des collections. L'édition manuelle des métadonnées à partir de la vue Appareil n'est pas autorisée. Notez que cette option spécifie l’envoi des métadonnées, pas des livres. Les fichiers de livres sur la liseuse ne sont pas modifiés.
sv: Om "Metadata management" är inställd på "Automatisk hantering", då kommer calibre att uppdatera metadata och samlingar både när läsaren är ansluten och när böcker skickas. När calibre upptäcker läsaren och genereras en lista över böcker på läsaren kommer den att sända metadata från biblioteket till läsaren för alla böcker på läsaren som finns i biblioteket (På enheten är Sann), lägga till och ta bort böcker från samlingarna som indikeras av metadata och enhetsanpassning. När en bok skickas, korrigerar calibre metadata för den boken, samlingar läggs till och tas bort. Manuell redigering av metadata på enheten är inte tillåtet. Observera att det här alternativet anger att skicka metadata, inte böcker. Bokens filer på läsaren ändras inte.

source: In summary, choose 'manual management' if you want to manage collections yourself. Collections for a book will never be removed by calibre, but can be removed by you by editing on the device view. Choose 'Only on send' if you want calibre to manage collections when you send a book, adding books to and removing books from collections as needed. Choose 'Automatic management' if you want calibre to keep collections up to date whenever the reader is connected.
fr: En résumé, choisir 'gestion manuelle' si vous souhaitez gérer vous-même les collections. Les collections pour un livre ne seront jamais supprimées par calibre, mais vous pouvez les supprimer vous-même en les éditant dans la vue appareil. Choisissez l'option 'Seulement à l’envoi' si vous voulez que Calibre gère les collections lorsque vous envoyez un livre, en ajoutant et en supprimant des livres des collections en fonction des besoins. Choisissez l'option 'Gestion automatique' si vous voulez que calibre mette les collections à jour chaque fois que la liseuse est connectée.
sv: Sammanfattningsvis välj "manuell hantering" om du vill hantera samlingar själv. Samlingar för en bok kommer aldrig att tas bort av calibre, men kan tas bort av dig genom att redigera på enheten. Välj "Endast vid sändning" om du vill att calibre ska hantera samlingar när du skickar en bok, lägga böcker till och ta bort böcker från samlingarna som behövs. Välj "Automatisk hantering" om du vill att calibre ska hålla samlingarna uppdaterade när läsaren är ansluten.

source: If you use multiple installations of calibre to manage your reader, then option 'Automatic management' may not be what you want. Connecting the reader to one library will reset the metadata to what is in that library. Connecting to the other library will reset the metadata to what is in that other library. Metadata in books found in both libraries will be flopped back and forth.
fr: Si vous utilisez plusieurs installations de calibre pour gérer votre liseuse, alors l'option 'Gestion automatique' ne peut pas être ce que vous voulez. La connexion de la liseuse à une bibliothèque réinitialisera les métadonnées pour tout le contenu de cette bibliothèque. La connexion à l’autre bibliothèque réinitialisera les métadonnées dans l'autre bibliothèque. Les métadonnées dans les livres trouvés dans les deux bibliothèques seront remplacées dans les deux sens.
sv: Om du använder flera installationer av calibre för att hantera din läsare, då alternativet "Automatisk hantering" kanske inte är vad du vill. Anslutning av läsaren till ett bibliotek återställer metadata till vad som finns i det biblioteket. Anslutning till andra bibliotek återställer metadata till vad som är i den andra bibliotek. Metadata i böcker som finns i båda biblioteken kommer att hoppa fram och tillbaka.

source: Can I use both calibre and the SONY software to manage my reader?
fr: Puis-je utiliser à la fois calibre et le logiciel SONY pour gérer ma liseuse ?
sv: Kan jag använda både calibre och SONY programvara för att hantera min läsare?

source: Yes, you can use both, provided you do not run them at the same time. That is, you should use the following sequence: Connect reader->Use one of the programs->Disconnect reader. Reconnect reader->Use the other program->disconnect reader.
fr: Oui, vous pouvez utiliser les deux, mais ne pas les utiliser en même temps. Cela signifie que vous devez utiliser la séquence suivante : Connecter la liseuse->Utiliser l'un des programmes->Déconnecter la liseuse. Rebranchez la liseuse->Utiliser l'autre programme->Déconnecter la liseuse.
sv: Ja, du kan använda båda, förutsatt att du inte kör dem samtidigt. Det vill säga, du bör använda följande sekvens: Anslut läsare-> Använd någon av program-> Koppla läsare. Anslut läsare-> Använd den andra program> Koppla läsare.

source: The underlying reason is that the Reader uses a single file to keep track of 'meta' information, such as collections, and this is written to by both calibre and the Sony software when either updates something on the Reader. The file will be saved when the Reader is (safely) disconnected, so using one or the other is safe if there's a disconnection between them, but if you're not the type to remember this, then the simple answer is to stick to one or the other for the transfer and just export/import from/to the other via the computers hard disk.
fr: La raison sous-jacente est que la liseuse utilise un seul fichier pour les informations 'méta' comme les collections, et que ce fichier est mis à jour à la fois par calibre et par le logiciel Sony lorsque vous effectuez des mises à jour sur la liseuse. Le fichier sera enregistré lorsque la liseuse est (en toute sécurité) déconnectée, donc il faut s’assurer qu’il y a bien une déconnexion entre les deux usages. Si vous êtes du genre à oublier, alors la réponse est simple : vous devez vous en tenir à l’un ou l’autre pour le transfert et seulement exporter/importer de l’un à l’autre via le disque dur de l'ordinateur.
sv: Den bakomliggande orsaken är att läsaren använder en enda fil för att hålla reda på "meta" information, såsom samlingar, och det skrivs till av både calibre och Sonys programvara när något uppdateras på läsaren. Filen kommer att sparas när läsaren är (säkert) bortkopplad, så att använda det ena eller det andra är säkert om det finns en frånkoppling mellan dem, men om du inte är den typen att komma ihåg detta, så det enkla svaret är att hålla sig till en eller det andra för överföring och bara export / import från / till den andra via datorns hårddisk.

source: If you do need to reset your metadata due to problems caused by using both at the same time, then just delete the media.xml file on the Reader using your PC's file explorer and it will be recreated after disconnection.
fr: Si vous avez besoin de réinitialiser vos métadonnées en raison de problèmes causés par l'utilisation simultanée des deux programmes, il suffit de supprimer le fichier media.xml sur la liseuse à l'aide de l’explorateur de fichiers de votre PC et il sera recréé après sa déconnexion.
sv: Om du behöver återställa metadata på grund av problem som orsakas av att använda både på samma gång, i så fall bara radera media.xml filen på läsaren med hjälp av datorns filhanterare och det kommer att återskapas efter frånkoppling.

source: With recent reader iterations, SONY, in all its wisdom has decided to try to force you to use their software. If you install it, it auto-launches whenever you connect the reader. If you don't want to uninstall it altogether, there are a couple of tricks you can use. The simplest is to simply re-name the executable file that launches the library program. More detail `in the forums <http://www.mobileread.com/forums/showthread.php?t=65809>`_.
fr: Avec les récentes itérations de lecteurs, SONY, dans toute sa sagesse, a décidé d'essayer de vous forcer à utiliser son logiciel. Si vous l'installez, il se lancera automatiquement chaque fois que vous connecterez la liseuse. Si vous ne souhaitez pas le désinstaller complètement, il y a quelques astuces que vous pouvez utiliser. Le plus simple est de simplement renommer le fichier exécutable qui lance le programme de la bibliothèque. Plus de détails `dans les forums <http://www.mobileread.com/forums/showthread.php?t=65809>`_.
sv: Med de senaste läsariterationer, SONY, i all sin vishet beslutat att försöka tvinga dig att använda deras programvara. Om du installerar det, auto-startar det när du ansluter läsaren. Om du inte vill avinstallera det helt och hållet, det finns ett par knep du kan använda. Det enklaste är att helt enkelt byta namn på körbar fil som startar biblioteksprogrammet. Mer i detalj i forumen <http://www.mobileread.com/forums/showthread.php?t=65809>`_.

source: How do I use calibre with my iPad/iPhone/iPod touch?
fr: Comment utiliser calibre avec mon iPad/iPhone/iPod touch ?
sv: Hur använder jag calibre med min iPad / iPhone / iPod touch?

source: Over the air
fr: Sans fil
sv: Över luftsnitt

source: The easiest way to browse your calibre collection on your Apple device (iPad/iPhone/iPod) is by using the calibre content server, which makes your collection available over the net. First perform the following steps in calibre
fr: La meilleure façon de naviguer dans votre collection calibre sur votre appareil Apple (iPad/iPhone/iPod) est d'utiliser le le serveur de contenu calibre, ce qui rend votre collection disponible sur le net. D'abord effectuer les étapes suivantes dans calibre :
sv: Det enklaste sättet att bläddra i din calibre-samling på din Apple-enhet (iPad / iPhone / iPod) är att använda calibre innehållsservern, vilket gör din samling tillgänglig över nätet. Utför först följande steg i calibre

source: Set the Preferred Output Format in calibre to EPUB (The output format can be set under :guilabel:`Preferences->Interface->Behavior`)
fr: Définir le Format de Sortie Préféré de calibre à ePub (le format de sortie peut être paramétré dans :guilabel:`Préférences->Interface->Comportement`)
sv: Ställ önskat utdataformat i calibre till EPUB (Utdataformatet kan ställas in under :guilabel:`Inställningar->Gränssnitt->Beteende`)

source: Set the output profile to iPad (this will work for iPhone/iPods as well), under :guilabel:`Preferences->Conversion->Common Options->Page Setup`
fr: Définissez le profil de sortie pour iPad (cela fonctionnera pour iPhone/iPod aussi), sous :guilabel:`Préférences->Conversion->Options communes->Mise en page`
sv: Ställ in utdatasprofil till iPad (detta kommer att fungera för iPhone / iPod också), enligt :guilabel:`Inställnigar->Konvertera->Vanliga alternativ->Sidinställning`

source: Convert the books you want to read on your iDevice to EPUB format by selecting them and clicking the Convert button.
fr: Convertir les livres que vous voulez lire sur votre iDevice au format EPUB en les sélectionnant et en cliquant sur le bouton Convertir.
sv: Konvertera de böcker du vill läsa på din i-enhet till EPUB-format genom att markera dem och klicka på knappen Konvertera.

source: Turn on the Content Server by clicking the :guilabel:`Connect/Share` button and leave calibre running. You can also tell calibre to automatically start the content server via :guilabel:`Preferences->Sharing over the net`.
fr: Allumez le Serveur de Contenu en cliquant sur le bouton :guilabel:`Connecter/Partager` et laissez calibre ouvert. Vous pouvez aussi dire à calibre de démarrer automatiquement le serveur de contenu via :guilabel:`Préférences->Partage via Internet`.
sv: Slå på innehållsserver genom att klicka på :guilabel:`Anslut / Dela`-knappen och lämna calibre igång. Du kan även tala om för calibre att automatiskt starta innehållsservern via :guilabel:`Inställningar->Dela->Dela på nätet`.

source: There are many apps for your iDevice that can connect to calibre. Here we describe using two of them, iBooks and Stanza.
fr: Il existe de nombreuses applications pour votre iDevice pouvant se connecter à calibre. Nous les décrivons ici en utilisant deux d'entre elles, iBooks et Stanza.
sv: Det finns många appar till din i-enhet som kan ansluta till calibre. Här beskriver vi med hjälp av två av dem, iBooks och Stanza.

source: Using Stanza
fr: Utiliser Stanza
sv: Använda Stanza

source: You should be able to access your books on your iPhone by opening Stanza. Go to "Get Books" and then click the "Shared" tab. Under Shared you will see an entry "Books in calibre". If you don't, make sure your iPad/iPhone is connected using the WiFi network in your house, not 3G. If the calibre catalog is still not detected in Stanza, you can add it manually in Stanza. To do this, click the "Shared" tab, then click the "Edit" button and then click "Add book source" to add a new book source. In the Add Book Source screen enter whatever name you like and in the URL field, enter the following::
fr: Vous devriez être en mesure d'accéder à vos livres sur votre iPhone en ouvrant Stanza. Allez sur "Obtenir des livres", puis cliquez sur l'onglet "Partagé". Sous Partagé vous verrez une entrée "Livres Calibre". Si vous ne le voyez pas, assurez-vous que votre iPad / iPhone est connecté via le réseau WiFi dans votre maison, pas sur la 3G. Si la bibliothèque de Calibre n'est toujours pas détectée dans Stanza, vous pouvez l'ajouter manuellement sur Stanza. Pour ce faire, cliquez sur l'onglet "Partagé", puis cliquez sur le bouton "Modifier" puis cliquez sur "Ajouter source de livres" pour ajouter une nouvelle source de livre. Dans l'écran Ajouter une source du livre entrez le nom que vous voulez, et dans le champ URL, entrez ce qui suit :
sv: Du bör kunna komma åt dina böcker på din iPhone genom att öppna Stanza. Gå till "Get Books" och klicka sedan på "Shared" fliken. Under Shared du att se en post "Books i calibre". Om du inte, se till att din iPad / iPhone är ansluten med hjälp av WiFi-nätverk i ditt hus, inte 3G. Om calibre katalogen fortfarande inte upptäcks i Stanza, kan du lägga till den manuellt i Stanza. Det gör du genom att klicka på "Shared" fliken, klicka sedan på "Edit" och sedan på "Add book source" för att lägga till en ny bok källa. I Add book source bilden anger vilket namn du vill och i fältet URL anger du följande::

source: Replace ``192.168.1.2`` with the local IP address of the computer running calibre. If you have changed the port the calibre content server is running on, you will have to change ``8080`` as well to the new port. The local IP address is the IP address you computer is assigned on your home network. A quick Google search will tell you how to find out your local IP address. Now click "Save" and you are done.
fr: Remplacer ``192.168.1.2`` par l'adresse IP locale de l’ordinateur exécutant Calibre. Si vous avez changé le port du serveur où se trouve le serveur de contenu calibre, vous devrez remplacer ``8080`` par le nouveau port. L'adresse IP est l'adresse IP que vous a attribuée l’ordinateur sur votre réseau domestique. Une recherche rapide sur Google vous dira comment trouver votre adresse IP locale. Maintenant, cliquez sur "Enregistrer" et vous avez terminé.
sv: Ersätt 192.168.1.2 med den lokala IP-adressen till den dator som kör calibre. Om du har ändrat porten calibre innehållsservern körs på, måste du ändra 8080 samt till den nya porten. Den lokala IP-adress är IP-adressen som du dator tilldelas i ditt hemmanätverk. En snabb Google-sökning kommer att berätta hur du hittar din lokala IP-adress. Klicka nu på "Spara" och du är klar.

source: If you get timeout errors while browsing the calibre catalog in Stanza, try increasing the connection timeout value in the stanza settings. Go to Info->Settings and increase the value of Download Timeout.
fr: Si vous obtenez des erreurs de délai d'attente lors de la navigation dans la bibliothèque calibre dans Stanza, essayez d'augmenter la valeur du délai de connexion dans les paramètres stanza. Allez à Info->Paramètres et augmenter la valeur du Délai de Téléchargement.
sv: Om du får tidbegränsningsfel medan du surfar på calibre katalogen i Stanza, prova att öka anslutnings "timeout"-värdet i stanza inställningar. Gå till Info->Settings och öka värdet på Download Timeout.

source: Using iBooks
fr: Utiliser iBooks
sv: Använda iBooks

source: Start the Safari browser and type in the IP address and port of the computer running the calibre server, like this::
fr: Lancez le navigateur Safari et saisissez l'adresse IP et le port de l'ordinateur exécutant le serveur calibre, comme ceci :
sv: Starta webbläsaren Safari och skriv in IP-adressen och porten på den dator som kör calibre servern, så här:
