Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: The bug in Amazon's software is that when you put a MOBI file on a Kindle, unless the file is marked as a Personal document, Amazon assumes you bought the book from it and tries to download the cover thumbnail for it from its servers. When the download fails, it refuses to fallback to the cover defined in the MOBI file. This is likely deliberate on Amazon's part to try to force authors to sell only through them. In other words, Kindle's only display covers for books marked as Personal Documents or books bought directly from Amazon.
fr: Le bogue dans le logiciel d'Amazon consiste à supposer que lorsque vous mettez un fichier MOBI dans un Kindle, à moins que celui-ci ne soit marqué comme Document Personnel, vous avez acheté celui-ci chez Amazon et essaye de télécharger une imagette de la couverture à partir de ses serveurs. Quand le téléchargement échoue, il refuse d'utiliser la couverture définie dans le fichier MOBI comme solution de rechange. Ceci est probablement un comportement délibéré de la part d'Amazon afin d'essayer de forcer les auteurs à vendre par leur intermédiaire. En d'autres termes, le Kindle affiche seulement les couvertures pour les livres marqués comme Documents Personnels ou les livres achetés directement chez Amazon.
sv: Felet i Amazons mjukvara är att när du skriver en MOBI-fil på en Kindle, om inte filen är markerad som en personligt dokument, förutsätter Amazon att du köpte boken från dem och försöker hämta omslagsminiatyren för den från deras servrar. När hämtningen misslyckas, vägrar den att gå tillbaka till omslaget som definieras i MOBI-filen. Detta är sannolikt avsiktligt från Amazons sida att försöka tvinga författare att endast sälja genom dem. Med andra ord, Kindle visar endast omslag av böcker markerade som personliga dokument eller av böcker som köps direkt från Amazon.

source: If you send a MOBI file to a Kindle with calibre using a USB connection, calibre works around this Amazon bug by uploading a cover thumbnail itself. However, that workaround is only possible when using a USB connection and sending with calibre. Note that if you send using email, Amazon will automatically mark the MOBI file as a Personal Document and the cover will work, but the book will show up in Personal Documents.
fr: Si vous envoyez un fichier MOBI à un Kindle avec Calibre en utilisant une connexion USB, calibre pallie à ce bogue d'Amazon en téléchargeant de lui-même une imagette de la couverture. Cependant, cette solution n'est possible que lorsque une connexion USB est utilisée et le fichier envoyé avec calibre. Veuillez noter que si vous envoyez le fichier MOBI en utilisant un email, Amazon marquera automatiquement celui-ci comme Document Personnel et la couverture fonctionnera, mais le livre apparaîtra dans les Documents Personnels.
sv: Om du skickar en MOBI-fil till en Kindle med calibre med en USB-anslutning, arbetar calibre runt detta Amazon-fel genom att ladda upp en omslagsikon. Dock är endast möjligt att komma runt problemet när du använder en USB-anslutning och skicka med calibre. Observera att om du skickar via e-post, kommer Amazon automatiskt markera MOBI-filen som ett personligt dokument och omslaget kommer att fungera, men boken kommer att dyka upp i personliga dokument.

source: How do I convert a collection of HTML files in a specific order?
fr: Comment puis-je convertir une collection de fichiers HTML dans un ordre spécifique ?
sv: Hur konverterar jag en samling HTML-filer i en viss ordning?

source: In order to convert a collection of HTML files in a specific order, you have to create a table of contents file. That is, another HTML file that contains links to all the other files in the desired order. Such a file looks like::
fr: Pour convertir une collection de fichiers HTML dans un ordre spécifique, vous devez créer un fichier table des matières. Celui-ci est, un autre fichier HTML qui contient des liens vers tous les autres fichiers dans l'ordre souhaité. Un tel fichier ressemble à ::
sv: För att omvandla en samling HTML-filer i en viss ordning, måste du skapa en innehållsförteckningsfil. Det vill säga, en annan HTML-fil som innehåller länkar till de andra filerna i önskad ordning. En sådan fil ser ut som::

source: Then, just add this HTML file to the GUI and use the convert button to create your ebook. You can use the option in the Table of Contents section in the conversion dialog to control how the Table of Contents is generated.
fr: Ensuite, il suffit d'ajouter ce fichier HTML au GUI et d'utiliser le bouton Convertir pour créer votre ebook. Vous pouvez utiliser l'option dans la section Table des Matières de la boîte de dialogue Convertir pour contrôler la façon dont la Table des Matières est générée.
sv: Sedan är det bara lägga till den här HTML-filen till grafiska gränssnittet och använd knappen Konvertera för att skapa din e-bok. Du kan använda alternativet i innehållsförteckningsavsnittet i dialogrutan för att styra omvandlingen hur innehållsförteckningen genereras.

source: By default, when adding HTML files, calibre follows links in the files in *depth first* order. This means that if file A.html links to B.html and C.html and D.html, but B.html also links to D.html, then the files will be in the order A.html, B.html, D.html, C.html. If instead you want the order to be A.html, B.html, C.html, D.html then you must tell calibre to add your files in *breadth first* order. Do this by going to Preferences->Plugins and customizing the HTML to ZIP plugin.
fr: Par défaut, lorsque vous ajoutez des fichiers HTML, calibre suit les liens dans les fichiers en adoptant un parcours en profondeur *depth first order*. Cela signifie que si A.html pointe vers B.html, C.html et D.html, mais que B.html a également un lien vers D.html, les fichiers seront dans l’ordre suivant : A.html, B.html, D.html, C.html. Si vous voulez l'ordre A.html, B.html, C.html, D.html alors vous devez dire à calibre d'ajouter vos fichiers dans un parcours en largeur *breadth first order*. Pour ce faire, allez dans Préférences-> Extensions->extension Type de fichier et personnalisez le module HTML to ZIP.
sv: Som standard när du lägger till HTML-filer, följer calibre länkar i filerna i *djup först* ordning. Detta innebär att om filen A.html länkarna för att B.html och C.html och D.html, men B.html också länkar till D.html, då filerna kommer att vara i ordning a.html, B.html, D Html, C.html. Om du istället vill att för att bli a.html, B.html, C.html, D.html då måste du berätta calibre att lägga dina filer i *bredden först* ordning. Gör detta genom att gå till Inställningar->Tillägg och anpassa HTML till ZIP-tillägg.

source: The EPUB I produced with calibre is not valid?
fr: L'EPUB que j'ai produit avec calibre n'est pas valide ?
sv: EPUB som producerades med calibre är inte giltig?

source: calibre does not guarantee that an EPUB produced by it is valid. The only guarantee it makes is that if you feed it valid XHTML 1.1 + CSS 2.1 it will output a valid EPUB. calibre tries hard to ensure that EPUBs it produces actually work as intended on a wide variety of devices, a goal that is incompatible with producing valid EPUBs, and one that is far more important to the vast majority of its users. If you need a tool that always produces valid EPUBs, calibre is not for you. This means, that if you want to send a calibre produced EPUB to an online store that uses an EPUB validity checker, you have to make sure that the EPUB is valid yourself, calibre will not do it for you -- in other words you must feed calibre valid XHTML + CSS as the input documents.
fr: calibre ne garantit pas qu'un EPUB qu'il produit soit valide. La seule garantie qu'il donne est que si vous lui donnez du XHTML 1.1 + CSS 2.1 valide, il va vous afficher un EPUB valide. calibre est conçu pour les consommateurs de livres numériques, non pour les producteurs. Il s'efforce de s'assurer que les EPUBs qu'il produit fonctionnent réellement comme prévu sur une grande variété de dispositifs, objectif qui est incompatible avec la production d’EPUBs valides, et qui est beaucoup plus important pour la grande majorité de ses utilisateurs. Si vous avez besoin d'un outil qui produit des EPUBs toujours valides, calibre n'est pas pour vous. Cela signifie, que si vous voulez envoyer un EPUB produit par calibre à une boutique en ligne qui utilise un vérificateur de validité d'EPUB, vous avez à assurer que l'EPUB est valide par vous même, calibre ne le fait pas pour vous -- en d'autres mots vous devez alimenter calibre en XHTML + CSS valides comme documents d'entrée.
sv: calibre garanterar inte att en EPUB som produceras är giltigt. Den enda garantin det gör är att om du matar den giltig XHTML 1.1 + CSS 2.1 matar den ut en giltig EPUB. calibre försöker hårt för att säkerställa att EPUB den producerar faktiskt fungerar som det är tänkt på en mängd olika enheter, ett mål som inte är förenligt med att producera giltiga EPUBs, och en som är mycket viktigare att de allra flesta av sina användare. Om du behöver ett verktyg som alltid ger tillförlitliga EPUB är calibre inte för dig. Detta innebär, att om du vill skicka en calibre som produceras EPUB till en online-butik som använder en EPUB giltighetskontroller, måste du se till att EPUB är giltig, calibre kommer inte göra det åt dig - med andra ord måste du mata calibre med giltig XHTML + CSS som ingångsdokument.

source: How do I use some of the advanced features of the conversion tools?
fr: Comment puis-je utiliser certaines les fonctionnalités avancées des outils de conversion ?
sv: Hur använder jag en del av de avancerade funktionerna i omvandlingsverktyget?

source: You can get help on any individual feature of the converters by mousing over it in the GUI or running ``ebook-convert dummy.html .epub -h`` at a terminal. A good place to start is to look at the following demo file that demonstrates some of the advanced features `html-demo.zip <http://calibre-ebook.com/downloads/html-demo.zip>`_
fr: Vous pouvez obtenir de l'aide sur n'importe quelle caractéristique particulière dans la boite de dialogue Convertir en passant la souris au-dessus de l'interface graphique ou en exécutant ``ebook-convert dummy.html .epub -h`` sur un terminal. Un bon endroit pour démarrer est de regarder le fichier de démonstration suivant qui illustre quelques-unes des fonctionnalités avancées : `html-demo.zip <http://calibre-ebook.com/downloads/html-demo.zip>`_
sv: Du kan få hjälp av någon enskild egenskap hos omvandlarna genom att föra musen över den i GUI eller köra ``ebook-convert dummy.html .epub -h`` vid en terminal. Ett bra ställe att börja är att titta på följande demo-fil som visar en del av de avancerade funktioner `html-demo.zip <http://calibre-ebook.com/downloads/html-demo.zip>`_

source: Device Integration
fr: Intégration d'un périphérique
sv: Enhetsintergration

source: What devices does calibre support?
fr: Quels périphériques calibre supporte-t'il ?
sv: Vilken enhet stöder calibre?

source: calibre can directly connect to all the major (and most of the minor) ebook reading devices, smarthphones, tablets, etc. In addition, using the :guilabel:`Connect to folder` function you can use it with any ebook reader that exports itself as a USB disk. You can even connect to Apple devices (via iTunes), using the :guilabel:`Connect to iTunes` function.
fr: calibre peut se connecter directement aux principaux (et la plupart des moins connus) périphériques de lecture de livre numérique, smarthphones, tablettes, etc. En outre, en utilisant la fonction :guilabel:`Connecter au dossier`, vous pouvez l'utiliser avec n'importe quel lecteur de livre numérique qui se comporte comme un disque USB. Vous pouvez même vous connecter à des dispositifs Apple (via iTunes), en utilisant la fonction `guilabel:`Se connecter à iTunes`.
sv: calibre kan direkt ansluta till alla stora (och de flesta av de mindre) e-boksläsenheter, smarta mobiler, surfplattor, etc. Dessutom används :guilabel:`Anslut till mapp`-funktionen kan du använda den med någon e-boksläsare som exporterar sig som en USB-disk. Du kan även ansluta till Apple-enheter (via iTunes), med hjälp av :guilabel:`Anslut till iTunes`-funktionen.

source: How can I help get my device supported in calibre?
fr: Comment puis-je aider à ce que mon périphérique soit pris en charge dans calibre ?
sv: Hur kan jag hjälpa till för att få stöd för min enhet i calibre?

source: If your device appears as a USB disk to the operating system, adding support for it to calibre is very easy. We just need some information from you:
fr: Si votre périphérique apparaît comme un disque USB dans le système d'exploitation, ajouter la prise en charge de celui-ci à calibre est très facile. Nous avons juste besoin de connaître quelques informations de votre part :
sv: Om enheten visas som en USB-disk för operativsystemet, att lägga till stöd för calibre är mycket enkelt. Vi behöver bara lite information från dig:

source: Complete list of ebook formats that your device supports.
fr: La liste complète des formats de livre numérique que votre périphérique prend en charge.
sv: Komplett lista över e-bokformat som enheten stöder.

source: Is there a special directory on the device in which all ebook files should be placed? Also does the device detect files placed in sub directories?
fr: Il y a-t'il un répertoire spécial dans lequel tous les fichiers livre numérique devront être placés ? Est-ce que le périphérique détecte les fichiers placés dans les sous-répertoires ?
sv: Finns det en särskild katalog på enheten där alla e-bokfiler ska placeras? Också om inte enheten upptäcker filer som placeras i underkataloger?

source: We also need information about your device that calibre will collect automatically. First, if your device supports SD cards, insert them. Then connect your device to the computer. In calibre go to :guilabel:`Preferences->Miscellaneous` and click the "Debug device detection" button. This will create some debug output. Copy it to a file and repeat the process, this time with your device disconnected from your computer.
fr: Nous avons également besoin d'informations sur votre dispositif que calibre recueillera automatiquement. Tout d'abord, si votre dispositif prend en charge les cartes SD, insérez-en une. Ensuite, connectez votre périphérique à l'ordinateur. Dans calibre allez dans :guilabel:`Préférences->Avancé->Divers` et cliquez sur le bouton "Déboguez la détection du dispositif". Cela va créer un journal de débogage. Copiez-le dans un fichier et répétez le processus, mais cette fois avec votre périphérique déconnecté de votre ordinateur.
sv: Vi behöver också information om enheten som calibre samlar automatiskt. Först, om enheten har stöd för SD-kort, sätt in dem. Anslut sedan enheten till datorn. I calibre gå till :guilabel:`Inställningar->Diverse` och klicka på knappen" Felsök enhetsupptäckt ". Detta kommer att skapa en del felsökningsutskrifter. Kopiera den till en fil och upprepa processen, den här gången med enheten bortkopplad från datorn.

source: Send both the above outputs to us with the other information and we will write a device driver for your device.
fr: Envoyez-nous les deux journaux de débogage ainsi que les autres informations recueillies et nous écrirons un pilote pour votre périphérique.
sv: Skicka båda de ovanstående utdata till oss med andra uppgifter och vi kommer att skriva en drivrutin för enheten.

source: Once you send us the output for a particular operating system, support for the device in that operating system will appear in the next release of calibre. To send us the output, open a bug report and attach the output to it. See `calibre bugs <http://calibre-ebook.com/bugs>`_.
fr: Une fois que vous nous envoyez les informations sur un système d'exploitation particulier, la prise en charge pour ce périphérique dans ce système d'exploitation apparaîtra dans la prochaine version de calibre. Pour nous envoyer les fichiers, ouvrez un rapport de bug et attachez vos informations en pièces jointes. Voir `calibre bugs <http://calibre-ebook.com/bugs>`_.
sv: När du skickar utdata för ett visst operativsystem, kommer stöd för enheten i det operativsystemet visas i nästa version av calibre. För att skicka utdata, öppna en felrapport och fäst utdata till den. Se calibre bugs <http://calibre-ebook.com/bugs>`_.

source: My device is not being detected by calibre?
fr: Mon périphérique n'est pas détecté par calibre ?
sv: Enheten upptäcks inte av calibre?

source: Follow these steps to find the problem:
fr: Suivez ces étapes pour trouver le problème :
sv: Gör så här för att hitta problemet:

source: Make sure that you are connecting only a single device to your computer at a time. Do not have another calibre supported device like an iPhone/iPad etc. at the same time.
fr: Assurez-vous que vous connectez un seul périphérique à la fois à votre ordinateur. Ne pas avoir un autre périphérique pris en charge par calibre comme un iPhone/iPad etc. en même temps.
sv: Se till att du ansluter en enda enhet till datorn åt gången. Använd inte någon annan calibre-stöd enhet som iPhone/iPad etc. samtidigt.

source: If you are connecting an Apple iDevice (iPad, iPod Touch, iPhone), use the 'Connect to iTunes' method in the 'Getting started' instructions in `Calibre + Apple iDevices: Start here <http://www.mobileread.com/forums/showthread.php?t=118559>`_.
fr: Si vous connectez un périphérique Apple (iPad, iPod Touch, iPhone), utiliser la méthode `Se connecter à iTunes` dans les instructions du 'Guide de démarrage' dans `Calibre + Apple iDevices: Start here <http://www.mobileread.com/forums/showthread.php?t=118559>`_.
sv: Om du ansluter en Apple iDevice (iPad, iPod Touch, iPhone), använder du "Anslut till iTunes"-metod i "Komma igång" instruktioner i Calibre + Apple iDevices: Börja här. <http://www.mobileread.com/forums/showthread.php?t=118559>`_.

source: Make sure you are running the latest version of calibre. The latest version can always be downloaded from `the calibre website <http://calibre-ebook.com/download>`_. You can tell what version of calibre you are currently running by looking at the bottom line of the main calibre window.
fr: Assurez-vous que vous utilisez la dernière version de calibre. La dernière version peut être téléchargée à partir `du site web de calibre <http://calibre-ebook.com/download>`_.. Vous pouvez voir quelle version de calibre vous utilisez actuellement en regardant la ligne du bas de la fenêtre principale de calibre.
sv: Se till att du kör den senaste versionen av calibre. Den senaste versionen kan alltid laddas ner från `calibres webbplats <http://calibre-ebook.com/download>`_. Du kan se vilken version av calibre du kör genom att titta på den nedersta raden i calibre-huvudfönster.

source: Ensure your operating system is seeing the device. That is, the device should show up in Windows Explorer (in Windows) or Finder (in OS X).
fr: Vérifiez que votre système d'exploitation peut voir le périphérique. Autrement dit, le prériphérique devrait apparaître dans l'Explorateur Windows (sous Windows) ou le Finder (sous OS X).
sv: Försäkra ditt operativsystem är att ser enheten. Det vill säga, att enheten ska visa upp i Utforskaren (Windows) eller Finder (i OS X).

source: In calibre, go to :guilabel:`Preferences->Ignored Devices` and check that your device is not being ignored
fr: Dans calibre, allez dans :guilabel:`Préférences->Dispositifs à ignorer` et vérifiez que votre dispositif n'est pas ignoré.
sv: I calibre, gå till :guilabel:`Inställningar->Ignorerade enheter` och kolla att din enhet inte ignoreras

source: If all the above steps fail, go to :guilabel:`Preferences->Miscellaneous` and click :guilabel:`Debug device detection` with your device attached and post the output as a ticket on `the calibre bug tracker <https://bugs.launchpad.net/calibre>`_.
fr: Si toutes les étapes précédentes ont échoué, allez dans :guilabel:`Préférences->Divers` et cliquez sur :guilabel:`Déboguer la détection de l’appareil` avec votre dispositif connecté et postez la sortie comme un ticket sur `le traqueur de bug calibre <https://bugs.launchpad.net/calibre>`_.
sv: Om alla dessa åtgärder misslyckas, gå till :guilabel:`Inställningar->Diverse` och klicka :guilabel:`Felsök enhetsdetektion` med enheten ansluten och skicka resultatet som en biljett på `calibres bug tracker <https://bugs.launchpad.net/calibre>`_.

source: My device is non-standard or unusual. What can I do to connect to it?
fr: Mon périphérique est non-standard ou inhabituel. Comment faire pour le connecter ?
sv: Min enhet är icke-standard eller ovanligt. Vad kan jag göra för att ansluta till den?

source: In addition to the :guilabel:`Connect to Folder` function found under the Connect/Share button, calibre provides a ``User Defined`` device plugin that can be used to connect to any USB device that shows up as a disk drive in your operating system. Note: on windows, the device must have a drive letter for calibre to use it. See the device plugin ``Preferences -> Plugins -> Device Plugins -> User Defined`` and ``Preferences -> Miscellaneous -> Get information to setup the user defined device`` for more information. Note that if you are using the user defined plugin for a device normally detected by a builtin calibre plugin, you must disable the builtin plugin first, so that your user defined plugin is used instead.
fr: En plus de la fonction :guilabel:`Se connecter au dossier` qui se trouve dans le menu du bouton Connecter/Partager, calibre fournit une extension ``Définie par l'utilisateur`` qui peut être utilisée pour se connecter à n'importe quel périphérique USB considéré comme un lecteur de disque par votre système d'exploitation. Remarque : Sous Windows, l'appareil doit avoir une lettre de lecteur pour pouvoir être utilisé par Calibre. Voir l'extension de périphérique ``Préférences->Extensions->extensions Interface de l’appareil->User Defined`` et ``Préférences->Divers->Récupérer les informations pour définir les préférences de l'utilisateur pour les appareils connectés`` pour plus d'informations. Notez que si vous utilisez un module d’extension personnalisé sur un périphérique pour lequel il existe un module d’extension par défaut, il faut désactiver le module par défaut pour que le module personnalisé soit utilisé à la place.
sv: Förutom Anslut till mapp finns under :guilabel:`Anslut till mapp`-knappen ger calibre en användardefinierad enhetstillägg som kan användas för att ansluta till en USB-enhet som dyker upp som en hårddisk i operativsystemet. OBS: I Windows måste enheten ha en enhetsbeteckning för calibre för att använda den. Se anordningen enhetstillägg ``Inställningar->Avancerat->Tillägg->Enhetstillägg->User Defined`` and ``Inställningar->Diverse->Få information om att stilla in användardefinierad enhet`` för mer information. Observera att om du är med hjälp av användardefinierade tillägg för en enhet som normalt upptäcks av en inbyggd calibre-tillägg, måste du inaktivera den inbyggda tillägg först, så att ditt användardefinierade tillägg används istället.

source: How does calibre manage collections on my SONY reader?
fr: Comment fait calibre pour gérer les collections sur ma liseuse SONY ?
sv: Hur hanterar calibre samlingar på min SONY-läsare?

source: When calibre connects with the reader, it retrieves all collections for the books on the reader. The collections of which books are members are shown on the device view.
fr: Quand calibre se connecte à la liseuse, il récupère toutes les collections auxquelles appartiennent les livres présents sur la liseuse. Les collections sont représentées sur la vue périphérique.
sv: När calibre ansluter med läsaren, hämtar det alla kollektioner av böcker på läsaren. Samlingarna av vilka böcker är medlemmar visas på enheten.
