Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: Simply copy the calibre library folder from the old to the new computer. You can find out what the library folder is by clicking the calibre icon in the toolbar. The very first item is the path to the library folder. Now on the new computer, start calibre for the first time. It will run the Welcome Wizard asking you for the location of the calibre library. Point it to the previously copied folder. If the computer you are transferring to already has a calibre installation, then the Welcome wizard wont run. In that case, right-click the calibre icon in the tooolbar and point it to the newly copied directory. You will now have two calibre libraries on your computer and you can switch between them by clicking the calibre icon on the toolbar. Transferring your library in this manner preserver all your metadata, tags, custom columns, etc.
fr: Il suffit de copier le dossier de la bibliothèque calibre de l'ancien vers le nouvel ordinateur. Vous pouvez voir où ce trouver le dossier de la bibliothèque est en cliquant sur l'icône de calibre dans la barre d'outils. La boite de dialogue du premier menu vous donne le chemin d'accès au dossier de la bibliothèque. Sur le nouvel ordinateur, démarrez Calibre pour la première fois. Il va exécuter l'Assistant de bienvenue qui vous demandera de spécifier l'emplacement de la bibliothèque de calibre. Sélectionnez le dossier précédemment copié. Si l'ordinateur où vous avez transféré la bibliothèque a déjà une installation de calibre, l'assistant de bienvenue ne se lancera pas. Dans ce cas, faites un clic droit sur l'icône calibre sur la barre d’outils et sélectionnez le nouveau répertoire copié. Vous aurez maintenant deux bibliothèques calibre sur votre ordinateur et vous pouvez basculer de l’une à l’autre en cliquant sur l'icône calibre sur la barre d'outils. Le transfert de votre bibliothèque de cette façon préservera toutes vos métadonnées, les étiquettes, les colonnes personnalisées, etc.
sv: Bara kopiera mappen med calibre-biblioteket från den gamla till den nya datorn. Du kan ta reda på var biblioteksmappen är genom att klicka på ikonen calibre i verktygsfältet. Den allra första punkten är sökvägen till biblioteksmappen. Nu på den nya datorn, starta calibre för första gången. Det kommer Välkomstguiden att köras som ber dig om placeringen av calibre-biblioteket. Hänvisa den till den tidigare kopierade mappen. Om datorn du överför till redan har en calibre-installation, kommer inte Välkomstguiden att köras. I så fall, högerklicka på ikonen calibre i verktygsfältet och led den till den nyligen kopierade katalogen. Du kommer nu att ha två calibre-bibliotek på din dator och du kan växla mellan dem genom att klicka på ikonen calibre i verktygsfältet. Överföra ditt bibliotek på detta sätt bevarar alla dina metadata, etiketter, anpassade kolumner, etc.

source: Note that if you are transferring between different types of computers (for example Windows to OS X) then after doing the above you should also right-click the calibre icon on the tool bar, select Library Maintenance and run the Check Library action. It will warn you about any problems in your library, which you should fix by hand.
fr: Notez que si vous opérez le transfert entre deux types d'ordinateurs différents (par exemple de Windows à OS X), après avoir fait ce qui précède vous devez aussi faire un clic droit sur l'icône calibre de la barre d'outils, sélectionner Maintenance de la bibliothèque et exécuter l'action Vérifier la bibliothèque. Cela vous indiquera des éventuels dysfonctionnements de votre bibliothèque, que vous devez corriger manuellement.
sv: Observera att om du överför mellan olika typer av datorer (till exempel Windows till OS X) sedan efter att ha gjort ovanstående bör du också högerklicka på ikonen calibre i verktygsfältet, välj Biblioteksunderhåll och utför åtgärden Kontrollera bibliotek. Det kommer att varna dig om eventuella problem i biblioteket, som du bör åtgärda på för hand.

source: A calibre library is just a folder which contains all the book files and their metadata. All the metadata is stored in a single file called metadata.db, in the top level folder. If this file gets corrupted, you may see an empty list of books in calibre. In this case you can ask calibre to restore your books by doing a right-click on the calibre icon in the toolbar and selecting Library Maintenance->Restore database
fr: Une bibliothèque calibre est juste un dossier qui contient tous les fichiers des livres et leurs métadonnées. Toutes les métadonnées sont stockées dans un fichier unique appelé metadata.db, au niveau le plus haut du dossier. Si ce fichier devient corrompu, vous pouvez avoir une liste de livres vide dans calibre. Dans ce cas, vous pouvez demander à calibre de restaurer vos livres en faisant un clic-droit sur l'icône de calibre dans la barre d'outil et en sélectionnant Maintenance de la bibliothèque->Restaurer la base de donnée.
sv: Ett calibre bibliotek är bara en mapp som innehåller alla bokfiler och deras metadata. All metadata lagras i en enda fil som heter metadata.db, i den översta mappnivån. Om filen blir skadad, kan det hända att en tom lista över böcker i calibre. I så fall kan du be calibre återställa dina böcker genom att göra en högerklicka på calibre -ikonen i verktygsfältet och välja Biblioteksunderhåll-> Återställ databasen

source: The list of books in calibre is blank!
fr: La liste des livres dans calibre est vide !
sv: Listan över böcker i calibre är tom!

source: In order to understand why that happened, you have to understand what a calibre library is. At the most basic level, a calibre library is just a folder. Whenever you add a book to calibre, that book's files are copied into this folder (arranged into sub folders by author and title). Inside the calibre library folder, at the top level, you will see a file called metadata.db. This file is where calibre stores the metadata like title/author/rating/tags etc. for *every* book in your calibre library. The list of books that calibre displays is created by reading the contents of this metadata.db file.
fr: Afin de comprendre pourquoi cela s'est produit, il faut comprendre ce qu'est une bibliothèque calibre. Au niveau le plus élémentaire, une bibliothèque calibre est juste un répertoire. Chaque fois que vous ajoutez un livre à calibre, les fichiers de ce livre sont copiés dans ce répertoire (subdivisé en sous-répertoires par auteur et par titre). A la racine du répertoire contenant la bibliothèque calibre, vous verrez un fichier appelé metadata.db. Ce fichier stocke les métadonnées comme le titre/auteur/cote/étiquettes, etc pour *tous* les livres de votre bibliothèque calibre. La liste des livresque calibre affiche est crée par la lecture du contenu de ce fichier metadata.db.
sv: För att förstå varför det hände, måste du förstå vad calibre-biblioteket är. På den mest grundläggande nivån, är ett calibre-bibliotek bara en mapp. När du lägger till en bok till calibre, är att bokens filer kopieras till denna mapp (ordnade i undermappar efter författare och titel). Inne i calibre-biblioteksmappen, på den högsta nivån, kommer du att se en fil som heter metadata.db. Den här filen är där calibre lagrar metadata som titel / författare / betyg / etiketter etc. för varje bok i ditt calibre-biblioteket. Listan över böcker som calibre visar skapas genom att läsa innehållet i denna metadata.db filen.

source: There can be two reasons why calibre is showing a empty list of books:
fr: Il peut y avoir deux raisons pour lesquelles calibre affiche une liste vide de livres :
sv: Det kan finnas två skäl till att calibre visar en tom lista över böcker:

source: Your calibre library folder changed its location. This can happen if it was on an external disk and the drive letter for that disk changed. Or if you accidentally moved the folder. In this case, calibre cannot find its library and so starts up with an empty library instead. To remedy this, do a right-click on the calibre icon in the calibre toolbar and select Switch/create library. Click the little blue icon to select the new location of your calibre library and click OK. If you dont know the new location search your computer for the file :file:`metadata.db`.
fr: Votre dossier de bibliothèque calibre a changé d’emplacement. Cela peut arriver s’il était sur un disque externe et que la lettre de lecteur pour ce disque a changé. Ou si vous avez accidentellement déplacé le dossier. Dans ce cas, calibre ne peut plus trouver sa bibliothèque et démarre avec une bibliothèque vide à la place. Pour y remédier, faites un clic-droit sur l'icône calibre dans la barre d'outils et sélectionnez Changer de/créer/déplacer une bibliothèque. Cliquez sur la petite icône bleue pour sélectionner le nouvel emplacement de votre bibliothèque calibre et cliquez sur OK. Si vous ne connaissez pas le nouvel emplacement rechercher le fichier :file:`metadata.db` dans votre ordinateur.
sv: Din calibre-biblioteksmapp bytte plats. Detta kan hända om det var på en extern hårddisk och enhetsbeteckningen för den disken förändrats. Eller om du av misstag flyttat mappen. I detta fall kan calibre inte hitta sitt bibliotek och så startar med ett tomt bibliotek istället. För att råda bot på detta, gör en högerklicka på ikonen calibre i calibre-verktygsfältet och välj Växla/skapa bibliotek. Klicka på den lilla blå ikonen för att välja den nya platsen för ditt calibre-biblioteket och klicka på OK. Om du inte vet den nya platsen söka igenom datorn efter filen :file:`metadata.db`.

source: Your metadata.db file was deleted/corrupted. In this case, you can ask calibre to rebuild the metadata.db from its backups. Right click the calibre icon in the calibre toolbar and select Library maintenance->Restore database. calibre will automatically rebuild metadata.db.
fr: Votre fichier metadata.db a été supprimé/endommagé. Dans ce cas, vous pouvez demander à calibre de restaurer le fichier metadata.db à partir de ses sauvegardes. Faites un clic droit sur l'icône calibre dans la barre d'outils et sélectionnez Maintenance de la bibliothèque->Restaurer la base de données. Calibre va restaurer automatiquement metadata.db.
sv: Din metadata.db raderades / skadades. I så fall kan du be calibre att bygga om metadata.db från sina säkerhetskopior. Högerklicka på ikonen calibre i calibre-verktygsfältet och välj Biblioteksunderhålls> Återställ databas. calibre kommer automatiskt återuppbygga metadata.db.

source: I am getting errors with my calibre library on a networked drive/NAS?
fr: J'obtiens des erreurs avec ma bibliothèque calibre sur un disque réseau/NAS ?
sv: Jag får fel med min calibre-biblioteket på en nätverksenhet/NAS?

source: **Do not put your calibre library on a networked drive**.
fr: **Ne mettez pas votre bibliothèque calibre sur un disque réseau**.
sv: Lägg inte ditt calibre-bibliotek på en nätverksenhet.

source: A filesystem is a complex beast. Most network filesystems lack various filesystem features that calibre uses. Some dont support file locking, some dont support hardlinking, some are just flaky. Additionally, calibre is a single user application, if you accidentally run two copies of calibre on the same networked library, bad things will happen. Finally, different OSes impose different limitations on filesystems, so if you share your networked drive across OSes, once again, bad things *will happen*.
fr: Un système de fichiers est une bête complexe. La plupart des systèmes de fichiers réseau ne comprennent pas les diverses caractéristiques du système de fichier utilisé par calibre. Certains ne supportent pas le verrouillage des fichiers, d'autres ne supportent pas le hardlinking. En outre, calibre est une application mono-utilisateur. Si vous exécutez accidentellement deux copies de calibre sur la même bibliothèque en réseau, des incidents peuvent se produire. Enfin, différents systèmes d'exploitation imposent des limitations sur le système de fichiers, donc si vous partagez votre lecteur réseau à travers plusieurs systèmes d'exploitation, une fois de plus, des incidents *se produiront*.
sv: Ett filsystem är ett komplext odjur. De flesta nätverksfilsystem saknar olika filsystemsfunktioner som calibre använder. Vissa stöder inte fillåsning, vissa stöd inte hårda länkar, vissa är bara opålitliga. Dessutom är calibre en enda användare program, om du råkar köra två kopior av calibre på samma nätverksbiblioteket, kommer dåliga saker hända. Slutligen olika operativsystem införa olika begränsningar av filsystem, så om du delar din nätverksenhet över operativsystem, återigen, kommer dåliga saker hända.

source: Consider using the calibre Content Server to make your books available on other computers. Run calibre on a single computer and access it via the Content Server or a Remote Desktop solution.
fr: Pensez à utiliser le Serveur de Contenu de calibre pour rendre les livres disponibles sur d'autres ordinateurs. Lancez calibre sur un seul ordinateur et accédez-y via le Serveur de Contenu ou via une solution de Bureau à Distance.
sv: Överväg att använda calibre mediaserver för att göra dina böcker tillgängliga på andra datorer. Kör calibre på en enda dator och komma åt den via mediaserver eller en Remote Desktop-lösning.

source: If you must share the actual library, use a file syncing tool like DropBox or rsync instead of a networked drive. If you are using a file-syncing tool it is **essential** that you make sure that both calibre and the file syncing tool do not try to access the calibre library at the same time. In other words, **do not** run the file syncing tool and calibre at the same time.
fr: Si vous devez partager la bibliothèque actuelle, utilisez un outil de synchronisation de fichiers comme Dropbox ou rsync plutôt qu'un disque réseau. Si vous utilisez un outil de synchronisation de fichiers, il est **essentiel** que vous vous assuriez que calibre et l'outil de synchronisation de fichiers ne cherchent pas à accéder à la bibliothèque en même temps. En d'autres termes, **n'exécuter pas** l'outil de synchronisation de fichiers et calibre au même moment.
sv: Om du måste dela det faktiska biblioteket, använd ett filsynkroniseringsverktyg som DropBox eller rsync istället för en nätverksenhet. Om du använder ett filsynkroniseringsverktyg är det **viktigt** att du ser till att både calibre och filsynkroniseringsverktyget inte försöker komma åt calibre bibliotek samtidigt. Med andra ord, kör **inte** filsynkroniseringsverktyget och calibre samtidigt.

source: Even with these tools there is danger of data corruption/loss, so only do this if you are willing to live with that risk. In particular, be aware that **Google Drive** is incompatible with calibre, if you put your calibre library in Google Drive, **you will suffer data loss**. See `this thread <http://www.mobileread.com/forums/showthread.php?t=205581>`_ for details.
fr: Même avec ces outils il y a un risque de corruption/de perte de données. Ne le faire que si vous êtes prêt à vivre avec ce risque. En particulier, sachez que **Google Drive** est incompatible avec calibre : si vous mettez votre bibliothèque calibre dans Google Drive, **vous subirez une perte de données**. Voir `ce poste <http://www.mobileread.com/forums/showthread.php?t=205581>`_ pour des détails.
sv: Även med dessa verktyg finns det risk för datakorruption eller förlust, så gör bara detta om du är villig att leva med den risken. Framför allt, tänk på att **Google Drive** är oförenlig med calibre, om du sätter ditt calibre biblioteket i Google Drive, **du kommer att drabbas dataförlust**. Se `this thread <http://www.mobileread.com/forums/showthread.php?t=205581>`

source: Miscellaneous
fr: Divers
sv: Diverse

source: I want calibre to download news from my favorite news website.
fr: Je veux que calibre télécharge les actualités de mon site préféré.
sv: Jag vill att calibre hämtar nyheter från min favoritnyhetssajten.

source: If you are reasonably proficient with computers, you can teach calibre to download news from any website of your choosing. To learn how to do this see :ref:`news`.
fr: Si vous êtes un minimum compétent en informatique, vous pouvez indiquer à calibre comment télécharger des actualités à partir de n’importe quel site de votre choix. Pour apprendre à le faire, voir :ref:`news`.
sv: Om du är någorlunda skicklig med datorer, kan du lära calibre att hämta nyheter från en webbplats som du väljer. Om du vill veta hur du gör detta se :ref:`news`.

source: Otherwise, you can request a particular news site by posting in the `calibre Recipes forum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_.
fr: Sinon, vous pouvez demander un site d’actualités en particulier en postant dans le `calibre Recipes forum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_.
sv: Annars kan du begära en viss nyhetssajt genom att posta i `calibre Recipes forum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_.

source: Why the name calibre?
fr: Pourquoi le nom calibre ?
sv: Varför namnet Calibre?

source: Take your pick:
fr: Faites votre choix :
sv: Gör ditt val:

source: A high *calibre* product
fr: Un produit de haut *calibre*
sv: En stor *calibre* produkt

source: A tribute to the SONY Librie which was the first e-ink based ebook reader
fr: Un hommage au Librie de SONY qui a été le premier lecteur de livre numérique e-ink
sv: En hyllning till SONY Librie som var den första e-bokläsare baserade på elektroniskt bläck

source: My wife chose it ;-)
fr: Ma femme l'a choisi ;-)
sv: Min fru valde det ;-)

source: calibre is pronounced as cal-i-ber *not* ca-li-bre. If you're wondering, calibre is the British/commonwealth spelling for caliber. Being Indian, that's the natural spelling for me.
fr: Calibre se prononce cal-i-ber *pas* ca-li-bre. Si ça vous interroge, calibre est l'orthographe britannique / du Commonwealth pour caliber. En tant qu’Indien, c’était l'orthographe la plus naturelle pour moi.
sv: calibre uttalas som kal-i-ber *inte* ka-li-bre. Om du undrar, calibre är den brittiska/ samväldets stavning för caliber. Att vara indisk, det är den naturliga stavningen för mig.

source: Why does calibre show only some of my fonts on OS X?
fr: Pourquoi calibre ne montre qu’une partie de mes polices sous OS X ?
sv: Varför visar calibre bara några av mina typsnitt på OS X?

source: calibre embeds fonts in ebook files it creates. Ebook files support embedding only TrueType and OpenType (.ttf and .otf) fonts. Most fonts on OS X systems are in .dfont format, thus they cannot be embedded. calibre shows only TrueType and OpenType fonts found on your system. You can obtain many such fonts on the web. Simply download the .ttf/.otf files and add them to the Library/Fonts directory in your home directory.
fr: Calibre incorpore les polices dans les fichiers de livre numérique qu'il crée. Les fichiers de livre numérique gèrent uniquement les polices TrueType et Open Type (.ttf et .otf) incorporées. La plupart des polices sur les systèmes OS X sont au format .dfont, donc elles ne peuvent pas être incorporées. calibre affiche uniquement les polices TrueType et Open Type trouvées sur votre système. Vous pouvez obtenir beaucoup de telles polices sur le web. Il vous suffit de télécharger les fichiers .ttf/.otf et de les ajouter au répertoire Library/Fonts dans votre répertoire principal.
sv: calibre bäddar in typsnitt i e-bokfiler som skapas. E-bokfiler stöder endast inbäddning av Truetype och Opentype (.ttf och .otf) typsnitt. De flesta typsnitt på OS X-system är i .dfont format, vilket de inte kan bäddas in. calibre visar endast Truetype och Opentype-typsnitt som finns på ditt system. Du kan få många sådana typsnitt på webben. Helt enkelt ladda ner .ttf / .otf filer och lägga till dem i Bibliotek / Fonts katalogen i din hemkatalog.

source: calibre is not starting on Windows?
fr: calibre ne démarre pas sous Windows ?
sv: calibre startar inte på Windows?

source: There can be several causes for this:
fr: Il peut y avoir plusieurs raisons à cela :
sv: Det kan finnas flera orsaker för detta:

source: If you are on Windows XP, or on a computer with a processor that does not support SSE2 (such as AMD processors from before 2003) try installing calibre `version 1.48 <http://download.calibre-ebook.com/1.48.0/>`_. calibre 2.0 and newer use Qt 5 which is known to be incompatible with Windows XP machines, and requires SSE2. Simply un-install calibre and then install version 1.48, doing so will not affect your books/settings.
fr: Si vous êtes sous Windows XP, ou sur un ordinateur avec un processeur qui ne supporte SSE2 (tels que les processeurs AMD antérieurs à 2003) essayer d'installer la version 1.48 de calibre <http://download.calibre-ebook.com/1.48.0/>`_. calibre 2.0 et ultérieurs utilisent Qt5 qui est connu pour n'être pas compatible avec les machines sous Windows XP, et requiert SSE2. Désinstallez simplement calibre et installez alors la version 1.48. faire cela n'affectera pas vos livres/paramètres.
sv: Om du är på Windows XP, eller på en dator med en processor som inte stödjer SSE2 (t.ex. AMD-processorer från före 2003) försöka installera calibre `version 1.48 <http://download.calibre-ebook.com/1.48.0/>` _. calibre 2.0 och nyare använda Qt 5 som är känd för att vara kompatibelt med Windows XP-maskiner, och kräver SSE2. Helt enkelt avinstallera calibre och sedan installera version 1.48, detta kommer inte att påverka dina böcker / inställningar.

source: If you get an error about calibre not being able to open a file because it is in use by another program, do the following:
fr: Si vous obtenez une erreur sur calibre indiquant que vous n’êtes pas en mesure d'ouvrir un fichier car ce fichier est utilisé par un autre programme, procédez comme suit :
sv: Om du får ett felmeddelande om att calibre inte kunna öppna en fil eftersom den används av ett annat program, gör följande:

source: Uninstall calibre
fr: Désinstallez calibre
sv: Avinstallera calibre

source: Reboot your computer
fr: Redémarrer votre ordinateur
sv: Boota om din dator

source: Re-install calibre. But do not start calibre from the installation wizard.
fr: Réinstallez calibre. Mais ne démarrez pas Calibre à partir de l'assistant d'installation.
sv: Återinstallera calibre, men starta inte calibre från installationsguiden.

source: Temporarily disable your antivirus program (disconnect from the Internet before doing so, to be safe)
fr: Désactivez temporairement votre programme antivirus (déconnecter Internet au préalable, pour être sûr)
sv: Tillfälligt deaktivera ditt antivirus program (koppla bort från internet innan du gör det, för att vara säker)

source: Look inside the folder you chose for your calibre library. If you see a file named metadata.db, delete it.
fr: Regardez dans le dossier défini comme étant votre bibliothèque calibre. Si vous voyez un fichier nommé metadata.db, supprimez-le.
sv: Titta inne i mappen du valt till ditt calibre-bibliotek. Om du ser en fil vid namn metadata.db, ta bort den.

source: Start calibre
fr: Démarrez calibre
sv: Starta calibre

source: From now on you should be able to start calibre normally.
fr: A partir de là, vous devriez être en mesure de démarrer calibre normalement.
sv: Från och med nu bör du kunna starta calibre normalt.
