Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: If you get an error about a Python function terminating unexpectedly after upgrading calibre, first uninstall calibre, then delete the folders (if they exists) :file:`C:\\Program Files\\Calibre` and :file:`C:\\Program Files\\Calibre2`. Now re-install and you should be fine.
fr: Si vous obtenez une erreur sur une fonction Python s'interrompant soudainement après la mise à jour de calibre, tout d’abord désinstallez calibre puis supprimez les répertoires C:\Program Files\Calibre et C:\Program Files\Calibre2 (s’ils existent). Ensuite, ré-installez et ça devrait fonctionner.
sv: Om du får ett fel i en Python-funktion som avslutas oväntat efter en uppgradering av calibre, först avinstallera calibre, sedan ta bort mappar (om det finns några) :file:`C:\\Program Files\\Calibre` och :file:`C:\\Program Files\\Calibre2`. Nu återinstallera och du bör vara OK.

source: If you get an error in the welcome wizard on an initial run of calibre, try choosing a folder like :file:`C:\\library` as the calibre library (calibre sometimes has trouble with library locations if the path contains non-English characters, or only numbers, etc.)
fr: Si vous obtenez une erreur dans l'assistant de bienvenue à l’ouverture initiale de calibre, essayez de choisir un dossier comme :file;`C:\bibliothèque` comme bibliothèque de calibre (calibre a parfois du mal avec les emplacements de bibliothèque si le chemin contient des caractères non-anglais, ou seulement des chiffres, etc).
sv: Om du får ett fel i välkomstguiden vid en initieringsköring av calibre, försök välja en mapp som :file:`C:\\library` för calibre-biblioteket (eftersom ibland har calibre problem med biblioteksplatser om sökvägen innehåller icke-engelska tecken, eller bara siffror etc.)

source: Try running it as Administrator (Right click on the icon and select "Run as Administrator")
fr: Essayez de l'exécuter en tant qu'administrateur (clic droit sur l'icône et sélectionnez "Exécuter en tant qu'Administrateur")
sv: Försök köra som administratör (högerklicka på ikonen och välj "Kör som administratör")

source: If it still wont launch, start a command prompt (press the windows key and R; then type :command:`cmd.exe` in the Run dialog that appears). At the command prompt type the following command and press Enter::
fr: Si Calibre ne démarre toujours pas, lancez une invite de commande (touche Windows et R, puis tapez `cmd.exe` dans la boîte de dialogue Exécuter qui apparaît). Dans l'invite de commande tapez la commande suivante et appuyez sur Entrée :
sv: Om det fortfarande inte startar, starta en kommandotolk (tryck på Windows-tangenten och R, skriv sedan: kommando: `cmd.exe` i dialogrutan Kör som visas). I kommandotolken skriver du följande kommando och tryck på Retur ::

source: Post any output you see in a help message on the `Forum <http://www.mobileread.com/forums/forumdisplay.php?f=166>`_.
fr: Postez le résultat dans un message d’aide sur le `Forum <http://www.mobileread.com/forums/forumdisplay.php?f=166>`_.
sv: Lägg upp något utdata som du ser i ett hjälpmeddelande på `Forum <http://www.mobileread.com/forums/forumdisplay.php?f=166>`_.

source: calibre freezes/crashes occasionally?
fr: calibre se bloque/plante occasionnellement ?
sv: caliber fryser / kraschar ibland?

source: There are several possible things I know of, that can cause this:
fr: Il y a plusieurs choses possibles que je sais, qui peuvent causer cela :
sv: Det finns flera möjliga saker som jag känner till, som kan orsaka detta:

source: You recently connected an external monitor or TV to your computer. In this case, whenever calibre opens a new window like the edit metadata window or the conversion dialog, it appears on the second monitor where you dont notice it and so you think calibre has frozen. Disconnect your second monitor and restart calibre.
fr: Vous avez récemment connecté un moniteur externe ou un téléviseur à votre ordinateur. Dans ce cas, chaque fois que calibre ouvre une nouvelle fenêtre comme la fenêtre Modifier les métadonnées ou la boîte de dialogue de Convertir, elle apparaît sur l’autre moniteur et vous ne le remarquez pas et vous pensez donc que calibre est bloqué. Déconnectez votre second moniteur et redémarrez calibre.
sv: Du kopplade nyligen en extern bildskärm eller TV till datorn. I detta fall, när calibre öppnas ett nytt fönster som metadataredigerinsfönstret eller konverteringsdialogrutan, visas det på den andra bildskärmen där du inte märker det, och så du tror calibre har frusit. Koppla in andra bildskärmen och starta calibre.

source: If you use RoboForm, it is known to cause calibre to crash. Add calibre to the blacklist of programs inside RoboForm to fix this. Or uninstall RoboForm.
fr: Si vous utilisez RoboForm, il est connu pour causer des plantages de calibre. Ajoutez Calibre à la liste noire de programmes de RoboForm pour résoudre ce problème. Ou désinstallez RoboForm.
sv: Om du använder RoboForm är det känt för att orsaka calibre kraschar. Lägg calibre till den svarta listan över program i RoboForm för att fixa detta. Eller avinstallera RoboForm.

source: The Logitech SetPoint Settings application causes random crashes in calibre when it is open. Close it before starting calibre.
fr: Le logiciel SetPoint de Logitech provoque des plantages aléatoires de calibre quand il est ouvert. Fermez-le avant de démarrer calibre.
sv: Logitechs inställningsprogram orsakar slumpmässiga krascher i calibre när den är öppen. Stäng det innan calibre.

source: Constant Guard Protection by Xfinity causes crashes in calibre. You have to manually allow calibre in it or uninstall Constant Guard Protection.
fr: Constant Guard Protection de Xfinity provoque des plantages de calibre. Vous avez à autoriser manuellement calibre dans celui-ci ou désinstaller Constant Guard Protection.
sv: Constant Guard Protection från Xfinity orsakar krascher i calibre. Du måste manuellt tillåta calibre i det eller avinstallera Constant Guard Protection.

source: Spybot - Search & Destroy blocks calibre from accessing its temporary files breaking viewing and converting of books.
fr: Spybot - Search & Destroy empêche calibre d'accéder aux fichiers temporaires, de visualiser et de convertir les livres.
sv: Spybot - Search & Destroy hindrar calibre från att komma åt sina temporära filer som förstör visning och konvertering av böcker.

source: You are using a Wacom branded USB mouse. There is an incompatibility between Wacom mice and the graphics toolkit calibre uses. Try using a non-Wacom mouse.
fr: Vous utilisez une souris USB de la marque Wacom. Il existe une incompatibilité entre la souris Wacom et la boite à outils graphique utilisée par calibre. Essayez avec une souris d’une autre marque.
sv: Du använder en Wacom märkes USB-mus. Det finns en inkompatibilitet mellan Wacom-möss och grafisk verktygslåda calibre använder. Försök att använda en icke-Wacom-mus.

source: On some 64 bit versions of Windows there are security software/settings that prevent 64-bit calibre from working properly. If you are using the 64-bit version of calibre try switching to the 32-bit version.
fr: Sur certaines versions 64 bits de Windows il existe des logiciels/paramètres de sécurité qui empêchent calibre 64 bits de fonctionner correctement. Si vous utilisez la version 64 bits de calibre essayez de passer à la version 32-bit.
sv: På vissa 64-bitarsversioner av Windows finns säkerhetsprogramvara / inställningar som hindrar 64-bitars calibre från att fungera korrekt. Om du använder 64-bitarsversionen av calibre försöka byta till 32-bitarsversionen.

source: If the crashes happen specifically when you are using a file open dialog, like clicking on the Add Books button or the Save to Disk button, then you may have an issue with the windows file open dialogs on your computer. Some calibre users have reported that uninstalling the SpiderOak encrypted backup software also fixes these crashes. If you do not wish to uninstall SpiderOak, you can also turn off "Enable OS integration" in the SpiderOak preferences.
fr: Si les plantages surviennent spécifiquement quand vous utiliser une boîte de dialogue d'ouverture de fichier, comme cliquez sur le bouton Ajouter des Livres ou le bouton Sauvegarder sur le Disque, alors vous pouvez avoir un problème avec les fenêtres boîtes de dialogue d'ouverture de fichier sur votre ordinateur. Certains utilisateurs de calibre ont rapporté que la désinstallation du logiciel de sauvegarde encryptée SpiderOak résout aussi ces plantages. Si vous ne souhaitez pas désinstallez SpiderOak, vous pouvez aussi arrêtez "Activez l'intégration OS" dans les préférences de SpiderOak.
sv: Om krascher händer speciellt när du använder en filöppningsdialog, som att klicka på knappen Lägg till böcker eller spara till disk-knappen, då kan du ha ett problem med fönstren filöppningsdialoger på din dator. Vissa calibre användare har rapporterat att avinstallera SpiderOak krypterings backup-programvara fixar även dessa krascher. Om du inte vill avinstallera SpiderOak kan du också stänga av "Aktivera OS integration" i SpiderOak-inställningar.

source: If none of the above apply to you, then there is some other program on your computer that is interfering with calibre. First reboot your computer in safe mode, to have as few running programs as possible, and see if the crashes still happen. If they do not, then you know it is some program causing the problem. The most likely such culprit is a program that modifies other programs' behavior, such as an antivirus, a device driver, something like RoboForm (an automatic form filling app) or an assistive technology like Voice Control or a Screen Reader.
fr: Si aucun des points répertoriés ci-dessus ne s'appliquent à vous, alors il y a un autre programme sur votre ordinateur qui interfère avec calibre. Tout d’abord redémarrez votre ordinateur en mode sans échec, afin d’avoir aussi peu de programmes que possible en exécution, et voyez si le programme démarre. Si c’est le cas, alors vous savez que c'est un programme qui cause le problème. La cause la plus probable est un programme qui modifie le comportement d'autres programmes, tels qu'un antivirus, un pilote de périphérique, quelque chose comme RoboForm (une application de remplissage automatique de formulaires) ou une aide technique comme la Synthèse Vocale ou un Lecteur d'Ecran.
sv: Om inget av ovanstående gäller för dig, så finns det något annat program på datorn som stör calibre. Först starta om datorn i felsäkert läge, att ha så få program som körs som möjligt, och se om krascher fortfarande händer. Om de inte gör det, då vet du att det är något program som orsakar problemet. Den mest sannolika boven i dramat är ett sådant program som modifierar andra programs beteende, till exempel ett antivirusprogram, en drivrutin, något som RoboForm (en automatisk ifyllnings app) eller hjälpmedel som röststyrning eller en skärmläsare.

source: The only way to find the culprit is to eliminate the programs one by one and see which one is causing the issue. Basically, stop a program, run calibre, check for crashes. If they still happen, stop another program and repeat.
fr: La seule façon de trouver le coupable est d'éliminer les programmes un par un et voir lequel est la cause du problème. Essentiellement, arrêtez un programme, exécutez calibre, vérifiez les plantages. S'ils se produisent encore, arrêtez un autre programme et ainsi de suite.
sv: Det enda sättet att hitta den skyldige är att eliminera program ett efter ett och se vilken som orsakar problemet. I grund och botten, stoppa ett program, köra calibre, kontrollera om det krascher. Om det fortfarande händer, stoppa ett annat program och upprepa.

source: Using the viewer or doing any conversions results in a permission denied error on windows
fr: Utiliser la visionneuse ou faire n'importe quelle conversion cause une erreur permission refusée dans windows
sv: Med hjälp av läsare eller gör några konverteringar resulterar i ett tillstånd som nekas fel på Windows

source: Something on your computer is preventing calibre from accessing its own temporary files. Most likely the permissions on your Temp folder are incorrect. Go to the folder file:`C:\\Users\\USERNAME\\AppData\\Local` in Windows Explorer and then right click on the file:`Temp` folder, select Properties and go to the Security tab. Make sure that your user account has full control for this folder.
fr: Quelque chose sur votre ordinateur empêche calibre d'accéder à ses propres fichiers temporaires. Le plus souvent les permissions sur répertoire Temp sont incorrectes. Allez au répertoire file:`C:\\Users\\USERNAME\\AppData\\Local` dans l'Explorateur de Windows et faites alors un clic droit sur le répertoire file:`temp`, sélectionnez Propriétés et allez à l'onglet Sécurité. Assurez-vous que votre compte utilisateur à le contrôle complet sur ce répertoire.
sv: Något på datorn hindrar calibre från att komma åt sina egna temporära filer. Troligtvis behörighet på din Temp-mappen är felaktig. Gå till mappen filen: `C:\\Användare\\ANVÄNDARNAMN\\AppData\\Local` i Utforskaren och högerklicka på filen:` Temp` mapp, välj Egenskaper och gå till fliken Säkerhet. Se till att ditt användarkonto har full kontroll på den här mappen.

source: Some users have reported that running the following command in an Administrator Command Prompt fixed their permissions. To get an Administrator Command Prompt search for cmd.exe in the start menu, then right click on the command prompt entry and select Run as Administrator. At the command prompt type the following command and press Enter::
fr: Certains utilisateurs ont rapporté qu'exécuter la commande suivante dans une invite de commande Administrateur répare leurs permissions. Pour obtenir une Invite de Commande Administrateur, cherchez après cmd.exe dans le menu démarrer, faites alors un clic droit sur l'entrée de l'invite de commande et sélectionner Exécuter en tant qu'Administrateur. Dans l'Invite de commande entrer la commande suivante et appuyer Enter::
sv: Vissa användare har rapporterat att köra följande kommando i en administratörskommandotolk löser deras behörigheter. För att få en administratörskommandotolk sök efter cmd.exe i startmenyn, högerklicka på Kommandotolksposten och välj Kör som administratör. I kommandotolken skriver du följande kommando och tryck på Retur::

source: Alternately, you can run calibre as Administrator, but doing so will cause some functionality, such as drag and drop to not work.
fr: Alternativement, vous pouvez exécuter calibre en tant qu'Administrateur, mais faire cela entraînera que certaines fonctionnalités, telle que le glisser et déposer de, de ne pas fonctionner.
sv: Alternativt kan du köra calibre som administratör, men detta kommer att leda till vissa problem, till exempel dra och släppa inte fungerar.

source: Finally, some users have reported that disabling UAC fixes the problem.
fr: Finalement, certains utilisateurs ont rapporté que désactiver l'UAC résout le problème.
sv: Slutligen har en del användare rapporterat att inaktivera UAC löser problemet.

source: calibre is not starting/crashing on OS X?
sv: calibre startar inte eller kraschar på OS X?

source: One common cause of failures on OS X is the use of accessibility technologies that are incompatible with the graphics toolkit calibre uses. Try turning off VoiceOver if you have it on. Also go to System Preferences->System->Universal Access and turn off the setting for enabling access for assistive devices in all the tabs. Another cause can be some third party apps that modify system behavior, such as Smart Scroll.
sv: En vanlig orsak till fel på OS X är användningen av tillgänglighetsteknik som är oförenliga med grafikverktygen calibre använder. Prova att stänga av VoiceOver om du har det på. Också gå till System Inställningar->System->Hjälpmedel och stäng av inställningen för att ge tillgång till hjälpmedel i alla flikar. En annan orsak kan vara en tredjepartsapps som modifierar systembeteende, såsom Smart Scroll.

source: You can obtain debug output about why calibre is not starting by running `Console.app`. Debug output will be printed to it. If the debug output contains a line that looks like::
fr: Vous pouvez obtenir des informations de débogage sur les incidents calibre qui ne démarre pas en lançant `Console.app`. Les informations de débogage y seront transcrites. Si ces informations contiennent une ligne ressemblant à :
sv: Du kan få felsökningsinformation om varför calibre inte startar genom att köra `Console.app`. Felsökningsinformation skrivs till den. Om felsökningsinformationen innehåller en rad som ser ut::

source: then the problem is probably a corrupted font cache. You can clear the cache by following these `instructions <http://www.macworld.com/article/1139383/fontcacheclear.html>`_. If that doesn't solve it, look for a corrupted font file on your system, in ~/Library/Fonts or the like. An easy way to check for corrupted fonts in OS X is to start the "Font Book" application, select all fonts and then in the File menu, choose "Validate fonts".
fr: alors le problème est probablement dû à un cache de police endommagé. Vous pouvez effacer le cache en suivant ces `instructions <http://www.macworld.com/article/1139383/fontcacheclear.html>`_. Si ça ne le résout pas, cherchez un fichier de police corrompue sur votre système, dans ~/Library/Fonts ou quelque chose qui y ressemble. Un moyen facile de vérifier les polices corrompues dans OS X est de lancer l’application "Font Book", sélectionnez toutes les polices, puis dans le menu Fichier, choisissez "Valider les polices".
sv: då problemet är troligen en skadad typsnittsbuffer. Du kan rensa bufferten genom att följa dessa `instruktioner <http://www.macworld.com/article/1139383/fontcacheclear.html>`_. Om det inte löser det, leta efter en skadad typsnitts-fil på datorn, i ~/Library/Fonts eller liknande. Ett enkelt sätt att kontrollera om det finns skadade typsnitt i OS X är att starta "Font Book"-programmet välja alla typsnitt och sedan på Arkiv-menyn, välj "Verifiera typsnitt".

source: I downloaded the installer, but it is not working?
fr: J’ai téléchargé le programme d’installation mais il ne fonctionne pas ?
sv: Jag laddade ner installationsprogrammet, men det fungerar inte?

source: Downloading from the Internet can sometimes result in a corrupted download. If the calibre installer you downloaded is not opening, try downloading it again. If re-downloading it does not work, download it from `an alternate location <http://sourceforge.net/projects/calibre/files/>`_. If the installer still doesn't work, then something on your computer is preventing it from running.
fr: Le téléchargement depuis Internet peut parfois aboutir à un téléchargement corrompu. Si le programme d'installation de calibre que vous avez téléchargé ne s'ouvre pas, essayez de le télécharger à nouveau. Si le nouveau téléchargement ne fonctionne pas, téléchargez-le à partir d'un autre site <http://sourceforge.net/projects/calibre/files/>`_. Si le programme d’installation ne fonctionne toujours pas, alors quelque chose sur votre ordinateur empêche son exécution.
sv: Nerladdning från Internet kan ibland resultera i en korrupt nedladdning. Om calibre installationsprogram du hämtat inte startar, prova att ladda ner det igen. Om du laddar ner det och ändå inte fungerar, ladda ner det från `en alternativ plats <http://sourceforge.net/projects/calibre/files/>` _. Om installationsprogrammet fortfarande inte fungerar, så finns något på datorn som hindrar det från att köras.

source: Try temporarily disabling your antivirus program (Microsoft Security Essentials, or Kaspersky or Norton or McAfee or whatever). This is most likely the culprit if the upgrade process is hanging in the middle.
fr: Essayez de désactiver temporairement votre programme antivirus (Microsoft Security Essentials, ou Kaspersky ou McAfee ou Norton ou autre). C’est probablement le coupable si le processus de mise à jour est suspendu en cours de lancement.
sv: Försök att tillfälligt inaktivera antivirusprogrammet (Microsoft Security Essentials eller Kaspersky eller Norton eller McAfee eller vad). Detta är troligen den skyldige om uppgraderingen hänger i mitten.

source: Try rebooting your computer and running a registry cleaner like `Wise registry cleaner <http://www.wisecleaner.com>`_.
fr: Essayez de redémarrer votre ordinateur et exécutez un nettoyeur de registre comme `Wise registry cleaner <http://www.wisecleaner.com>`_.
sv: Försök att starta om datorn och köra ett registerrensninsprogram som `Wise Registry Cleaner <http://www.wisecleaner.com>`_.

source: Try a clean install. That is, uninstall calibre, delete :file:`C:\\Program Files\\Calibre2` (or wherever you previously chose to install calibre). Then re-install calibre. Note that uninstalling does not touch your books or settings.
fr: Essayez une installation propre, C'est-à-dire, désinstallez calibre, supprimez :file:`C:\\Program Files\\Calibre2` (ou quelque soit l'endroit où vous avec choisi d'installer calibre précdemment) Réinstallez alors calibre. Notez que la désinstallation ne touche pas à vos livres ou à vos paramètres.
sv: Prova en ren installation. Det vill säga, avinstallera calibre ta bort: file: `C:\\Program\\Calibre2` (eller var du tidigare valde att installera calibre). Därefter ominstallera calibre. Observera att avinstallering inte rör dina böcker eller inställningar.

source: Try downloading the installer with an alternate browser. For example if you are using Internet Explorer, try using Firefox or Chrome instead.
fr: Essayez de télécharger le programme d'installation avec un autre navigateur. Par exemple, si vous utilisez Internet Explorer, essayez d'utiliser Firefox ou Chrome à la place.
sv: Prova att ladda ner installationsprogrammet med en alternativ webbläsare. Till exempel om du använder Internet Explorer, prova att använda Firefox eller Chrome istället.

source: If you get an error about a missing DLL on windows, then most likely, the permissions on your temporary folder are incorrect. Go to the folder :file:`C:\\Users\\USERNAME\\AppData\\Local` in Windows explorer and then right click on the :file:`Temp` folder and select :guilabel:`Properties` and go to the :guilabel:`Security` tab. Make sure that your user account has full control for this folder.
fr: Si vous obtenez une erreur sur une DLL manquante sur Windows, alors très probablement, les autorisations sur le dossier temporaire sont incorrectes. Allez dans le dossier :file:`C:\Utilisateurs\NOM D'UTILISATEUR\ AppData\Local` dans votre explorateur Windows, puis faites un clic droit sur le dossier Temp, puis sélectionnez Propriétés et cliquez sur l'onglet Sécurité. Assurez-vous que votre compte utilisateur a le contrôle total sur ce dossier.
sv: Om du får ett felmeddelande om en saknad DLL i fönster, så mest sannolikt, är behörighet på din tillfälliga mapp felaktig. Gå till mappen: filen: `C:\\Användare\\ANVÄNDARNAMN\\AppData\\Local` i Utforskaren och högerklicka sedan på: file:` Temp` mappen och välj :guilabel:`Egenskaper` och gå till den :guilabel:`Säkerhet`-flik. Se till att ditt användarkonto har full kontroll för den här mappen.
