Repository: Easonqsp/calibre-translations
Catalog: manual/*/faq.po
Languages: fr, sv

source: If you still cannot get the installer to work and you are on windows, you can use the `calibre portable install <http://calibre-ebook.com/download_portable>`_, which does not need an installer (it is just a zip file).
fr: Si vous ne parvenez toujours pas à démarrer le programme d’installation et que vous êtes sous Windows, vous pouvez utiliser l'`installation de calibre portable <http://calibre-ebook.com/download_portable>`_, qui n'a pas besoin d'un programme d'installation (c’est juste un fichier zip).
sv: Om du ändå inte kan få installeraren att fungera och du är på Windows, kan du använda `caliber bärbara installation <http://calibre-ebook.com/download_portable>` _, som inte behöver ett installationsprogram (det är bara en zip-fil).

source: My antivirus program claims calibre is a virus/trojan?
fr: Mon antivirus affirme que calibre est un virus/cheval de troie ?
sv: Mitt antivirusprogram påstår calibre är ett virus / trojan?

source: The first thing to check is that you are downloading calibre from the official website: `<http://calibre-ebook.com/download>`_. Make sure you are clicking the download links on the left, not the advertisements on the right. calibre is a very popular program and unscrupulous people try to setup websites offering it for download to fool the unwary.
fr: La première chose à vérifier est que vous avez téléchargé calibre sur le site officiel : `<http://calibre-ebook.com/download>`_. Assurez-vous que vous cliquez les liens de téléchargement sur la gauche, pas les publicités sur la droite. calibre est un programme très populaire et des gens peu scrupuleux peuvent offrir la possibilité de le télécharger sur des sites Web non recommandables.
sv: Det första du bör kontrollera är att du laddar ner calibre från den officiella hemsidan: `<http://calibre-ebook.com/download>` _. Se till att du klicka på nedladdningslänkar till vänster, inte reklam till höger. calibre är ett mycket populärt program och skrupelfria människor försöker installations webbplatser som erbjuder den för nedladdning för att lura oförsiktiga.

source: If you have the official download and your antivirus program is still claiming calibre is a virus, then, your antivirus program is wrong. Antivirus programs use heuristics, patterns of code that "look suspicious" to detect viruses. It's rather like racial profiling. calibre is a completely open source product. You can actually browse the source code yourself (or hire someone to do it for you) to verify that it is not a virus. Please report the false identification to whatever company you buy your antivirus software from. If the antivirus program is preventing you from downloading/installing calibre, disable it temporarily, install calibre and then re-enable it.
fr: Si vous avez le téléchargement officiel et que votre antivirus prétend toujours que calibre est un virus, alors, votre programme antivirus fait une erreur. Les programmes antivirus utilisent des technologies heuristiques, les modèles de code qui semblent suspicieux pour détecter les virus. C'est un peu comme le profilage racial. calibre est un produit entièrement open source. Vous pouvez réellement parcourir le code source vous-même (ou le faire faire par quelqu'un d’autre) pour vérifier que ce n'est pas un virus. Merci de signaler la faute d’identification à la companie où vous avez acheté votre logiciel antivirus. Si le programme antivirus vous empêche de télécharger/installer calibre, désactivez-le temporairement, installez calibre, puis réactivez-le.
sv: Om du har den officiella nedladdningen och antivirusprogrammet fortfarande hävdar calibre är ett virus är alltså felet antivirusprogrammet. Antivirusprogram använder heuristik, mönsterkod som "ser misstänkt" för att upptäcka virus. Det är ungefär som rasprofilering. calibre är en helt öppen källkodsprodukt. Du kan faktiskt bläddra i källkoden själv (eller anlita någon att göra det åt dig) för att kontrollera att det inte är ett virus. Vänligen rapportera falska identifiering till vad företaget du köper ditt antivirusprogram från. Om antivirusprogram hindrar dig från att ladda ner / installera calibre inaktivera det temporärt, installera calibre och sedan återaktivera det.

source: How do I backup calibre?
fr: Comment faire une sauvegarde de calibre ?
sv: Hur säkerhetskopierar calibre?

source: The most important thing to backup is the calibre library folder, that contains all your books and metadata. This is the folder you chose for your calibre library when you ran calibre for the first time. You can get the path to the library folder by clicking the calibre icon on the main toolbar. You must backup this complete folder with all its files and sub-folders.
fr: L’élément le plus important à sauvegarder est le dossier bibliothèque de calibre, qui contient tous vos livres et métadonnées. C'est le dossier que vous avez choisi pour votre bibliothèque calibre lors de l'exécution de calibre pour la première fois. Vous pouvez obtenir le chemin d'accès au dossier de la bibliothèque en cliquant sur l'icône calibre sur la barre d'outils principale. Vous devez sauvegarder ce dossier complet avec tous ses fichiers et sous-dossiers.
sv: Det viktigaste för att säkerhetskopiera är calibre-biblioteksmapp som innehåller alla dina böcker och metadata. Detta är den mapp du valde för din calibre-biblioteket när du körde calibre för första gången. Du kan få sökvägen till biblioteksmappen genom att klicka på calibre-ikonen på verktygslisten. Du måste säkerhetskopiera den här hel mapp med alla filer och undermappar.

source: You can switch calibre to using a backed up library folder by simply clicking the calibre icon on the toolbar and choosing your backup library folder. A backed up library folder backs up your custom columns and saved searches as well as all your books and metadata.
fr: Vous pouvez basculer calibre pour utiliser une bibliothèque sauvegardée en cliquant simplement sur l'icône calibre sur la barre d'outils et en sélectionnant le répertoire de sauvegarde de votre bibliothèque. Un dossier de sauvegarde de la bibliothèque conserve vos colonnes personnalisées, les recherches enregistrées ainsi que tous vos livres et métadonnées.
sv: Du kan växla calibre till att använda en säkerhetskopierad biblioteksmapp genom att klicka på calibre ikonen i verktygsfältet och välja din säkerhetskopierade biblioteksmapp. En säkerhetskopierad biblioteksmappen säkerhetskopierar dina egna kolumner och sparade sökningar samt alla dina böcker och metadata.

source: If you want to backup the calibre configuration/plugins, you have to backup the config directory. You can find this config directory via :guilabel:`Preferences->Miscellaneous`. Note that restoring configuration directories is not officially supported, but should work in most cases. Just copy the contents of the backup directory into the current configuration directory to restore.
fr: Si vous souhaitez sauvegarder les extensions de configuration calibre, vous devez sauvegarder le répertoire config. Vous pouvez trouver ce répertoire config via :guilabel:`Préférences->Divers`. Notez que la restauration des répertoires de configuration n'est pas officiellement supportée, mais devrait fonctionner dans la plupart des cas. Il suffit de copier le contenu du répertoire de sauvegarde dans le répertoire de configuration à restaurer.
sv: Om du vill säkerhetskopiera calibres konfigurations/tillägg, måste du säkerhetskopiera konfigurationskatalogen. Du hittar den här konfiguring mappen via :guilabel:`Inställningar->Diverse`. Observera att återställa konfigurationskataloger inte officiellt stöds, men bör fungera i de flesta fall. Bara kopiera innehållet i backup-katalogen i den aktuella konfigurationen katalogen att återställa.

source: How do I use purchased EPUB books with calibre (or what do I do with .acsm files)?
fr: Comment puis-je mettre des livres numériques EPUB achetés avec calibre (ou que dois-je faire avec les fichiers .acsm) ?
sv: Hur använder jag köpta EPUB-böcker med calibre (eller vad ska jag göra med .acsm filer)?

source: Most purchased EPUB books have `DRM <http://drmfree.calibre-ebook.com/about#drm>`_. This prevents calibre from opening them. You can still use calibre to store and transfer them to your ebook reader. First, you must authorize your reader on a windows machine with Adobe Digital Editions. Once this is done, EPUB books transferred with calibre will work fine on your reader. When you purchase an epub book from a website, you will get an ".acsm" file. This file should be opened with Adobe Digital Editions, which will then download the actual ".epub" ebook. The ebook file will be stored in the folder "My Digital Editions", from where you can add it to calibre.
fr: La plupart des livres EPUB achetés ont un `DRM <http://drmfree.calibre-ebook.com/about#drm>`_. Ceci empêche calibre de les ouvrir. Vous avez toujours la possibilité d’utiliser calibre pour stocker et transférer les livres sur votre liseuse. Tout d'abord, vous devez autoriser votre liseuse sur Windows avec le logiciel Adobe Digital Editions. Une fois cela fait, les livres EPUB transférés avcalibre fonctionneront sur votre liseuse. Lorsque vous achetez un livre EPUB sur un site Web, vous obtiendrez un fichier *.acsm*. Ce fichier doit être ouvert avec Adobe Digital Editions, qui téléchargera ensuite le livre sous format *.ePub*. Le fichier de livre numérique sera stocké dans le dossier "My Digital Editions", d'où vous pourrez l’ajouter à calibre.
sv: Mest köpta EPUB böcker har `DRM <http://drmfree.calibre-ebook.com/about#drm>` _. Detta förhindrar calibre från att öppna dem. Du kan fortfarande använda calibre att lagra och överföra dem till eboksläsare. Först måste du tillåta dina läsare på en Windows-maskin med Adobe Digital Editions. När detta är gjort, överförs EPUB böcker med calibre kommer att fungera bra på din läsare. När du köper en epub bok från en webbplats, kommer du att få en ".acsm" filen. Denna fil ska öppnas med Adobe Digital Editions, som sedan kommer att hämta själva ".epub" ebook. Den e-bokfilen sparas i mappen "Mina digitala upplagor", där du kan lägga till det till calibre.

source: I am getting a "Permission Denied" error?
fr: J’ai une erreur “accès refusé” ?
sv: Jag får ett "Permission Denied" fel?

source: A permission denied error can occur because of many possible reasons, none of them having anything to do with calibre.
fr: Une erreur d’accès refusé peut se produire pour de nombreuses raisons possibles, aucune n'ayant un rapport avec calibre.
sv: En tillståndsnekningsfel kan uppstå på grund av många möjliga orsaker, ingen av dem har något att göra med calibre.

source: You can get permission denied errors if you are using an SD card with write protect enabled.
fr: Vous pouvez obtenir des erreurs accès refusé si vous utilisez une carte SD avec protection en écriture activée.
sv: Du kan få tillståndsnekningsfel om du använder ett SD-kort med skrivskydd aktiverat.

source: If you, or some program you used changed the file permissions of the files in question to read only.
fr: Si vous, ou un certain programme que vous utilisez a changé les permissions en lecture seule sur les fichiers en question.
sv: Om du, eller något program du använde ändrat filrättigheter av filerna i fråga att bara läsas.

source: If there is a filesystem error on the device which caused your operating system to mount the filesystem in read only mode or mark a particular file as read only pending recovery.
fr: Si une erreur de système de fichier sur votre périphérique qui a amené votre système d'exploitation à monter le système de fichier en lecture seule ou marqué un fichier particulier comme étant en lecture seule pendant une restauration.
sv: Om det finns ett filsystemsfel på enheten som orsakade operativsystemet att montera filsystemet i skrivskyddat läge eller markera en viss fil som skrivskyddad för att återvinnas.

source: If the files have their owner set to a user other than you.
fr: Si les fichiers ont un utilisateur propriétaire autre que vous.
sv: Om filerna har sina ägare inställda till en annan användare än du .

source: If your file is open in another program.
fr: Si votre fichier est ouvert dans un autre programme.
sv: Om filen är öppen i ett annat program.

source: If the file resides on a device, you may have reached the limit of a maximum of 256 files in the root of the device. In this case you need to reformat the device/sd card referered to in the error message with a FAT32 filesystem, or delete some files from the SD card/device memory.
fr: Si le fichier se trouve sur un périphérique, vous avez atteint la limite d'un maximum de 256 fichiers à la racine du périphérique. Dans ce cas, vous devez reformater la carte SD de l'appareil avec un système de fichiers FAT32 ou supprimer des fichiers de la mémoire de la carte SD/du périphérique.
sv: Om filen finns på en enhet kan du ha nått gränsen för maximalt 256 filer i roten på enheten. I så fall måste du formatera om enheten / sd-kort som refererades i felmeddelandet med ett FAT32-filsystem, eller ta bort några filer från SD-kortet / enhetens minne.

source: You will need to fix the underlying cause of the permissions error before resuming to use calibre. Read the error message carefully, see what file it points to and fix the permissions on that file or its containing folders.
fr: Vous devez corriger la cause sous-jacente à l’accès refusé avant de reprendre l’utilisation de calibre. Lisez le message d'erreur avec soin, repérez le fichier en cause et rétablissez les permissions d’accès sur ce fichier ou sur les répertoires qui le contienne
sv: Du måste rätta till det underliggande orsaken till behörighetsfelen innan du fortsätter använda calibre. Läs felmeddelandet noggrant, se vilken fil det pekar på och fixa behörigheterna på den filen eller dess mappar.

source: Can I have the comment metadata show up on my reader?
fr: Puis-je avoir la métadonnée commentaire apparaître sur ma liseuse ?
sv: Kan jag få kommentarsmetadata att dyka upp på min läsare?

source: Most readers do not support this. You should complain to the manufacturer about it and hopefully if enough people complain, things will change. In the meantime, you can insert the metadata, including comments into a "Jacket page" at the start of the ebook, by using the option to "Insert metadata as page at start of book" during conversion. The option is found in the :guilabel:`Structure Detection` section of the conversion settings. Note that for this to have effect you have to *convert* the book. If your book is already in a format that does not need conversion, you can convert from that format to the same format.
fr: La plupart des liseuses ne supportent pas cela. Vous devriez vous plaindre auprès fabricant à ce sujet et j'espère que si suffisamment de gens se plaignent, les choses vont changer. En attendant, vous pouvez insérer des métadonnées, y compris des commentaires dans une "page jaquette" au début du livre numérique, en utilisant l'option "Insérer les métadonnées comme page au début du livre" durant la conversion. L'option se trouve dans la section :guilabel:`Détection de la Structure` des paramètres de conversion. Pour que cela ait un effet, vous devez *convertir* le livre. Si votre livre est déjà dans un format qui ne nécessite pas de conversion, vous pouvez convertir de ce format sur le même format.
sv: De flesta läsare stöder inte detta. Du ska klaga hos tillverkaren om det och förhoppningsvis om tillräckligt många klagar, kommer saker och ting förändras. Under tiden kan du infoga metadata, med kommentarer till en "skyddsomslagssida" i början av e-bok, genom att använda alternativet "Infoga metadata som sidan i början på boken" under konverteringen. Alternativet finns i :guilabel:`Strukturdetektion`-avsnittet av konverteringsinställningarna. Notera att för att detta ska gälla måste du *konvertera* boken. Om din bok är redan i ett format som inte behöver konvertering kan du konvertera från det formatet till samma format.

source: Another alternative is to create a catalog in ebook form containing a listing of all the books in your calibre library, with their metadata. Click-and-hold the convert button to access the catalog creation tool. And before you ask, no you cannot have the catalog "link directly to" books on your reader.
fr: Une autre alternative est de créer un catalogue sous forme de livre numérique contenant une liste de tous les livres dans votre bibliothèque calibre, avec leurs métadonnées. Cliquez et maintenez le bouton Convertir pour accéder à l'outil de création de catalogues. Et avant que vous demandiez, non, vous ne pouvez pas avoir le *lien direct vers* du catalogue aux livres sur votre liseuse.
sv: Ett annat alternativ är att skapa en katalog i e-boksform innehållande en lista på alla böcker i ditt calibre-bibliotek, med sina metadata. Klicka och håll knappen Konvertera för att komma åt skapa katalog verktyget. Och innan du frågar, nej du kan inte ha den "länken direkt till" sortiment böcker på din läsare.

source: How do I get calibre to use my HTTP proxy?
fr: Comment obtenir que calibre utilise mon proxy HTTP ?
sv: Hur får jag calibre att använda min HTTP-proxy?

source: By default, calibre uses whatever proxy settings are set in your OS. Sometimes these are incorrect, for example, on windows if you don't use Internet Explorer then the proxy settings may not be up to date. You can tell calibre to use a particular proxy server by setting the ``http_proxy`` environment variable. The format of the variable is: ``http://username:password@servername`` you should ask your network administrator to give you the correct value for this variable. Note that calibre only supports HTTP proxies not SOCKS proxies. You can see the current proxies used by calibre in Preferences->Miscellaneous.
fr: Par défaut, calibre utilise tous les paramètres de proxy définis dans votre OS. Parfois, ceux-ci sont incorrects, par exemple, sur Windows, si vous ne utilisez pas Internet Explorer alors les paramètres de proxy peuvent ne pas être à jour. Vous pouvez dire à calibre pour utiliser un serveur proxy notamment en réglant la variable d'environnement `` http_proxy``. Le format de la variable est : `` http://nomutilisateur:motdepasse@nomduserveur`` vous devriez demander à votre administrateur réseau de vous donner la valeur correcte pour cette variable. Notez que calibre ne prend en charge les proxies HTTP et non les proxies SOCKS. Vous pouvez voir les proxies actuellement utilisés par calibre dans Préférences->Divers.
sv: Som standard använder calibre uppsatta proxy-inställningar oavsett vad som ställs in i ditt operativsystem. Ibland är dessa felaktiga, till exempel på Windows om du inte använder Internet Explorer så kan det hända att proxy-inställningarna inte är uppdaterade. Du kan uppmana calibre att använda en viss proxyserver genom att ställa in ``http_proxy`` miljövariabel. Formatet på variabeln är: ``http://användarnamn:lösenord@servernamn`` du bör fråga din nätverksadministratör för att ge dig rätt värde för denna variabel. Observera att calibre bara stödjer HTTP-proxier inte SOCKS-proxy. Du kan se de aktuella proxier som används av kaliber i Inställningar->Diverse.

source: I want some feature added to calibre. What can I do?
fr: Je voudrais certaines fonctionnalités ajoutées à calibre. Que puis-je faire ?
sv: Jag vill ha lite funktionstilllägg i calibre. Vad kan jag göra?

source: You have two choices:
fr: Vous avez deux choix:
sv: Du har två val:

source: Create a patch by hacking on calibre and send it to me for review and inclusion. See `Development <http://calibre-ebook.com/get-involved>`_.
fr: Créer un patch en bidouillant calibre et me l'envoyer pour examen et inclusion. Voir `Développement <http://calibre-ebook.com/get-involved>`_.
sv: Skapa en lösning genom att hacka på calibre och skicka det till mig för granskning och inkludering. Se `Development <http://calibre-ebook.com/get-involved>`_.

source: `Open a bug requesting the feature <http://calibre-ebook.com/bugs>`_ . Remember that while you may think your feature request is extremely important/essential, calibre developers might not agree. Fortunately, calibre is open source, which means you always have the option of implementing your feature yourself, or hiring someone to do it for you. Furthermore, calibre has a comprehensive plugin architecture, so you might be able to develop your feature as a plugin, see :ref:`pluginstutorial`.
fr: `Ouvrir un bug demandant la fonctionnalité <http://calibre-ebook.com/bugs>`_ . Rappelez-vous que même si vous pensez que votre demande de fonctionnalité est extrêmement importante/essentielle, les développeurs de calibre peuvent ne pas être d'accord. Heureusement, calibre est open source, ce qui signifie que vous avez toujours la possibilité de mettre en œuvre votre fonction vous-même, ou d'embaucher quelqu'un pour le faire pour vous. En outre, calibre a une architecture d'extension compréhensive, vous devriez donc être en mesure de développer votre fonctionnalité en tant qu'extension, voir :ref:`pluginstutorial`.
sv: `Öppna en bugg som begär funktionen <http://calibre-ebook.com/bugs>` _. Kom ihåg att även om du tror att din funktion förfrågan är oerhört viktigt / mycket viktigt, calibre-utvecklare kanske inte håller med. Lyckligtvis är calibre öppen källkod, vilket innebär att du alltid har möjlighet att genomföra din funktion själv, eller anställa någon att göra det åt dig. Vidare calibre har en omfattande tilläggsarkitektur, så du kanske kan utveckla din funktion som ett tillägg, se :ref:`pluginstutorial`.

source: Why doesn't calibre have an automatic update?
fr: Pourquoi calibre n’a pas de mise à jour automatique ?
sv: Varför har inte calibre en automatisk uppdatering?

source: For many reasons:
fr: Pour de nombreuses raisons :
sv: För många orsaker:

source: *There is no need to update every week*. If you are happy with how calibre works turn off the update notification and be on your merry way. Check back to see if you want to update once a year or so. There is a check box to turn off the update notification, on the update notification itself.
fr: *Il n'est pas nécessaire de mettre à jour chaque semaine*. Si vous êtes satisfait du fonctionnement de calibre, désactivez la notification de mise à jour. Revenez vérifier pour voir si vous voulez mettre à jour une fois par an ou plus. Il y a une case à cocher pour désactiver la notification de mise à jour, sur la notification de mise à jour elle-même.
sv: *Det finns ingen anledning att uppdatera varje vecka*. Om du är nöjd med hur calibre kör stäng av anmälan om uppdateringen och vara på god väg. Återkom för att se om du vill uppdatera en gång om året eller så. Det finns en kryssruta för att stänga av uppdateringsmeddelandet, på själva uppdateringsanmälan.

source: calibre downloads currently use `about 100TB of bandwidth a month <http://calibre-ebook.com/dynamic/downloads>`_. Implementing automatic updates would greatly increase that and end up costing thousands of dollars a month, which someone has to pay.
fr: Les téléchargements de calibre utilisent actuellement `environ 100 To de bande passante par mois <http://calibre-ebook.com/dynamic/downloads>`_. L'implémentation des mises à jour automatiques augmenterait considérablement cela et cela finirait par coûter des milliers de dollars par mois, que quelqu'un devrait payer.
sv: calibre-nedladdningar använder idag `omkring 100TB bandbredd per månad <http://calibre-ebook.com/dynamic/downloads>`_. Implementera automatiska uppdateringar skulle kraftigt öka det och resulltera kostnad på tusentals dollar i månaden, vilket någon måste betala.
