Repository: Easonqsp/calibre-translations
Catalog: manual/*/gui.po
Languages: de, sv

source: |stdi| The :guilabel:`Send to device` action has eight variations, accessed by doing a right-click on the button.
de: |stdi| Die Aktion :guilabel:`An Reader senden` hat acht Variationen, die mit einem Rechtsklick auf die Schaltfläche aufgerufen werden können.
sv: |stdi| :guilabel:`Skicka till enhet` åtgärden har åtta variationer, som nås genom att göra ett högerklick på knappen.

source: **Send to main memory**: The selected books are transferred to the main memory of the ebook reader.
de: **An Hauptspeicher senden**: Die ausgewählten Bücher werden in den Hauptspeicher des eBook-Readers übertragen.
sv: **Skicka till huvudminne**: De utvalda böckerna överförs till huvudminnet av e-bokläsaren.

source: **Send to card (A)**: The selected books are transferred to the storage card (A) on the ebook reader.
de: **An Speicherkarte (A) senden**: Die ausgewählten Bücher werden auf die Speicherkarte (A) des eBook-Readers übertragen.
sv: **Skicka till minneskortet (A)**: De utvalda böckerna överförs till minneskortet (A) på e-bokläsaren.

source: **Send to card (B)**: The selected books are transferred to the storage card (B) on the ebook reader.
de: **An Speicherkarte (B) senden**: Die ausgewählten Bücher werden auf die Speicherkarte (B) des eBook-Readers übertragen.
sv: **Skicka till minneskortet (B)**: De utvalda böckerna överförs till minneskortet (B) på e-bokläsaren.

source: **Send specific format to**: The selected books are transferred to the selected storage location on the device, in the format that you specify.
de: **Ein bestimmtes Format senden an**: Die ausgewählten Bücher werden an den ausgewählten Speicherort des eBook-Readers im angegeben Format übertragen.
sv: **Skicka specifikt format till**: De utvalda böckerna överförs till vald plats på enheten, i det format som du anger.

source: **Eject device**: Detaches the device from calibre.
de: **Gerät auswerfen**: trennt das Gerät von calibre und meldet den eBook-Reader sicher vom Computer ab.
sv: **Mata ut enhet**: Kopplar bort enheten från calibre.

source: **Set default send to device action**: Allows you to specify which of the options, 1 through 5 above or 7 below, will be the default action when you click the main button.
de: **Geben Sie die voreingestellte Übertragungsart an**: Sie können angeben, welche der Optionen, 1 bis 5 oben oder 7 unten, die Standard-Aktion sein soll, wenn Sie auf die Schaltfläche An Reader senden klicken.
sv: **Sätt som standard att skicka till enhet**: Här kan du ange vilket av alternativen, 1 till 5 ovan eller 7 nedan, kommer att vara standardåtgärd när du klickar på huvudknappen.

source: **Send and delete from library**: The selected books are transferred to the selected storage location on the device and then **deleted** from the Library.
de: **Übertragen und aus der Bibliothek löschen**: Die ausgewählten Bücher werden an den ausgewählten Speicherort des eBook-Readers übertragen und dann aus der Bibliothek **gelöscht**.
sv: **Skicka och radera från biblioteket**: De utvalda böckerna överförs till vald plats på enheten och sedan **raderas** från biblioteket.

source: **Fetch Annotations (experimental)**: Transfers annotations you may have made on an ebook on your device to the comments metadata of the book in the calibre library.
de: **Anmerkungen abrufen (experimentell)**: Überträgt die Anmerkungen, die Sie vielleicht im eBook auf ihrem eBook-Reader gemacht haben, an die Kommentar-Metadaten des Buchs in der calibre-Bibliothek.
sv: **Hämta anteckningar (experimentellt)**: Överför anteckningar du kan ha gjort på en e-bok på din enhet till kommentarsmetadata av boken i calibre-biblioteket.

source: You can control the file name and folder structure of files sent to the device by setting up a template in :guilabel:`Preferences->Import/Export->Sending books to devices`. Also see :ref:`templatelangcalibre`.
de: Sie können Dateinamen und Ordner-Strukturen der Dateien, die an das Gerät gesendet werden, durch die Einrichtung einer Vorlage in :guilabel:`Einstellungen ->Import/Export ->Bücher auf Geräte übertragen` steuern. Siehe auch :ref:`templatelangcalibre`.
sv: Du kan kontrollera filnamnet och mappstruktur med filer som skickas till enheten genom att sätta upp en mall i :guilabel:`Inställningar->Import/Export->Skickar böcker till enheter`. Se också :ref:`templatelangcalibre`.

source: Fetch news
de: Nachrichten abrufen
sv: Hämta nyheter

source: |fni| The :guilabel:`Fetch news` action downloads news from various websites and converts it into an ebook that can be read on your ebook reader. Normally, the newly created ebook is added to your ebook library, but if an ebook reader is connected at the time the download finishes, the news is also uploaded to the reader automatically.
de: |fni| Die Aktion :guilabel:`Nachrichten herunterladen` lädt Nachrichten von verschiedenen Websites und konvertiert diese zu einem eBook, dass auf Ihrem eBook-Reader gelesen werden kann. Normalerweise wird das neu erstellte eBook Ihrer eBook-Bibliothek hinzugefügt. Wenn jedoch ein eBook-Reader verbunden ist und der Download zu diesem Zeitpunkt beendet wurde, werden die Nachrichten automatisch an den eBook-Reader übertragen, sofern dies eingestellt wurde.
sv: |fni| :guilabel:`Hämta nyheter` åtgärden hämtar nyheter från olika webbplatser och omvandlar de till en e-bok som kan läsas på din e-bokläsare. Normalt är att den nyskapade e-boken läggs till ditt e-bokbibliotek, men om en e-bokläsare är ansluten vid den tidpunkt då nedladdningen är klar, laddas nyheten också upp till läsaren automatiskt.

source: The :guilabel:`Fetch news` action uses simple recipes (10-15 lines of code) for each news site. To learn how to create recipes for your own news sources, see :ref:`news`.
de: Die Aktion :guilabel:`Nachrichten herunterladen` verwendet einfache Schemata (10-15 Zeilen Code) für jede Nachrichten-Webseite. Für weitere Informationen zur Erstellung von Schemata für eigene Nachrichten-Quellen lesen Sie bitte das Tutorial zum :ref:`news`.
sv: :guilabel:`Hämta nyheter` åtgärden använder enkla recept (10-15 rader kod) för varje nyhetsplats. Om du vill veta hur du skapar recept för dina egna nyhetskällor, se :ref:`news`.

source: The :guilabel:`Fetch news` action has three variations, accessed by doing a right-click on the button.
de: Die Aktion :guilabel:`Nachrichten herunterladen` hat drei Variationen, die mit einem Rechtsklick auf die Schaltfläche aufgerufen werden können.
sv: :guilabel:`Hämta nyheter` åtgärden har tre varianter, som nås genom att göra ett högerklick på knappen.

source: **Schedule news download**: Allows you to schedule the download of of your selected news sources from a list of hundreds available. Scheduling can be set individually for each news source you select and the scheduling is flexible allowing you to select specific days of the week or a frequency of days between downloads.
de: **Zeitgesteuertes Herunterladen von Nachrichten**: Sie können den Download ausgewählter Nachrichtenquellen aus einer Liste von Hunderten verfügbarer auswählen und zeitlich planen. Die Planung kann individuell für jede ausgewählte Nachrichtenquelle flexibel eingestellt werden, sodass Sie bestimmte Tage der Woche oder eine Frequenz von Tagen zwischen den Downloads wählen können.
sv: **Schemalägg nyhetshämtning**: Låter dig schemalägga nedladdningen av dina utvalda nyhetskällor från en lista med hundratals tillgängliga. Schemaläggning kan ställas in individuellt för varje nyhetskälla du väljer och schemaläggning är flexibel så att du kan välja specifika veckodagar eller en frekvens av dagar mellan hämtningar.

source: **Add a custom news source**: Allows you to create a simple recipe for downloading news from a custom news site that you wish to access. Creating the recipe can be as simple as specifying an RSS news feed URL, or you can be more prescriptive by creating Python-based code for the task. For more information see :ref:`news`.
de: **Neue individuelle Nachrichtenquelle hinzufügen**: Sie können ein einfaches Schema zum Herunterladen von Nachrichten aus einer benutzerdefinierten Nachrichten-Website, auf die Sie zugreifen möchten, erstellen. Ein Schema zu erstellen ist im einfachsten Fall die Angabe einer URL-Feed-Adresse der gewünschten RSS-Nachrichtenquelle oder ein selbsterstellter Python-basierter Programmcode für diese Aufgabe. Weitere Informationen finden Sie unter :ref:`news`.
sv: **Lägg till en anpassad nyhetskälla**: Gör att du kan skapa ett enkelt recept för nedladdning av nyheter från en egen nyhetsplats som du vill komma åt. Skapa recept kan vara så enkelt som att ange en RSS-flödes-URL, eller så kan du vara mer normativ genom att skapa Python-baserad kod för uppgiften. För mer information se :ref:`news`.

source: **Download all scheduled news sources**: Causes calibre to immediately begin downloading all news sources that you have scheduled.
de: **Alle aktivierten Nachrichtenquellen herunterladen**: Veranlasst calibre sofort mit downloaden aller geplanten Nachrichtenquellen zu beginnen.
sv: **Ladda ner alla schemalagda nyhetskällor**: Får calibre att omedelbart börja ladda ner alla nyhetskällor som du har schemalagt.

source: Library
de: Bibliothek
sv: Bibliotek

source: |lii| The :guilabel:`Library` action allows you to create, switch between, rename or remove a Library. calibre allows you to create as many libraries as you wish. You could, for instance, create a fiction library, a non-fiction library, a foreign language library, a project library, or any structure that suits your needs. Libraries are the highest organizational structure within calibre. Each library has its own set of books, tags, categories and base storage location.
de: |lii| Die Aktion :guilabel:`Bibliothek` ermöglicht es, eine Bibliothek zu erstellen, zwischen ihnen zu wechseln, deren Name zu verändern oder sie zu löschen. In calibre können Sie beliebig viele Bibliotheken erstellen. Sie können Bibliotheken nach beliebigen Kriterien, wie z. B. Belletristik-, Sachbuch-, Fremdsprachen-, Projektbibliothek erstellen oder nach jeder beliebigen anderen Strukturen definieren. Bibliotheken sind die höchsten Organisationsstrukturen innerhalb calibre. Jede Bibliothek hat seine eigenen Bücher, Tags, Kategorien und Speicherort.
sv: |lii| :guilabel:`BIbliotek` åtgärden låter dig skapa, växla mellan, byta namn på eller ta bort ett bibliotek. calibre ger dig möjlighet att skapa så många bibliotek som du vill. Du kan till exempel skapa ett skönlitterärtbibliotek, ett faktabibliotek, ett bibliotek för främmande språk, ett projektbibliotek, eller någon struktur som passar dina behov. Biblioteken är den högsta organisationsstrukturen inom calibre. Varje bibliotek har sin egen uppsättning av böcker, etiketter, kategorier och lagringsplatsbas.

source: **Switch/create library...**: Allows you to; a) connect to a pre-existing calibre library at another location, b) create an empty library at a new location or, c) move the current library to a newly specified location.
de: **Bibliothek wechseln/neu erstellen ...**: Ermöglicht es: a) eine bereits vorhandene Bibliothek von einem anderen Ort in calibre einzubinden, b) eine leere Bibliothek an einem neuen Speicherort zu erstellen oder c) eine aktuelle Bibliothek zu einem neuen Speicherort zu verschieben.
sv: **Byt/skapa bibliotek...**: Låter dig; a) ansluta till ett befintligt calibre-bibliotek på en annan plats, b) skapa ett tomt biblioteket på en ny plats eller, c) flytta nuvarande biblioteket till en nyligen angiven plats.

source: **Quick switch**: Allows you to switch between libraries that have been registered or created within calibre.
de: **Schneller Wechsel**: Ermöglicht das Umschalten zwischen Bibliotheken, die in calibre erstellt oder eingebunden wurden.
sv: **Snabb växling**: Låter dig växla mellan bibliotek som har registrerats eller skapats inom calibre.

source: **Rename library**: Allows you to rename a Library.
de: **Bibliothek umbenennen**: Ermöglicht die Umbenennung einer Bibliothek.
sv: **Byt namn på bibliotek**: Låter dig byta namn på ett bibliotek.

source: **Delete library**: Allows you to unregister a library from calibre.
de: **Bibliothek entfernen**: Ermöglicht das Abmelden einer eingebundenen Bibliothek aus calibre.
sv: **Ta bort bibliotek**: Låter dig avregistrera ett bibliotek från calibre.

source: **<library name>**: Actions 5, 6 etc... give you immediate switch access between multiple libraries that you have created or attached to. This list contains only the 5 most frequently used libraries. For the complete list, use the Quick Switch menu.
de: **<Bibliotheksnamen>**: Mit den Aktionen 5, 6 usw. erhält man einen Schnellzugriff auf erstellte bzw. eingebundene Bibliotheken, um zwischen diesen zu wechseln. Die Liste enthält nur die 5 am häufigsten verwendeten Bibliotheken. Der Zugriff auf die vollständige Liste erfolgt über den Menüpunkt Schneller Wechsel.
sv: **<biblioteksnamn>**: Åtgärder 5, 6 osv ... ger dig omedelbar övergång tillgång mellan flera bibliotek som du har skapat eller bifogas. Denna lista innehåller endast de fem mest använda bibliotek. För den kompletta listan, använd "Snabb växling"-menyn.

source: **Library maintenance**: Allows you to check the current library for data consistency issues and restore the current library's database from backups.
de: **Wartung der Bibliothek**: Ermöglicht die Überprüfung der Datenintegrität der aktuellen Bibliothek und die Wiederherstellung von Metadaten der aktuellen Bibliotheksdatenbank aus der internen Metadatensicherung.
sv: **Biblioteksunderhåll**: Låter dig kontrollera det aktuella biblioteket för datakonsistens och återställa den nuvarande bibliotekets databas från säkerhetskopior.

source: Metadata about your ebooks, e.g. title, author, and tags, is stored in a single file in your calibre library folder called metadata.db. If this file gets corrupted (a very rare event), you can lose the metadata. Fortunately, calibre automatically backs up the metadata for every individual book in the book's folder as an OPF file. By using the Restore database action under Library Maintenance described above, you can have calibre rebuild the metadata.db file from the individual OPF files for you.
de: Die Metadaten aller Bücher, wie z. B. Titel, Autor und Schlagworte, werden innerhalb der calibre-Bibliothek in der Datei metadata.db gespeichert. Wenn diese Datei beschädigt wird, können Metadaten verloren gehen (ein sehr seltenes Ereignis). Zum Glück steht calibre in diesem Fall eine automatische Sicherung der Metadaten für jedes einzelne Buch in dessen Ordner als OPF-Datei zur Verfügung. Über die zuvor beschriebene Aktion Bibliothek wiederherstellen im Bereich Wartung kann mithilfe der einzelnen OPF-Dateien die Datei metadata.db wiederhergestellt werden.
sv: Metadata för dina e-böcker, t.ex. titel, författare, och etiketter, lagras i en enda fil i din calibre-biblioteksmapp som heter metadata.db. Om filen blir korrupt (mycket ovanligt), kan du förlora metadata. Lyckligtvis säkerhetskopierar calibre automatiskt metadata för varje enskild bok i bokens mapp som en OPF-fil. Genom att använda "Återställ databas"-åtgärden enligt Biblioteksunderhåll som beskrivs ovan, kan du låta calibre återskapa metadata.db filen från de enskilda OPF-filer åt dig.

source: You can copy or move books between different libraries (once you have more than one library setup) by right clicking on the book and selecting the action :guilabel:`Copy to library`.
de: Bücher können zwischen verschiedenen Bibliotheken durch Rechtsklick auf das Buch und Auswahl der Aktion :guilabel:`In Bibliothek kopieren` kopiert oder verschoben werden (sobald Sie mehr als eine Bibliothek erstellt oder eingebunden haben).
sv: Du kan kopiera eller flytta böcker mellan olika bibliotek (när du har mer än ett bibliotek uppsatt) genom att högerklicka på boken och välja åtgärd :guilabel:`Kopiera till bibliotek`.

source: Device
de: Gerät
sv: Enhet

source: |dvi| The :guilabel:`Device` action allows you to view the books in the main memory or storage cards of your device, or to eject the device (detach it from calibre). This icon shows up automatically on the main calibre toolbar when you connect a supported device. You can click on it to see the books on your device. You can also drag and drop books from your calibre library onto the icon to transfer them to your device. Conversely, you can drag and drop books from your device onto the library icon on the toolbar to transfer books from your device to the calibre library.
de: |dvi| Die Aktion :guilabel:`Gerät` ermöglicht die Anzeige von Bücher, die sich im Hauptspeicher oder auf integrierten Speicherkarten befinden oder die Möglichkeit das Gerät auszuwerfen (von calibre und Computer sicher trennen). Dieses Symbol wird automatisch in der Hauptwerkzeugleiste von calibre angezeigt, sobald ein unterstütztes Gerät angeschlossen wird. Wenn mehrere Speicher im Gerät vorhanden sind, werden mehrere Symbole angezeigt. Klicken Sie auf das Symbol, um die im Gerät gespeicherten Bücher zu sehen. Sie können auch mit der Maus Bücher aus Ihrer calibre-Bibliothek auf das Symbol ziehen, um sie auf Ihr Gerät übertragen. Umgekehrt können Sie Bücher vom Gerät auf das Bibliothekssymbol in der Symbolleiste ziehen, um Bücher von Ihrem Gerät in die calibre-Bibliothek zu übertragen.
sv: |dvi| :guilabel:`Enhet` åtgärden låter dig visa böckerna i huvudminnet eller minneskort för enheten, eller att mata ut enheten (ta bort den från calibre). Denna ikon visas automatiskt upp på calibres huvudverktygsfält när du ansluter en enhet som stöds. Du kan klicka på den för att se böckerna på enheten. Du kan också dra och släppa böcker från ditt calibre-biblioteket till ikonen för att överföra dem till enheten. Omvänt kan du dra och släppa böcker från din enhet till symbolbiblioteket i verktygsfältet för att överföra böcker från din enhet till calibre-biblioteket

source: Save to disk
de: Auf Festplatte speichern
sv: Spara till disk

source: |svdi| The :guilabel:`Save to disk` action has five variations, accessed by doing a right-click on the button.
de: |svdi| Die Aktion :guilabel:`auf Festplatte speichern` hat fünf Variationen, die durch Rechtsklick auf die Schaltfläche abgerufen werden können.
sv: |svdi| :guilabel:`Spara till disk` åtgärden har fem varianter, som nås genom att göra ett högerklick på knappen.

source: **Save to disk**: Saves the selected books to disk organized in directories. The directory structure looks like::
de: **Auf Festplatte speichern**: Speichert die ausgewählten Bücher in einer Verzeichnisstruktur auf den Datenträger. Die Verzeichnisstruktur sieh folgendermaßen aus::
sv: **Spara till disk**: Sparar de markerade böckerna organiserade i kataloger till disk. Katalogstrukturen ser ut som::

source: You can control the file name and folder structure of files saved to disk by setting up a template in :guilabel:`Preferences->Import/Export->Saving books to disk`. Also see :ref:`templatelangcalibre`.
de: Sie können Dateinamen und Ordner-Strukturen der Dateien, die auf die Festplatte gespeichert werden, durch die Einrichtung einer Vorlage in :guilabel:` Einstellungen ->Import/Export ->Bücher auf Datenträger speichern` steuern. Siehe hierzu :ref:`templatelangcalibre`.
sv: Du kan kontrollera filnamnet och mappstruktur med filer som sparas till disk genom att sätta upp en mall i :guilabel:`Inställningar->Import/Export->Spara böcker till disk`. Se också :ref:`templatelangcalibre`.

source: **Save to disk in a single directory**: Saves the selected books to disk in a single directory.
de: **Auf Festplatte in ein einziges Verzeichnis speichern**: Speichert die ausgewählten Bücher in ein einzelnes Verzeichnis der Festplatte.
sv: **Spara till disk i en enda katalog**: Sparar de markerade böckerna till disk i en enda katalog.

source: For 1. and 2., all available formats, as well as metadata, are stored to disk for each selected book. Metadata is stored in an OPF file. Saved books can be re-imported to the library without any loss of information by using the :ref:`Add books <add_books>` action.
de: Für 1. und 2. werden für jedes ausgewählte Buch alle verfügbaren Formate sowie Metadaten auf der Festplatte gespeichert. Metadaten werden in einer OPF-Datei gespeichert. Gespeicherte Bücher können erneut ohne Verlust an Informationen in die Bibliothek mithilfe der Aktion :ref:`Bücher hinzufügen <add_books>` importiert werden.
sv: För 1. och 2., alla tillgängliga format, samt metadata lagras på disk för varje vald bok. Metadata lagras i en OPF-fil. Sparade böcker kan återimporteras till biblioteket utan förlust av information genom att använda :ref:`Lägg till böcker <add_books>` åtgärd.

source: **Save only *<your preferred>* format to disk**: Saves the selected books to disk in the directory structure as shown in (1.) but only in your preferred ebook format. You can set your preferred format in :guilabel:`Preferences->Behaviour->Preferred output format`
de: **Nur das *<bevorzugte Format>* auf Festplatte speichern**: Speichert die ausgewählten Bücher in Verzeichnisstruktur, wie unter (1.) beschrieben, auf Festplatte – jedoch nur im bevorzugten Format des eBooks. Das bevorzugte Format wird unter :guilabel:`Einstellungen ->Benutzeroberfläche ->Verhalten ->Bevorzugtes Ausgabe-Format` festgelegt.
sv: **Spara bara *<ditt önskade>*-format på disk**: Sparar de markerade böckerna till disk i katalogstrukturen som visas i (1) men bara i önskat e-bokformat. Du kan ställa din favorit format i :guilabel:`Inställningar->Beteende->Önskat utformat`

source: **Save only *<your preferred>* format to disk in a single directory**: Saves the selected books to disk in a single directory but only in your preferred ebook format. You can set your preferred format in :guilabel:`Preferences->Behaviour->Preferred output format`
de: **Nur das *<bevorzugte Format>* in ein einzelnes Verzeichnis auf der Festplatte speichern**: Speichert die ausgewählten Bücher in ein einzelnes Verzeichnis auf die Festplatte, jedoch nur im bevorzugten Format des eBooks. Das bevorzugte Format wird unter :guilabel:`Einstellungen ->Benutzeroberfläche ->Verhalten ->Bevorzugtes Ausgabe-Format` festgelegt.
sv: **Spara bara *<ditt önskade>* format till disk i en enda katalog**: Sparar de markerade böckerna till din hårddisk i en enda katalog men bara på ditt önskade e-bokformat. Du kan ställa din favorit format i :guilabel:`Inställningar->Beteende->Önskat utformat`

source: **Save single format to disk...**: Saves the selected books to disk in the directory structure as shown in (1.) but only in the format you select from the pop-out list.
de: **Einzelnes Format auf Festplatte speichern ...**: Speichert die ausgewählten Bücher in der Verzeichnisstruktur Platte, siehe (1) - jedoch nur das ausgewählte Format aus der angezeigten Auswahlliste.
sv: **Spara ett enstaka format till disk ...**: Sparar de markerade böckerna till disk i katalogstrukturen som visas i (1) men bara i det format du väljer från rullgardinlistan.

source: Connect/Share
de: Verbinden/Teilen
sv: Anslut/dela ut

source: |csi| The :guilabel:`Connect/Share` action allows you to manually connect to a device or folder on your computer. It also allows you to set up you calibre library for access via a web browser or email.
de: |csi| Die Aktion :guilabel:`Verbinden/Teilen` ermöglicht die Herstellung einer manuellen Verbindung zu einem Gerät oder Ordner auf Ihrem Computer. Außerdem können Sie den Zugriff auf Ihre calibre Bibliothek über einen Web-Browser oder E-Mail einrichten.
sv: |csi| :guilabel:`Anslut/dela ut` åtgärden låter dig ansluta manuellt till en enhet eller mapp på datorn. Det gör också att du kan ställa in ditt calibre-bibliotek för åtkomst via en webbläsare eller e-post.
