Repository: Easonqsp/calibre-translations
Catalog: manual/*/gui.po
Languages: de, sv

source: Sometimes you want to to select a book and quickly get a list of books with the same value in some category (authors, tags, publisher, series, etc) as the currently selected book, but without changing the current view of the library. You can do this with Quickview. Quickview opens a second window showing the list of books matching the value of interest.
de: Manchmal wählt man ein Buch aus und möchte schnell eine Liste von Büchern mit dem gleichen Wert einer Kategorie (Autoren, Schlagwörter, Verlag, Reihe, usw.) angezeigt bekommen, wie das aktuell ausgewählte Buch und ohne die aktuelle Ansicht in der Bibliothek ändern zu müssen. Hierzu kann man die Schnellansicht verwenden. Die Schnellansicht öffnet ein zweites Fenster mit einer Liste der Bücher, die dem interessierten Wert entsprechen.
sv: Ibland vill du välja en bok och snabbt få en lista över böcker med samma värde i någon kategori (författare, etiketter, förläggare, serier, etc) som den markerade boken, men utan att ändra den aktuella vyn av biblioteket. Du kan göra detta med Snabbvisning. Snabbvisning öppnar ett andra fönster som visar en lista med böcker som passar värdet av intresse.

source: For example, assume you want to see a list of all the books with the same author of the currently-selected book. Click in the author cell you are interested in and press the 'Q' key. A window will open with all the authors for that book on the left, and all the books by the selected author on the right.
de: Nehmen wir beispielsweise an, Sie möchten eine Liste aller Bücher des gleichen Autors eines aktuell ausgewählten Buches sehen. Klicken Sie hierzu in die Autoren-Zelle des Autors und drücken dann die Taste "Q". Es öffnet sich ein Fenster mit allen Autoren für dieses Buch auf der linken Seite und deren Bücher auf der rechten Seite.
sv: Antag till exempel att du vill se en lista med alla böcker med samma författare till den för tillfället valda boken. Klicka i författarens cell du är intresserad av och tryck på "Q"-tangenten. Ett fönster öppnas med alla författare för det verket till vänster, och alla böcker av den valda författaren till höger.

source: Some example Quickview usages: quickly seeing what other books:
de: Einige Beispiele zur Schnellansicht: Schnell sehen, welche anderen Bücher:
sv: Några exempel på snabbvisningsanvändning: snabbt se vad andra böcker:

source: have some tag that is applied to the currently selected book,
de: haben einige der Schlagwörter, die das aktuell ausgewählte Buch besitzt,
sv: har någon etikett som tillämpas på den markerade boken,

source: are in the same series as the current book
de: haben die gleiche Serie, wie das aktuelle Buch,
sv: är i samma serie som aktuell bok

source: have the same values in a custom column as the current book
de: haben die gleichen Werte einer benutzerdefinierten Spalte wie das aktuelle Buch,
sv: har samma värden i en anpassad kolumn som den aktuella boken

source: are written by one of the same authors of the current book
de: wurden von einem der gleichen Autoren wie vom aktuellen Buch geschieben,
sv: är skriven av en av samma författare till den aktuella boken

source: without changing the contents of the library view.
de: ohne den Inhalt der Bibliotheksansicht ändern.
sv: utan att ändra innehållet i biblioteksvyn.

source: The Quickview window opens on top of the calibre window and will stay open until you explicitly close it. You can use Quickview and the calibre library view at the same time. For example, if in the calibre library view you click on a category column (tags, series, publisher, authors, etc) for a book, the Quickview window contents will change to show you in the left-hand side pane the items in that category for the selected book (e.g., the tags for that book). The first item in that list will be selected, and Quickview will show you on the right-hand side pane all the books in your library that reference that item. Click on an different item in the left-hand pane to see the books with that different item.
de: Das Schnellansicht-Fenster öffnet sich über dem calibre Fenster und bleibt geöffnet, bis Sie es explizit schließen. Die Schnellansicht und die calibre Bibliotheksansicht können zur gleichen Zeit benutzt werden. Beispielsweise können Sie in der calibre Bibliotheksansicht auf eine Kategorie-Spalte (Schlagworte, Serie, Verleger, Autoren, usw.) für ein Buch klicken und in der Schnellansicht ändert sich der Fensterinhalt auf der linken Seite passend zum Kategorie-Eintrag des ausgewählten Buchs (z. B. für die Schlagworte zu diesem Buch). Das erste Element in der Liste ist automatisch ausgewählt und die Schnellansicht zeigt im rechten Seitenbereich alle Bücher in Ihrer Bibliothek, die auf dieses Element verweisen. Klicken Sie auf ein anderes Element im linken Bereich und es werden alle Bücher passend zu diesem Element angezeigt.
sv: Snabbvisningsfönstret öppnas ovanpå calibre och håller öppet tills du explicit stänger det. Du kan använda snabbvisning och calibres biblioteksvy samtidigt. Till exempel, om du i calibres biblioteksvy klickar på en kategorikolumn (etiketter, serier, utgivare, författare, etc.) för en bok, kommer fönsterinnehållet snabbvisningen ändras till att visa dig i den vänstra sidopanelen objekten i den kategori för den valda boken (t.ex. etiketter för det verket). Den första posten i denna lista kommer att väljas ut, och snabbvisning kommer att visa dig på den högra sidopanelen alla böcker i biblioteket som refererar den posten. Klicka på en annan post i den vänstra rutan för att se böckerna med att olika objekt.

source: Double-click on a book in the Quickview window to select that book in the library view. This will also change the items display in the QuickView window(the left-hand pane) to show the items in the newly-selected book.
de: Ein Doppelklick auf ein Buch im Fenster der Schnellansicht bewirkt die Auswahl des Buchs in der Bibliotheksansicht. Dies aktualisiert auch die angezeigten Elemente im Fenster der Schnellansicht (im linken Teilfenster) passend zu den Elementen des neu ausgewählten Buchs.
sv: Dubbelklicka på en bok i snabbvisningsfönstret för att välja den bok i biblioteksvyn. Detta kommer också ändra poster som visas i snabbvisningsfönstret (det vänstra fönstret) för att visa objekten i den nyligen valda boken.

source: Shift- (or Ctrl-) double-click on a book in the Quickview window to open the edit metadata dialog on that book in the calibre window.
de: Umschalt+ (oder Strg+) Doppelklick auf ein Buch im Fenster der Schnellansicht öffnen den Dialog Metadaten bearbeiten für dieses Buch im calibre Fenster.
sv: Skift- (eller Ctrl-) dubbelklicka på en bok i snabbvisningsfönstret för att öppna dialogrutan för att redigera metadata för boken i calibre-fönstret.

source: You can see if a column can be Quickview'ed by hovering your mouse over the column heading and looking at the tooltip for that heading. You can also know by right-clicking on the column heading to see of the "Quickview" option is shown in the menu, in which case choosing that Quickview option is equivalent to pressing 'Q' in the current cell.
de: Ob eine Schnallansicht für eine Spalte besteht wird im Tool-Tipp der Spaltenanzeige angegeben, wenn man den Mauszeiger über die Spaltenüberschriften bewegt. Ebenfalls kann man dies durch einen Rechtsklick auf die Spaltenüberschrift und der auswählbaren Menüoption "Schnellansichtsspalten" erkennen. Wird diese ausgewählt, entspricht diese Option der Schnellansicht durch Drücken von "Q" in der aktuellen Zelle.
sv: Du kan se om en kolumn kan snabbvisas genom att hålla musen över kolumnrubriken och tittar på verktygstips för denna rubrik. Du kan också veta genom att högerklicka på kolumnrubriken för att se om "Snabbvisnings" alternativet visas i menyn, i vilket fall välja att snabbvisningsalternativet motsvarar att trycka "Q" i den aktuella cellen.

source: Quickview respects the virtual library setting, showing only books in the current virtual library.
de: Die Schnellansicht respektiert die Einstellungen der virtuellen Bibliothek und zeigt nur Bücher aus der aktuellen virtuellen Bibliothek.
sv: Snabbvisning respekterar det virtuella bibliotekets inställning, visar bara böcker i den aktuella virtuella biblioteket.

source: Jobs
de: Aufträge
sv: Jobb

source: The Jobs panel shows the number of currently running jobs. Jobs are tasks that run in a separate process. They include converting ebooks and talking to your reader device. You can click on the jobs panel to access the list of jobs. Once a job has completed you can see a detailed log from that job by double-clicking it in the list. This is useful to debug jobs that may not have completed successfully.
de: Die Aufgabenanzeige unten rechts zeigt die Anzahl der aktuell ausgeführten Aufträge. Aufträge sind Aufgaben, die in einem separaten Prozess ausgeführt werden. Dazu gehören die Konvertierung von eBooks und die Kommunikation mit Ihrem Lesegerät. Klicken Sie auf die Aufgabenanzeige, um auf die Liste der Aufträge zugreifen. Nach dem Abschluss des Auftrags finden Sie ein detailliertes Protokoll, den man sich durch einen Doppelklick in der Liste anzeigen lassen kann. Dies ist nützlich, um Aufträge zu überprüfen, die nicht erfolgreich abgeschlossen wurden.
sv: Panelen jobb visar antalet jobb som körs. Jobb är uppgifter som körs i en separat process. De omfattar konvertera e-böcker och prata med din läsenhet. Du kan klicka på jobbpanelen för att komma åt listan över jobb. När ett jobb har slutförts kan du se en detaljerad logg från det jobbet genom att dubbelklicka på den i listan. Detta är användbart för att felsöka jobb som kanske inte har slutförts.

source: Keyboard Shortcuts
de: Tastatur Belegungen
sv: Kortkommandon

source: Calibre has several keyboard shortcuts to save you time and mouse movement. These shortcuts are active in the book list view (when you're not editing the details of a particular book), and most of them affect the title you have selected. The calibre ebook viewer has its own shortcuts which can be customised by clicking the Preferences button in the viewer.
de: calibre hat verschiedene Tastenkombinationen um zeitsparend und mit weniger Mausbewegungen zu arbeiten. Die Tastenkombinationen stehen in der Buch-Listenansicht zur Verfügung (wenn Sie keine Buchdetails bearbeiten) und die meisten von ihnen beeinflussen das ausgewählte Buch. Der calibre eBook-Betrachter verfügt über eigene Tastenkombinationen, die über die Schaltfläche Einstellungen im eBook-Betrachter angepasst werden können.
sv: calibre har flera kortkommandon för att spara tid och musrörelser. Dessa kortkommandon är aktiva i boklistvyn (när du inte redigerar detaljerna i en viss bok), och de flesta av dem påverkar den titel du har valt. calibres e-bokläsare har sina egna kortkommandon som kan skräddarsys, genom att klicka på knappen Inställningar i läsaren.

source: Note: The Calibre keyboard shortcuts do not require a modifier key (Command, Option, Control, etc.), unless specifically noted. You only need to press the letter key, e.g. E to edit.
de: Hinweis: Die calibre -Tastenkombinationen erfordern, wenn nicht anders angegeben, keine Zusatztasten (Command, Umschalt, Strg, usw.). Sie müssen nur die Buchstaben drücken, z. B. E für Metadaten Bearbeiten.
sv: Observera: calibres kortkommandon inte kräver en specialtangent (kommando, alternativ, kontroll, etc.), om inte särskilt anges. Du behöver bara trycka på bokstavsknappen, t.ex. E för att redigera.

source: Keyboard Shortcut
de: Tastatur Belegung
sv: Kortkommando

source: Action
de: Aktion
sv: Utför

source: :kbd:`F2 (Enter in OS X)`
de: :kbd:`F2 (Enter unter OS X)`
sv: :kbd:`F2 (Enter i OS X)`

source: Edit the metadata of the currently selected field in the book list.
de: Bearbeitet die Metadaten des markierten Feldes in die Buchliste.
sv: Redigera metadata för det valda fältet i boklistan.

source: Add Books
de: Bücher hinzufügen
sv: Lägg till böcker

source: :kbd:`Shift+A`
de: :kbd:`Umschalt+A`
sv: :kbd:`Skift+A`

source: Add Formats to the selected books
de: Formate zum ausgewählten Buch hinzufügen
sv: Lägg format till de utvalda böckerna

source: Convert selected Books
de: Ausgewählte Bücher konvertieren
sv: Konvertera valda böcker

source: :kbd:`Del`
de: :kbd:`Entf`

source: Remove selected Books
de: Ausgewählte Bücher entfernen
sv: Ta bort valda böcker

source: Edit metadata of selected books
de: Metadaten der ausgewählten Bücher bearbeiten
sv: Redigera metadata av valda böcker

source: Get Books
de: Bücher erwerben
sv: Hämta böcker

source: Show book details
de: Zeige Buchdetails
sv: Visa bokdetaljer

source: Edit Table of Contents
de: Inhaltsverzeichnis bearbeiten
sv: Redigera Innehållsförteckning

source: Merge selected records
de: Ausgewählte Bucheinträge zusammenfügen
sv: Slå samman valda poster

source: Merge selected records, keeping originals
de: Ausgewählte Bucheinträge zusammenfügen, Originale behalten
sv: Slå samman poster, behåll originalen

source: Open containing folder
de: Öffne Speicherort
sv: Öppna mapp

source: Polish books
de: Bücher perfektionieren
sv: Polera böcker

source: Save to Disk
de: Auf Festplatte speichern
sv: Spara till disk

source: :kbd:`Alt+V/Cmd+V in OS X`
de: :kbd:`Alt+V/Cmd+V unter OS X`
sv: :kbd:`Alt+V/Cmd+V i OS X`

source: View specific format
de: Spezielles Format ansehen
sv: Visa specifikt format

source: :kbd:`Alt+Shift+J`
de: :kbd:`Alt+Umschalt+J`
sv: :kbd:`Alt+Skift+J`

source: Toggle jobs list
de: Auftragsliste umschalten
sv: Växla jobblista

source: :kbd:`Alt+Shift+B`
de: :kbd:`Alt+Umschalt+B`
sv: :kbd:`Alt+Skift+B`

source: Toggle Cover Browser
de: Umschalten auf Coverbild-Browser
sv: Växla omslagsvisning

source: :kbd:`Alt+Shift+D`
de: :kbd:`Alt+Umschalt+D`
sv: :kbd:`Alt+Skift+D`

source: Toggle Book Details panel
de: Umschalten auf Buchdetailansicht
sv: Växla bokdetaljspanel

source: :kbd:`Alt+Shift+T`
de: :kbd:`Alt+Umschalt+T`
sv: :kbd:`Alt+Skift+T`

source: Toggle Tag Browser
de: Umschalten auf Schlagwort-Browser
sv: Växla etikett visning

source: :kbd:`Alt+Shift+G`
de: :kbd:`Alt+Umschalt+G`
sv: :kbd:`Alt+Skift+G`

source: Toggle Cover Grid
de: Umschalten auf Cover-Raster
sv: Växla omslagsrutnät

source: Show books by the same author as the current book
de: Zeige Bücher vom gleichen Autor wie das aktuelle Buch
sv: Visa böcker med samma författare som aktuell bok

source: Show books with the same tags as current book
de: Zeige Bücher mit den gleichen Tags wie das aktuelle Buch
sv: Visa böcker med samma etiketter som aktuell bok

source: Show books by the same publisher as current book
de: Zeige Bücher vom gleichen Verlag wie das aktuelle Buch
sv: Visa böcker av samma förlag som aktuell bok

source: :kbd:`Alt+Shift+S`
de: :kbd:`Alt+Umschalt+S`
sv: :kbd:`Alt+Skift+S`

source: Show books in the same series as current book
de: Zeige Bücher der gleichen Serie wie das aktuelle Buch
sv: Visa böcker i samma serie som aktuell bok

source: :kbd:`/, Ctrl+F`
de: :kbd:`/, Strg+F`

source: Focus the search bar
de: In die Suchleiste springen
sv: Fokusera sökfältet

source: :kbd:`Shift+Ctrl+F`
de: :kbd:`Umschalt+Strg+F`
sv: :kbd:`Skift+Ctrl+F`

source: Open the advanced search dialog
de: Öffnet den Dialog der erweiterten Suche
sv: Öppna den avancerade sökdialogen

source: Clear the current search
de: Aktuelle Suche löschen
sv: Rensa sökning

source: :kbd:`Shift+Esc`
de: :kbd:`Umschalt+Esc`
sv: :kbd:`Skift+Esc`

source: Focus the book list
de: Auf Buchliste fokussieren
sv: Fokusera boklista

source: :kbd:`Ctrl+Esc`
de: :kbd:`Strg+Esc`

source: Clear the virtual library
de: Virtuelle Bibliothek leeren
sv: Rensa det virtuella biblioteket

source: Clear the additional restriction
de: Zusätzliche Einschränkungen leeren
sv: Rensa den ytterligare begränsningen

source: :kbd:`Ctrl+*`
de: :kbd:`Strg+*`

source: Create a temporary virtual library based on the current search
de: Erstelle eine temporäre Virtuelle Bibliothek basierend auf der aktuellen Suche
sv: Skapa ett temporärt virtuellt bibliotek baserat på den aktuella sökningen

source: :kbd:`N or F3`
de: :kbd:`N oder F3`

source: Find the next book that matches the current search (only works if the highlight checkbox next to the search bar is checked)
de: Finde das nächste Buch, das der aktuellen Suche entspricht (funktioniert nur, wenn das Kontrollkästchen Hervorhebung rechts neben der Suchleiste aktiviert ist)
sv: Hitta nästa bok som passar den aktuella sökningen (fungerar bara om kryssrutan bredvid sökfältet markerats)

source: :kbd:`Shift+N or Shift+F3`
de: :kbd:`Umschalt+N oder Umschalt+F3`
sv: :kbd:`Skift+N eller Skift+F3`

source: :kbd:`Ctrl+D`
de: :kbd:`Strg+D`

source: Download metadata and shortcuts
de: Metadaten herunterladen und Schnellzugriffe
sv: Hämta metadata och genvägar

source: :kbd:`Ctrl+R`
de: :kbd:`Strg+R`

source: Restart calibre
de: calibre Neustarten
sv: Starta om calibre

source: :kbd:`Ctrl+Shift+R`
de: :kbd:`Strg+Umschalt+R`
sv: :kbd:`Ctrl+Skift+R`

source: Restart calibre in debug mode
de: calibre im Fehlerdiagnosemodus neu starten
sv: Starta om calibre i felsökningsläge

source: :kbd:`Shift+Ctrl+E`
de: :kbd:`Umschalt+Strg+E`
sv: :kbd:`Skift+Ctrl+E`

source: Add empty books to calibre
de: Leere Bücher zu calibre hinzufügen
sv: Lägg till tomma böcker till calibre

source: Open the Quick View popup for viewing books in related series/tags/etc.
de: Schnellansichtfenster öffnen, um Bücher aus zugehörigen Serien, mit zugehörigen Schlagwörtern usw. anzuzeigen.
sv: Öppna snabbsökningsfönstret för visa böcker med relaterade serier/etiketter/etc.

source: Focus the opened Quick View panel
de: Zur geöffneten Schnellansicht wechseln
sv: Fokusera den öppnade snabbsökningspanelen

source: Perform a search in the Quick View panel
de: Suche in der Schnellansicht durchführen
sv: Utför en sökning i snabbsökningspanelen

source: :kbd:`Ctrl+Q`
de: :kbd:`Strg+Q`

source: Quit calibre
de: calibre beenden
sv: Avsluta Calibre

source: Normally, calibre reads metadata from inside the book file. However, it can be configured to read metadata from the file name instead, via :guilabel:`Preferences->Adding Books->Read metadata from file contents`.
sv: Normalt läser calibre metadata från bokfilen. Emellertid kan den konfigureras för att läsa metadata från filnamnet i stället, via :guilabel:`Inställningar->Lägga till böcker->Läs metadata från filens innehåll i stället för filnamn`.

source: You can also control how metadata is read from the filename using regular expressions (see :doc:`regexp`). In the :guilabel:`Adding Books` section of the configuration dialog, you can specify a regular expression that calibre will use to try and guess metadata from the names of ebook files that you add to the library. The default regular expression is::
sv: Du kan också styra hur metadata läses från filnamnet med reguljära uttryck (se :doc:`regexp`). I :guilabel:`Lägg till böcker` avsnittet av inställningsdialogrutan kan du ange ett reguljärt uttryck som calibre kommer att använda för att försöka gissa metadata från namnen på e-bokfiler som du lägger till i biblioteket. Standard för reguljära uttrycket är::

source: that is, it assumes that all characters up to the first ``-`` are the title of the book and subsequent characters are the author of the book. For example, the filename::
sv: et vill säga, det förutsätts att alla tecken fram till den första ``-`` är titeln på boken och efterföljande tecken är författare till boken. Till exempel, filnamnet::

source: If the filename does not contain the hyphen, the above regular expression will fail.
sv: Om filnamnet inte innehåller bindestrecket, kommer ovanstående reguljära uttryck misslyckas.

source: You can right click on individual ebook formats in the Book Details panel to delete them, compare them to their original versions, save them to disk, open them with an external program, etc.
sv: Du kan högerklicka på enskilda e-bokformat i bokdetaljpanelen för att ta bort dem, jämföra dem med sina originalversioner, spara dem till disk, öppna dem med ett externt program, osv.

source: You can change the cover of the book by simply drag and dropping an image onto the book details panel. If you wish to edit the cover image in an external program, simply right click on it and choose :guilabel:`Open With`.
sv: Du kan ändra omslaget till boken genom att helt enkelt dra och släppa en bild på bokdetaljpanelen. Du vill redigera omslagsbild i ett extern program, högerklicka på den och välj :guilabel:`Öppna med`.

source: You can also add ebook files to the current book by drag and dropping the files onto the book details panel.
sv: Du kan också lägga e-bokfiler till den aktuella boken genom att dra och släppa filerna på bokdetaljpanelen.

source: :kbd:`Shift+Q`
sv: :kbd:`Skift+Q`

source: :kbd:`Shift+S`
sv: :kbd:`Skift+S`
