Repository: Easonqsp/calibre-translations
Catalog: manual/*/gui.po
Languages: de, sv

source: Enclose search strings with quotes (") if the string contains parenthesis or spaces. For example, to search for the tag ``Science Fiction`` you would need to search for ``tag:"=science fiction"``. If you search for ``tag:=science fiction`` you will find all books with the tag 'science' and containing the word 'fiction' in any metadata.
de: Schließen Sie die Suchbegriffe in Anführungszeichen ("), wenn die Zeichenfolge Klammer oder Leerzeichen enthält. Um z. B. nach dem Tag ``Science Fiction`` zu suchen, müssten Sie nach ``tag:"=science fiction"`` suchen. Wenn Sie nach ``tag:=science fiction`` suchen, finden Sie alle Bücher, die den Tag 'science' und irgendwo das Wort 'fiction' in den Metadaten enthält.
sv: Bifoga söksträngar med citationstecken (") om strängen innehåller parentes eller utrymmen till exempel vill söka efter etiketten ``Science Fiction`` du skulle behöva söka efter ``etikett:"=science fiction"`` Om du sök efter ``etikett:=science fiction`` hittar du alla böcker med etiketten "science" och som innehåller ordet "fiction" av vilket metadata.

source: You can build advanced search queries easily using the :guilabel:`Advanced Search Dialog` accessed by clicking the button |sbi|.
de: Erweiterte Suchabfragen können sehr einfach über den Dialog :guilabel:`Erweiterte Suche` durch Klicken auf die Schaltfläche |sbi| erstellt werden.
sv: Du kan bygga avancerade sökfrågor enkelt med hjälp av :guilabel:`Avancerad sökdialog` som nås genom att klicka på knappen |sbi|.

source: Available fields for searching are: ``tag, title, author, publisher, series, series_index, rating, cover, comments, format, identifiers, date, pubdate, search, size`` and custom columns. If a device is plugged in, the ``ondevice`` field becomes available, when searching the calibre library view. To find the search name (actually called the `lookup name`) for a custom column, hover your mouse over the column header in the library view.
de: Verfügbare Felder für die Suche sind: ``tag, title, author, publisher, series, series_index, rating, cover, comments, format, identifiers, date, pubdate, search, size`` und benutzerdefinierte Spalten. Wenn ein Gerät angeschlossen ist, steht zusätzlich das Feld ``ondevice`` der calibre-Bibliotheksansicht für die Suche zur Verfügung. Um den Suchnamen (auch `Nachschlage Name` genannt) für eine benutzerdefinierte Spalte zu finden, bewegt man die Maus über die Spaltenüberschrift in der Bibliotheksansicht. Hierbei wird der Feldname eingeblendet.
sv: Tillgängliga fält för att söka är: ``etikett, titel, författare, förlag, serier, series_index, betyg, omslag, kommentarer, format identifierare, datum, pubDate, sök, storlek`` och anpassade kolumner. Om en enhet är ansluten, blir ``ondevice`` fält tillgängliga, när du söker calibre biblioteksvyn. För att hitta sökningen namnet (egentligen kallad `lookup name`) för en anpassad kolumn håller du musen över kolumnrubriken i biblioteksvyn.

source: The syntax for searching for dates is::
de: Die Syntax für die Suche nach einem Datum ist::
sv: Syntaxen för att söka efter datum är::

source: If the date is ambiguous, the current locale is used for date comparison. For example, in an mm/dd/yyyy locale 2/1/2009 is interpreted as 1 Feb 2009. In a dd/mm/yyyy locale it is interpreted as 2 Jan 2009. Some special date strings are available. The string ``today`` translates to today's date, whatever it is. The strings ``yesterday`` and ``thismonth`` (or the translated equivalent in the current language) also work. In addition, the string ``daysago`` (also translated) can be used to compare to a date some number of days ago. For example::
de: Wenn ein Datum nicht eindeutig ist, wird das aktuelle Gebietsschema für Datumsvergleich verwendet. Beispielsweise wird im Gebietsschema mm/dd/yyyy 01.02.2009 als 1. Februar 2009 interpretiert. Im Gebietsschema dd/mm/yyyy wird es als 2. Januar 2009 interpretiert. Es stehen einige spezielle Datumsbezeichnungen zur Verfügung. Die Zeichenfolge ``today`` entspricht dem heutigen Datum, wann immer es ist. Die Bezeichnung ``yesterday`` und ``thismonth`` (oder das übersetzte Äquivalent in der aktuellen Sprache) funktionieren auch. Darüber hinaus kann die Zeichenfolge ``daysago`` (auch übersetzt) verwendet werden, um eine zurückliegende Anzahl von Tagen zu einem Datum zu vergleichen. Zum Beispiel::
sv: Om datumet är tvetydig, är den aktuella används platsinformation för datumjämförelse. Till exempel i en mm/dd/åååå platsinformation 2009/02/01 tolkas det som 1 Feb 2009. I en åååå/mm/dd platsinformation tolkas det som 2 januari 2009. Vissa speciella datumsträngar är tillgängliga. Strängen ``today`` översätter till dagens datum, vad det än är. Strängarna ``yesterday`` och ``thismonth`` (eller översatta motsvarande i det aktuella språket) fungerar också. Dessutom kan strängen ``daysago`` (även översatt) användas för att jämföra med ett datum ett visst antal dagar sedan. Exempelvis::

source: To avoid potential problems with translated strings when using a non-English version of calibre, the strings ``_today``, ``_yesterday``, ``_thismonth``, and ``_daysago`` are always available. They are not translated.
de: Um mögliche Probleme mit übersetzten Zeichenketten bei nicht englischen calibre-Versionen zu vermeiden, sind die Bezeichnungen ``_today``, ``_yesterday``, ``_thismonth``, und ``_daysago`` immer verfügbar. Diese werden nicht übersetzt.
sv: För att undvika eventuella problem med översatta strängar när du använder en icke-engelsk version av calibre, är strängarna ``_today``, ``_yesterday``, ``_thismonth`` och ``_daysago`` alltid tillgängliga. De översätts inte.

source: You can search for books that have a format of a certain size like this::
de: Sie können nach Bücher einer bestimmten formatierten Größe suchen, wie beispielsweise::
sv: Du kan söka efter böcker som har ett format av en viss storlek så här::

source: Dates and numeric fields support the relational operators ``=`` (equals), ``>`` (greater than), ``>=`` (greater than or equal to), ``<`` (less than), ``<=`` (less than or equal to), and ``!=`` (not equal to). Rating fields are considered to be numeric. For example, the search ``rating:>=3`` will find all books rated 3 or higher.
de: Datums- und numerische Felder unterstützen die relationalen Operatoren ``=`` (gleich), ``>`` (größer als), ``>=`` (größer als oder gleich), ``<`` (kleiner), ``<=`` (kleiner als oder gleich), und ``!=`` (ungleich). Bewertungsfelder sind numerisch. Beispielsweise findet die Suche ``rating:>=3`` alle Bücher mit der Bewertung 3 oder höher.
sv: Datum och numeriska fält stöder relationsoperatorer ``=`` (lika med), ``>`` (större än), ``>=`` (större än eller lika med), ``<`` (mindre än), ``<=`` (mindre än eller lika med), and ``!=`` (inte lika med). Betygsfälten anses vara numeriska. Exempelvis sökandet ``rating:>=3`` hittar alla böcker med betyg 3 eller högre.

source: You can search for the number of items in multiple-valued fields such as tags. These searches begin with the character ``#``, then use the same syntax as numeric fields. For example, to find all books with more than 4 tags use ``tags:#>4``. To find all books with exactly 10 tags use ``tags:#=10``.
de: Sie können die Anzahl der Elemente in Felder mit mehreren Werten wie z. B. bei Tags suchen. Diese Suchvorgänge beginnen mit dem Zeichen ``#`` und verwenden dann gleiche Syntax wie bei numerischen Feldern. Um z. B. alle Bücher mit mehr als 4 Tags Nutzung finden, verwendet man ``tags:#>4``. Zum Finden aller Bücher mit genau 10 Tags benutzt man ``tags:#=10``.
sv: Du kan söka efter det antal poster i flervärda områden som etiketter. Dessa sökningar börjar med tecknet ``#``, sedan använda samma syntax som för numeriska fält. Till exempel, för att hitta alla böcker med mer än 4 etiketter använder `` tags:#>4``. För att hitta alla böcker med exakt 10 etiketter använder `` tags:#=10``.

source: Series indices are searchable. For the standard series, the search name is 'series_index'. For custom series columns, use the column search name followed by _index. For example, to search the indices for a custom series column named ``#my_series``, you would use the search name ``#my_series_index``. Series indices are numbers, so you can use the relational operators described above.
de: Serie Indizes können durchsucht werden. Für die Standard-Serie lautet der Name 'series_index'. Für benutzerdefinierte Serien-Spalten verwenden Sie den Suchnamen der Spalte gefolgt von _index. Um z. B. den Index für eine benutzerdefinierten Serie mit Namen ``#meine_serie`` zu suchen, würde man den Suchnamen ``#meine_serie_index`` verwenden. Serie Indizes sind Zahlen, daher können Sie die zuvor oben beschriebenen relationalen Operatoren benutzten.
sv: Indexserien är sökbara. För standardserien, är söknamnet "series_index". För anpassade seriekolumner, använd kolumnsökningsnamn följt av _index. Om du exempelvis vill söka indexen för en anpassad seriekolumn som heter ``#my_series``, skulle du använda sökfunktionsnamnet ``#my_series_index``. Indexserien är tal, så att du kan använda relationsoperatorer som beskrivs ovan.

source: The special field ``search`` is used for saved searches. So if you save a search with the name "My spouse's books" you can enter ``search:"My spouse's books"`` in the search bar to reuse the saved search. More about saving searches below.
de: Das spezielle Feld ``search`` wird für gespeicherten Suchen verwendet. Wenn eine Suche mit dem Namen "Bücher meines Ehepartners" speichern, können Sie durch die Eingabe ``search:"Bücher meines Ehepartners"`` die gespeicherte Suche wiederverwenden. Weitere Informationen über das Speichern von Suchen kommen nachfolgend.
sv: Det speciella fältet ``search`` används för sparade sökningar. Så om du sparar en sökning med namnet "Min makes böcker" kan du skriva ``search:"Min makes böcker"`` i sökfältet för att återanvända den sparade sökningen. Mer om att spara sökningar nedan.

source: You can search for the absence or presence of a field using the special "true" and "false" values. For example::
de: Sie können das Fehlen oder Vorhandensein eines Felds mithilfe der speziellen Werte "true" und "false" suchen. Zum Beispiel::
sv: Du kan söka efter frånvaron eller närvaron av ett fält med hjälp av de speciella "sanna" och "falska" värden. Exempelvis::

source: Yes/no custom columns are searchable. Searching for ``false``, ``empty``, or ``blank`` will find all books with undefined values in the column. Searching for ``true`` will find all books that do not have undefined values in the column. Searching for ``yes`` or ``checked`` will find all books with ``Yes`` in the column. Searching for ``no`` or ``unchecked`` will find all books with ``No`` in the column. Note that the words ``yes``, ``no``, ``blank``, ``empty``, ``checked`` and ``unchecked`` are translated; you can use either the current language's equivalent word or the English word. The words ``true`` and ``false`` and the special values ``_yes``, ``_no``, and ``_empty`` are not translated.
de: Benutzerdefinierte Spalten vom Typ Ja/Nein können durchsucht werden. Eine Suche nach ``false``, ``empty``, oder ``blank`` findet alle Bücher mit undefinierten Werten in der Spalte. Die Suche nach ``true`` finden alle Bücher, die keine undefinierten Werte in der Spalte aufweisen. Eine Suche nach ``yes`` oder ``checked`` wird alle Bücher mit ``Yes`` in der Spalte finden. Die Suche für ``no`` oder ``unchecked`` findet alle Bücher mit ``No`` in der Spalte. Hinweis, die nachfolgenden Worte werden übersetzt: ``yes`` in ``ja``, ``no`` in ``nein``, ``blank`` in ``leer``, ``empty`` in ``leer``, ``checked`` in ``ausgewählt`` und ``unchecked`` in ``"nicht ausgewählt"``. Sie können entweder das entsprechende Wort in aktuellen Sprache oder das englische Wort verwenden. Die Worte ``true`` und ``false`` sowie die speziellen Werte ``_yes``, ``_no``, and ``_empty`` werden nicht übersetzt.
sv: Ja/nej anpassade kolumner är sökbara. Söka efter `` false``, `` empty``, eller `` blank`` hittar alla böcker med odefinierade värden i kolumnen. Söka efter ``true`` hittar alla böcker som inte har odefinierade värden i kolumnen. Söka efter ``yes`` eller ``checked`` hittar alla böcker med ``Yes`` i kolumnen. Söka efter ``no`` eller ``unchecked`` hittar alla böcker med ``No`` i kolumnen. Observera att orden ``yes``, ``no``, ``blank``, ``empty``, ``checked`` och ``unchecked`` sätts; Du kan antingen använda det aktuella språket motsvariga ord eller det engelska ordet. Orden ``true`` och ``false`` och de särskilda värden ``_yes``, ``_no`` och ``_empty`` översätts inte.

source: Hierarchical items (e.g. A.B.C) use an extended syntax to match initial parts of the hierarchy. This is done by adding a period between the exact match indicator (=) and the text. For example, the query ``tags:=.A`` will find the tags `A` and `A.B`, but will not find the tags `AA` or `AA.B`. The query ``tags:=.A.B`` will find the tags `A.B` and `A.B.C`, but not the tag `A`.
de: Hierarchische Elemente (z. B. A.B.C) verwenden eine erweiterte Syntax, um erste Teile der Hierarchie zu finden. Dies erfolgt durch Hinzufügen eines Punktes zwischen dem Gleichheits-Indikator (=) und dem zu suchenden Text. So findet z. B. die Abfrage ``tags:=.A`` die Tags `A` und `A.B`, aber nicht die Tags `AA` oder `AA.B`. Die Abfrage ``tags:=.A.B`` finden die Tags `A.B` and `A.B.C`, aber nicht das Tag `A`.
sv: Hierarkiska objekt (t.ex. A.B.C) använder en utökad syntax för att passa de första delarna av hierarkin. Detta görs genom att lägga till en punkt mellan den exakta indikatorn passningen (=) och texten. Till exempel frågan ``tags:=A`` hittar etiketterna `A` och` AB`, men hittar inte etiketterna `AA` eller` AA.B`. Sökning ``tags:=.A.B`` hittar etiketterna `A.B` och` A.B.C`, men inte den etiketten `A`.

source: Identifiers (e.g., isbn, doi, lccn etc) also use an extended syntax. First, note that an identifier has the form ``type:value``, as in ``isbn:123456789``. The extended syntax permits you to specify independently which type and value to search for. Both the type and the value parts of the query can use `equality`, `contains`, or `regular expression` matches. Examples:
de: Kennungen (z. B. isbn, doi, lccn usw.) verwenden ebenfalls eine erweiterte Syntax. Es ist zu beachten, dass ein Bezeichner der Form ``Type:Wert`` entspricht, wie z. B. ``isbn:123456789``. Die erweiterte Syntax erlaubt es unabhängig vom angegebenen Typ und Wert zu suchen. Es kann auf beide Teile, den Typ oder den Wert und basierend auf `Gleichheit`, `enthält` oder mit `reguläreren Ausdrücken` in einer Abfrage geprüft werden. Beispiele:
sv: Identifierare (t.ex. isbn, doi, LCCN etc) också använda en utökad syntax. Först, notera att en identifierare har formen ``typ:value``, som i ``ISBN:123456789``. Den utökade syntaxen tillåter dig att specificera självständigt vilken typ och värde för att söka efter. Både typ och värde delarna av frågan kan använda `lika med`,` innehåller` eller `reguljära uttryck` sökningar. Exempel:

source: ``identifiers:true`` will find books with any identifier.
de: ``identifiers:true`` findet alle Bücher mit einer beliebigen Kennung.
sv: ``identifierare:true`` hittar böcker med någon identifierare.

source: ``identifiers:false`` will find books with no identifier.
de: ``identifiers:false`` findet Bücher ohne Kennung.
sv: ``identifierare:false`` hittar böcker utan identifierare.

source: ``identifiers:123`` will search for books with any type having a value containing `123`.
de: ``identifiers:123`` sucht nach Büchern mit beliebiger Kennung, die den Wert `123` beinhalten.
sv: ``identifierare:123`` kommer att söka efter böcker av någon typ som har ett värde som innehåller `123`.

source: ``identifiers:=123456789`` will search for books with any type having a value equal to `123456789`.
de: ``identifiers:=123456789``' sucht nach Bücher mit beliebiger Kennung und einem Wert gleich `123456789`.
sv: ``identifierare:=123456789`` kommer att söka efter böcker av någon typ som har ett värde som är lika med `123456789`.

source: ``identifiers:=isbn:`` and ``identifiers:isbn:true`` will find books with a type equal to isbn having any value
de: ``identifiers:=isbn:`` und ``identifiers:isbn:true`` findet Bücher, deren Typ gleich isbn ist und welche einen beliebigen Wert haben.
sv: ``identifierare:=isbn:`` och ``identifierare: isbn: true`` hittar böcker med en typ lika med isbn har något värde

source: ``identifiers:=isbn:false`` will find books with no type equal to isbn.
de: ``identifiers:=isbn:false`` findet Bücher, deren Typ nicht isbn ist.
sv: ``identifierare:=isbn:false`` hittar böcker med någon typ lika med isbn.

source: ``identifiers:=isbn:123`` will find books with a type equal to isbn having a value containing `123`.
de: ``identifiers:=isbn:123`` findet Bücher, deren Typ gleich isbn und die einen Wert mit `123` beinhalten.
sv: ``identifierare:=isbn:123`` hittar böcker med en typ som motsvarar isbn med ett värde som innehåller `123`.

source: ``identifiers:=isbn:=123456789`` will find books with a type equal to isbn having a value equal to `123456789`.
de: ``identifiers:=isbn:=123456789`` findet Bücher mit einem Typ gleich isbn und die dem Wert gleich "123456789" entsprechen.
sv: ``identifierare:=isbn:=123456789`` hittar böcker med en typ som motsvarar isbn med ett värde som är lika med `123456789`.

source: ``identifiers:i:1`` will find books with a type containing an `i` having a value containing a `1`.
de: ``identifiers:i:1`` findet Bücher, deren Typ ein `i` und deren Wert eine `1` beinhalten.
sv: ``identifierare:i:1`` hittar böcker med en typ som innehåller ett `i` har ett värde som innehåller en`1`.

source: :guilabel:`Advanced Search Dialog`
de: :guilabel:`Erweiterte Suche Dialog`
sv: :guilabel:`Advancerad sökdialog`

source: Saving searches
de: Suchvorgänge speichern
sv: Sparade sökningar

source: calibre allows you to save a frequently used search under a special name and then reuse that search with a single click. To do this, create your search either by typing it in the search bar or using the Tag Browser. Then type the name you would like to give to the search in the Saved Searches box next to the search bar. Click the plus icon next to the saved searches box to save the search.
de: In calibre können Sie eine häufig verwendete Suche unter einer besonderen Bezeichnung speichern, um diese dann mit einem Klick erneut anwenden zu können. Zu diesem Zweck erstellen Sie Ihre Suche entweder durch die direkte Eingabe in der Suchleiste oder mithilfe des Schlagwortbrowsers. Dann geben in dem Feld Gespeicherte Suchen rechts neben der Suchleiste den gewünschten Suchnamen ein. Zum Schluss klicken Sie auf das Plus-Symbol neben dem Feld Gespeicherte Suchen, um die Suche zu speichern.
sv: calibre tillåter dig spara en ofta använd sökning under ett särskilt namn och sedan återanvända den sökningen med ett enda klick. Det gör du genom att skapa din sökning, antingen genom att skriva in det i sökfältet eller använda etikettbläddraren. Skriv sedan det namn du vill ge till sökningen i rutan Sparade sökningar bredvid sökfältet. Klicka på plusikonen bredvid rutan sparade sökningar för att spara sökningen.

source: Now you can access your saved search in the Tag Browser under "Searches". A single click will allow you to reuse any arbitrarily complex search easily, without needing to re-create it.
de: Jetzt können Sie auf Ihre gespeicherte Suche im Schlagwort-Browser unter "Suchergebnisse" zugreifen. Mit einem einzigen Klick können Sie jede beliebig komplexe Suche problemlos wiederverwenden, ohne diese neu erstellen zu müssen.
sv: Nu kan du komma åt din sparade sökning i etikettbläddraren under "sökningar". Ett enda klick gör att du kan återanvända en godtyckligt komplex sökning enkelt, utan att behöva återskapa den.

source: Virtual Libraries
de: Virtuelle Bibliotheken
sv: Virtuella bibliotek

source: A :guilabel:`Virtual Library` is a way to pretend that your calibre library has only a few books instead of its full collection. This is an excellent way to partition your large collection of books into smaller, manageable chunks. To learn how to create and use virtual libraries, see the tutorial: :ref:`virtual_libraries`.
de: Eine :guilabel:`Virtuelle Bibliothek` ist eine Möglichkeit so zu tun, als besteht Ihre calibre-Bibliothek nur aus ein paar Büchern statt seiner kompletten Sammlung. Dies ist eine hervorragende Möglichkeit, Ihre große Büchersammlung in kleinere, überschaubare Einheiten aufzuteilen. Weitere Informationen zum Erstellen und Verwenden von virtuellen Bibliotheken finden Sie in den Tutorials: :ref:`virtual_libraries`.
sv: Ett :guilabel:`Virtuellt bibliotek` är ett sätt att låtsas att ditt calibre-biblioteket bara har ett fåtal böcker i stället för dess fullständiga samling. Detta är ett utmärkt sätt att partitionera din stora samling av böcker i mindre, hanterbara bitar. Om du vill veta hur du skapar och använder virtuella bibliotek, se handledningen: :ref:`virtual_libraries`.

source: Guessing metadata from file names
de: Metadaten aus dem Dateinamen extrahieren
sv: Gissa metadata från filnamn

source: In the :guilabel:`Add/Save` section of the configuration dialog, you can specify a regular expression that calibre will use to try and guess metadata from the names of ebook files that you add to the library. The default regular expression is::
de: Im Abschnitt des Konfigurationsdialogs von :guilabel:`Bücher hinzufügen` können Sie einem regulären Ausdruck angeben, den calibre benutzen kann, um Metadaten aus den Namen der eBook-Dateien zu erraten, die Sie der Bibliothek hinzufügen möchten. Der reguläre Standardausdruck ist für Dateinamen mit dem Aufbau::

source: i.e., it assumes that all characters up to the first ``-`` are the title of the book and subsequent characters are the author of the book. For example, the filename::
de: d. h. es wird davon ausgegangen, dass alle Zeichen bis zum ersten ``-`` der Titel des Buches ist und die nachfolgenden Zeichen zum Autor des Buches gehören. Als Beispiel der Dateiname::

source: will be interpreted to have the title: Foundation and Earth and author: Isaac Asimov
de: interpretiert daraus den Titel: Foundation and Earth und den Autor: Isaac Asimov.
sv: kommer att tolkas ha titeln: Foundation and Earth och författare: Isaac Asimov

source: If the filename does not contain the hyphen, the regular expression will fail.
de: Der reguläre Ausdruck schlägt fehl, wenn der Dateiname keinen Bindestrich zwischen Buchtitel und Autor enthält.

source: Book Details
de: Buchdetails
sv: Bokinformation

source: The Book Details display shows the cover and all the metadata for the currently selected book. It can be hidden via the button in the lower right corner of the main calibre window. The author names shown in the Book Detail panel are clickable, they will by default take you to the Wikipedia page for the author. This can be customized by right clicking on the author name and selecting Manage this author.
de: Die Buchdetails zeigen das Cover und alle Metadaten für das aktuell ausgewählte Buch. Es kann über die Schaltfläche in der unteren rechten Ecke des calibre Hauptfensters aus- und eingeblendet werden. Die gezeigten Autorennamen in den Buchdetails sind anklickbar und öffnen standardmäßig die Wikipedia-Seite des Autors. Dies kann durch mit einem Rechtsklick auf den Namen des Autors und der Auswahl Autor verwalten angepasst werden.
sv: Bokdetaljer visar omslag och allt metadata för den valda boken. Det kan döljas via knappen i det nedre högra hörnet av huvudfönstret i calibre. De författarnamn som visas i panelen bokdetaljer är klickbara, de kommer som standard att ta dig till Wikipedia-sidan för författaren. Detta kan anpassas genom att högerklicka på författarens namn och välja Hantera denna författare.
