Repository: Easonqsp/calibre-translations
Catalog: manual/*/gui.po
Languages: de, sv

source: The Graphical User Interface
de: Die grafische Benutzeroberfläche
sv: Grafiska användargränssnittet

source: The Graphical User Interface *(GUI)* provides access to all library management and ebook format conversion features. The basic workflow for using calibre is to first add books to the library from your hard disk. calibre will automatically try to read metadata from the books and add them to its internal database. Once they are in the database, you can perform various :ref:`actions` on them that include conversion from one format to another, transfer to the reading device, viewing on your computer, and editing metadata. The latter includes modifying the cover, description, and tags among other details. Note that calibre creates copies of the files you add to it. Your original files are left untouched.
de: Die grafische Benutzeroberfläche *(GUI)* ermöglicht den Zugriff auf alle Funktionen des Bibliotheksmanagements und der Konvertierung von eBook-Formaten. Der grundlegende Workflow für die Verwendung von calibre besteht darin, zuerst Bücher von Ihrer Festplatte zur Bibliothek zu übertragen. calibre wird automatisch versuchen, die Metadaten der Bücher zu erkennen und diese in der internen Datenbank zu speichern. Sobald die Bücher in der Datenbank sind, können Sie verschiedene :ref:`actions` durchgeführen. Dies beinhaltet die Konvertierung von einem Format in ein anderes, die Übertragung an ein Lesegerät, die Anzeige auf dem Computer und die Bearbeitung der Metadaten. Letzteres beinhaltet neben anderen Details die Änderung der Buch-Cover, Beschreibung und Schlagworte. Beachten Sie, dass calibre Kopien der hinzugefügten Buchdateien erstellt. Die Originaldateien bleiben unverändert.
sv: Det grafiska användargränssnittet *(GUI)* erbjuder tillgång till all bibliotekshantering och e-bokkonverteringsfunktioner. Det grundläggande arbetsflöde för att använda calibre är först att lägga till böcker till biblioteket från din hårddisk. calibre kommer automatiskt försöka läsa metadata från böckerna och lägga till dem i sin interna databas. När de är i databasen, kan du utföra olika :ref:`actions` på dem som ingår konvertering från ett format till ett annat, överföra till avläsningsanordningen, titta på datorn och redigera metadata. Det senare innefattar modifiering av omslag, beskrivning och etiketter bland andra detaljer. Observera att calibre skapar kopior av de filer som du lägger till. Dina originalfiler lämnas orörda.

source: The interface is divided into various sections:
de: Die Oberfläche ist in verschiedene Abschnitte aufgeteilt:
sv: Gränssnittet är uppdelat i olika sektioner:

source: Actions
de: Aktionen
sv: Åtgärder

source: The actions toolbar provides convenient shortcuts to commonly used actions. If you right-click the buttons, you can perform variations on the default action. Please note that the actions toolbar will look slightly different depending on whether you have an ebook reader attached to your computer.
de: Die Symbolleiste der Aktionen bietet praktische Verknüpfungen zu häufig verwendeten Aktionen. Wenn Sie mit der rechten Maustaste auf die Icons klicken, können Sie verschiedene Variationen einer Standard-Aktion ausführen. Bitte beachten Sie, dass die Symbolleiste und deren Aktionen je nachdem, ob Sie ein eBook-Reader an den Computer angeschlossen haben, variieren.
sv: I åtgärdsverktygsfältet finns praktiska genvägar till vanliga åtgärder. Om du högerklickar på knapparna, kan du utföra varianter på standardåtgärden. Observera att de åtgärdsverktygsfält kommer se lite olika ut beroende på om du har en e-bokläsare ansluten till datorn.

source: Add books
de: Bücher hinzufügen
sv: Lägg till böcker

source: |adbi| The :guilabel:`Add books` action has seven variations accessed by doing a right-click on the button.
de: |adbi| Die Aktion :guilabel:`Bücher hinzufügen` hat sieben Variationen, die mit einem Rechtsklick auf die Schaltﬂäche aufgerufen werden können.
sv: |adbi| :guilabel:`Lägg till böcker` åtgärd har sju variationer, som nås genom att göra ett högerklick på knappen.

source: **Add books from a single directory**: Opens a file chooser dialog and allows you to specify which books in a directory should be added. This action is *context sensitive*, i.e. it depends on which :ref:`catalog <catalogs>` you have selected. If you have selected the :guilabel:`Library`, books will be added to the library. If you have selected the ebook reader device, the books will be uploaded to the device, and so on.
de: **Bücher aus einem einzigen Verzeichnis hinzufügen**: Öffnet einen Dateiauswahldialog in dem Sie angeben können, welche Bücher aus einem Verzeichnis hinzugefügt werden sollen. Diese Aktion ist *Kontext-Sensitiv*, d. h. es kommt darauf an welchen :ref:`Katalog <catalogs>` Sie gewählt haben. Wenn Sie die :guilabel:`Library` ausgewählt haben, werden Bücher der Bibliothek hinzugefügt. Wenn Sie das Gerät eBook-Reader ausgewählt haben, werden die Bücher auf das Gerät geladen, und so weiter.
sv: **Lägg böcker från en enda katalog**: Öppnar en filvalsdialog och låter dig ange vilka böcker i en katalog bör tilläggas. Denna åtgärd är kontextkänslig , det vill säga det beror på vilken :ref:`katalog <catalogs>` som du har valt. Om du har valt biblioteket , kommer böcker att läggas till i biblioteket. Om du har valt e-boksläsarenheten kommer böckerna laddas upp till enheten och så vidare.

source: **Add books from directories, including sub-directories (One book per directory, assumes every ebook file is the same book in a different format)**: Allows you to choose a directory. The directory and all its sub-directories are scanned recursively, and any ebooks found are added to the library. calibre assumes that each directory contains a single book. All ebook files in a directory are assumed to be the same book in different formats. This action is the inverse of the :ref:`Save to disk <save_to_disk_multiple>` action, i.e. you can :guilabel:`Save to disk`, delete the books and re-add them with no lost information except for the date (this assumes you have not changed any of the setting for the Save to disk action).
de: **Bücher aus Verzeichnisse einschließlich Unterverzeichnisse hinzufügen (ein Buch pro Verzeichnis, geht davon aus, dass jede eBook-Datei das gleiche Buch in einem anderen Format ist)**: Sie können das Verzeichnis auswählen. Das Verzeichnis und alle Unterverzeichnissen werden rekursiv ausgelesen und alle gefundenen eBooks werden der Bibliothek hinzugefügt. calibre wird davon ausgehen, dass jedes Verzeichnis ein einzelnes Buch enthält. Es wird weiterhin angenommen, dass alle eBook-Dateien in einem Verzeichnis das gleiche Buch in verschiedenen Formaten sind. Diese Aktion ist die Umkehrfunktion der Aktion :ref:`Auf Festplatte speichern<save_to_disk_multiple>`, d. h. Sie können mit :guilabel:`Auf Festplatte speichern` Bücher speichern, danach die Bücher aus der Bibliothek löschen und dann wieder hinzufügen, ohne das Informationen außer dem Datum verlorenen gehen (vorausgesetzt, es wurde keine Einstellung für die Aktion Speichern auf Datenträger geändert).
sv: **Lägg böcker från kataloger, inklusive underkataloger (En bok per katalog, antar varje e-bokfil är samma bok i ett annat format)**: Låter dig välja en katalog. Katalogen och alla dess underkataloger skannas rekursivt, och alla e-böcker som hittas läggs till i biblioteket. calibre förutsätter att varje katalog innehåller en enda bok. Alla e-bokfiler i en katalog antas vara samma bok i olika format. Denna åtgärd är inversen av :ref:`Spara till disk <save_to_disk_multiple>` handling, dvs du kan :guilabel:`Spara till disk`, ta bort böckerna och lägga tillbaka dem utan någon förlorad information utom för dagen (detta förutsätter att du inte har ändrat någon av inställningarna för Spara till disk åtgärd).

source: **Add books from directories, including sub-directories (Multiple books per directory, assumes every ebook file is a different book)**: Allows you to choose a directory. The directory and all its sub-directories are scanned recursively and any ebooks found are added to the library. calibre assumes that each directory contains many books. All ebook files with the same name in a directory are assumed to be the same book in different formats. Ebooks with different names are added as different books.
de: **Bücher aus Verzeichnisse einschließlich Unterverzeichnisse hinzufügen (mehrere Bücher pro Verzeichnis, geht davon aus, dass jede eBook-Datei ein anderes Buch ist)**: Sie können das Verzeichnis auswählen. Das Verzeichnis und alle Unterverzeichnissen werden rekursiv ausgelesen und alle gefundenen eBooks werden zur Bibliothek hinzugefügt. calibre wird davon ausgehen, dass jedes Verzeichnis viele Bücher enthält. Bei eBook-Dateien mit gleichen Namen in einem Verzeichnis wird angenommen, dass es sich um das gleiche Buch in verschiedenen Formaten handelt. eBooks mit unterschiedlichen Namen werden als unterschiedliche Bücher hinzugefügt.
sv: **Lägg böcker från kataloger, inklusive underkataloger (Flera böcker per katalog, antar varje e-bokfil är en annan bok)** : Låter dig välja en katalog. Katalogen och alla dess underkataloger skannas rekursivt och eventuella e-böcker som hittas läggs till i biblioteket. calibre förutsätter att varje katalog innehåller många böcker. Alla e-bokfiler med samma namn i en katalog antas vara samma bok i olika format. E-böcker med olika namn läggs till som olika böcker.

source: **Add multiple books from archive (ZIP/RAR)**: Allows you to add multiple ebooks that are stored inside the selected ZIP or RAR files. It is a convenient shortcut that avoids having to first unzip the archive and then add the books via one of the above two options.
de: **Mehrere Bücher aus einem Archiv (ZIP/RAR) hinzufügen**: Sie können mehrere eBooks hinzufügen, die innerhalb ausgewählter ZIP- oder RAR-Dateien gespeichert sind. Es ist eine bequeme Abkürzung, die es vermeidet, ein Archiv zuerst entpacken zu müssen um die Bücher dann über einen der oben genannten Optionen hinzu zu fügen.
sv: **Lägg till flera böcker från arkivet (ZIP/RAR)**: Gör att du kan lägga till flera e-böcker som finns lagrade inuti det markerade ZIP eller RAR-filer. Det är en praktisk genväg som innebär att man slipper att först packa upp arkivet och sedan lägga till böckerna via ett av de två ovanstående alternativen.

source: **Add empty book. (Book Entry with no formats)**: Allows you to create a blank book record. This can be used to then manually fill out the information about a book that you may not have yet in your collection.
de: **Leeres Buch hinzufügen. (Bucheintrag ohne Formate)**: Sie können hiermit einen leeren Buchdatensatz erstellen. Dieser kann dazu verwendet werden, um manuell die Informationen für ein Buch zu erfassen, dass sich noch nicht in Ihrer Sammlung befindet.
sv: **Lägg tom bok. (Värdeandels utan format)**: Används för att skapa en tom bok rekord. Detta kan användas för att sedan manuellt fylla i information om en bok som du kanske inte har ännu i din samling.

source: **Add from ISBN**: Allows you to add one or more books by entering their ISBNs.
de: **Von ISBN hinzufügen**: Sie können eines oder mehrere Bücher hinzufügen, indem Sie deren ISBN-Nummern eingeben.
sv: **Lägg från ISBN**: Låter dig lägga till en eller flera böcker genom att skriva in deras ISBN.

source: **Add files to selected book records**: Allows you to add or update the files associated with an existing book in your library.
de: **Dateien zum ausgewählten Buch hinzufügen**: Sie können hierüber Dateien zu einem bestehenden Buch in Ihrer Bibliothek hinzufügen oder diese aktualisieren.
sv: **Lägg till filer till utvalda boken poster**: Gör att du kan lägga till eller uppdatera filer som hör till en befintlig bok i biblioteket.

source: The :guilabel:`Add books` action can read metadata from a wide variety of ebook formats. In addition, it tries to guess metadata from the filename. See the :ref:`config_filename_metadata` section, to learn how to configure this.
de: Die Aktion :guilabel:`Bücher hinzufügen` kann Metadaten aus einer Vielzahl von eBook-Formaten lesen. Darüber hinaus wird versucht, die Metadaten aus dem Dateinamen zu erraten. Für weitere Informationen zur Konfiguration siehe Abschnitt :ref:`config_filename_metadata`.
sv: Med :guilabel:`Lägg till böcker` åtgärden kan läsa metadata från en bred variation av e-boksformat. Dessutom försöker den gissa metadata från filnamnet. Se :ref:`config_filename_metadata` sektion, för att lära sig att konfigurera denna.

source: To add an additional format for an existing book you can do any of three things:
de: Um ein zusätzliches Format zu einem bestehenden Buch hinzufügen zu können, nutzen sie eine der drei Möglichkeiten:
sv: För att lägga till ett extra format för en befintlig bok du kan göra något av tre saker:

source: Drag and drop the file onto the book details panel on the right side of the main window
de: Ziehen Sie die Datei ins Buchdetail-Fenster auf der rechten Seite des Hauptfensters.
sv: Dra och släpp filen på bokens informationspanelen på höger sida i huvudfönstret

source: Right click the Add books button and choose :guilabel:`Add files to selected books`.
de: Rechtsklick auf die Schaltfläche Bücher hinzufügen und Auswahl :guilabel:`Dateien zum ausgewählten Buch hinzufügen`.
sv: Högerklicka på knappen Lägg till böcker och välj :guilabel:`Lägg till filer till valda bokens poster`.

source: Click the red add books button in the top right area of the :guilabel:`Edit Metadata` dialog, accessed by the :ref:`edit_meta_information` action.
de: Klick auf die rote Schaltfläche Bücher hinzufügen im oberen rechten Bereich des Dialogs :guilabel:`Metadaten bearbeiten`, erreichbar über die Aktion :ref:`edit_meta_information`.
sv: Klicka på den röda "lägg till böcker"-knappen i övre högra delen av :guilabel:`Edit Metadata` dialog, nås av :ref:`edit_meta_information` åtgärd.

source: Edit metadata
de: Metadaten bearbeiten
sv: Redigera metadata

source: |emii| The :guilabel:`Edit metadata` action has four variations which can be accessed by doing a right-click on the button.
de: |emii| Die Aktion :guilabel:`Metadaten Bearbeiten` hat vier Variationen, die mit einem Rechtsklick auf die Schaltfläche aufgerufen werden können.
sv: |emii| :guilabel:`Redigera metadata` åtgärder har fyra variationer, som kan nås genom att göra ett högerklick på knappen.

source: **Edit metadata individually**: Allows you to edit the metadata of books one-by-one with the option of fetching metadata, including covers, from the Internet. It also allows you to add or remove particular ebook formats from a book.
de: **Metadaten einzeln bearbeiten**: Hiermit können Sie die Metadaten von Büchern nacheinander, einschließlich der Option, Metadaten und Cover aus dem Internet abzurufen, bearbeiten. Zusätzlich können Sie bestimmte eBook-Formate eines Buchs hinzufügen oder entfernen.
sv: **Redigera metadata individuellt**: Gör att du kan redigera metadata för böcker en efter en med möjlighet att hämta metadata, inklusive omslag, från Internet. Det gör också att du kan lägga till eller ta bort vissa e-bokformat från en bok.

source: **Edit metadata in bulk**: Allows you to edit common metadata fields for large numbers of books simulataneously. It operates on all the books you have selected in the :ref:`Library view <search_sort>`.
de: **Metadaten auf einmal bearbeiten**: Sie können gemeinsame Metadatenfelder für eine große Anzahl von Büchern gleichzeitig bearbeiten. Es bearbeitet alle Bücher, die Sie in der :ref:`Bibliotheksansicht<search_sort>` ausgewählt haben.
sv: **Redigera metadata i grupp**: Gör det möjligt att redigera vanliga metadatafält för ett stort antal böcker samtidigt. Den fungerar på alla böcker som du har valt i :ref:`Biblioteksvy <search_sort>`.

source: **Download metadata and covers**: Downloads metadata and covers (if available) for the books that are selected in the book list.
de: **Metadaten und Coverbilder laden**: Lädt Metadaten und Cover (falls verfügbar) für die Bücher, die in der Buchliste ausgewählt wurden.
sv: **Hämta metadata och omslag**: Laddar ner metadata och omslag (om möjligt) för de böcker som är markerade i boklistan.

source: **Merge book records**: Gives you the capability of merging the metadata and formats of two or more book records. You can choose to either delete or keep the records that were not clicked first.
de: **Bucheinträge zusammenführen**: Diese Option gibt Ihnen die Möglichkeit Metadaten und Formate von zwei oder mehr Büchern zusammenzuführen. Die Datensätze der Büchern, die nicht zuerst angeklickt wurden, entweder löschen oder behalten.
sv: **Sammanfoga bokuppgifter**: Ger dig möjlighet att slå samman metadata och format av två eller flera bokposter. Du kan välja att antingen ta bort eller behålla de register som inte klickade först.

source: For more details see :ref:`metadata`.
de: Für weitere Details siehe :ref:`metadata`.
sv: För mer detaljer se :ref:`metadata`.

source: Convert books
de: Bücher konvertieren
sv: Konvertera böcker

source: |cei| Ebooks can be converted from a number of formats into whatever format your ebook reader prefers. Many ebooks available for purchase will be protected by `Digital Rights Management <http://drmfree.calibre-ebook.com/about#drm>`_ *(DRM)* technology. calibre will not convert these ebooks. It is easy to remove the DRM from many formats, but as this may be illegal, you will have to find tools to liberate your books yourself and then use calibre to convert them.
de: |cei| eBooks können aus einer Reihe von Formaten in jedes Format konvertiert werden, welches Ihr eBook-Reader bevorzugt. Viele kommerzielle eBooks werden durch `Digital Rights Management <http://drmfree.calibre-ebook.com/about#drm>`_ *(DRM)* Technologie geschützt. calibre wird diese eBooks nicht konvertieren. DRM kann aus vielen Formaten einfach entfernt werden. Da dies jedoch illegal sein kann, müssen Sie zuerst Werkzeuge finden, um Ihre Bücher zum persönlichen Gebrauch zu befreien. Erst dann können diese mit calibre konvertiert werden.
sv: |cei| E-böcker kan omvandlas från ett antal format till det format din eboksläsare föredrar. Många e-böcker som finns att köpa kommer att skyddas av `Digital Rights Management <http://drmfree.calibre-ebook.com/about#drm>`_ *(DRM)* teknik. calibre kommer inte konvertera dessa e-böcker. Det är lätt att ta bort DRM från många format, men eftersom det kan vara olagligt, du måste hitta verktyg för att frigöra dina böcker själv och sedan använda calibre för att konvertera dem.

source: For most people, conversion should be a simple one-click affair. If you want to learn more about the conversion process, see :ref:`conversion`.
de: In den meisten Fällen sollte die Konvertierung eine einfache Ein-Klick Angelegenheit sein. Wenn Sie mehr über den Konvertierungsprozess erfahren möchten, finden Sie unter :ref:`conversion` weitere Informationen.
sv: För de flesta människor, bör konverteringen vara en enkel en-klicks-uppgift. Om du vill lära dig mer om konverteringsprocessen, se :ref:`conversion`.

source: The :guilabel:`Convert books` action has three variations, accessed by doing a right-click on the button.
de: Die Aktion :guilabel:`Bücher konvertieren` hat drei Variationen, die mit einem Rechtsklick auf die Schaltfläche aufgerufen werden können.
sv: :guilabel:`Kovertera böcker` åtgärden har tre varianter, som nås genom att göra ett högerklick på knappen.

source: **Convert individually**: Allows you to specify conversion options to customize the conversion of each selected ebook.
de: **Einzeln konvertieren**: Sie können die Optionen zur Konvertierung für jedes ausgewählte eBook separat anpassen.
sv: **Konvertera individuellt**: Här kan du ange konverteringsalternativ för att anpassa konverteringen av varje vald e-bok.

source: **Bulk convert**: Allows you to specify options only once to convert a number of ebooks in bulk.
de: **Auf einmal konvertieren**: Sie können die Optionen der Konvertierung einmalig für alle ausgewählte eBooks anpassen und dann alle auf einmal konvertieren.
sv: **Masskonvertering**: Här kan du ange alternativ endast en gång för att omvandla ett antal e-böcker i grupp.

source: **Create a catalog of the books in your calibre library**: Allows you to generate a complete listing of the books in your library, including all metadata, in several formats such as XML, CSV, BiBTeX, EPUB and MOBI. The catalog will contain all the books currently showing in the library view. This allows you to use the search features to limit the books to be catalogued. In addition, if you select multiple books using the mouse, only those books will be added to the catalog. If you generate the catalog in an ebook format such as EPUB, MOBI or AZW3, the next time you connect your ebook reader the catalog will be automatically sent to the device. For more information on how catalogs work, read the :ref:`catalog_tut`.
de: **Einen Katalog Ihrer calibre-Bibliothek erstellen**: Sie können eine vollständige Liste aller Bücher in Ihrer Bibliothek einschließlich aller Metadaten in verschiedenen Formaten, wie z. B. XML, CSV, BiBTeX, EPUB und MOBI, generieren. Der Katalog enthält alle Bücher, die aktuell in der Bibliotheksansicht gezeigt werden. Dies erlaubt Ihnen, die Suchfunktionen zu verwenden, um die Anzahl der zu katalogisierenden Bücher zu reduzieren. Wenn Sie mehrere Bücher mit der Maus auswählen, werden nur diese zum Katalog hinzugefügt. Wird der Katalog in einem eBook-Format wie EPUB, MOBI oder AZW3 generiert, erfolgt beim nächsten Anschluss des eBook-Readers, wenn eingestellt, die automatische Übertragung an das Gerät. Lesen Sie für weitere Informationen zur Funktionsweise der Kataloge :ref:`catalog_tut`.
sv: **Skapa en katalog av böckerna i ditt calibre-bibliotek**: Gör att du kan skapa en fullständig lista över de böcker i biblioteket, inklusive all metadata, i flera format som XML, CSV, BiBTeX, EPUB och MOBI. Katalogen kommer att innehålla alla böcker nu visas i biblioteksvyn. Detta gör att du kan använda sökfunktioner för att begränsa de böcker som ska katalogiserade. Dessutom, om du väljer flera böcker med musen, kommer bara dessa böcker att läggas till katalogen. Om du skapar katalogen i ett e-bokformat som EPUB, MOBI eller AZW3, nästa gång du ansluter e-boksläsare kommer katalogen skickas automatiskt till enheten. För mer information om hur kataloger fungerar, läs :ref:`catalog_tut`.

source: View
de: Vorschau
sv: Visa

source: |vi| The :guilabel:`View` action displays the book in an ebook viewer program. calibre has a built-in viewer for many ebook formats. For other formats it uses the default operating system application. You can configure which formats should open with the internal viewer via Preferences->Behavior. If a book has more than one format, you can view a particular format by doing a right-click on the button.
de: |vi| Die Aktion :guilabel:`Vorschau` zeigt ein Buch mit dem eBook-Betrachter an. calibre hat einen integrierten Betrachter für viele eBook-Formate. Bei anderen Formaten wird die im Betriebssystem hinterlegte Standard-Anwendung verwendet. Über Einstellungen ->Benutzeroberfläche ->Verhalten können Sie festlegen, welche Formate mit dem internen Betrachter geöffnet werden. Wenn ein Buch mehr als ein Format hat, können Sie ein bestimmtes Format durch einen Rechtsklick auf die Schaltfläche auswählen.
sv: |vi| :guilabel:`Visa` åtgärden visar boken i ett e-bokläsarprogram. calibre har en inbyggd läsare för många e-bokformat. För andra format använder den operativsystemets standardapplikation. Du kan konfigurera vilka format ska öppnas med den interna läsaren via Inställningar->Beteende. Om en bok har fler än ett format, kan du visa ett visst format genom att göra ett högerklick på knappen.

source: Send to device
de: An Reader senden
sv: Skicka till enhet
