Repository: Easonqsp/calibre-translations
Catalog: manual/*/gui.po
Languages: de, sv

source: Similarly, if you download metadata for the book, the Book details panel will automatically show you links pointing to the web pages for the book on amazon, worldcat, etc. from where the metadata was downloaded.
de: Weiterhin zeigt Ihnen das Buchdetailfenster automatisch die Informationen zu Web-Seiten-Links von Amazon, Worldcat usw., von dem die Metadaten für das Buch heruntergeladen wurden.
sv: Likaså om du hämtar metadata för boken, visar panelen bokdetaljer automatiskt dig länkar som pekar på webbsidor för boken på Amazon, WorldCat, etc. från där metadata hämtades.

source: You can right click on individual ebook formats in the Book Details panel to delete them, compare them to their original versions, save them to disk, etc.
de: Durch einen Rechtsklick auf einzelnen eBook-Formate in Buchdetails können diese gelöscht, mit der Originalfassung verglichen und auf Festplatte gespeichert werden. Die möglichen Aktionen passen sich nach den vorliegenden Daten an.

source: You can change the cover of the book by simply drag and dropping an image onto the book details panel. You can also add ebook files to the current book by drag and dropping the files onto the book details panel.
de: Ein Buch-Cover kann einfach durch Drag &amp; Drop eines anderen Bilds ins Buchdetailfenster ausgetauscht werden. Ebenso können per Drag &amp; Drop zusätzliche eBook-Dateien zum aktuellen Buch über das Buchdetailfenster hinzufügt werden.

source: Double clicking the book details panel will open it up in a separate popup window.
de: Einen Doppelklick auf das Buchdetailfenster öffnet es in einem separaten Popupfenster.
sv: Dubbelklicka på information om boken så öppnas panelen upp i ett separat fönster.

source: Finally, you can customize exactly what information is displayed in the Book Details panel via :guilabel:`Preferences->Look & Feel->Book Details`.
de: Zuletzt können Sie über :guilabel:`Einstellungen ->Erscheinungsbild ->Buchdetails` einstellen, welche Informationen im Buchdetailfenster angezeigt werden sollen.
sv: Slutligen kan du skräddarsy exakt vilken information som visas i bokdetaljspanelen via :guilabel:`Inställningar->Utseende & Beteende>Bokinformation`.

source: Tag Browser
de: Schlagwort-Browser
sv: Etikettbläddrare

source: The Tag Browser allows you to easily browse your collection by Author/Tags/Series/etc. If you click on any item in the Tag Browser, for example the author name Isaac Asimov, then the list of books to the right is restricted to showing books by that author. You can click on category names as well. For example, clicking on "Series" will show you all books in any series.
de: Mit dem Schlagwort-Browser ist es einfach, Ihre Sammlung nach Autoren, Schlagwörter, Serien usw. zu durchsuchen. Klicken Sie auf irgendein Element im Schlagwort-Browser, wie z. B. auf den Namen des Autors Isaac Asimov, so wird die angezeigte Buchliste rechts auf alle Bücher von diesem Autor beschränkt. Sie können ebenfalls auf den Kategorienamen klicken. So zeigt beispielsweise ein Klick auf "Serie" alle Bücher, die eine Serie haben.
sv: Etikettbläddaren tillåter dig enkelt bläddra i din samling Författare/Etiketter/Serier/etc. Om du klickar på ett objekt i Etikettbläddaren, till exempel författarens namn Isaac Asimov, då begränsas listan över böcker till höger till att visa böcker av denna författare. Du kan klicka på kategorinamn också. Till exempel, klicka på "Serier" kommer att visa dig alla böcker i någon serie.

source: The first click on an item will restrict the list of books to those that contain or match the item. Continuing the above example, clicking on Isaac Asimov will show books by that author. Clicking again on the item will change what is shown, depending on whether the item has children (see sub-categories and hierarchical items below). Continuing the Isaac Asimov example, clicking again on Isaac Asimov will restrict the list of books to those not by Isaac Asimov. A third click will remove the restriction, showing all books. If you hold down the Ctrl or Shift keys and click on multiple items, then restrictions based on multiple items are created. For example you could hold Ctrl and click on the tags History and Europe for finding books on European history. The Tag Browser works by constructing search expressions that are automatically entered into the Search bar. Looking at what the Tag Browser generates is a good way to learn how to construct basic search expressions.
de: Der erste Klick auf ein Element wird die Liste der Bücher auf das Element einschränken, dass mit diesem übereinstimmt oder es enthält. Das obige Beispiel weiterführend, zeigt ein Klick auf Isaac Asimov alle Bücher von diesem Autor. Klicken Sie nochmals auf das Element, werden bei hierarchischen Elemente alle untergeordneten Elemente angezeigt (siehe Unterkategorien und hierarchische Elemente unten). Setzt man das Beispiel Isaac Asimov fort und klickt nochmals auf Isaac Asimov, wird die Liste der Bücher auf alle Autoren eingeschränkt, die nicht von Isaac Asimov sind. Ein dritter Klick entfernt die Einschränkung und es werden wieder alle Bücher angezeigt. Wenn Sie die Strg- oder Umschalttaste gedrückt halten und auf mehrere Elemente klicken, werden Einschränkungen auf mehrere Elemente erstellt. Sie könnten zum Beispiel Strg gedrückt halten und danach auf die Schlagworte Geschichte und Europa klicken, um ihre Suche auf Büchern zur europäischen Geschichte zu begrenzen. Die Schlagwort-Browser arbeitet baut Suchausdrücke auf, die automatisch in die Suchleiste eingegeben werden. Die generierten Ergebnisse des Schlagwort-Browsers zu beobachten, ist eine gute Möglichkeit zu erlernen, man einfache Suche Ausdrücke erstellt.
sv: Det första klicket på ett objekt kommer att begränsa listan över böcker till de som innehåller eller passar objektet. Fortsätt exemplet ovan, att klicka på Isaac Asimov kommer visa böcker av denna författare. Klicka igen på objektet kommer att ändra vad som visas, beroende på om objektet har barn (se underkategorier och hierarkiska artiklar nedan). Fortsätt Isaac Asimov exemplet klicka igen på Isaac Asimov kommer begränsa listan över böcker till dem som inte är av Isaac Asimov. Ett tredje klick tar bort begränsningen, visar alla böcker. Om du håller ned Ctrl eller Skift och klickar på flera objekt, så skapas restriktioner baserade på flera objekt. Till exempel kan du hålla Ctrl och klicka på etiketterna Historia och Europa för att hitta böcker om Europas historia. Etikettbläddraren fungerar genom att bygga sökuttryck som automatiskt förs in i sökfältet. Om man tittar på vad Etikettbläddraren genererar är ett bra sätt att lära sig hur man konstruerar grundläggande sökuttryck.

source: Items in the Tag browser have their icons partially colored. The amount of color depends on the average rating of the books in that category. So for example if the books by Isaac Asimov have an average of four stars, the icon for Isaac Asimov in the Tag Browser will be 4/5th colored. You can hover your mouse over the icon to see the average rating.
de: Die Elemente des Schlagwort-Browsers haben Symbole, die sich teilweise einfärben. Der Grad der Einfärbung hängt hierbei von der durchschnittlichen Bewertung der Bücher dieser Kategorie ab. So werden z. B. Bücher von Isaac Asimov, wenn diese eine durchschnittliche vier Sterne haben, das Symbol im Schlagwort-Browser zu 4/5-farbig einfärben. Wenn die Maus über ein Symbol bewegt wird, bekommt man die durchschnittliche Bewertung angezeigt.
sv: Poster i etikettbläddraren har sina ikoner delvis färgad. Mängden färg beror på den genomsnittliga betyget av böckerna i den kategorin. Så till exempel om böcker av Isaac Asimov har i genomsnitt fyra stjärnor, visas ikonen för Isaac Asimov i etikettbläddraren vara 4/5: e färgad. Du kan hålla musen över ikonen för att se det genomsnittliga betyget.

source: The outer-level items in the tag browser, such as Authors and Series, are called categories. You can create your own categories, called User Categories, which are useful for organizing items. For example, you can use the User Categories Editor (click :guilabel:`Alter Tag Browser->Manage authors, series, etc->Manage User Categories`) to create a user category called Favorite Authors, then put the items for your favorites into the category. User categories can have sub-categories. For example, the user category Favorites.Authors is a sub-category of Favorites. You might also have Favorites.Series, in which case there will be two sub-categories under Favorites. Sub-categories can be created by right-clicking on a user category, choosing "Add sub-category to ...", and entering the sub-category name; or by using the User Categories Editor by entering names like the Favorites example above.
de: Die oberste Ebene eines Elements im Schlagwort-Browser, wie z. B. bei Autoren und Serien, heißen Kategorien. Sie können Ihre eigenen Kategorien, so genannte Benutzer-Kategorien erstellen, die für die Organisation der Elemente nützlich sind. Beispielsweise können Sie den Editor für Benutzer-Kategorien verwenden (Klick auf :guilabel:`Schlagwort- Browser anpassen ->Verwalte Autoren, Schlagwörter, etc. ->Benutzer-Kategorien verwalten`), um eine Benutzer-Kategorie namens Lieblingsautoren zu erstellen, und legen dann die Elemente für Ihre Favoriten in diese Kategorie fest. Benutzerkategorien können Unterkategorien haben. Beispielsweise ist die Benutzerkategorie Favoriten.Lieblingsautoren eine Unterkategorie von Favoriten. Möglicherweise haben Sie auch noch Favoriten.Serien, in diesem Fall werden zwei Unterkategorien unter Favoriten angezeigt. Unterkategorien können durch einen Rechtsklick auf eine Benutzer-Kategorie, Auswahl von "Unterkategorie zu ... hinzufügen" und der Eingabe des Namens für die Unterkategorie erstellt werden; oder mithilfe des Editors für Benutzer-Kategorien durch Eingabe der Namen wie im obigen Favoriten-Beispiel.
sv: Objekten i yttre nivå av etikettbläddraren, till exempel författare och serien, kallas kategorier. Du kan skapa egna kategorier, så kallade användarkategorier, som är användbara för att organisera objekt. Till exempel kan du använda användarkategoriredigering (klicka :guilabel:`Etikettbläddrarmeny-> Hantera författare, serier, etc-> Hantera användarkategorier`) för att skapa en användarkategori som kallas favoritförfattare, sedan lägg objekten på dina favoriter i kategorin. Användarkategorier kan ha underkategorier. Till exempel är de användarkategori Favorites.Authors en underkategori av favoriter. Du kanske också har Favorites.Series, i vilket fall kommer det att finnas två underkategorier under favoriter. Underkategorier kan skapas genom att högerklicka på en användarkategori och att välja "Lägg till underkategori till ...", och går in i underkategorin namn; eller genom att använda användarkategoriredigering genom att ange namn som favoriter i exemplet ovan.

source: You can search user categories in the same way as built-in categories, by clicking on them. There are four different searches cycled through by clicking:
de: Sie können Benutzerkategorien auf die gleiche Weise suchen wie integrierte Kategorien: durch anklicken. Beim Klicken auf das Icon gibt es vier nacheinander durchlaufende Suchenaktionen:
sv: Du kan söka användarkategorier på samma sätt som inbyggda kategorier, genom att klicka på dem. Det finns fyra olika sökningar som cyklas igenom genom att klicka:

source: "everything matching an item in the category" indicated by a single green plus sign.
de: "Alle zu der Kategorie passende Elemente" durch ein einziges grünes Pluszeichen gekennzeichnet.
sv: "allt som passar en post i kategorin" anges med ett enda gröna plustecknet.

source: "everything matching an item in the category or its sub-categories" indicated by two green plus signs.
de: "Alle zu der Kategorie oder den zugehörigen Unterkategorien passende Elemente" durch zwei grüne Pluszeichen gekennzeichnet.
sv: "allt som passar en post i den kategori eller dess underkategorier" anges med två gröna plustecknet.

source: "everything not matching an item in the category" shown by a single red minus sign.
de: "Alle zu der Kategorie nicht passende Elemente " durch ein einzelnes rotes Minuszeichen angezeigt.
sv: "allt som inte passar en post i kategorin" visas med ett enda röd minustecken.

source: "everything not matching an item in the category or its sub-categories" shown by two red minus signs.
de: "Alle zu der Kategorie oder den zugehörigen Unterkategorien nicht passende Elemente" durch zwei rote Minus-Zeichen angezeigt.
sv: "allt som inte passar en post i den kategori eller dess underkategorier" visas av två röda minustecken.

source: It is also possible to create hierarchies inside some of the text categories such as tags, series, and custom columns. These hierarchies show with the small triangle, permitting the sub-items to be hidden. To use hierarchies of items in a category, you must first go to Preferences->Look & Feel and enter the category name(s) into the "Categories with hierarchical items" box. Once this is done, items in that category that contain periods will be shown using the small triangle. For example, assume you create a custom column called "Genre" and indicate that it contains hierarchical items. Once done, items such as Mystery.Thriller and Mystery.English will display as Mystery with the small triangle next to it. Clicking on the triangle will show Thriller and English as sub-items. See :ref:`Managing subgroups of books, for example "genre" <subgroups-tutorial>` for more information.
de: Es ist auch möglich, Hierarchien innerhalb einiger Text-Kategorien wie Schlagwörtern, Serien und benutzerdefinierte Spalten zu erstellen. Diese durch ein kleines Dreieck gekennzeichneten Hierarchien, ermöglichen ein Verstecken der Unterelemente. Um eine Kategorie mit hierarchische Elementen verwenden zu können, müssen zuerst unter "Einstellungen ->Erscheinungsbild ->Schlagwortbrowser" der bzw. die Name(n) im Feld "Kategorien mit hierarchischen Einträgen" eingegeben werden. Sobald dies erfolgte, werden Elemente dieser Kategorie, welche Punkte enthalten, durch ein kleines Dreieck angezeigt. Angenommen, Sie erstellen z. B. eine benutzerdefinierte Spalte mit dem Namen "Genre" und stellen ein, dass diese hierarchische Elemente enthält. Sobald dies eingestellt wurde, werden Elemente wie Mystery.Thriller und Mystery.Englisch als Mystery mit einem kleinen Dreieck daneben angezeigt. Klick man auf das Dreieck, werden die Unterelemente Thriller und Englisch angezeigt. Für weitere Informationen siehe :ref:`Untergruppen von Büchern verwalten, zum Beispiel "Genre" <subgroups-tutorial>`.
sv: Det är också möjligt att skapa hierarkier inom några av kategorierna text såsom etiketter, serier och anpassade kolumner. Dessa hierarkier visar den lilla triangeln, medger delposter att vara dolda. För att använda hierarkier av objekt i en kategori, måste du först gå till Inställningar->Utseende och beteende och ange kategorinamn (s) in i "Kategorier med hierarkisk objekt" rutan. När detta är gjort, kommer poster i den kategorin som innehåller punkter visas med hjälp av den lilla triangeln. Till exempel, anta att du skapar en egen kolumn som heter "Genre" och pekar på att den innehåller hierarkiska objekt. När detta är gjort, sådant som Mystery.Thriller och Mystery.English visas som Mystery med den lilla triangeln bredvid den. Genom att klicka på triangeln visas Thriller och engelska som delposter. Se :ref:`Hantera undergrupper av böcker, till exempel “genre” <subgroups-tutorial>` för mer information.

source: Hierarchical items (items with children) use the same four 'click-on' searches as user categories. Items that do not have children use two of the searches: "everything matching" and "everything not matching".
de: Hierarchische Elemente (Elemente mit Untergruppen) verwenden die gleichen vier "Weiter-Klick"-Suchvorgänge als Benutzerkategorien. Elemente, die ohne Untergruppen verwenden nur zwei der Suchvorgänge: "Alle passende" und "Alle nicht passende".
sv: Hierarkiska objekt (objekt med barn) använder samma fyra "klicka-på" sökningar som användarkategorier. Poster som inte har barn använder två av de sökningar: "allt som passar" och "allt som inte passar".

source: You can drag and drop items in the Tag browser onto user categories to add them to that category. If the source is a user category, holding the shift key while dragging will move the item to the new category. You can also drag and drop books from the book list onto items in the Tag Browser; dropping a book on an item causes that item to be automatically applied to the dropped books. For example, dragging a book onto Isaac Asimov will set the author of that book to Isaac Asimov. Dropping it onto the tag History will add the tag History to the book's tags.
de: Sie können Elemente über Drag &amp; drop dem Schlagwort-Browser auf Benutzerkategorien dieser Kategorie hinzufügen. Wenn die Quelle eine Benutzerkategorie ist, wird durch die gleichzeitig gedrückte Umschalt-Taste während des Ziehens ein Element in die neue Kategorie verschoben. Sie können auch Bücher durch Drag &amp; drop aus der Buchliste auf ein Element im Schlagwort-Browser ziehen; ein Buch auf ein Element zu ziehen bewirkt, dass das Element automatisch auf die abgelegten Bücher angewendet wird. Beispielsweise bewirkt das ziehen eines Buches auf den Autor Isaac Asimov, dass dieses Buch den Autoren-Name Isaac Asimov zugewiesen bekommt. Es auf dem Tag Geschichte ablegen bedeutet, dass das Schlagwort Geschichte dem Buch hinzugefügt wird.
sv: Du kan dra och släppa objekt i etikettbläddraren på användarkategorier för att lägga till dem i den kategorin. Om källan är en användarkategori, hålla Skift-tangenten medan du drar flyttar objektet till den nya kategorin. Du kan också dra och släppa böcker från boklistan på objekt i etikettbläddraren; släppa en bok om ett objekt medför att objekt som ska tillämpas automatiskt på de släppta böckerna. Till exempel kommer dra en bok på Isaac Asimov sätter författaren till denna bok till Isaac Asimov. Att släppa den på etiketten Historik kommer att lägga till etiketten Historik till bokens etiketter.

source: There is a search bar at the top of the Tag Browser that allows you to easily find any item in the Tag Browser. In addition, you can right click on any item and choose one of several operations. Some examples are to hide the it, rename it, or open a "Manage x" dialog that allows you to manage items of that kind. For example, the "Manage Authors" dialog allows you to rename authors and control how their names are sorted.
de: Am oberen Rand des Schlagwort-Browsers gibt es eine Suchleiste, über die man jedes Element im Schlagwort-Browser problemlos finden kann. Darüber hinaus können Sie einen Rechtsklick auf ein Element machen und haben dann die Auswahl auf verschiedene Aktionen wie z. B. ausblenden, umbenennen oder öffnen eines "Verwalte X"-Dialogs, der es Ihnen erlaubt, Elemente dieser Art verwalten. Beispielsweise kann man über den Dialog "Autoren verwalten" Autoren umbenennen oder einstellen, wie ein Name sortiert wird.
sv: Det finns ett sökfält överst på etikettbläddraren som tillåter dig att enkelt hitta ett objekt i etikettbläddraren. Dessutom kan du högerklicka på ett objekt och välja ett av flera operationer. Några exempel är att dölja det, byta namn på det, eller öppna en "Hantera x" dialogruta som låter dig hantera objekt av detta slag. Till exempel dialogruta "Hantera Författare" kan du ändra namn på författare och kontrollera hur deras namn sorteras.

source: You can control how items are sorted in the Tag browser via the :guilabel:`Alter Tag Browser` button at the bottom of the Tag Browser. You can choose to sort by name, average rating or popularity (popularity is the number of books with an item in your library; for example, the popularity of Isaac Asimov is the number of books in your library by Isaac Asimov).
de: Sie können steuern, wie Elemente im Schlagwort-Browser sortiert werden. Dies erfolgt über die Schaltfläche :guilabel:`Schlagwort-Browser anpassen` am unteren Rand des Schlagwort-Browsers. Es kann nach Name, durchschnittliche Bewertung oder Beliebtheit sortieren werden (Popularität ist die Anzahl der Bücher mit einem Element in der Bibliothek, die Popularität von Isaac Asimov ist beispielsweise die Anzahl der Bücher in der Bibliothek von Isaac Asimov).
sv: Du kan styra hur objekt sorteras i etikettbläddraren via :guilabel:`Alter Tag Browser` knappen längst ner på Tag Browser. Du kan välja att sortera efter namn, genomsnittliga betyget eller popularitet (popularitet är antalet böcker med ett objekt i biblioteket, till exempel, är populariteten av Isaac Asimov antalet böcker i biblioteket av Isaac Asimov).

source: Cover Grid
de: Cover-Raster
sv: Omslagsrutnät

source: You can have calibre display a grid of book covers instead of a list of books, if you prefer to browse your collection by covers instead. The :guilabel:`Cover Grid` is activated by clicking the grid button in the bottom right corner of the main calibre window. You can customize the cover sizes and the background of the cover grid via :guilabel:`Preferences->Look & Feel->Cover Grid`. You can even have calibre display any specified field under the covers, such as title or authors or rating or a custom column of your own devising.
de: calibre kann statt einer Buchliste ein Raster von Buchcovern anzeigen, falls Sie es vorziehen, Ihre Sammlung über eine Coveransicht zu durchsuchen. Die Ansicht :guilabel:`Cover-Raster` wird durch einen Klick auf die Raster-Schaltfläche in der unteren rechten Ecke des calibre-Hauptfenster aktiviert. Cover-Größen und Hintergrund des Cover-Rasters können über :guilabel:`Einstellungen ->Erscheinungsbild ->Cover-Raster` angepasst werden. calibre kann jedes Metadatenfeld und auch selbst erstellte benutzerdefinierte Felder unter dem Cover anzeigen, wie z. B. Titel, Autoren oder Bewertungen. Weiterhin kann calibre Embleme, basierend auf selbst erstellten Regeln, neben einem Cover anzeigen.
sv: Du kan låta calibre visa ett rutnät av bokomslag stället för en lista med böcker, om du föredrar att bläddra i din samling av omslag istället. Den :guilabel:`Omslagsrutnät` aktiveras genom att klicka på knappen nätet i det nedre högra hörnet av huvudfönstret calibre. Du kan anpassa omslagsstorlekar och bakgrunden till omslagsrutnät via :guilabel:`Inställningar->Utseende & Beteende>Omslagsrutnät`. Du kan även låta calibre visa någon angivna fältet under omslaget, t.ex. titel eller författare eller betyg eller en egen kolumn som du själva har utformat.

source: Cover Browser
de: Coverbild-Browser
sv: Omslagsbläddrare

source: In addition to the cover grid described above, you can also have calibre display covers in the single row. This is activated via a button in the lower right corner of the main window. In :guilabel:`Preferences->Look & Feel->Cover Browser` you can change the number of covers displayed, and even have the cover browser display itself in a separate popup window.
de: Zusätzlich kann calibre zum oben beschriebenen Cover-Raster Buch-Cover in einer einzelnen Zeile darstellen. Diese Ansicht wird über die Schaltfläche Coverbild-Browser in der unteren rechten Ecke des Hauptfensters aktiviert. Über :guilabel:`Einstellungen ->Erscheinungsbild ->Coverbild-Browser` können die Anzahl der angezeigten Cover und weitere Einstellungen vorgenommen werden. Es ist auch möglich, den Coverbild-Browser selbst in einem separaten Popupfenster anzuzeigen.
sv: Förutom omslag som beskrivs ovan, kan du också låta calibre visa omslag på en enda rad. Detta aktiveras via en knapp i det nedre högra hörnet av huvudfönstret. I :guilabel:`Inställningar->Utseende & Beteende->Omslagsbläddrare` kan du ändra antalet omslag visas, och även låta omslagen visas i ett separat fönster.

source: Quickview
de: Schnellansicht
sv: Snabbvisning
