Repository: Easonqsp/calibre-translations
Catalog: manual/*/gui.po
Languages: de, sv

source: The :guilabel:`Connect/Share` action has four variations, accessed by doing a right-click on the button.
de: Die Aktion :guilabel:`Verbinden/Teilen` hat vier Variationen, die durch Rechtsklick auf die Schaltfläche abgerufen werden können.
sv: :guilabel:`Anslut/dela ut` åtgärden har fyra variationer, som nås genom att göra ett högerklick på knappen.

source: **Connect to folder**: Allows you to connect to any folder on your computer as though it were a device and use all the facilities calibre has for devices with that folder. Useful if your device cannot be supported by calibre but is available as a USB disk.
de: **Mit Verzeichnis verbinden**: Ermöglicht die Verbindung zu einem beliebigen Ordner auf Ihrem Computer und stellt das Verzeichnis wie ein Geräteverzeichnis zur Nutzung aller Möglichkeiten von calibre zur Verfügung. Dies ist hilfreich, falls Ihr Gerät nicht von calibre unterstützt wird jedoch als USB-Festplatte/Massenspeicher zugänglich ist.
sv: **Anslut till mapp**: Låter dig ansluta till valfri mapp på din dator som om den vore en enhet och använda alla faciliteter calibre har för enheter med den mappen. Användbart om enheten inte kan stödjas av calibre, men finns som en USB-disk.

source: **Connect to iTunes**: Allows you to connect to your iTunes books database as though it were a device. Once the books are sent to iTunes, you can use iTunes to make them available to your various iDevices.
de: **Mit iTunes verbinden**: ermöglicht Ihnen eine Verbindung zu Ihrer iTunes-Datenbank, als wäre calibre ein Gerät. Sobald die Bücher an iTunes gesendet wurden, können Sie iTunes verwenden, um diese Ihren verschiedenen iDevices zur Verfügung zu stellen.
sv: **Anslut till iTunes**: Låter dig ansluta till iTunes-böckers databas som om det vore en enhet. När böckerna skickas till iTunes kan du använda iTunes för att göra dem tillgängliga för dina olika iDevices.

source: **Start Content Server**: Starts calibre's built-in web server. When started, your calibre library will be accessible via a web browser from the Internet (if you choose). You can configure how the web server is accessed by setting preferences at :guilabel:`Preferences->Sharing->Sharing over the net`
de: **Inhalte-Server starten**: calibre's integrierten Web-Server starten. Sie können (falls ausgewählt) auf Ihre calibre-Bibliothek über den Web-Browser via Internet zugreifen, sobald dieser gestartet wurde. Der Zugriff auf den Webserver wird über :guilabel:`Einstellungen ->Versand ->Netzwerk-Server` eingestellt.
sv: **Starta mediaserver**: Startar calibres inbyggda webbserver. Vid start kommer ditt calibre-biblioteket vara tillgänglig via en webbläsare från Internet (om du väljer). Du kan konfigurera hur webbservern nås genom att ställa in preferenser på :guilabel:`Inställningar->Dela->Dela på nätet`

source: **Setup email based sharing of books**: Allows sharing of books and news feeds by email. After setting up email addresses for this option, calibre will send news updates and book updates to the entered email addresses. You can configure how calibre sends email by setting preferences at :guilabel:`Preferences->Sharing->Sharing books by email`. Once you have set up one or more email addresses, this menu entry will be replaced by menu entries to send books to the configured email addresses.
de: **Richtet den E-Mail Versand von Büchern ein**: Ermöglicht den Austausch von Büchern und Newsfeeds per E-Mail. Nach der Einrichtung von E-Mail-Adressen für diese Option sendet calibre Nachrichten und Buch-Updates an die eingegebene Email-Adressen. Wie calibre E-Mails versendet, wird über :guilabel:`Einstellungen ->Versand ->Bücherversand per E-Mail` eingestellt. Nachdem Sie eine oder mehrere E-Mail-Adressen eingerichtet haben, wird dieser Menüeintrag durch Menüeinträge Bücher an die konfigurierten E-Mail-Adressen senden ersetzt.
sv: **Ställ in epostbaserad delning av böcker**: Tillåter delning av böcker och nyhetsflöden via e-post. När du konfigurerat e-postadresser för detta alternativ kommer calibre skicka nyhetsuppdateringar och boka uppdateringar till de angivna e-postadresser. Du kan konfigurera hur calibre skickar e-post genom att ange inställningar på :guilabel:`Inställningar->Dela->Dela Böcker via e-Post`. När du har ställt in en eller flera e-postadresser, kommer menyalternativet ersättas av menyposter för att skicka böcker till de konfigurerade e-postadresser.

source: Remove books
de: Bücher entfernen
sv: Ta bort böcker

source: |rbi| The :guilabel:`Remove books` action **deletes books permanently**, so use it with care. It is *context sensitive*, i.e. it depends on which :ref:`catalog <catalogs>` you have selected. If you have selected the :guilabel:`Library`, books will be removed from the library. If you have selected the ebook reader device, books will be removed from the device. To remove only a particular format for a given book use the :ref:`edit_meta_information` action. Remove books also has five variations which can be accessed by doing a right-click on the button.
de: |rbi| Durch die Aktion :guilabel:`Bücher entfernen` **werden Bücher dauerhaft gelöscht**, daher sind diese Aktionen mit Vorsicht zu verwenden. Sie sind *Kontext-abhängig* d. h., es kommt darauf an, welche :ref:`Kataloge<catalogs>` ausgewählt wurden. Wenn Sie eine :guilabel:`Bibliothek` ausgewählt haben, werden Bücher aus der Bibliothek entfernt. Falls Sie einen eBook-Reader ausgewählt haben, werden Bücher von einem Gerät entfernt. Benutzen Sie die Aktion :ref:`edit_meta_information`, um nur ein einzelnes Format für ein ausgewähltes Buch zu entfernen. :guilabel:`Bücher entfernen` hat fünf Variationen, die durch Rechtsklick auf die Schaltfläche abgerufen werden können.
sv: |rbi| Med :guilabel:`Ta bort böcker` åtgärden **raderas böcker permanent**, så använd den med omsorg. Det är *kontextkänslig*, det vill säga att det beror på vilken :ref:`katalog <catalogs>` du har valt. Om du har valt :guilabel:`Bibliotek`, kommer böcker att tas bort från biblioteket. Om du har valt eboksläsarenheten kommer böcker att tas bort från enheten. För att ta bort endast ett visst format för en given bok använd :ref:`edit_meta_information` åtgärd. Ta bort böcker har också fem variationer som kan nås genom att göra en högerklicka på knappen.

source: **Remove selected books**: Allows you to **permanently** remove all books that are selected in the book list.
de: **Ausgewählte Bücher entfernen**: Löscht **dauerhaft** alle Bücher, die in der Buchliste ausgewählt wurden.
sv: **Ta bort valda böcker**: Tillåter dig att **permanent** ta bort alla böcker som är valda i boklistan.

source: **Remove files of a specific format from selected books...**: Allows you to **permanently** remove ebook files of a specified format from books that are selected in the book list.
de: **Entfernt angegebene Dateiformate aus den ausgewählten Büchern ...**: Löscht **dauerhaft** eBook-Dateien eines bestimmten Formats aus Büchern, die aus der Buchliste ausgewählt wurden.
sv: **Ta bort filer av specifikt format från valda böcker...**: Tillåter dig att **permanent** ta bort e-böcker med ett specifikt format från böcker som är valda i boklistan.

source: **Remove all formats from selected books, except...**: Allows you to **permanently** remove ebook files of any format except a specified format from books that are selected in the book list.
de: **Alle Formate der ausgewählten Bücher entfernen, außer ...**: Löscht **dauerhaft** alle eBook-Dateiformate außer dem angegebenen Format aus Büchern, die aus der Buchliste ausgewählt wurden.
sv: **Ta bort alla format från valda böcker, utom...**: Tillåter dig att **permanent** ta bort filer av godtyckligt format förutom ett angivet specifikt format från böcker som är valda i boklistan.

source: **Remove all formats from selected books**: Allows you to **permanently** remove all ebook files from books that are selected in the book list. Only the metadata will remain.
de: **Alle Formate von ausgewählten Bücher entfernen**: Löscht **dauerhaft** alle eBook-Dateien aus Büchern, die aus der Buchliste ausgewählt wurden. Es bleibt nur die Metadaten erhalten.
sv: **Ta bort alla format från valda böcker**: Tillåter dig att **permanent** ta bort filer från böcker som är valda i boklistan. Bara metadata kommer återstå.

source: **Remove covers from selected books**: Allows you to **permanently** remove cover image files from books that are selected in the book list.
de: **Coverbilder der ausgewählten Bücher entfernen**: löscht **dauerhaft** Coverbild-Dateien aus Bücher, die aus der Buchliste ausgewählt wurden.
sv: **Ta bort omslag från valda böcker**: Tillåter dig att **permanent** ta bort omslagsbildfiler från böcker som är valda i boklistan.

source: **Remove matching books from device**: Allows you to remove ebook files from a connected device that match the books that are selected in the book list.
de: **Übereinstimmende Bücher vom Gerät löschen** entfernt eBook-Dateien von einem angeschlossenen Gerät, die den ausgewählten Büchern der Buchliste entsprechen.
sv: **Ta bort passande böcker från enheten**: Tillåter dig att **permanent** ta bort e-bokfiler från anslutna enheter som passar böcker som är valda i boklistan.

source: Note that when you use Remove books to delete books from your calibre library, the book record is permanently deleted, but on Windows and OS X the files are placed into the recycle bin. This allows you to recover them if you change your mind.
de: Beachten Sie, dass bei der Verwendung von :guilabel:`Bücher entfernen`, Buchdatensätze dauerhaft aus Ihrer calibre-Bibliothek gelöscht werden. Unter Windows und OS X werden die gelöschten Dateien in den Papierkorb verschoben. Dadurch können Sie diese wiederherstellen, falls Sie Ihre Meinung ändern.
sv: Observera att när du använder Ta bort böcker för att ta bort böcker från ditt calibre-biblioteket, tas bokposten bort permanent, men på Windows och OS X placeras filerna i papperskorgen. Detta gör att du kan återställa dem om du ångrar dig.

source: Preferences
de: Einstellungen
sv: Inställningar

source: |cbi| The :guilabel:`Preferences` action allows you to change the way various aspects of calibre work. It has four variations, accessed by doing a right-click on the button.
de: |cbi| Über die Aktion :guilabel:`Einstellungen` können Sie die vielfältigen Einstellungen und das Verhalten von calibre anpassen. Sie hat vier Variationen, die durch Rechtsklick auf die Schaltfläche aufgerufen werden können.
sv: |cbi| :guilabel:`Inställningar` åtgärden tillåter dig ändra hur olika aspekter av calibres arbete. Den har fyra variationer, som nås genom att göra ett högerklick på knappen.

source: **Preferences**: Allows you to change the way various aspects of calibre work. Clicking the button also performs this action.
de: **Verhalten von calibre ändern**: Hierüber haben Sie Zugriff auf die vielfältigen Einstellungen und das Verhalten von calibre. Ein Klick auf die Schaltfläche :guilabel:`Einstellungen` führt die gleiche Aktion aus.
sv: **Inställningar**: Tillåter dig ändra hur olika aspekter av calibres arbete. Genom att klicka på knappen utförs också denna åtgärd.

source: **Run welcome wizard**: Allows you to start the Welcome Wizard which appeared the first time you started calibre.
de: **Willkommens-Assistenten ausführen**: Führt den Willkommen-Assistenten, der sich beim ersten Start nach der Installation von calibre öffnet, erneut aus.
sv: **Kör välkomstguide**: Tillåter dig att starta välkomstguiden som dyker upp första gången du startar calibre.

source: **Get plugins to enhance calibre**: Opens a new windows that shows plugins for calibre. These plugins are developed by third parties to extend calibre's functionality.
de: **calibre durch Plugins verbessern**: Öffnet ein neues Fenster mit zur Verfügung stehenden Anwender-Plugins für calibre. Diese Plugins werden von Drittanbietern zur Erweiterung von calibre's Funktionsumfang entwickelt.
sv: **Hämta tillägg för att förbättra calibre**: Öppnar ett nytt fönster som visar tillägg för calibre. Dessa tillägg är utvecklade av tredje part för att utöka calibres funktionalitet.

source: **Restart in debug mode**: Allows you to enable a debugging mode that can assist the calibre developers in solving problems you encounter with the program. For most users this should remain disabled unless instructed by a developer to enable it.
de: **Neustart im Fehlerdiagnosemodus**: Aktiviert den Fehlerdiagnosemodus, mit dessen Hilfe calibre's Entwickler zur Lösung von aufgetretenen Problemen im Programm unterstützen werden können. Diese Option sollte nur aktiviert werden, wenn ein Entwickler Sie dazu auffordert.
sv: **Starta om i felsökningsläge**: Tillåter dig att aktivera felsökningsläge som kan hjälpa calibres utvecklarna att lösa problem som du stöter på med programmet. För de flesta användare bör det förbli inaktiverad om inte instrueras av en utvecklare att aktivera det.

source: Catalogs
de: Kataloge
sv: Kataloger

source: A *catalog* is a collection of books. calibre can manage two types of different catalogs:
de: A *Katalog* ist eine Sammlung von Büchern. calibre kann zwei Arten von Katalogen verwalten:
sv: En *Katalog* är en samling av böcker. calibre kan hantera två typer av olika kataloger:

source: **Library**: This is a collection of books stored in your calibre library on your computer.
de: **Bibliothek**: Dies ist eine Sammlung von Büchern, die in Ihrer calibre-Bibliothek auf dem Computer gespeichert wurde.
sv: **Bibliotek**: Detta är en samling böcker som lagras i ditt calibre-biblioteket på din dator.

source: **Device**: This is a collection of books stored in your ebook reader. It will be available when you connect the reader to your computer.
de: **Gerät**: Dies ist eine Sammlung von gespeicherten Büchern auf Ihrem eBook-Reader. Diese steht zur Verfügung, sobald der Reader mit dem Computer verbunden wird.
sv: **Enhet**: Detta är en samling böcker som lagras i din eboksläsare. Det kommer att vara tillgängliga när du ansluter läsaren till datorn.

source: Many operations, such as adding books, deleting, viewing, etc., are context sensitive. So, for example, if you click the View button when you have the **Device** catalog selected, calibre will open the files on the device to view. If you have the **Library** catalog selected, files in your calibre library will be opened instead.
de: Viele Tätigkeiten, wie das Hinzufügen von Bücher, löschen, Anzeigen usw. sind kontextbezogen. So können Sie zum Beispiel im ausgewählten Katalog **Gerät** die Schaltfläche Vorschau klicken und calibre öffnet die auf dem Gerät ausgewählte Datei. Wurde der Katalog **Bibliothek** ausgewählt, wird stattdessen die Datei in Ihrer calibre-Bibliothek geöffnet.
sv: Många operationer, som att lägga böcker, ta bort, visa, etc., är beroende av kontext. Så, till exempel, om du klickar på knappen Visa när du har **Enhet**-katalog vald, kommer calibre att öppna filerna på enheten för att visa. Om du har **Bibliotek**-katalog vald, kommer filer i ditt calibre-bibliotek öppnas i stället.

source: Search & Sort
de: Suchen & Sortieren
sv: Sök & sortera

source: The Search & Sort section allows you to perform several powerful actions on your book collections.
de: Im Abschnitt Suche & Sortieren können Sie vielfältige leistungsstarke Aktionen innerhalb der Büchersammlungen ausführen.
sv: Sök & sortera avsnittet tillåter dig utföra flera kraftfulla åtgärder på dina boksamlingar.

source: You can sort them by title, author, date, rating, etc. by clicking on the column titles. You can also sub-sort, i.e. sort on multiple columns. For example, if you click on the title column and then the author column, the book will be sorted by author and then all the entries for the same author will be sorted by title.
de: Sie können diese durch Klicken auf die Spaltentitel nach Titel, Autor, Datum, Bewertung, etc. sortieren. Auch Untersortierungen, d. h. über mehrere Spalten sortieren, sind möglich. Wenn Sie beispielsweise auf den Titel- und danach der Autor-Spalte klicken, werden die Bücher zuerst nach Autoren sortiert und danach alle Einträge des gleichen Autors nach Titel sortiert.
sv: Du kan sortera dem efter titel, författare, datum, betyg, etc. genom att klicka på kolumnrubrikerna. Du kan också göra undersortering, dvs sortera på flera kolumner. Till exempel, om du klickar på titelkolumnen och sedan författarkolumnen, kommer boken att sorteras efter författare och sedan alla poster för samma författare sorteras efter titel.

source: You can search for a particular book or set of books using the search bar. More on that below.
de: Sie können über die Adressleiste für ein bestimmtes Buch oder Bücher suchen. Nachfolgend mehr dazu.
sv: Du kan söka efter en viss bok eller en uppsättning böcker med hjälp av sökfältet. Mer om detta nedan.

source: You can quickly and conveniently edit metadata by double-clicking the entry you want changed in the list.
de: Sie können Metadaten schnell und bequem durch einen Doppelklick auf das zu änderende Buch in der Liste bearbeiten.
sv: Du kan snabbt och bekvämt redigera metadata genom att dubbelklicka på posten som du vill ändra i listan.

source: You can perform :ref:`actions` on sets to books. To select multiple books you can either:
de: Sie können :ref:`actions` auf eine Reihe von Büchern gleichzeitig ausführen. Die Auswahl mehrerer Bücher geschieht durch:
sv: Du kan utföra :ref:`actions` på uppsättningar av böcker. För att välja flera böcker kan du antingen:

source: Keep the :kbd:`Ctrl` key pressed and click on the books you want selected.
de: Bei gedrückter :kbd:`Strg`-Taste nacheinander auf die gewünschten Bücher klicken.
sv: Håll :kbd:`Ctrl` tangenten nedtryckt och klicka på de böcker du vill markera.

source: Keep the :kbd:`Shift` key pressed and click on the starting and ending book of a range of books you want selected.
de: Mit gedrückter :kbd:`Umschalt`-Taste auf das erste und letzte Buch einer Reihe von hintereinander liegenden Büchern klicken.
sv: Håll :kbd:`Shift` tangenten nedtryckt och klicka på start- och slutbok av en rad böcker som du vill markera.

source: You can configure which fields you want displayed by using the :ref:`configuration` dialog.
de: Sie können die angezeigten Felder mithilfe des Dialogs :ref:`configuration` nach ihren Wünschen gestalten.
sv: Du kan konfigurera vilka fält som ska visas med hjälp av :ref:`configuration` dialogen.

source: The Search Interface
de: Die Suchoberfläche
sv: Sökgränssnittet

source: You can search all the metadata by entering search terms in the search bar. Searches are case insensitive. For example::
de: Sie können alle Metadaten durch Eingabe von Suchbegriffen in der Suchleiste suchen. Die Suche ist unabhängig von der Groß-/Kleinschreibung. Zum Beispiel::
sv: Du kan söka allt metadata genom att skriva in sökord i sökfältet. Sökningar är skiftlägesokänsliga. Exempelvis::

source: This will match all books in your library that have ``Asimov`` and ``Foundation`` in their metadata and are available in the LRF format. Some more examples::
de: Diese Suche wird alle Bücher in der Bibliothek finden, die ``Asimov`` und ``Foundation`` in ihren Metadaten enthalten und als LRF-Format verfügbar sind. Einige weitere Beispiele::
sv: Detta kommer att passas mot alla böcker i biblioteket som har ``Asimov`` och ``Foundation`` i sitt metadata och finns i LRF-format. Några fler exempel::

source: Searches are by default 'contains'. An item matches if the search string appears anywhere in the indicated metadata. Two other kinds of searches are available: equality search and search using `regular expressions <http://en.wikipedia.org/wiki/Regular_expression>`_.
de: Suchen basieren standardmäßig auf 'enthält'. Ein Element wird gefunden, wenn die Suchzeichenfolge an einer beliebigen Stelle in den angegebenen Metadaten enthalten ist wird. Es sind noch zwei andere Such-Arten verfügbar: Gleichheit und Suche mit `Regulären Ausdrücken <http://en.wikipedia.org/wiki/Regular_expression>`_.
sv: Sökningar är som standard "innehåller". Ett objekt passar om söksträngen visas någonstans i den angivna metadata. Två andra typer av sökningar finns: likhetssökning och sök hjälp av `reguljära uttryck <http://en.wikipedia.org/wiki/Regular_expression>`_.

source: Equality searches are indicated by prefixing the search string with an equals sign (=). For example, the query ``tag:"=science"`` will match "science", but not "science fiction" or "hard science". Regular expression searches are indicated by prefixing the search string with a tilde (~). Any `python-compatible regular expression <https://docs.python.org/2/library/re.html>`_ can be used. Note that backslashes used to escape special characters in regular expressions must be doubled because single backslashes will be removed during query parsing. For example, to match a literal parenthesis you must enter ``\\(``. Regular expression searches are 'contains' searches unless the expression contains anchors.
de: Gleichheitssuchen werden durch Voranstellen der Suchzeichenfolge mit einem Gleichheitszeichen (=) angegeben. Z. B. die Abfrage ``tag:"=science"`` entspricht "science", aber nicht "science fiction" oder "hard science". Suchen mit Reguläre Ausdrücken werden durch eine Tilde (~) vor der zu suchende Zeichenfolge eingeleitet. Jede `Python-kompatible regulärer Ausdruck <https://docs.python.org/2/library/re.html>`_ kann verwendet werden. Beachten Sie, dass zur Verwendung von umgekehrte Schrägstriche bzw. Backslashes, Sonderzeichen in Reqular Ausdrücken diese verdoppelt werden müssen, da einzelne Backslashes beim Analysieren der Abfrage entfernt werden. Z. B. um eine Klammer zu finden, muss ``\\(`` eingegeben werden. Regulären Ausdrücke sind 'enthält'-Suchen, sofern im Ausdruck kein Anker verwendet wird.
sv: Likhetssökningar indikeras genom att inleda söksträngen med ett likhetstecken (=). Till exempel frågan ``tag: "= vetenskap" `` kommer att passa "vetenskap", men inte "science fiction" eller "hård vetenskap". Sök med reguljärt uttryck indikeras genom att inleda söksträngen med tilde (~). Varje `python-kompatibla reguljära uttryck <https://docs.python.org/2/library/re.html>`_ kan användas. Observera att omvända snedstreck som används för att undkomma specialtecken i reguljära uttryck måste fördubblas, eftersom enskilda snedstreck kommer att tas bort under frågeanalys. Till exempel, för att matcha en bokstavlig parentes måste du ange ``\\(``. Reguljära uttryckssökningar är "innehåller" sökningar om inte uttrycket innehåller ankare.

source: Should you need to search for a string with a leading equals or tilde, prefix the string with a backslash.
de: Wird eine Zeichenfolge mit einem führenden Gleichheitszeichen oder Tilde gesucht, schreibt man vor die Zeichenfolge ein Backslash.
sv: Om du behöver söka efter en sträng med inledande likhet- eller tilde-tecken, prefixa strängen med ett omvänt snedstreck.
