Repository: Easonqsp/calibre-translations
Catalog: manual/*/index.po
Languages: da, de, fr, hr, ko, pl, sv

source: |app| User Manual
da: |app| - brugermanual

source: |app| is an ebook library manager. It can view, convert and catalog ebooks in most of the major ebook formats. It can also talk to many ebook reader devices. It can go out to the Internet and fetch metadata for your books. It can download newspapers and convert them into ebooks for convenient reading. It is cross platform, running on Linux, Windows and OS X.
da: |app| er en biblioteksprogram for e-bøger. Programmet kan vise, konvertere og katalogisere e-bøger i de vigtigste e-bogsformater. Programmet kan også kommunikere med mange e-bogslæsere. Programmet kan gå på nettet og hente metadata for dine e-bøger. Det kan hente aviser og konvertere dem til e-bøger for nem læsning. Det fungerer på flere platforme såsom Linux, Windows og OS X.

source: You've just started |app|. What do you do now? Before |app| can do anything with your ebooks, it first has to know about them. Drag and drop a few ebook files into |app|, or click the "Add books" button and browse for the ebooks you want to work with. Once you've added the books, they will show up in the main view looking something like this:
da: Du har netop startet |app|. Hvad gør du nu? før |app| kan gøre noget med dine e-bøger, så skal programmet først kende til dem. Træk og slip nogle få e-bogsfiler ind i |app|, eller klik på knappen »Tilføj bøger« og kig efter de e-bøger du ønsker at arbejde med. Når du først har tilføjet bøgerne, så vil de blive vist i hovedbilledet på denne måde:

source: Once you've admired the list of books you just added to your heart's content, you'll probably want to read one. In order to do that you'll have to convert the book to a format your reader understands. When first running |app|, the Welcome Wizard starts and will set up calibre for your reader device. Conversion is a breeze. Just select the book you want to convert then click the "Convert books" button. Ignore all the options for now and click "OK". The little icon in the bottom right corner will start spinning. Once it's finished spinning, your converted book is ready. Click the "View" button to read the book.
da: Når du først har beundret listen over bøgerne, du har tilføjet, så er det tid for at læse en. For at gøre dette skal du konvertere bogen til et format din læser forstår. Når du første gang kører |app| vil velkomstguiden starte og opsætte Calibre for din enhed. Konvertering er rigtig nemt. Bare vælg bogen du ønsker at konvertere, klik så på knappen Konverter bøger. Ignorer alle indstillingerne indtil videre og klik på O.k. Det lille ikon i bunden af den højre side vil begynde at rotere. Når den er færdig med at rotere, er din konverterede bog klar. Klik på knappen Vis for at læse bogen.

source: If you want to read the book on your reader, connect it to the computer, wait till calibre detects it (10-20 seconds) and then click the "Send to device" button. Once the icon stops spinning again, disconnect your reader and read away! If you didn't convert the book in the previous step, |app| will auto convert it to the format your reader device understands.
da: Hvis du ønsker at læse bogen på din læser, så forbinder du den til computere, vent på at Calibre detekterer den (10-20 sekunder) og klik så på knappen Send til enhed. Når ikonet stopper med at rotere frakobler du din læser og kan begynde og læse! Hvis du ikke konverterede bogen i det forrige trin vil |app| konvertere den til formatet din enhed forstår.

source: To get started with more advanced usage, you should read about the :ref:`Graphical User Interface <gui>`. For even more power and versatility, learn the :ref:`Command Line Interface <cli>`. You will find the list of :ref:`Frequently Asked Questions <faq>` useful as well.
da: For at komme i gang med den mere avancerede brug, så bør du læse :ref:`Graphical User Interface <gui>`. For endnu mere funktionalitet og alsidighed så lær indholdet i :ref:`Command Line Interface <cli>`. Du vil også finde listen i :ref:`Frequently Asked Questions <faq>` nyttig.
de: Um die erweiterten Möglichkeiten zu nutzen, sollten sie zuvor mehr über das :ref:`Graphical User Interface <gui>` lesen. Für noch mehr Leistung und Vielseitigkeit ist das Erlernen des :ref:`Command Line Interface <cli>` nützlich. Ebenfalls hilfreich sind Empfehlungen der :ref:`Frequently Asked Questions <faq>`.
fr: Pour vous lancer dans un usage plus avancé, vous devriez lire :ref:`Interface Graphique Utilisateur <gui>`. Pour encore plus de puissance et de polyvalence, apprenez :ref:`Interface en Ligne de Commande <cli>`. Vous trouverez la liste des :ref:`Questions Fréquemment Posées <faq>` bien utile elle aussi.
ko: 좀더 고급 사용법을 익히고 싶다면, :ref:`그래픽 사용자 인터페이스 <gui>`에 대하여 읽어보아야 합니다. 더 강력하고 유연한 기능에 대해서는 :ref:`명령행 인터페이스 <cli>`를 공부하세요. :ref:`자주 묻는 질문(FAQ) <faq>` 목록 또한 도움이 될 것입니다.
sv: För att kunna börja med mer avancerad användning, bör du läsa om :ref:`Grafiskt användargränssnitt <gui>`. För ännu mer kraftfull och flexibilitet, läs :ref:`Kommandorandsgränssnittet <cli>`. Du kommer också att finna listan av :ref:`Vanliga frågor och svar <faq>` användbar.

source: **An ebook version of this user manual is available in** `EPUB format <calibre.epub>`_, `AZW3 (Kindle Fire) format <calibre.azw3>`_ and `PDF format <calibre.pdf>`_.
da: **En e-bogsversion af denne brugermanual er tilgængelig i** `EPUB-format <calibre.epub>`_, `AZW3-format (Kindle Fire)<calibre.azw3>`_ og `PDF-format <calibre.pdf>`_.
de: **Eine eBook-Version dieses Benutzerhandbuchs steht im** `EPUB-Format <calibre.epub>`_, `AZW3-Format (Kindle Fire) <calibre.azw3>`_ und `PDF-Format <calibre.pdf>`_ zur Verfügung.
fr: **Une version ebook de ce manuel est disponible aux formats** `EPUB <calibre.epub>`_, `AZW3 (Kindle Fire) <calibre.azw3>`_ et `PDF <calibre.pdf>`_.
hr: **E-inačica ovog korisničkog uputstva dostupna je u ** `EPUB formatu <calibre.epub>`_, `AZW3 (Kindle Fire) formatu <calibre.azw3>`_ i `PDF formatu <calibre.pdf>`_.
ko: **이 사용자 매뉴얼의 eBook 버전도 다음과 같이 이용가능합니다.** `EPUB 형식 <calibre.epub>`_, `AZW3 (Kindle Fire) 형식 <calibre.azw3>`_ , `PDF 형식 <calibre.pdf>`_.
pl: **Ten podręcznik jest dostępny w postaci ebooka w formatach** `EPUB <calibre.epub>`_, `AZW3 (Kindle Fire) <calibre.azw3>`_ i `PDF <calibre.pdf>`_.
sv: **En e-bokversion av denna användarmanual finns tillgänglig i** `EPUB-format <calibre.epub>`_, `AZW3 (Kindle Fire)-format <calibre.azw3>`_ och `PDF-format <calibre.pdf>`_.

source: Sections
da: Sektioner
de: Abschnitte
hr: Sekcije
ko: 섹션
pl: Sekcje
sv: Avsnitten

source: The main |app| user interface
da: |app|-brugergrænsefladen

source: Adding your favorite news website to |app|
da: Tilføjelse af din favorithjemmeside for nyheder til |app|

source: The |app| ebook viewer
da: E-bogsfremviseren |app|

source: Customizing |app|'s ebook conversion
da: Tilpasning af |app|&#x27;s e-bogskonvertering

source: Editing ebooks
da: Redigering af e-bøger
de: eBook Editor
fr: Edition des livres numériques
hr: Uređivanje e-knjiga
ko: eBook
pl: Edytowanie książek
sv: Redigera e-böcker

source: Comparing ebooks
da: Sammenligning af e-bøger
de: Bücher vergleichen
fr: Comparaison des livres numériques
hr: Uspoređivanje e-knjiga
ko: eBook
sv: Jämför e-böcker

source: Editing ebook metadata
da: Redigering af e-bogsmetadata
de: eBook Metadaten bearbeiten
fr: Edition des métadonnées d'un livre numérique
hr: Uređivanje metapodataka za e-knjige
ko: eBook 책 정보
sv: Redigera e-bokmetadata

source: Frequently Asked Questions
da: Ofte stillede spørgsmål
de: Häufig gestellte Fragen (FAQ)
fr: Questions Fréquemment Posées
hr: Često postavljana pitanja
ko: 자주 묻는 질문(FAQ)
sv: Vanliga frågor och svar

source: Tutorials
da: Øvelser
fr: Tutoriels
hr: Tutoriali
ko: 입문 설명서
pl: Samouczki
sv: Handledningar

source: Customizing |app|
da: Tilpasning af |app|

source: The Command Line Interface
da: Kommandolinjens grænseflade
de: Das Kommandozeilen-Interface
fr: L'Interface en Ligne de Commande
ko: 명령행
sv: Kommandorandsgränssnittet

source: Setting up a |app| development environment
da: Opsætning af et |app|-udviklingsmiljø

source: calibre User Manual
de: calibre Benutzerhandbuch
fr: Manuel de l'Utilisateur calibre
hr: lappl korisnicki prirucnik
ko: 캘리버(Calibre) 사용자 매뉴얼
pl: Podręcznik użytkownika calibre
sv: calibre användarhandledning

source: calibre is an ebook library manager. It can view, convert and catalog ebooks in most of the major ebook formats. It can also talk to many ebook reader devices. It can go out to the Internet and fetch metadata for your books. It can download newspapers and convert them into ebooks for convenient reading. It is cross platform, running on Linux, Windows and OS X.
de: calibre ist ein eBook-Verwaltungsprogramm. Es kann eBooks anzeigen, konvertieren, katalogisieren und unterstützt alle wichtigen Formate sowie viele Lesegeräte. Es kann aus dem Internet Metadaten für Ihre Bücher herunterladen, unterstützt den Download von Zeitungen und konvertiert diese zum bequemen Lesen in Ebooks. Es ist ein Cross-Plattform-Programm und kann auf Linux-, Windows- und OS X-Systemen ausgeführt werden.
fr: calibre est un gestionnaire de bibliothèque de livres numériques. Il peut visualiser, convertir et cataloguer des livres numériques dans la plupart des principaux formats. Il peut aussi communiquer avec beaucoup de dispositifs de lecture de livre numérique. Il peut aller sur Internet et chercher des métadonnées pour vos livres. Il peut télécharger des journaux et les convertir en livres numériques pour une lecture confortable. Il est multi-plateforme, fonctionnant sur Linux, Windows et Mac OS X.
hr: calibre je upravitelj e-knjižara. Sadrži mogućnosti pregledavanja, konvertiranja i katalogiziranja e-knjiga u većini najčešćih formata za e-knjige. Također se može povezati na mnogo uređaja e-čitača. Može otići na internet i dobaviti metapodatke za Vaše knjige. Može skidati novine i konvertirati ih u e-knjige za lakše čitanje. o je prelazna platforma, namijenjena za Linux, Windows i OS X.
ko: 캘리버는 eBook 서재 관리 프로그램입니다. 대부분의 주류 eBook 형식을 읽고, 변환하고, 카탈로그를 생성할 수 있습니다. 또한, 많은 eBook 리더 기기와 연결할 수도 있습니다. 인터넷에서 사용자의 책에 대한 책정보를 수집할 수도 있으며, 신문을 다운로드 받아 읽기 편하게 eBook으로 변환할 수도 있습니다. 캘리버는 크로스 플랫폼을 지원하며, 리눅스, 윈도우즈, OSX에서 실행됩니다.
pl: calibre jest programem do zarządzania e-biblioteką. Za jego pomocą można czytać, konwertować i katalogować ebooki w większości formatów ebooków. Obsługuje również wiele czytników. Pozwala na pobieranie metadanych z internetu. Umożliwia również pobieranie czasopism i konwertowanie ich na ebooki, by można je było wygodnie czytać. Działa na Linuksie, Windows i OS X.
sv: calibre är en e-boksbibliotekshanterare. Den kan visa, konvertera och katalogisera e-böcker i de flesta av de stora e-bokformaten. Den kan också prata med många e-bokläsenheter. Den kan gå ut till Internet och hämta metadata för dina böcker. Man kan ladda ner tidningar och omvandla dem till e-böcker för bekväm läsning. Den är plattformsoberoende, som körs på Linux, Windows och OS X.

source: You've just started calibre. What do you do now? Before calibre can do anything with your ebooks, it first has to know about them. Drag and drop a few ebook files into calibre, or click the "Add books" button and browse for the ebooks you want to work with. Once you've added the books, they will show up in the main view looking something like this:
de: Sie haben calibre gerade gestartet. Was ist der nächste Schritt? Bevor calibre etwas mit ihren eBooks anfangen kann, muss es sie zuerst einmal kennen. Nehmen Sie einige eBook-Dateien und ziehen Sie diese mit der Maus nach calibre ins Hauptfenster. Oder klicken Sie auf die Schaltfläche "Bücher hinzufügen" und wählen dann die eBooks aus, mit denen Sie arbeiten möchten. Sobald Bücher hinzugefügt wurden, sind diese in der Hauptansicht, ähnlich wie hier angezeigt, sichtbar:
fr: Vous venez de commencer avec calibre. Qu'allez-vous faire maintenant ? Avant que calibre puisse faire quoique ce soit avec vos livres numériques, il faut d'abord qu’il les connaisse. Glissez et déposez quelques fichiers de livre numérique dans calibre, ou cliquez sur le bouton "Ajouter des livres" et sélectionnez les livres numériques avec lesquels vous voulez travailler. Une fois que vous aurez ajouté ces livres, ils apparaîtront dans l'écran principal ressemblant à quelque chose comme ceci :
hr: Upravo ste zapoceli lappl. Sta sad da radite? Prije nego lappi bilo sta uradi sa vasim e-knjigama, on mora da zna za njih. Povucite i ispustite nekoliko e-knjiga dokumenata u lappl, ili kliknite "dodaj knjige" oznaku i pretrazite e-knjige sa kojima zelite da radite. Nakon sto ste dodali knjige one ce se pokazati na glavnom prozoru sto izgleda ovako:
ko: 당신은 이제 막 캘리버를 사용하기 시작했습니다. 당장 무엇을 할까요? 캘리버가 사용자의 책들을 가지고 무언가를 하기 전에, 우선 캘리버가 책들에 대해 알아야만 합니다. 몇몇 eBook 파일들을 캘리버로 끌어다 놓기를 하거나, "책 추가" 버튼을 눌러 사용자가 작업하길 원하는 책들을 탐색하세요. 일단 책들이 추가되면, 메인 창에 추가된 책들이 나타나서 아래와 비슷하게 보일 것입니다:
pl: Właśnie uruchomiłeś calibre. I co teraz? Zanim program będzie mógł cokolwiek zrobić z ebookami, najpierw musisz je dodać do biblioteki. Przeciągnij kilka plików ebooków do okna calibre lub kliknij przycisk "Dodaj książki" i wybierz książki, które chcesz umieścić w bibliotece. Kiedy już się w niej znajdą, zostaną umieszczone na liście w głównym oknie, co będzie wyglądać mniej więcej tak:
sv: Du har precis satt igång calibre. Vad gör du nu? Innan calibre kan göra vad som helst med din e-böcker, först måste det veta om dem. Dra och släpp några e-bokfiler i calibre, eller klicka på "Lägg till böcker" och leta efter de e-böcker som du vill arbeta med. När du har lagt böckerna, kommer de att dyka upp i huvudfönstret ser ut ungefär så här:

source: Once you've admired the list of books you just added to your heart's content, you'll probably want to read one. In order to do that you'll have to convert the book to a format your reader understands. When first running calibre, the Welcome Wizard starts and will set up calibre for your reader device. Conversion is a breeze. Just select the book you want to convert then click the "Convert books" button. Ignore all the options for now and click "OK". The little icon in the bottom right corner will start spinning. Once it's finished spinning, your converted book is ready. Click the "View" button to read the book.
de: Nachdem Sie nach Belieben Bücher hinzugefügt haben, möchten Sie vielleicht eins davon lesen. Um dies zu können, müssen Sie das Buch vielleicht in ein für Ihr Lesegerät verständliches Format konvertieren. Falls calibre zum ersten Mal ausgeführt wurde, startet der Willkommen-Assistenten und wird calibre für Ihr Lesegerät angepasst einrichten. Die Konvertierung ist ein Kinderspiel. Wählen Sie einfach das Buch, welches Sie konvertieren möchten, aus und klicken Sie auf die Schaltfläche "Bücher konvertieren". Ignorieren Sie zunächst alle Optionen und klicken auf "OK". Das kleine Icon in der rechten unteren Ecke beginnt sich zu drehen. Das Buch ist fertig konvertiert, sobald es sich nicht mehr dreht. Mit einem Klick auf "Vorschau" können Sie nun das Buch lesen.
fr: Une fois que vous aurez admiré avec satisfaction la liste des livres que vous venez d'ajouter, vous aurez probablement envie de les lire. Pour ce faire, vous devrez convertir le livre dans un format que votre liseuse comprenne. Lors de la première ouverture de calibre, l'Assistant de Bienvenue a démarré et a paramétré calibre pour votre appareil de lecture. La conversion est un jeu d'enfant. Il suffit de sélectionner le livre que vous voulez convertir, puis de cliquer sur le bouton "Convertir des livres". Ignorer toutes les options pour l'instant et cliquez sur "OK". La petite icône dans le coin en bas à droite va commencer à tourner. Une fois que c'est fini, votre livre converti est prêt. Cliquez sur le bouton "Visualiser" pour lire le livre.
hr: Nakon što ste se nadivili popisu knjiga kojih ste upravo dodali koliko Vam srce želi, vjerojatno ćete željeti pročitati jednu. Da biste to učinili, morat ćete konvertirati knjigu u format koji Vaš čitač prepoznaje. Kod prvog pokretanja calibrea, pokrenut će se i Čarobnjak Dobrodošlice i postaviti calibre za Vaš čitač. Konverzija je šetnja u parku. Samo odaberite knjigu koju elite konvertirati i kliknite na ikonu "Convert books". Ignorirajte sve opcije zasad i kliknite "OK". Mala ikona u donjem desnom kutu počet će se vrtjeti. Jednom kad završi s vrtnjom, Vaša konvertirana knjiga je spremna. Kliknite na "View" za čitanje.
ko: 추가시킨 책 목록에 대하여 충분히 만족하였다면, 이제 책을 골라 읽기를 원할 것입니다. 그러려면, 우선 그 책을 리더 기기가 이해할 수 있는 형식으로 변환하여야만 합니다. 캘리버가 최초 실행될 때 '환영합니다!' 마법사가 시작되어 사용자의 리더 기기에 맞도록 캘리버를 설정할 것입니다. 변환 작업은 매우 간단합니다. 단지, 변환하기를 원하는 책을 선택한 다음 "책 변환" 버튼을 누르기면 하면 됩니다. 지금은 모든 옵션들을 무시하고 "OK" 버튼을 클릭하세요. 오른쪽 하단 구석의 작은 아이콘이 돌아가기 시작할 것입니다. 그 돌아가기가 멈추면 변환된 책이 준비되었다는 뜻입니다. 이제 책을 읽으려면 "보기" 버튼을 누르면 됩니다.
pl: Kiedy już nasycisz się widokiem świeżo dodanych do biblioteki książek, prawdopodobnie będziesz je chciał poczytać. Aby to zrobić musisz przekonwertować książki na format, który jest obsługiwany przez twój czytnik. Przy pierwszym uruchomieniu kreator skonfiguruje program do współpracy z twoim czytnikiem. Konwersja jest prosta. Po prostu wybierasz książkę i klikasz przycisk "Konwertuj książki". Pomiń wszystkie opcje i kliknij przycisk "OK". W prawym dolnym rogu okna zacznie się kręcić niewielka ikonka. Kiedy skończy się kręcić, konwersja jest ukończona. Kliknij przycisk "Wyświetl", by przeczytać książkę.
sv: När du har beundrat listan över böcker som du just lagt till i ditt hjärtas innehåll, kommer du antagligen att vilja läsa en. För att göra det måste du konvertera boken till ett format som din läsaren förstår. När calibre körs första gånger kommer en Välkomstguide och ställa in calibre för din läsenhet. Konvertering är en bris. Välj bara den bok du vill konvertera och klicka sedan på "Konvertera böcker"-knappen. Ignorera alla alternativ just nu och klicka på "OK". Den lilla ikonen i det nedre högra hörnet kommer att börja snurra. När den har snurrat klart, är din konverterade bok klar. Klicka på "Visa" för att läsa boken.

source: If you want to read the book on your reader, connect it to the computer, wait till calibre detects it (10-20 seconds) and then click the "Send to device" button. Once the icon stops spinning again, disconnect your reader and read away! If you didn't convert the book in the previous step, calibre will auto convert it to the format your reader device understands.
de: Wenn Sie das Buch auf Ihrem eReader lesen möchten, verbinden sie diesen mit dem Computer, warten bis calibre den eReader erkannt hat (10-20 Sekunden) und klicken dann auf die Schaltfläche "An Gerät senden". Sobald sich das kleine Symbol unten rechts nicht mehr dreht, können Sie den Reader vom Computer trennen und mit dem Lesen anfangen! Falls Sie das Buch im vorherigen Schritt nicht konvertiert hatten, wird calibre es automatisch vor dem Übertragen in das für das Lesegerät verständliche Format konvertieren.
fr: Si vous voulez lire le livre sur votre liseuse, connectez-la à l'ordinateur, attendez que calibre la détecte (10-20 secondes), puis cliquez sur le bouton "Envoyer au dispositif". Une fois que l'icône s'arrête de tourner à nouveau, débranchez votre liseuse et lisez tout de suite ! Si vous n'aviez pas converti le livre dans l'étape précédente, calibre l'aura automatiquement fait pour que le livre soit dans un format que votre dispositif de lecture peut comprendre.
hr: Ako želite čitati knjigu na Vašem čitaču, spojite ga s računalom, pričekajte da ga calibre pronađe (10-20 sekundi) i kliknite na "Send to device". Jednom kad se ikona ponovno prestane vrtjeti, odvojite svoj čitač i čitajte do mile volje! Ako niste konvertirali knjigu u prethodnom koraku, calibre će ju automatski konvertirati u format koji Vaš čitač prepoznaje.
ko: 사용자의 리더 기기에서 책을 읽기를 원한다면, 기기를 컴퓨터에 연결한 후, 캘리버가 기기를 인식할 때까지 (10-20초 정도) 기다리세요. 그런 다음 "장치로 전송" 버튼을 누릅니다. 다시 아이콘이 돌아가기를 멈추면, 기기를 분리한 후 편하게 읽으면 됩니다. 만일 이전 단계에서 책을 변환하지 않았다면, 캘리버가 리더 기기가 인식할 수 있는 형식으로 자동으로 변환할 것입니다.
pl: Jeśli chcesz czytać książkę na czytniku, podłącz go do komputera, odczekaj aż zostanie wykryty (10-20 sekund) i kliknij przycisk "Prześlij do urządzenia". Kiedy ikona przestanie się kręcić, odłącz czytnik i zabierz się do czytania! Jeśli nie przekonwertowałeś książki w poprzednim kroku, calibre zrobi to automatycznie, wybierając format, który jest obsługiwany przez twój czytnik.
sv: Om du vill läsa boken på din läsare, anslut den till datorn, vänta tills calibre upptäcker den (10-20 sekunder) och klicka sedan på knappen "Skicka till enhet". När ikonen slutar snurra igen, koppla bort läsare och börja läs! Om du inte konverterat boken i föregående steg, kommer calibre automatiskt konvertera den till formatet din läsenheten förstår.

source: The main calibre user interface
de: Die calibre Benutzeroberfläche
fr: L'interface utilisateur principale de calibre
hr: Glavno korisničko sučelje calibrea
ko: 메인 캘리버 사용자 인터페이스
pl: Główne okno
sv: calibres huvudgränssnitt

source: Adding your favorite news website to calibre
de: Hinzufügen Ihrer bevorzugten Nachrichten-Webseite in calibre
fr: Ajouter vos site web favoris d'actualités à calibre
hr: Dodajte svoje najdraže informativne stranice calibreu
ko: 사용자가 좋아하는 뉴스 웹사이트를 캘리버에 추가하기
sv: Lägg till dina favoritnyhetssidor till calibre

source: The calibre ebook viewer
de: Der calibre eBook-Betrachter
fr: La visionneuse de livre numérique calibre
hr: calibre pregledavatelj e-knjiga
ko: 캘리버 eBook 뷰어
pl: Przeglądarka książek
sv: calibres e-bokläsare

source: Customizing calibre's ebook conversion
de: Anpassen der calibre Ebook-Konvertierung
fr: Personnalisation de la conversion de livre numérique calibre
ko: 캘리버의 eBook 변환
pl: Konfigurowanie konwersji książek
sv: Anpassa calibres e-bokkonvertering

source: Customizing calibre
de: calibre anpassen
fr: Personnaliser calibre
hr: Prilagođavanje calibrea
ko: 캘리버 커스터마이즈
pl: Dostosowywanie calibre
sv: Anpassa calibre

source: Setting up a calibre development environment
de: Einrichtung der calibre Entwicklungsumgebung
fr: Mise en place de l'environnement de développement calibre
hr: Postavite razvojno okruženje u calibreu
ko: 캘리버 개발환경
sv: Konfigurera calibre utvecklingsmiljö

source: To get started with more advanced usage, you should read about :doc:`gui`. For even more power and versatility, learn the :doc:`generated/en/cli-index`. You will find the list of :doc:`faq` useful as well.
hr: Da biste započeli s naprednijim korištenjem, trebali biste pročitati :doc:`gui`. Za još više snage i raznovrsnosti, naučite :doc:`generated/hr/cli-index`. Popis :doc:`faq` će Vam također koristiti.
pl: Aby dokładniej zapoznać się z programem powinieneś przeczytać :doc:`gui`. By uzyskać więcej informacji o możliwościach calibre zapoznaj się z :doc:`generated/en/cli-index`. Wiele użytecznych informacji znajdziesz również w :doc:`faq`.
