Repository: Easonqsp/calibre-translations
Catalog: manual/*/metadata.po
Languages: es, sv

source: Finally, in regular expression mode you can copy values from one field to another. Simply make the source and destination field different. The copy can replace the destination field, prepend to the field (add to the front), or append to the field (add at the end). The 'use comma' checkbox tells calibre to (or not to) add a comma between the text and the destination field in prepend and append modes. If the destination is multiple (e.g., tags), then you cannot uncheck this box.
es: Finalmente, en el modo de expresión regular puede copiar los valores de un campo a otro. Simplemente haga que el campo de origen y destino sean diferentes. La copia puede reemplazar el campo de destino, anteponga al campo (agregar al frente), o anexar al campo (añadir al final). La casilla de verificación 'usar coma' alerta a calibre (o a no hacerlo) añadir una coma entre el texto y el campo de destino en anteponer y anexar modos. Si el destino es múltiple (por ejemplo, etiquetas), entonces no se puede desactivar esta casilla.
sv: Slutligen, i reguljära uttrycksläget kan du kopiera värden från ett fält till ett annat. Helt enkelt göra fältets källa och destination annorlunda. Kopian kan ersätta destinationsfältet lägger du till fältet (lägg till i början), eller lägga till fältet (lägg till på slutet). Den &#x27använd kommatecken&#x27 kryssrutan berättar calibre lägga till (eller inte) lägga till ett kommatecken mellan texten och destinationsfältet i lägg till före och efter lägen. Om destinationen är flera (t.ex. etiketter), kan du inte avmarkera rutan

source: Search and replace is done after all the other metadata changes in the other tabs are applied. This can lead to some confusion, because the test boxes will show the information before the other changes, but the operation will be applied after the other changes. If you have any doubts about what is going to happen, do not mix search/replace with other changes.
es: Buscar y reemplazar se realiza después de aplicar todos los cambios en los metadatos en las otras pestañas. Esto puede llevar a cierta confusión, ya que las cajas de pruebas mostrarán la información antes que los otros cambios, pero la operación se aplicará después de los otros cambios. Si tiene alguna duda sobre lo que va a suceder, no mezcle buscar/reemplazar con los otros cambios.
sv: Sök och ersätt görs efter alla andra metadataändringar i de andra flikarna tillämpas. Detta kan leda till en viss förvirring, eftersom testrutorna visar informationen innan andra förändringar, men åtgärden kommer att tillämpas efter övriga förändringar. Om du har några tvivel om vad som kommer att hända, blanda inte ihop sök/ersätt med andra förändringar.

source: Bulk downloading of metadata
es: Descargando metadatos en masa
sv: Massnerladdning av metadata

source: If you want to download the metadata for multiple books at once, right-click the :guilabel:`Edit metadata` button and select :guilabel:`Download metadata`. You can choose to download only metadata, only covers, or both.
es: Si quiere descargar los metadatos de varios libros a la vez, haga clic en el botón :guilabel:`Editar metadatos` y seleccione :guilabel:`Descargar metadatos`. Puede elegir descargar solo metadatos, solo portadas o ambos..
sv: Om du vill hämta metadata för flera böcker på en gång, högerklickar du på :guilabel:`Redigera metadata`-knappen och välj :guilabel:`Hämta metadata`. Du kan välja att hämta endast metadata, bara omslag, eller båda.
