Repository: Easonqsp/calibre-translations
Catalog: manual/*/metadata.po
Languages: es, sv

source: Editing Ebook Metadata
es: Editando metadatos del libro electrónico
sv: Redigera e-boks metadata

source: Contents
es: Contenido
sv: Innehåll

source: Ebooks come in all shapes and sizes and more often than not, their metadata (things like title/author/series/publisher) is incomplete or incorrect. The simplest way to change metadata in calibre is to simply double click on an entry and type in the correct replacement. For more sophisticated, "power editing" use the edit metadata tools discussed below.
es: Los libros electrónicos vienen de todas formas y tamaños, y más a menudo, sus metadatos (tales como título/autor/series/editor) son incompletos o incorrectos. La forma más sencilla de cambiar los metadatos en calibre es simplemente hacer doble clic en una entrada y escribir el dato correcto. Para un "poder de edición" más sofisticado, utilice las herramientas de edición de metadatos discutidas a continuación.
sv: E-böcker finns i alla former och storlekar, och oftare än inte, (saker som titel / författare / serie / utgivare) är ofullständig eller felaktig sin metadata. Det enklaste sättet att ändra metadata i calibre är att helt enkelt dubbelklicka på en post och skriv rätt ersättare. För mer sofistikerade, "power redigering" använda redigeringsmetadataverktyg som diskuteras nedan.

source: Editing the metadata of one book at a time
es: Editando metadatos de un libro por vez
sv: Redigera metadata av en bok i taget

source: Click the book you want to edit and then click the :guilabel:`Edit metadata` button or press the ``E`` key. A dialog opens that allows you to edit all aspects of the metadata. It has various features to make editing faster and more efficient. A list of the commonly used tips:
es: Haga clic en el libro que desea editar y luego en el botón :guilabel:`Editar metadata` o pulse la tecla ``E``. Un cuadro de diálogo se abre permitiéndole editar todos los aspectos de los metadatos. Tiene diversas funciones para hacer la edición más rápida y eficiente. Una lista de los consejos más utilizados:
sv: Klicka på den bok du vill redigera och klicka sedan på :guilabel:`Redigera metadata` knappen eller tryck på `` E `` nyckel. En dialogruta öppnas som låter dig redigera alla aspekter av metadata. Den har olika funktioner för att göra redigeringen snabbare och effektivare. En lista över de vanligaste tips:

source: You can click the button in between title and authors to swap them automatically.
es: Puede hacer clic en el botón entre el título y los autores para intercambiarlos automáticamente.
sv: Du kan klicka knappen mellan titel och författare för att växla dem automatiskt.

source: You can click the button next to author sort to have calibre automatically fill it in using the sort values stored with each author. Use the :guilabel:`Manage authors` dialog to see and change the authors' sort values. This dialog can be opened by clicking and holding the button next to author sort.
es: Puede hacer clic en el próximo botón para ordenar por autor para hacer que calibre lo haga automáticamente usando los valores de orden almacenados con cada autor. Utilice el cuadro de diálogo :guilabel:`Administrar autores` para ver y cambiar los valores de clasificación de los autores. Este cuadro de diálogo se puede abrir pulsando y manteniendo pulsado el botón próximo al orden por autor.
sv: Du kan klicka på knappen bredvid författaren sorterings för att ha calibre automatiskt fylla i med hjälp av sorteringsvärden som lagrats med varje upphovsman. Använd :guilabel:`Hantera Författare` dialog att se och ändra författarnas sorteringsvärden. Denna dialogruta kan öppnas genom att klicka och hålla in knappen bredvid författaren sortera.

source: You can click the button next to tags to use the Tag Editor to manage the tags associated with the book.
es: Puede hacer clic en el botón próximo a las etiquetas para usar el Editor de etiquetas para gestionar las etiquetas asociadas con el libro.
sv: Du kan klicka på knappen bredvid etiketter att använda Etikett Editor för att hantera etiketter i samband med boken.

source: The ISBN box will have a red background if you enter an invalid ISBN. It will be green for valid ISBNs
es: El cuadro ISBN tendrá un fondo rojo si introduce un ISBN nulo. Será verde para los ISBNs válidos
sv: ISBN rutan kommer att ha en röd bakgrund, om du anger ett ogiltigt ISBN. Det kommer att vara grönt för giltiga ISBN

source: The author sort box will be red if the author sort value differs from what calibre thinks it should be.
es: El cuadro de ordenar por autor será de color rojo si el valor del orden por autor difiere de lo que calibre piensa que debería ser.
sv: Författaren sorterings rutan blir röd om författaren sorterings värdet skiljer sig från det som calibre tycker att det borde vara.

source: Downloading metadata
es: Descargando metadatos
sv: Nedladdning av metadata

source: The nicest feature of the edit metadata dialog is its ability to automatically fill in many metadata fields by getting metadata from various websites. Currently, calibre uses isbndb.com, Google Books, Amazon and Library Thing. The metadata download can fill in Title, author, series, tags, rating, description and ISBN for you.
es: La mejor característica del cuadro de diálogo de edición de metadatos es su capacidad para llenar automáticamente varios campos de metadatos al obtenerlos de varios sitios de internet. Actualmente, calibre utiliza isbndb.com, Google Books, Amazon y Library Thing. La descarga de metadatos son título, autor, series, etiquetas, rating, descripción e ISBN.
sv: Den trevligaste funktionen i dialogrutan redigera metadata är dess förmåga att automatiskt fylla i många metadatafält genom att få metadata från olika webbplatser. För närvarande calibre använder isbndb.com, Google Books, Amazon och bibliotek Thing. Metadata nedladdning kan fylla i titel, författare, serier, taggar, betyg, beskrivning och ISBN för dig.

source: To use the download, fill in the title and author fields and click the :guilabel:`Fetch metadata` button. calibre will present you with a list of books that most closely match the title and author. If you fill in the ISBN field first, it will be used in preference to the title and author. If no matches are found, try making your search a little less specific by including only some key words in the title and only the author last name.
es: Para utilizar la descarga, rellene los campos de título y autor y haga clic en el botón :guilabel:`Recolectar metadatos`. calibre le presentará una lista de libros que más coinciden estrechamente respecto al título y el autor. Si rellena el campo ISBN primero, se va a utilizar con preferencia respecto del título y autor. Si no se encuentran coincidencias, trate de hacer su búsqueda un poco menos específica incluyendo sólo algunas palabras clave en el título y sólo el apellido del autor.
sv: För att använda nedladdning, fyll i titel och författare och tryck :guilabel:`Hämta metadata`. calibre kommer att visa dig en lista på böcker som närmast passar titel och författare. Om du fyller i ISBN-fältet först, kommer det att användas i stället för titeln och författare. Om inga passade träffar hittas, försök att göra din sökning lite mindre specifik genom att ta med endast några nyckelord i titeln och bara författarens efternamn.

source: Managing book formats
es: Gestionando formatos de libros
sv: Hantering bokformat

source: In calibre, a single book entry can have many different *formats* associated with it. For example you may have obtained the Complete Works of Shakespeare in EPUB format and later converted it to MOBI to read on your Kindle. calibre automatically manages multiple formats for you. In the :guilabel:`Available formats` section of the Edit metadata dialog, you can manage these formats. You can add a new format, delete an existing format and also ask calibre to set the metadata and cover for the book entry from the metadata in one of the formats.
es: En calibre, una sola entrada en el libro puede tener varios *formatos* diferentes asociados con el mismo. Por ejemplo, puede haber obtenido las obras completas de Shakespeare en formato EPUB y más tarde convertidas a Mobi para leerlas en el Kindle. calibre maneja automáticamente múltiples formatos para usted. En la sección :guilabel:`Formatos disponibles` del cuadro de diálogo Editar metadatos, puede administrar estos formatos. Puede agregar un nuevo formato, borrar uno existente y también solicitar a calibre configurar los metadatos y la cubierta del libro desde los metadatos contenidos en alguno de los formatos.
sv: I calibre, kan en enda bokpost har många olika *format* i samband med det. Till exempel kan du ha fått de samlade verk av Shakespeare i EPUB-format och senare konverterade den till MOBI att läsa på din Kindle. calibre hanterar automatiskt flera format för dig. I :guilabel:`Tillgängliga format` i dialogrutan Redigera metadata, kan du hantera dessa format. Du kan lägga till ett nytt format, ta bort ett befintligt format och även be calibre för att ange metadata och täcka för boken posten från metadata i ett av formaten.

source: All about covers
es: Todo sobre cubiertas
sv: Allt om omslag

source: You can ask calibre to download book covers for you, provided the book has a known ISBN. Alternatively you can specify a file on your computer to use as the cover. calibre can even generate a default cover with basic metadata on it for you. You can drag and drop images onto the cover to change it and also right click to copy/paste cover images.
es: Puede solicitar a calibre descargar las cubiertas de libro por usted, siempre y cuando el libro posea un ISBN conocido. Alternativamente, puede especificar un archivo en su computadora para utilizarlo como portada. calibre puede incluso generar una portada predeterminada con metadatos básicos por usted. Puede arrastrar y soltar imágenes de la portada para cambiarla o un clic derecho para copiar/pegar imágenes.
sv: Du kan be calibre ladda ner bokomslag för dig, förutsatt att boken har en känd ISBN. Alternativt kan du ange en fil på din dator som ska användas som omslag. calibre kan även generera ett standardomslag med grundläggande metadata om det för dig. Du kan dra och släppa bilder på locket för att byta den och även högerklicka för att kopiera / klistra in omslagsbilder.

source: In addition, there is a button to automatically trim borders from the cover, in case your cover image has an ugly border.
es: Además, hay un botón para recortar automáticamente los bordes de la cubierta, en el caso que la imagen de la portada posea bordes no precisamente perfectos.
sv: Dessutom finns det en knapp för att automatiskt justera gränser från omslag, om din omslagsbild har en ful kant.

source: Editing the metadata of many books at a time
es: Modificar los metadatos de barios libros a la vez
sv: Redigera metadata för flera böcker på en gång

source: First select the books you want to edit by holding Ctrl or Shift and clicking on them. If you select more than one book, clicking the :guilabel:`Edit metadata` button will cause a new *Bulk* metadata edit dialog to open. Using this dialog, you can quickly set the author/publisher/rating/tags/series etc of a bunch of books to the same value. This is particularly useful if you have just imported a number of books that have some metadata in common. This dialog is very powerful, for example, it has a Search and Replace tab that you can use to perform bulk operations on metadata and even copy metadata from one column to another.
es: Primero, seleccione los libros que desea editar manteniendo presionado la tecla Ctrl o Shift y haciendo clic en ellos. Si selecciona más de un libro, haga clic en el botón :guilabel:`Editar metadatos` lo que provocará que se abra un nuevo cuadro de diálogo de edición de metadatos *Masivo*. Usándolo, puede establecer rápidamente el autor/editor/calificación/etiquetas/series, etc de un montón de libros con el mismo dato. Esto es particularmente útil si lo que ha importado es una serie de libros que tienen varios metadatos en común. Esta función es muy potente, por ejemplo, tiene una pestaña de buscar y reemplazar que se puede utilizar para llevar a cabo operaciones masivas sobre metadatos e incluso copiar los metadatos de una columna a otra.
sv: Välj först de böcker du vill redigera genom att hålla ner Ctrl eller Skift och klicka på dem. Om du väljer mer än en bok, klicka på :guilabel:`Redigera metadata`-knappen kommer att orsaka en ny *Mass* metadata redigeringsdialogruta för att öppna. Med den här dialogrutan kan du snabbt ställa författaren /förlag/betyg/etikett/serie etc av ett gäng böcker till samma värde. Detta är särskilt användbart om du just har importerat ett antal böcker som har någon metadata gemensamt. Denna dialog är mycket kraftfullt, till exempel, har det en Sök och ersätt flik som du kan använda för att utföra massoperationer på metadata och med kopiera metadata från en kolumn till en annan.

source: The normal edit metadata dialog also has Next and Previous buttons that you can use to edit the metadata of several books one after the other.
es: El cuadro de diálogo de edición de metadatos también posee los botones Siguiente y Anterior que puede utilizar para editar los metadatos de varios libros uno tras otro.
sv: Normala redigeringsdialogen för metadata har också knapparna Nästa och Föregående som du kan använda för att redigera metadata för flera böcker efter varandra.

source: Search and replace
es: Buscar y reemplazar
sv: Sök och ersätt

source: The Bulk metadata edit dialog allows you to perform arbitrarily powerful search and replace operations on the selected books. By default it uses a simple text search and replace, but it also support *regular expressions*. For more on regular expressions, see :ref:`regexptutorial`.
es: El cuadro de diálogo de edición de metadatos a granel le permite arbitrariamente realizar poderosas operaciones de búsquedas y reemplazos en los libros seleccionados. De manera predeterminada usa una simple búsqueda y reemplazo de texto, pero también admite *expresiones regulares*. Para más información sobre las expresiones regulares, consulte :ref:`regexptutorial`.
sv: Massmetadata redigeringsdialogrutan låter dig utföra godtyckligt kraftfulla sök och ersätt operationer på de valda böckerna. Som standard använder en enkel textsökning och ersätta, men det stöder också *reguljära uttryck*. För mer information om reguljära uttryck finns :ref:`regexptutorial`.

source: As noted above, there are two search and replace modes: character match and regular expression. Character match will look in the `Search field` you choose for the characters you type in the `search for` box and replace those characters with what you type in the `replace with` box. Each occurance of the search characters in the field will be replaced. For example, assume the field being searched contains `a bad cat`. if you search for `a` to be replaced with `HELLO`, then the result will be `HELLO bHELLOd cHELLOt`.
es: Como se señaló anteriormente, hay dos modos de buscar y reemplazar: coincidencia de caracteres y expresión regular. Coincidencia de caracteres verá en `Buscar campo` que elija para los caracteres que tipee en el cuadro ` buscar por` y reemplazar esos caracteres con los que tipee en el cuadro `reemplazar con`. Cada instancia de los caracteres de búsqueda en el campo será reemplazado. Por ejemplo, suponga que el campo que se está buscado contiene `a bad cat`. Si busca por 'a' para ser reemplazado con `HELLO`, entonces el resultado será `HELLO bHELLOd cHELLOt`.
sv: Som nämnts ovan finns det två sök- och ersättningslägen: teckenpassning och reguljära uttryck. Teckenpassning kommer att se i `Sök-fältet du väljer för de tecken du skriver i` söka efter`-rutan och ersätta dessa tecken med vad du skriver i `ersätta med`-rutan. Varje förekomst av söktecknen på området kommer att ersättas. Antag till exempel fältet som sökte innehåller `en len sten`. om du söker på `en` ersättas med` HELLO`, då resultatet kommer att bli `HELLO lHELLO stHELLO`.

source: If the field you are searching on is a `multiple` field like tags, then each tag is treated separately. For example, if your tags contain `Horror, Scary`, the search expression `r,` will not match anything because the expression will first be applied to `Horror` and then to `Scary`.
es: Si el campo que está buscando es un campo `múltiple` como las etiquetas, entonces cada etiqueta es tratada separadamente. Por ejemplo, si sus etiquetas contienen `Horror, Scary`, la expresión de búsqueda `r` no coincidirá con nada porque la expresión primeramente se aplicará a `Horror` y después a `Scary`.
sv: Om fältet du söker på är ett `multi`-fält som etiketter, då varje etikett behandlas separat. Till exempel, om dina etiketter innehåller `Skräck, Kuslig`, sökuttrycket` r `kommer inte passa mot något eftersom uttrycket först kommer att tillämpas på` Skräck` och sedan till `Kuslig`.

source: If you want the search to ignore upper/lowercase differences, uncheck the `Case sensitive` box.
es: Si desea que la búsqueda ignore las diferencias mayúsculas/minúsculas, desactive la casilla `Case sensitive`.
sv: Om du vill sökning ska vara skifteslägeokänslig, bocka `Case sensitive` rutan.

source: You can have calibre change the case of the result (information after the replace has happened) by choosing one of the functions from the `Apply function after replace` box. The operations available are:
es: Puede hacer que calibre cambie las mayúsculas y minúsculas en los resultados de las búsquedas (información después de reemplazar ha ocurrido) eligiendo una de las funciones del cuadro `Aplicar función después del reemplazo`. Las operaciones disponibles son:
sv: Du kan låta calibre ändra det gäller resultatet (information efter det att ersättning har hänt) genom att välja en av funktionerna från `Verkställ funktion efter ersätta`-rutan. Möjliga åtgärder är:

source: `Lower case` -- change all the characters in the field to lower case
es: `Minúsculas` -- cambia todos los caracteres del campo a minúsculas
sv: `Lower case` -- ändra alla tecken i fältet till gemener

source: `Upper case` -- change all the characters in the field to upper case
es: `Mayúsculas` -- cambia todos los caracteres del campo a mayúsculas
sv: `Upper case` -- ändra alla tecken i fältet till versaler

source: `Title case` -- capitalize each word in the result.
es: `Title case` -- poner en mayúsculas cada palabra en el resultado.
sv: `Title case` -- Varje ord med bara versaler.

source: The `Your test` box is provided for you to enter text to check that search/replace is doing what you want. In the majority of cases the book test boxes will be sufficient, but it is possible that there is a case you want to check that isn't shown in these boxes. Enter that case into `Your test`.
es: El cuadro `Su prueba` le es proporcionado para que pueda introducir texto para comprobar que buscar/reemplazar está haciendo lo que les ordenado. En la mayoría de los casos, las cajas de prueba de libro será suficiente, pero es posible que haya un caso que quiera comprobar que no se muestre en estas cajas. Ingrese ese caso en `Su prueba`.
sv: Den `Din test`-rutan finns för dig att skriva in text för att kontrollera att sök/ersätt gör vad du vill. I de flesta fall kommer bokens provrutorna att räcka, men det är möjligt att det finns ett fall som du vill kontrollera som inte visas i dessa rutor. Skriv in det målet i `Din test`.

source: Regular expression mode has some differences from character mode, beyond (of course) using regular expressions. The first is that functions are applied to the parts of the string matched by the search string, not the entire field. The second is that functions apply to the replacement string, not to the entire field.
es: Modo de expresión regular tiene algunas diferencias con respecto a la modalidad caracteres, más allá (por supuesto) de usar expresiones regulares. El primero es que las funciones se aplican a las partes de la cadena coincidente con la cadena de búsqueda, no todo el campo. El segundo es que las funciones se aplican a la cadena de reemplazo, no todo el campo.
sv: Reguljära uttrycksläget har vissa skillnader från teckenläge, förutom (naturligtvis) användning av reguljära uttryck. Den första är att funktionerna tillämpas på de delar av strängen som passar mot söksträngen, inte hela fältet. Det andra är att funktionerna gäller ersättningssträngen, inte hela fältet.

source: The third and most important is that the replace string can make reference to parts of the search string by using backreferences. A backreference is ``\\n`` where n is an integer that refers to the n'th parenthesized group in the search expression. For example, given the same example as above, `a bad cat`, a search expression `a (...) (...)`, and a replace expression `a \\2 \\1`, the result will be `a cat bad`. Please see the :ref:`regexptutorial` for more information on backreferences.
es: La tercera y más importante es que la cadena de reemplazo puede hacer referencia a las partes de la cadena de búsqueda mediante el uso de retroreferencias. Una retro-referencia es ``\\n`` donde n es un entero que se refiere al grupo entre paréntesis n`th en la expresión de búsqueda. Por ejemplo, dado el mismo ejemplo anterior, `a bad cat`, una expresión de búsqueda `a (...) (...)`, y una expresión de reemplazo à \\2 \\1`, el resultado será `a cat bad`. Por favor, consulte el :ref:`regexptutorial` para obtener más información acerca de retroreferencias.
sv: Den tredje och viktigaste är att ersättningssträngen kan hänvisa till delar av söksträngen med bakåtreferenser. En bakåtreferens är ``\\n`` där n är ett heltal som hänvisar till den n:te parentesgrupp i sökuttrycket. Till exempel, givet samma exempel som ovan, `en dålig katt`, ett sökuttryck `en (...) (...) `, och ersätter uttrycket `en \\2 \\1`, resultatet kommer vara `en katt dålig`. Se :ref:`regexptutorial` för mer information om bakåtreferenser.

source: One useful pattern: assume you want to change the case of an entire field. The easiest way to do this is to use character mode, but lets further assume you want to use regular expression mode. The search expression should be `(.*)` the replace expression should be `\\1`, and the desired case change function should be selected.
es: Una pauta útil: asume que desea cambiar las mayúsculas-minúsculas de un campo entero. La forma más sencilla de hacerlo es utilizar el modo carácter, pero supongamos que desea utilizar el modo de expresión regular. La expresión de búsqueda debe ser `(.*)` la expresión de reemplazo debe ser `\\1`, y la función de cambio deseado de mayúsculas-minúsculas debe ser seleccionado.
sv: Ett användbart mönster: anta att du vill ändra skiftläge för ett helt fält. Det enklaste sättet att göra detta är att använda teckenläge, men låt oss vidare anta att du vill använda reguljära uttrycksläge. Sökningen uttrycket ska vara `(.*)` ersättningsuttrycket ska vara `\\1` och önskad förändringsfunktion bör väljas.
