Repository: Easonqsp/calibre-translations
Catalog: manual/*/news.po
Languages: sv

source: If you're satisfied with your recipe, and you feel there is enough demand to justify its inclusion into the set of built-in recipes, post your recipe in the `calibre recipes forum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_ to share it with other calibre users.
sv: Om du är nöjd med ditt recept, och du känner att det finns tillräcklig efterfrågan för att motivera dess införande i uppsättningen av inbyggda recept, lägg upp receptet på `calibres receptforum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_ för att dela den med andra calibre-användare.

source: On OS X, the command line tools are inside the calibre bundle, for example, if you installed calibre in :file:`/Applications` the command line tools are in :file:`/Applications/calibre.app/Contents/console.app/Contents/MacOS/`.
sv: På OS x, kommandoradverktyget är inne i calibre paketet, till exempel om du installerar Calibre i :file:`/Applications` är kommandoradverktyget i :file:`/Applications/calibre.app/Contents/console.app/Contents/MacOS/`.

source: The command line interface for all ebook conversion.
sv: Kommandoradsgränssnittet för all e-bokkonvertering.

source: Further reading
sv: Ytterligare läsning

source: To learn more about writing advanced recipes using some of the facilities, available in ``BasicNewsRecipe`` you should consult the following sources:
sv: Om du vill veta mer om att skriva avancerade recept med några av faciliteterna som finns i ``BasicNewsRecipe`` bör du konsultera följande källor:

source: :ref:`API Documentation <news_recipe>`
sv: :ref:`API Dokumentation <news_recipe>`

source: Documentation of the ``BasicNewsRecipe`` class and all its important methods and fields.
sv: Dokumentation av ``BasicNewsRecipe``-klassen och alla dess viktiga metoder och fält.

source: The source code of ``BasicNewsRecipe``
sv: Källkoden för ``BasicNewsRecipe``

source: `Built-in recipes <http://bazaar.launchpad.net/~kovid/calibre/trunk/files/head:/recipes/>`_
sv: `Inbyggda recept <http://bazaar.launchpad.net/~kovid/calibre/trunk/files/head:/recipes/>`_

source: The source code for the built-in recipes that come with calibre
sv: Källkoden för de inbyggda recept som kommer med calibre

source: `The calibre recipes forum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_
sv: `Calibres recept forum <http://www.mobileread.com/forums/forumdisplay.php?f=228>`_

source: Lots of knowledgeable calibre recipe writers hang out here.
sv: Massor av kunniga calibre recept författare hänga här.

source: API documentation
sv: API dokumentation
