Repository: Easonqsp/calibre-translations
Catalog: manual/*/news_recipe.po
Languages: sv

source: API Documentation for recipes
sv: API dokumentation för recept

source: The API for writing recipes is defined by the :class:`BasicNewsRecipe`
sv: API för skriva recept är definierade av :class:`BasicNewsRecipe`

source: Base class that contains logic needed in all recipes. By overriding progressively more of the functionality in this class, you can make progressively more customized/powerful recipes. For a tutorial introduction to creating recipes, see :doc:`news`.
sv: Basklass som innehåller logik behövs i alla recept. Av överrida progressivt mer av funktionaliteten i denna klass, kan du göra allt mer kundanpassade / kraftfulla recept. En handledning introduktion till att skapa recept, se :doc:`news`.

source: Call this method inside any of the preprocess methods to abort the download for the current article. Useful to skip articles that contain inappropriate content, such as pure video articles.
sv: Anropa denna metod inne i någon av förbehandlingsmetoderna för att avbryta nedladdningen för den aktuella artikeln. Användbara att hoppa över artiklar som innehåller olämpligt innehåll, såsom rena videoartiklar.

source: Causes the recipe download system to abort the download of this recipe, displaying a simple feedback message to the user.
sv: Orsakar att receptetnedladdningssystemet avbryter nedladdningen av detta recept, visar en enkel återkopplingsmeddelande till användaren.

source: Call this from populate_article_metadata with the src attribute of an <img> tag from the article that is appropriate for use as the thumbnail representing the article in the Table of Contents. Whether the thumbnail is actually used is device dependent (currently only used by the Kindles). Note that the referenced image must be one that was successfully downloaded, otherwise it will be ignored.
sv: Kalla detta från populate_article_metadata med attributet src för en <img> etiketten från artikeln som är lämplig att använda som ikon representerar artikeln i innehållsförteckningen. Huruvida ikonen faktiskt används är beroende av enhet (för närvarande endast används av Kindles). Observera att den refererade bilden måste vara en som framgångsrikt hämtats, annars kommer det att ignoreras.

source: If your recipe when converted to EPUB has problems with images when viewed in Adobe Digital Editions, call this method from within :meth:`postprocess_html`.
sv: Om ditt recept vid konvertering till EPUB har problem med bilderna när de visas i Adobe Digital Editions, kalla denna metod inifrån :meth:`postprocess_html`.

source: Return a set of canonical representations of ``url``. The default implementation uses just the server hostname and path of the URL, ignoring any query parameters, fragments, etc. The canonical representations must be unique across all URLs for this news source. If they are not, then internal links may be resolved incorrectly.
sv: Returnera en uppsättning kanoniska representationer av ``url``. Grundinställningen använder bara servervärdnamn och sökväg för URL, ignorerar eventuella frågeparametrar, fragment, etc. kanoniska representationer måste vara unika för alla webbadresser till den här nyhetskällan. Om de inte är det, så interna länkar kan lösas felaktigt.

source: Is True if the URL is coming from an internal link in an HTML file. False if the URL is the URL used to download an article.
sv: Är Sann om webbadressen kommer från en intern länk i en HTML-fil. Falsk om webbadressen är URL som används för att hämta en artikel.

source: Called after all articles have been download. Use it to do any cleanup like logging out of subscription sites, etc.
sv: Anropas efter alla artiklar har laddats ner. Använd den för att göra godtycklig sanering som att logga ut från prenumerationsplatser etc.

source: Clone the browser br. Cloned browsers are used for multi-threaded downloads, since mechanize is not thread safe. The default cloning routines should capture most browser customization, but if you do something exotic in your recipe, you should override this method in your recipe and clone manually.
sv: Klona webbläsare br. Klonade webbläsare används för multi-trådade nedladdningar, eftersom mechanize (mekanisera) inte är trådsäkert. Standardkloningsrutiner ska fånga de flesta webbläsaranpassningar, men om du gör något exotiskt i ditt recept, ska du åsidosätta den här metoden i ditt recept och klona manuellt.

source: Cloned browser instances use the same, thread-safe CookieJar by default, unless you have customized cookie handling.
sv: Klonade webbläsarinstanser använder samma, trådsäkra CookieJar som standard, såvida du inte har anpassat cookie-hantering.

source: Create a generic cover for recipes that don't have a cover
sv: Skapa en generisk omslag för recept som inte har ett omslag

source: Download and pre-process all articles from the feeds in this recipe. This method should be called only once on a particular Recipe instance. Calling it more than once will lead to undefined behavior. :return: Path to index.html
sv: Hämta och förbearbeta alla artiklar från flöde i detta recept. Denna metod bör kallas en gång för en viss receptinstans. Kallas det mer än en gång kommer det att leda till odefinierade beteenden. :return: Path to index.html

source: Extracts main article content from 'html', cleans up and returns as a (article_html, extracted_title) tuple. Based on the original readability algorithm by Arc90.
sv: Tar fram huvudartikelns innehåll från "html", rensar upp och återvänder som en (article_html, extracted_title) tupel. Baserat på den ursprungliga läsbarhet algoritm genom Arc90.

source: Override in a subclass to customize extraction of the :term:`URL` that points to the content for each article. Return the article URL. It is called with `article`, an object representing a parsed article from a feed. See `feedparser <https://pythonhosted.org/feedparser/>`_. By default it looks for the original link (for feeds syndicated via a service like feedburner or pheedo) and if found, returns that or else returns `article.link <https://pythonhosted.org/feedparser/reference-entry-link.html>`_.
sv: Överrid i en underklass för att anpassa utvinning av :term:`URL` som pekar på innehållet för varje artikel. Returnera artikel-URLn. Den anropas med `article`, ett objekt som representerar en analyserad artikel från ett flöde. Se 'feedparser <https://pythonhosted.org/feedparser/>' _. Normalt söker den efter den ursprungliga länken (till flöde syndikerade via en tjänst som Feedburner eller pheedo) och om den hittas, returnerar detta eller annars returneras `article.link <https://pythonhosted.org/feedparser/reference-entry-link.html>`_.

source: Return a browser instance used to fetch documents from the web. By default it returns a `mechanize <http://wwwsearch.sourceforge.net/mechanize/>`_ browser instance that supports cookies, ignores robots.txt, handles refreshes and has a mozilla firefox user agent.
sv: Returnera en webbläsare instans som används för att hämta dokument från webben. Som standard den returnerar en `mechanize (mekanisera) <http://wwwsearch.sourceforge.net/mechanize/>`_ browser instans som stöder cookies, ignorerar robots.txt, hanterar fräschar och har ett Mozilla Firefox användaragent.

source: If your recipe requires that you login first, override this method in your subclass. For example, the following code is used in the New York Times recipe to login for full access::
sv: Om ditt recept kräver att du loggar in först, överrids denna metod i din underklass. Till exempel är följande kod används i New York Times recept för att logga in för full tillgång::

source: Return a :term:`URL` to the cover image for this issue or `None`. By default it returns the value of the member `self.cover_url` which is normally `None`. If you want your recipe to download a cover for the e-book override this method in your subclass, or set the member variable `self.cover_url` before this method is called.
sv: Returnera en :term:`URL` till omslagsbild för den här utgåvan eller` None`. Som standard returnerar värdet av elementet `self.cover_url` som normalt är `None`. Om du vill att ditt recept för att hämta ett omslag för e-boken överrids den här metoden i din underklass, eller ställa medlemsvariabeln `self.cover_url` innan denna metod anropas.

source: Return a list of :term:`RSS` feeds to fetch for this profile. Each element of the list must be a 2-element tuple of the form (title, url). If title is None or an empty string, the title from the feed is used. This method is useful if your recipe needs to do some processing to figure out the list of feeds to download. If so, override in your subclass.
sv: Returnera en lista med :term:`RSS` flöde att hämta för den här profilen. Varje element i listan måste vara ett 2-elements tupel av formen (titel, url). Om titeln är None eller en tom sträng, används titeln från flödet. Denna metod är användbar om du receptet behöver göra en del bearbetning för att räkna ut lista med inlägg för att ladda ner. Om så är fallet, överrid i din underklass.

source: Override in subclass to use something other than the recipe title
sv: Överrids i underklass för att använda något annat än receptets titel

source: Return a :term:`URL` to the masthead image for this issue or `None`. By default it returns the value of the member `self.masthead_url` which is normally `None`. If you want your recipe to download a masthead for the e-book override this method in your subclass, or set the member variable `self.masthead_url` before this method is called. Masthead images are used in Kindle MOBI files.
sv: Returnera en :term:`URL` till redaktionsloggo till denna utgåva eller` None`. Som standard returnerar värdet av elementet `self.masthead_url` som normalt är `None`. Om du vill att ditt recept ska hämta en redationsloggon för e-boken överrrid den här metoden i din underklass, eller sätt medlemmen variabeln `self.masthead_url` innan denna metod anropas. Redaktionsloggo används i Kindle MOBI-filer.

source: If you set `articles_are_obfuscated` this method is called with every article URL. It should return the path to a file on the filesystem that contains the article HTML. That file is processed by the recursive HTML fetching engine, so it can contain links to pages/images on the web.
sv: Om du sätter `articles_are_obfuscated` anropas denna metod med varje artikel URL. Det ska returnera sökvägen till en fil i filsystemet som innehåller artikeln HTML. Filen bearbetas av den rekursiva HTML-hämtmotor, så det kan innehålla länkar till sidor / bilder på webben.

source: This method is typically useful for sites that try to make it difficult to access article content automatically.
sv: Denna metod är oftast användbart för webbplatser som försöker göra det svårt att komma åt artikelns innehåll automatiskt.

source: Perform some processing on image urls (perhaps removing size restrictions for dynamically generated images, etc.) and return the precessed URL.
sv: Utför någon behandling på bildwebbadresser (kanske ta bort storleksbegränsningar för dynamiskt skapade bilder, etc.) och returnera bearbetad URL.

source: Convenience method that takes an URL to the index page and returns a `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ of it.
sv: Bekväm metod som använder en webadress (URL) för indexera en sida och returnerar en `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ av den.

source: `url_or_raw`: Either a URL or the downloaded index page as a string
sv: `url_or_raw`: Antingen en webbadress eller den nedladdade indexsidan som en sträng

source: Return True if the link should be followed or False otherwise. By default, raises NotImplementedError which causes the downloader to ignore it.
sv: Returnerar Sann om länken ska följas eller Falsk annars. Som standard höjer NotImplementedError som orsakar hämtningen att ignorera det.

source: The URL to be followed
sv: Webbadressen som skall följas

source: The Tag from which the URL was derived
sv: Ettiketen för vilken URL erhölls

source: This method is used to login to a website that uses javascript for its login form. After the login is complete, the cookies returned from the website are copied to a normal (non-javascript) browser and the download proceeds using those cookies.
sv: Denna metod används för att logga in på en webbplats som använder javascript för sitt inloggningsformulär. Efter inloggningen är klar, kopieras kakorna från webbplatsen kopieras till en normal (icke-javascript) webbläsare och nedladdningen fortsätter som använder dessa kakor.

source: An example implementation::
sv: Ett exempel på implementering::

source: Note that you can also select forms with CSS2 selectors, like this::
sv: Observera att du också kan välja formulär med CSS2 väljare, så här::

source: Create a list of articles from the list of feeds returned by :meth:`BasicNewsRecipe.get_feeds`. Return a list of :class:`Feed` objects.
sv: Skapa en lista över artiklar i listan över flöden som returneras av :meth:`BasicNewsRecipe.get_feeds`. Returnerar en lista med :class:`Feed` objekt.

source: This method should be implemented in recipes that parse a website instead of feeds to generate a list of articles. Typical uses are for news sources that have a "Print Edition" webpage that lists all the articles in the current print edition. If this function is implemented, it will be used in preference to :meth:`BasicNewsRecipe.parse_feeds`.
sv: Denna metod bör implementeras på recept för att tolka en webbplats istället för flöde för att skapa en lista med artiklar. Typiska användningsområden är för nyhetskällor som har en "Print Edition" webbsida som listar alla artiklar i den aktuella tryckupplagan. Om denna funktion implementeras kommer den att användas i stället för :meth:`BasicNewsRecipe.parse_feeds`.

source: It must return a list. Each element of the list must be a 2-element tuple of the form ``('feed title', list of articles)``.
sv: Det måste returnera en lista. Varje element i listan måste vara ett 2-inslag tupel av formen ``("flödestitel", lista med artiklar)``.

source: Each list of articles must contain dictionaries of the form::
sv: Varje lista av artiklar måste innehålla ordlister på formen::

source: For an example, see the recipe for downloading `The Atlantic`. In addition, you can add 'author' for the author of the article.
sv: Till exempel, se receptet för nedladdning `The Atlantic`. Dessutom kan du lägga till "författare" för författaren till artikeln.

source: If you want to abort processing for some reason and have calibre show the user a simple message instead of an error, call :meth:`abort_recipe_processing`.
sv: Om du vill avbryta behandlingen av någon anledning och låta calibre visa användaren ett enkelt budskap i stället för ett fel, anropa :meth:`abort_recipe_processing`.

source: Called when each HTML page belonging to article is downloaded. Intended to be used to get article metadata like author/summary/etc. from the parsed HTML (soup). :param article: A object of class :class:`calibre.web.feeds.Article`. If you change the summary, remember to also change the text_summary :param soup: Parsed HTML belonging to this article :param first: True iff the parsed HTML is the first page of the article.
sv: Anropas när varje HTML-sida som hör till artikeln hämtas. Avsedd att användas för att få artikelns metadata som författaren / sammandrag / etc. från analyserad HTML (soppa). :param artikel: Ett objekt av klassen :class:`calibre.web.feeds.Article`. Om du ändrar sammanfattningen, kom ihåg att också ändra text_summary :param soup: Tolkad HTML tillhör denna artikel :param first: Sann om och endast om analyserad HTML är den första sidan av artikeln.

source: Run any needed post processing on the parsed downloaded e-book.
sv: Körs om någon efterbehandling behövs på analyserad nedladdade e-bok.

source: An OEBBook object
sv: Ett OEBBook-objekt

source: Conversion options
sv: Konverteringsalternativ

source: This method is called with the source of each downloaded :term:`HTML` file, after it is parsed for links and images. It can be used to do arbitrarily powerful post-processing on the :term:`HTML`. It should return `soup` after processing it.
sv: Denna metod kallas med källan till varje nedladdad: term :term:`HTML` fil, efter att den analyserats för länkar och bilder. Den kan användas för att göra godtyckligt kraftfull efterbehandling på :term:`HTML`. Det bör returnera `soup` efter bearbetning det.

source: A `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ instance containing the downloaded :term:`HTML`.
sv: En `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ instans innehållande nerladdad :term:`HTML`.

source: True if this is the first page of an article.
sv: Sann om detta är första sidan av en artikel.

source: This method is called with the source of each downloaded :term:`HTML` file, before it is parsed for links and images. It is called after the cleanup as specified by remove_tags etc. It can be used to do arbitrarily powerful pre-processing on the :term:`HTML`. It should return `soup` after processing it.
sv: Denna metod kallas med källan till varje nedladdad :term:`HTML` fil, innan den analyseras för länkar och bilder. Det kallas efter rensningen som specificerats remove_tags etc. Det kan användas för att göra godtyckliga och starka förbearbetning på :term:`HTML`. Det bör returnera `soup` efter bearbetning det.

source: `soup`: A `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ instance containing the downloaded :term:`HTML`.
sv: `soup`: En `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ instans innehållande nerladdad :term:`HTML`.

source: This method is called with the source of each downloaded :term:`HTML` file, before it is parsed into an object tree. raw_html is a unicode string representing the raw HTML downloaded from the web. url is the URL from which the HTML was downloaded.
sv: Denna metod anropas med källa av varje nedladdad :term:`HTML` fil, innan den tolkas i ett objektträd. raw_html är en unicode sträng som representerar råa HTML nedladdningen från webben. url är URL från vilken HTML var nedladdad.

source: Note that this method acts *before* preprocess_regexps.
sv: Obserevera att denna metod agerar *innan* preprocess_regexps.

source: This method must return the processed raw_html as a unicode object.
sv: Denna metod måste returnera den bearbetade raw_html som ett unicode-objekt.

source: Take a `url` pointing to the webpage with article content and return the :term:`URL` pointing to the print version of the article. By default does nothing. For example::
sv: Ta en `url` som pekar på en webbsida med artikelinnehåll och returnerar :term:`URL` som pekar på en utskrivbar version av artikeln. Som standard gör ingenting. TIll exempel::

source: This method is called with the source of each downloaded :term:`HTML` file, before any of the cleanup attributes like remove_tags, keep_only_tags are applied. Note that preprocess_regexps will have already been applied. It is meant to allow the recipe to skip ad pages. If the soup represents an ad page, return the HTML of the real page. Otherwise return None.
sv: Denna metod anropas med källan till varje nedladdad :term:`HTML` fil, innan någon av rensningsattribut som remove_tags, keep_only_tags tillämpas. Observera att preprocess_regexps kommer redan ha använts. Det är tänkt att låta receptet att hoppa över annonssidor. Om soup är en annonssida, returnera HTML den verkliga sidan. Annars returneras None.

source: Convenience method to sort the titles in `index` according to `weights`. `index` is sorted in place. Returns `index`.
sv: Bekväm metod för att sortera titlar i `index` enligt `weights`. index` sorteras på plats. Returnerar `index`.

source: `index`: A list of titles.
sv: `index`: En lista av titlar.

source: `weights`: A dictionary that maps weights to titles. If any titles in index are not in weights, they are assumed to have a weight of 0.
sv: `weights`: En ordlista som översätter vikt mot titel., Om något titelindex inte har vikt. antas de ha vikten 0.

source: Convenience method to take a `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ `Tag` and extract the text from it recursively, including any CDATA sections and alt tag attributes. Return a possibly empty unicode string.
sv: Bekväm metod som använder en `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ `tag`-etikett och extraherar text från den rekursivt, inkluderande godtycklig CDATA sektion och alt-attribut. Returnerar en möjlig tom unicode-sträng.

source: `use_alt`: If `True` try to use the alt attribute for tags that don't have any textual content
sv: `use_alt`: Om `True` försök använd alt attribut för etiketter som inte har något textinnehåll

source: `tag`: `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ `Tag`
sv: `tag`: `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html>`_ `Tag` (Etikett)

source: Set to True and implement :meth:`get_obfuscated_article` to handle websites that try to make it difficult to scrape content.
sv: Sätt till Sann och implementerar :meth:`get_obfuscated_article` för hantera webbsidor som försöker göra det svårt att skrapa fram innehåll.

source: Automatically extract all the text from downloaded article pages. Uses the algorithms from the readability project. Setting this to True, means that you do not have to worry about cleaning up the downloaded HTML manually (though manual cleanup will always be superior).
sv: Automatiskt extrahera all text från nedladdade artikelsidor. Använder algoritmerna från läsbarhet projektet. Sätt denna sann innebär att du inte behöver oroa dig för att städa upp den nedladdade HTML manuellt (även om manuell rensning alltid kommer att vara bättre).

source: Specify elements that the auto cleanup algorithm should never remove. The syntax is a XPath expression. For example::
sv: Ange element som den automatiska rensningen algoritmen aldrig ska ta bort. Syntaxen är ett XPath-uttryck. Exempelvis::

source: If True the navigation bar is center aligned, otherwise it is left aligned
sv: Om sann centreras navigationslisten annars är den vänsterjusterad

source: Set this to False to ignore all scaling and compression parameters and pass images through unmodified. If True and the other compression parameters are left at their default values, jpeg images will be scaled to fit in the screen dimensions set by the output profile and compressed to size at most (w * h)/16 where w x h are the scaled image dimensions.
sv: Ställ in den till Falsk för att ignorera alla skalnings- och komprimeringsparametrar och passera bilder igenom omodifierad. Om Sann och andra komprimeringsparametrar behåller sina standardvärden, kommer jpeg-bilder skalas för att passa in skärmmått som fastställts av utskriftsprofil och komprimeras till storleken på de flesta (b * h) / 16 där bxh är det skalade bildens dimensioner .
