Repository: Easonqsp/calibre-translations
Catalog: manual/*/news_recipe.po
Languages: sv

source: The factor used when auto compressing jpeg images. If set to None, auto compression is disabled. Otherwise, the images will be reduced in size to (w * h)/compress_news_images_auto_size bytes if possible by reducing the quality level, where w x h are the image dimensions in pixels. The minimum jpeg quality will be 5/100 so it is possible this constraint will not be met. This parameter can be overridden by the parameter compress_news_images_max_size which provides a fixed maximum size for images. Note that if you enable scale_news_images_to_device then the image will first be scaled and then its quality lowered until its size is less than (w * h)/factor where w and h are now the *scaled* image dimensions. In other words, this compression happens after scaling.
sv: Den faktor som används när automatisk komprimera jpeg-bilder. Om värdet är None, är komprimering automatisk inaktiverad. Annars kommer bilderna att minskas i storlek till (b * h) / compress_news_images_auto_size byte om möjligt genom att minska kvalitetsnivån, där bxh är bildens dimensioner i pixlar. Den minsta jpeg-kvalitet kommer att vara 5/100 så det är möjligt denna begränsning inte kommer att uppfyllas. Denna parameter kan överridas av parametern compress_news_images_max_size som ger en fast maximal storlek för bilder. Observera att om du aktiverar scale_news_images_to_device kommer sedan bilden först skalas och sedan dess kvalitet sänkas tills dess storlek är mindre än (b*h)/faktor där w och h är nu bildens *skalade* dimensioner. Med andra ord, denna kompression sker efter skalning.

source: Set jpeg quality so images do not exceed the size given (in KBytes). If set, this parameter overrides auto compression via compress_news_images_auto_size. The minimum jpeg quality will be 5/100 so it is possible this constraint will not be met.
sv: Sätt jpeg-kvalitet så att bilder inte överskrider angiven storlek (i kBytes). Om satt, överrider denna parameter automatisk komprimering via compress_news_images_auto_size. Minimum jpeg-kvalitet kommer vara 5/100 so det är möjligt att denna restriktion inte möts.

source: Recipe specific options to control the conversion of the downloaded content into an e-book. These will override any user or plugin specified values, so only use if absolutely necessary. For example::
sv: Receptspecifika alternativ för att styra konvertering av nedladdat innehåll in i en e-bok. Dessa kommer överrida alla användare eller tilläggsspecifika värden, så använd bara om det är absolut nödvändigt. TIll exempel::

source: By default, the cover image returned by get_cover_url() will be used as the cover for the periodical. Overriding this in your recipe instructs calibre to render the downloaded cover into a frame whose width and height are expressed as a percentage of the downloaded cover. cover_margins = (10, 15, '#ffffff') pads the cover with a white margin 10px on the left and right, 15px on the top and bottom. Color names defined at http://www.imagemagick.org/script/color.php Note that for some reason, white does not always work on windows. Use #ffffff instead
sv: Som standard returneras omslagsbild av get_cover_url () och kommer att användas som omslag för tidskriften. Överridning av detta i ditt recept instruerar calibre att anpassa det nedladdade omslaget i en ram vars bredd och höjd uttrycks som en procentandel av den nedladdade omslaget. cover_margins = (10, 15, "#ffffff") fyller omslaget med en vit marginal 10px på vänster och höger, 15px på toppen och botten. Färgnamn som fastställts på http://www.imagemagick.org/script/color.php Notera att av någon anledning, vitt fungerar inte alltid på fönster. Använd #ffffff istället

source: Delay between consecutive downloads in seconds. The argument may be a floating point number to indicate a more precise time.
sv: Fördröjning mellan konsekutiva nedladdningar i sekunder. Argumentet kan vara ett flyttal för att indikera mer exakt tid.

source: A couple of lines that describe the content this recipe downloads. This will be used primarily in a GUI that presents a list of recipes.
sv: Ett par rader som beskriver innehållet detta recept laddar ner. Detta kommer främst att användas i ett användargränssnitt som presenterar en lista med recept.

source: Specify an override encoding for sites that have an incorrect charset specification. The most common being specifying ``latin1`` and using ``cp1252``. If None, try to detect the encoding. If it is a callable, the callable is called with two arguments: The recipe object and the source to be decoded. It must return the decoded source.
sv: Ange en kodningsöverridning för webbplatser som har en felaktig charset-specifikation. Det vanligaste är att ange ``latin1`` och använda ``cp1252``. Om None, försöka identifiera kodningen. Om det är en anropbar, anropas den anropbara med två argument: Receptobjektet och den källa som skall avkodas. Det måste returnera den avkodade källan.

source: Specify any extra :term:`CSS` that should be added to downloaded :term:`HTML` files. It will be inserted into `<style>` tags, just before the closing `</head>` tag thereby overriding all :term:`CSS` except that which is declared using the style attribute on individual :term:`HTML` tags. For example::
sv: Ange någon extra :term:`CSS` som bör läggas till ladda ned :term:`HTML`-filer. Det kommer att införas i `<style>` etiketter, precis före den avslutande `</head>` etikett därmed tvingande allt :term:`CSS` utom det som deklareras med hjälp av stilattribut på individuella :term:`HTML` etiketter . Exempelvis::

source: List of feeds to download. Can be either ``[url1, url2, ...]`` or ``[('title1', url1), ('title2', url2),...]``
sv: Förteckning över flöde för att ladda ner. Kan vara antingen ``[url1, url2, ...]`` eller ``[('title1', url1), ('title2', url2),...]``

source: List of regular expressions that determines which links to ignore. If empty it is ignored. Used only if is_link_wanted is not implemented. For example::
sv: Lista över reguljära uttryck som avgör vilka länkar att ignorera. Om den är tom ignoreras det. Endast användas om is_link_wanted inte implementeras. Exempelvis::

source: will remove all URLs that have `ads.doubleclick.net` in them.
sv: kommer ta bort alla URLer som har `ads.doubleclick.net` in sig.

source: Only one of :attr:`BasicNewsRecipe.match_regexps` or :attr:`BasicNewsRecipe.filter_regexps` should be defined.
sv: Bara en av :attr:`BasicNewsRecipe.match_regexps` eller :attr:`BasicNewsRecipe.filter_regexps` skulle bara definierad.

source: Ignore duplicates of articles that are present in more than one section. A duplicate article is an article that has the same title and/or URL. To ignore articles with the same title, set this to::
sv: Ignorera dubbletter av artiklar som finns i mer än ett avsnitt. En dubblettartikel är en artikel som har samma titel och / eller webbadress. Att ignorera artiklar med samma titel, ställa detta till::

source: To use URLs instead, set it to::
sv: För att använda URL:er i stället, sätt den till::

source: To match on title or URL, set it to::
sv: För träff mot titel eller URL, sätt den till::

source: Keep only the specified tags and their children. For the format for specifying a tag see :attr:`BasicNewsRecipe.remove_tags`. If this list is not empty, then the `<body>` tag will be emptied and re-filled with the tags that match the entries in this list. For example::
sv: Håll endast specificerade etiketter och deras barn. För formatet för att ange en etikett se :attr:`BasicNewsRecipe.remove_tags`. Om denna lista inte är tom, då blir `<body>` etikett tom och återfylld med etiketter som passar poster i denna lista. Till exempel::

source: will keep only tags that have an `id` attribute of `"content"` or `"heading"`.
sv: kommer bara ha etiketter som har ett `id` attribut av `"content"` eller `"heading"`.

source: The language that the news is in. Must be an ISO-639 code either two or three characters long
sv: Språket som nyheterna är i. Måste vara en ISO-639-kod antingen två eller tre tecken långt

source: By default, calibre will use a default image for the masthead (Kindle only). Override this in your recipe to provide a url to use as a masthead.
sv: Som standard, kommer calibre att använda en redaktionslogga (endast Kindle). Åsido detta i ditt recept för att ge en url för att användas som en redaktionslogga.

source: List of regular expressions that determines which links to follow. If empty, it is ignored. Used only if is_link_wanted is not implemented. For example::
sv: Lista över reguljära uttryck som avgör vilka länkar att följa. Om den är tom, ignoreras den. Endast användas om is_link_wanted inte implementeras. Exempelvis::

source: will match all URLs that have `page=some number` in them.
sv: kommer passa mot alla URLer som har `page=some number` i sig.

source: Maximum number of articles to download from each feed. This is primarily useful for feeds that don't have article dates. For most feeds, you should use :attr:`BasicNewsRecipe.oldest_article`
sv: Maximalt antal artiklar att ladda ned från varje flöde. Den är primärt användbar för flöde som inte har artikeldatum. För de flesta flödes, bör du använda :attr:`BasicNewsRecipe.oldest_article`

source: If True the GUI will ask the user for a username and password to use while downloading. If set to "optional" the use of a username and password becomes optional
sv: Om Sann kommer gränssnittet att be användaren om ett användarnamn och lösenord för att använda vid nedladdning. Om inställningen är "frivilligt" att använda ett användarnamn och lösenord blir tillval

source: Convenient flag to disable loading of stylesheets for websites that have overly complex stylesheets unsuitable for conversion to ebooks formats. If True stylesheets are not downloaded and processed
sv: Bekväm flagga för att inaktivera laddning av formatmallar för webbplatser som har alltför komplexa mallar som är olämpliga för konvertering till e-böcker format. Om Sann hämtas inte mallar och bearbetas

source: Oldest article to download from this news source. In days.
sv: Äldsta artikel att ladda ner från denna nyhetskälla. I dagarna.

source: List of :term:`regexp` substitution rules to run on the downloaded :term:`HTML`. Each element of the list should be a two element tuple. The first element of the tuple should be a compiled regular expression and the second a callable that takes a single match object and returns a string to replace the match. For example::
sv: Lista av :term:`regexp` substitutionsregler att köras vid nedladdning :term:`HTML`. Varje element i listan bör vara en tupel. Första elementet av tupel bör vara ett kompilerat regujärt uttryck och andra en anropsbar som tar ett passande objekt och returnerar en sträng för att ersätta träffen. Till exempel::

source: will remove everything from `<!--Article ends here-->` to `</body>`.
sv: kommer ta bort allt från `<!--Article ends here-->` till `</body>`.

source: Publication type Set to newspaper, magazine or blog. If set to None, no publication type metadata will be written to the opf file.
sv: Publikationstyp Inställd på tidning, tidskrift eller blogg. Om satt till None, kommer ingen publikationstypsmetadata skrivas till opf-filen.

source: Set to a non empty string to disable this recipe. The string will be used as the disabled message
sv: Ställ in på en icke tom sträng för att inaktivera detta recept. Strängen kommer att användas som inaktiverade meddelande

source: Number of levels of links to follow on article webpages
sv: Antal nivåer av länkar att följa på en artikelwebbsida

source: List of attributes to remove from all tags. For example::
sv: Lista över attribut för att ta bort från alla etiketter. Exempelvis::

source: If True empty feeds are removed from the output. This option has no effect if parse_index is overridden in the sub class. It is meant only for recipes that return a list of feeds using `feeds` or :meth:`get_feeds`. It is also used if you use the ignore_duplicate_articles option.
sv: Om Sann tas tomma flöden bort från utdata. Det här alternativet har ingen effekt om parse_index överrids i underklassen. Den är avsedd endast för recept som returnerar en lista med flöden som använder `feeds` eller :meth:`get_feeds`. Den används också om du använder alternativet ignore_duplicate_articles.

source: Convenient flag to strip all javascript tags from the downloaded HTML
sv: Bekväm flagga att strippa alla javascript etiketter från den nedladdade HTMLn

source: List of tags to be removed. Specified tags are removed from downloaded HTML. A tag is specified as a dictionary of the form::
sv: Lista med etiketter som skall avlägsnas. Angivna etiketter tas bort från nedladdad HTML. En etiketter anges som en ordlista på formen::

source: All keys are optional. For a full explanation of the search criteria, see `Beautiful Soup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html#Searching%20the%20Parse%20Tree>`_ A common example::
sv: Alla tangenter är valbara. För full förklaring av sökningskriteria, se `Beautiful Soup <http://www.crummy.com/software/BeautifulSoup/bs3/documentation.html#Searching%20the%20Parse%20Tree>`_ Ett vanligt exempel::

source: This will remove all `<div class="advert">` tags and all their children from the downloaded :term:`HTML`.
sv: Detta tar bort alla `<div class="advert">` etiketter och deras barn från nerladdade :term:`HTML`.

source: Remove all tags that occur after the specified tag. For the format for specifying a tag see :attr:`BasicNewsRecipe.remove_tags`. For example::
sv: Ta bort alla etiketter som förekommer efter angiven etikett. För formatet att ange en etikett se :attr:`BasicNewsRecipe.remove_tags`. Till exempel::

source: will remove all tags after the first element with `id="content"`.
sv: kommer ta bort alla etiketter efter första elementet med `id="content"`.

source: Remove all tags that occur before the specified tag. For the format for specifying a tag see :attr:`BasicNewsRecipe.remove_tags`. For example::
sv: Ta bort alla etiketter som förekommer före angiven etikett. För formatet att ange en etikett se :attr:`BasicNewsRecipe.remove_tags`. Till exempel::

source: will remove all tags before the first element with `id="content"`.
sv: kommer ta bort alla etiketter före första elementet med `id="content"`.

source: Minimum calibre version needed to use this recipe
sv: Minimum version av calibre som behövs för detta recept

source: If set to True then links in downloaded articles that point to other downloaded articles are changed to point to the downloaded copy of the article rather than its original web URL. If you set this to True, you might also need to implement :meth:`canonicalize_internal_url` to work with the URL scheme of your particular website.
sv: Om satt till Sann så kommer länkar i nedladdade artiklar som pekar på andra nedladdade artiklar ändras till att peka på den nedladdade kopia av artikeln snarare än dess ursprungliga webbadress . Om du ställer in detta till Sann, behöver du kanske du också införa :meth:`canonicalize_internal_url` för att arbeta med URL-schemat för just din webbplats.

source: Reverse the order of articles in each feed
sv: Omvänd ordning av artiklar i varje flöde

source: Maximum dimensions (w,h) to scale images to. If scale_news_images_to_device is True this is set to the device screen dimensions set by the output profile unless there is no profile set, in which case it is left at whatever value it has been assigned (default None).
sv: Maximala dimensioner (w, h) att skala bilder till. Om scale_news_images_to_device är Sann så är detta inställt på enhetens skärmmått för utskriftsprofil om det inte finns någon profil som, i vilket fall det är kvar på oavsett värde den har tilldelats (standard None).

source: Rescale images to fit in the device screen dimensions set by the output profile. Ignored if no output profile is set.
sv: Skala om bilder för att passa enhetens skärmmått satta av utdataprofilen. Ignoreras om ingen utdataprofil är angiven.

source: Number of simultaneous downloads. Set to 1 if the server is picky. Automatically reduced to 1 if :attr:`BasicNewsRecipe.delay` > 0
sv: Antal samtidiga nedladdningar. Sätt till 1 om servern är petig. Automatisk reducerat till 1 om attr:`BasicNewsRecipe.delay` > 0

source: Max number of characters in the short description
sv: Maximal antal tecken i den korta beskrivningen

source: The CSS that is used to style the templates, i.e., the navigation bars and the Tables of Contents. Rather than overriding this variable, you should use `extra_css` in your recipe to customize look and feel.
sv: CSS som används för att utforma mallar, dvs de navigeringsfält och innehållsförteckningar. I stället för att överrida denna variabel bör du använda `extra_css` i receptet för att anpassa utseende och beteende.

source: The format string for the date shown on the first page. By default: Day_Name, Day_Number Month_Name Year
sv: Formatsträng för datum att visa på första sidan. Som standard: Day_Name, Day_Number Month_Name Year

source: Timeout for fetching files from server in seconds
sv: Tidsbegränsning för hämta filer från servern i sekunder

source: The title to use for the ebook
sv: Titel att använda för e-bok

source: Normally we try to guess if a feed has full articles embedded in it based on the length of the embedded content. If `None`, then the default guessing is used. If `True` then the we always assume the feeds has embedded content and if `False` we always assume the feed does not have embedded content.
sv: Normalt försöker vi gissa om ett flöde har hela artiklar inbäddade i den baserat på längden av inbäddat innehåll. Om `None`, sedan standard används gissning. Om `True` då antar vi alltid flöden har inbäddat innehåll och om` False` kan vi alltid utgå från flödet inte har inbäddat innehåll.

source: If you set this True, then calibre will use javascript to login to the website. This is needed for some websites that require the use of javascript to login. If you set this to True you must implement the :meth:`javascript_login` method, to do the actual logging in.
sv: Om du sätter detta till Sann, så använder calibre javascript för att logga in på webbplatsen. Detta behövs för vissa webbplatser som kräver användning av javascript för att logga in. Om du ställer in detta till Sann måste du implementera :meth:`javascript_login` metoden, för att göra den faktiska inloggningen.
