Repository: Easonqsp/calibre-translations
Catalog: manual/*/news.po
Languages: sv

source: Adding your favorite news website
sv: Lägga till din favorit nyhetswebbplats

source: calibre has a powerful, flexible and easy-to-use framework for downloading news from the Internet and converting it into an ebook. The following will show you, by means of examples, how to get news from various websites.
sv: calibre har en kraftfull, flexibel och lätt att använda ramverk för att hämta nyheter från Internet och omvandla dem till en e-bok. Följande kommer att visa dig, med hjälp av exempel, hur man får nyheter från olika webbplatser.

source: To gain an understanding of how to use the framework, follow the examples in the order listed below:
sv: För att få en förståelse för hur man använder ramverket, följ exemplen i den ordning som anges nedan:

source: Completely automatic fetching
sv: Helt automatisk hämtning

source: If your news source is simple enough, calibre may well be able to fetch it completely automatically, all you need to do is provide the URL. calibre gathers all the information needed to download a news source into a :term:`recipe`. In order to tell calibre about a news source, you have to create a :term:`recipe` for it. Let's see some examples:
sv: Om din nyhetskälla är enkel nog, skulle calibre mycket väl kunna hämta det helt automatiskt, allt du behöver göra att ge webbadressen. calibre samlar all information som behövs för att ladda ner en nyhetskälla i ett recept . För att berätta för calibre om en nyhetskälla, måste du skapa ett recept för det. Låt oss se några exempel:

source: *portfolio.com* is the website for *Condé Nast Portfolio*, a business related magazine. In order to download articles from the magazine and convert them to ebooks, we rely on the :term:`RSS` feeds of portfolio.com. A list of such feeds is available at http://www.portfolio.com/rss/.
sv: *portfolio.com* är webbplatsen för *Condé Nast Portfolio*, ett företagsrelaterad tidning. För att ladda ner artiklar från tidningen och konvertera dem till e-böcker, litar vi på RSS- flöden på portfolio.com. En förteckning över sådana flöden finns på http://www.portfolio.com/rss/ .

source: Lets pick a couple of feeds that look interesting:
sv: Låter plocka ett par flöden som ser intressanta:

source: Business Travel: http://feeds.portfolio.com/portfolio/businesstravel
sv: Affärsresor: http://feeds.portfolio.com/portfolio/businesstravel

source: Tech Observer: http://feeds.portfolio.com/portfolio/thetechobserver
sv: Teknikobservatör: http://feeds.portfolio.com/portfolio/thetechobserver

source: I got the URLs by clicking the little orange RSS icon next to each feed name. To make calibre download the feeds and convert them into an ebook, you should right click the :guilabel:`Fetch news` button and then the :guilabel:`Add a custom news source` menu item. A dialog similar to that shown below should open up.
sv: Jag fick de webbadresser genom att klicka på den lilla oranga RSS-ikonen bredvid varje flödesnamnet. För att få calibre att hämta flöden och omvandla dem till en e-bok, ska du högerklicka på :guilabel:`Fetch news` knappen och sedan :guilabel:`Add a custom news source` menyn. En dialogruta liknande den som visas nedan bör då öppnas.

source: First enter ``Portfolio`` into the :guilabel:`Recipe title` field. This will be the title of the ebook that will be created from the articles in the above feeds.
sv: Ange först ``Portfolio`` i :guilabel:`Recipe title`-fältet. Detta kommer att vara titeln på den e-bok som kommer att skapas från artiklarna i de ovannämnda flöden.

source: The next two fields (:guilabel:`Oldest article` and :guilabel:`Max. number of articles`) allow you some control over how many articles should be downloaded from each feed, and they are pretty self explanatory.
sv: De nästa två fälten (:guilabel:`Oldest article` och :guilabel:`Max. number of articles`) tillåter dig viss kontroll över hur många artiklar som ska hämtas från varje flöde, och de är ganska självförklarande.

source: To add the feeds to the recipe, enter the feed title and the feed URL and click the :guilabel:`Add feed` button. Once you have added both feeds, simply click the :guilabel:`Add/update recipe` button and you're done! Close the dialog.
sv: För att lägga till flöde till receptet, mata in i flödestiteln och flödes-URLn och klicka på :guilabel:`Add feed`-knappen. När du har lagt båda flöden, klicka på :guilabel:`Add/update recipe`-knappen och du är klar! Stäng dialogrutan.

source: To test your new :term:`recipe`, click the :guilabel:`Fetch news` button and in the :guilabel:`Custom news sources` sub-menu click :guilabel:`Portfolio`. After a couple of minutes, the newly downloaded Portfolio ebook will appear in the main library view (if you have your reader connected, it will be put onto the reader instead of into the library). Select it and hit the :guilabel:`View` button to read!
sv: Om du vill testa nya :term:`recipe` , klicka på knappen :guilabel:`Fetch news` och i :guilabel:`Custom news sources` undermenyn klicka på :guilabel:`Portfolio`. Efter ett par minuter, kommer den nyligen nedladdade Portfolio e-bok visas i huvudbiblioteket vyn (om du har din läsare ansluten kommer den att läggas ut på läsaren i stället för in i biblioteket). Välj det och tryck på knappen :guilabel:`View` för att läsa!

source: The reason this worked so well, with so little effort is that *portfolio.com* provides *full-content* :term:`RSS` feeds, i.e., the article content is embedded in the feed itself. For most news sources that provide news in this fashion, with *full-content* feeds, you don't need any more effort to convert them to ebooks. Now we will look at a news source that does not provide full content feeds. In such feeds, the full article is a webpage and the feed only contains a link to the webpage with a short summary of the article.
sv: Anledningen till att detta fungerat så bra, med så liten ansträngning är att *portfolio.com* ger *full-innehåll* RSS- flöden, det vill säga, är artikelns innehåll inbäddade i fodret själva. För de flesta nyhetskällor som tillhandahåller nyheter på detta sätt, med *full-innehåll* flöden, behöver du inte någon mer ansträngning för att omvandla dem till e-böcker. Nu ska vi titta på en nyhetskälla som inte ger fullständiga innehållsflöden. I sådana flöden är hela artikeln en webbsida och fodret innehåller endast en länk till webbsidan med en kort sammanfattning av artikeln.

source: Lets try the following two feeds from *The BBC*:
sv: Låt oss prova följande två flöden från *BBC*:

source: News Front Page: http://newsrss.bbc.co.uk/rss/newsonline_world_edition/front_page/rss.xml
sv: Nyheter framsida: http://newsrss.bbc.co.uk/rss/newsonline_world_edition/front_page/rss.xml

source: Science/Nature: http://newsrss.bbc.co.uk/rss/newsonline_world_edition/science/nature/rss.xml
sv: Vetenskap/Natur: http://newsrss.bbc.co.uk/rss/newsonline_world_edition/science/nature/rss.xml

source: Follow the procedure outlined in :ref:`portfolio` to create a recipe for *The BBC* (using the feeds above). Looking at the downloaded ebook, we see that calibre has done a creditable job of extracting only the content you care about from each article's webpage. However, the extraction process is not perfect. Sometimes it leaves in undesirable content like menus and navigation aids or it removes content that should have been left alone, like article headings. In order, to have perfect content extraction, we will need to customize the fetch process, as described in the next section.
sv: Följ förfarandet i :ref:`portfolio` för att skapa ett recept för *BBC* (med hjälp av flöden ovan). Om man tittar på nedladdade e-boken, ser vi att calibre har gjort ett förtjänstfullt arbete för att utvinna bara innehållet som du bryr dig om från varje artikel hemsida. Emellertid är extraktionsprocessen inte perfekt. Ibland lämnar oönskade innehåll som menyer och navigeringshjälpmedel, eller det tar bort innehåll som borde ha lämnats ensam, som artikelrubriker. För att få perfekt utvinning innehåll, måste vi anpassa hämta processen, som beskrivs i nästa avsnitt.

source: Customizing the fetch process
sv: Anpassa hämta processen

source: When you want to perfect the download process, or download content from a particularly complex website, you can avail yourself of all the power and flexibility of the :term:`recipe` framework. In order to do that, in the :guilabel:`Add custom news sources` dialog, simply click the :guilabel:`Switch to Advanced mode` button.
sv: När du vill att fullända hämtningen, eller hämta innehåll från en särskilt komplicerad webbplats kan du använda dig av all den kraft och flexibilitet i ramen av :term:`recipe`. För att kunna göra det, i :guilabel:`Add custom news sources` dialog, genom att klicka på :guilabel:`Switch to Advanced mode` knappen.

source: The easiest and often most productive customization is to use the print version of the online articles. The print version typically has much less cruft and translates much more smoothly to an ebook. Let's try to use the print version of the articles from *The BBC*.
sv: Det enklaste och ofta mest produktiva anpassning är att använda den tryckta versionen av uppkopplade-artiklar. Den tryckta versionen är oftast mycket mindre hantverk och översätter mycket smidigare till en e-bok. Låt oss försöka använda den tryckta versionen av artiklarna från *BBC*.

source: Using the print version of bbc.co.uk
sv: Använda den tryckta versionen av bbc.co.uk

source: The first step is to look at the ebook we downloaded previously from :ref:`bbc`. At the end of each article, in the ebook is a little blurb telling you where the article was downloaded from. Copy and paste that URL into a browser. Now on the article webpage look for a link that points to the "Printable version". Click it to see the print version of the article. It looks much neater! Now compare the two URLs. For me they were:
sv: Det första steget är att titta på e-boken som vi hämtat tidigare från :ref:`bbc` . Vid slutet av varje artikel, i e-boken finns en liten baksidetext som talar om när artikeln hämtats från. Kopiera och klistra in denna webbadress i en webbläsare. Nu på artikelwebbsidan leta efter en länk som pekar på "Utskrift". Klicka på den för att se den tryckta versionen av artikeln. Det ser mycket snyggare! Jämför nu de två webbadresser. För mig var de:

source: Article URL
sv: Artikel URL

source: Print version URL
sv: Utskriftsversion URL

source: So it looks like to get the print version, we need to prefix every article URL with:
sv: Så det ser ut att få den tryckta versionen måste vi prefix varje artikel URL med:

source: Now in the :guilabel:`Advanced Mode` of the Custom news sources dialog, you should see something like (remember to select *The BBC* recipe before switching to advanced mode):
sv: Nu i :guilabel:`Advanced Mode` för Anpassad nyhetskällor dialogrutan ska du se något liknande (kom ihåg att välja *BBC* receptet innan du växlar till avancerat läge):

source: You can see that the fields from the :guilabel:`Basic mode` have been translated to python code in a straightforward manner. We need to add instructions to this recipe to use the print version of the articles. All that's needed is to add the following two lines:
sv: Du kan se att fälten från :guilabel:`Basic mode` har omräknats med python-kod på ett enkelt sätt. Vi måste lägga till instruktioner för att detta recept för att använda den tryckta versionen av artiklarna. Allt som behövs är att lägga till följande två rader:

source: This is python, so indentation is important. After you've added the lines, it should look like:
sv: Detta är python, så indenteringen(indrag) är viktigt. När du har lagt raderna ska det se ut:

source: In the above, ``def print_version(self, url)`` defines a *method* that is called by calibre for every article. ``url`` is the URL of the original article. What ``print_version`` does is take that url and replace it with the new URL that points to the print version of the article. To learn about `python <http://www.python.org>`_ see the `tutorial <http://docs.python.org/tut/>`_.
sv: I ovanstående, ``def print_version(self, url)`` definierar en metod som anropas av calibre för varje artikel. ``url`` är webbadressen till den ursprungliga artikeln. Vilken print_version gör är att tar URL:n och ersätter den med den nya URL:n som pekar på den tryckta versionen av artikeln. Om du vill veta om `python <http://www.python.org>`_ se `tutorial <http://docs.python.org/tut/>`_.

source: Now, click the :guilabel:`Add/update recipe` button and your changes will be saved. Re-download the ebook. You should have a much improved ebook. One of the problems with the new version is that the fonts on the print version webpage are too small. This is automatically fixed when converting to an ebook, but even after the fixing process, the font size of the menus and navigation bar to become too large relative to the article text. To fix this, we will do some more customization, in the next section.
sv: Nu klickar du på :guilabel:`Add/update recipe`-knappen och dina ändringar sparas. Hämta e-boken igen. Du bör nu ha en mycket förbättrad e-bok. Ett av problemen med den nya versionen är att typsnitten på utskriftsversion är för små. Detta är automatiskt justerat vid konvertering till en e-bok, men även efter justeringsprocessen, blir teckenstorleken för menyer och navigeringsfältet för stora i förhållande till artikeltexten. För att åtgärda detta, kommer vi att göra lite mer anpassning, i nästa avsnitt.

source: Replacing article styles
sv: Byte av artikelstilar

source: In the previous section, we saw that the font size for articles from the print version of *The BBC* was too small. In most websites, *The BBC* included, this font size is set by means of :term:`CSS` stylesheets. We can disable the fetching of such stylesheets by adding the line::
sv: I föregående avsnitt såg vi att teckenstorleken efter artiklar från den tryckta versionen av *BBC* var för liten. I de flesta webbplatser, ingår *BBC*, är detta textstorlek in med hjälp av :term:`CSS` stilmallar. Vi kan inaktivera hämtning av sådana mallar genom att lägga till raden::

source: The recipe now looks like:
sv: Receptet ser nu ut:

source: The new version looks pretty good. If you're a perfectionist, you'll want to read the next section, which deals with actually modifying the downloaded content.
sv: Den nya versionen ser ganska bra ut. Om du är en perfektionist, vill du nog läsa nästa avsnitt, som handlar faktiskt om att modifiera nedladdat material.

source: Slicing and dicing
sv: Skivning och tärning

source: calibre contains very powerful and flexible abilities when it comes to manipulating downloaded content. To show off a couple of these, let's look at our old friend the :ref:`The BBC <bbc1>` recipe again. Looking at the source code (:term:`HTML`) of a couple of articles (print version), we see that they have a footer that contains no useful information, contained in
sv: calibre innehåller mycket kraftfulla och flexibla färdigheter när det gäller att manipulera nedladdat material. För att visa upp ett par av dessa, låt oss titta på vår gamle vän för :ref:`The BBC <bbc1>` receptet igen. Om man tittar på källkoden (:term:`HTML`) i ett par artiklar (utskriftsversion), ser vi att de har en sidfot som innehåller någon användbar information, som finns i

source: This can be removed by adding::
sv: Detta kan tas bort genom att lägga till:

source: to the recipe. Finally, lets replace some of the :term:`CSS` that we disabled earlier, with our own :term:`CSS` that is suitable for conversion to an ebook::
sv: till receptet. Slutligen kan ersätta en del av :term:`CSS` som vi tidigare inaktiverad, med vår egen :term:`CSS`om är lämplig för omvandling till en e-bok::

source: With these additions, our recipe has become "production quality", indeed it is very close to the actual recipe used by calibre for the *BBC*, shown below:
sv: Med dessa tillägg har vårt recept blivit "produktionskvalitet", ja det är mycket nära till den faktiska receptet används av calibre för *BBC*, som visas nedan:

source: This :term:`recipe` explores only the tip of the iceberg when it comes to the power of calibre. To explore more of the abilities of calibre we'll examine a more complex real life example in the next section.
sv: Detta :term:`recipe` utforskar bara toppen av isberget när det kommer till makten av calibre. För att utforska mer av förmågan hos calibre så undersöker vi en mer komplex verkliga livet exempel i nästa avsnitt.

source: Real life example
sv: Exempel i verkligheten

source: A reasonably complex real life example that exposes more of the :term:`API` of ``BasicNewsRecipe`` is the :term:`recipe` for *The New York Times*
sv: Ett tämligen komplicerat exempel från verkligheten som exponerar mer av :term:`API` för ``BasicNewsRecipe`` är :term:`recipe` för New York Times

source: We see several new features in this :term:`recipe`. First, we have::
sv: Vi ser flera nya funktioner i detta :term:`recipe`. recept. Först har vi::

source: This sets the displayed time on the front page of the created ebook to be in the format, ``Day, Day_Number Month, Year``. See :attr:`timefmt <calibre.web.feeds.news.BasicNewsRecipe.timefmt>`.
sv: Detta ställer den visade tiden på förstasidan av den skapade e-boken att vara i formatet, ``Dag, Dag_Nummer Månad, År``. Se :attr:`timefmt <calibre.web.feeds.news.BasicNewsRecipe.timefmt>`.

source: Then we see a group of directives to cleanup the downloaded :term:`HTML`::
sv: Sedan ser vi en grupp av direktiv till sanering den nedladdade :term:`HTML`::

source: These remove everything before the first ``<h1>`` tag and everything after the first tag whose id is ``footer``. See :attr:`remove_tags <calibre.web.feeds.news.BasicNewsRecipe.remove_tags>`, :attr:`remove_tags_before <calibre.web.feeds.news.BasicNewsRecipe.remove_tags_before>`, :attr:`remove_tags_after <calibre.web.feeds.news.BasicNewsRecipe.remove_tags_after>`.
sv: Dessa tar bort allt innan den första ``<h1>`` etiketten och allt efter den första etiketten vars id är ``footer``. Se :attr:`remove_tags <calibre.web.feeds.news.BasicNewsRecipe.remove_tags>`, :attr:`remove_tags_before <calibre.web.feeds.news.BasicNewsRecipe.remove_tags_before>`, :attr:`remove_tags_after <calibre.web.feeds.news.BasicNewsRecipe.remove_tags_after>`.

source: The next interesting feature is::
sv: Nästa intressant funktion är:

source: ``needs_subscription = True`` tells calibre that this recipe needs a username and password in order to access the content. This causes, calibre to ask for a username and password whenever you try to use this recipe. The code in :meth:`calibre.web.feeds.news.BasicNewsRecipe.get_browser` actually does the login into the NYT website. Once logged in, calibre will use the same, logged in, browser instance to fetch all content. See `mechanize <http://wwwsearch.sourceforge.net/mechanize/>`_ to understand the code in ``get_browser``.
sv: ``needs_subscription = True`` berättar för calibre att detta recept behöver användarnamn och lösenord för att kunna åt innehållet. Detta medför att, calibre frågar efter användarnamn och lösenord när du försöker använda det här receptet. Koden i :meth:`calibre.web.feeds.news.BasicNewsRecipe.get_browser` loggar faktiskt in på NYT webbsida. När du loggat in, kommer calibre använda samma webbinstans för att hämta allt innehåll. Se `mechanize <http://wwwsearch.sourceforge.net/mechanize/>`_ to understand the code in ``get_browser``.

source: The next new feature is the :meth:`calibre.web.feeds.news.BasicNewsRecipe.parse_index` method. Its job is to go to http://www.nytimes.com/pages/todayspaper/index.html and fetch the list of articles that appear in *todays* paper. While more complex than simply using :term:`RSS`, the recipe creates an ebook that corresponds very closely to the days paper. ``parse_index`` makes heavy use of `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/documentation.html>`_ to parse the daily paper webpage. You can also use other, more modern parsers if you dislike BeatifulSoup. calibre comes with `lxml <http://lxml.de/>`_ and `html5lib <https://github.com/html5lib/html5lib-python>`_, which are the recommended parsers. To use them, replace the call to ``index_to_soup()`` with the following::
sv: Nästa nyhet är :meth:`calibre.web.feeds.news.BasicNewsRecipe.parse_index` metoden. Dess uppgift är att gå till http://www.nytimes.com/pages/todayspaper/index.html och hämta listan över artiklar som visas i *dagens* tidning. Medan mer komplex än att bara använda :term:`RSS`, skapar receptet en e-bok som motsvarar mycket nära dagens tidning. ``parse_index`` använder mycket `BeautifulSoup <http://www.crummy.com/software/BeautifulSoup/documentation.html>`_ för att tolka dagens tidningswebbsida. Du kan också använda andra, mer moderna parsers om du ogillar BeatifulSoup. calibre comes with `lxml <http://lxml.de/>`_ och `html5lib <https://github.com/html5lib/html5lib-python>`_, vilka är de rekommenderade parsers. För att använda dem, byt ut anropet till index_to_soup () med följande::

source: The final new feature is the :meth:`calibre.web.feeds.news.BasicNewsRecipe.preprocess_html` method. It can be used to perform arbitrary transformations on every downloaded HTML page. Here it is used to bypass the ads that the nytimes shows you before each article.
sv: Den sista nyheten är :meth:`calibre.web.feeds.news.BasicNewsRecipe.preprocess_html` metoden. Den kan användas för att utföra godtyckliga transformationer på varje nedladdad HTML-sida. Här används det för att kringgå de annonser som de NYTimes visar dig innan varje artikel.

source: Tips for developing new recipes
sv: Tips för att utveckla nya recept

source: The best way to develop new recipes is to use the command line interface. Create the recipe using your favorite python editor and save it to a file say :file:`myrecipe.recipe`. The `.recipe` extension is required. You can download content using this recipe with the command::
sv: Det bästa sättet att utveckla nya recept är att använda kommandoraden. Skapa receptet med din favorit python editor och spara den till en fil låt säga :file:`myrecipe.recipe`. Den `.recipe` -tillägget krävs. Du kan hämta innehåll med detta recept med kommandot::

source: The command :command:`ebook-convert` will download all the webpages and save them to the EPUB file :file:`myrecipe.epub`. The :option:`-vv` makes ebook-convert spit out a lot of information about what it is doing. The :option:`--test` makes it download only a couple of articles from at most two feeds. In addition, ebook-convert will put the downloaded HTML into the ``debug/input`` directory, where ``debug`` is the directory you specified in the :option:`--debug-pipeline` option.
sv: Kommandot :command:`ebook-convert` kommer att ladda ner alla webbsidor och spara dem till EPUB-filen :file:`myrecipe.epub`. Alternativet :option:`-vv` får ebook-convert mata ut en hel del information om vad den gör. Alternativet :option:`--test` begränsar nerladdning till bara ett par artiklar från högst två flöden. Dessutom kommer ebook-convert placera HTML i ``debug/input``-katalogen, där ``debug`` är katalogen du angav i :option:`--debug-pipeline`-alternativet.

source: Once the download is complete, you can look at the downloaded :term:`HTML` by opening the file :file:`debug/input/index.html` in a browser. Once you're satisfied that the download and preprocessing is happening correctly, you can generate ebooks in different formats as shown below::
sv: När nedladdningen är klar kan du titta på den nedladdade :term:`HTML` genom att öppna filen :file:`debug/input/index.html` i en webbläsare. När du är nöjd med nedladdningen och förbehandling sker på rätt sätt, kan du skapa e-böcker i olika format enligt nedan::
