Repository: Easonqsp/calibre-translations
Catalog: manual/*/plugins.po
Languages: sv

source: Function that is called with a % progress (number between 0 and 100) for various tasks If it is called with -1 that means that the task does not have any progress information
sv: Funktion som anropas med en procent (%) progress (tal mellan 0 och 100) för olika uppgifter om det kallas med -1 som innebär att uppgiften inte har några progressinformation

source: Device information from the device scanner
sv: Enhetsinformation från enhetens skanner

source: Optional method to perform further checks on a device to see if this driver is capable of handling it. If it is not it should return False. This method is only called after the vendor, product ids and the bcd have matched, so it can do some relatively time intensive checks. The default implementation returns True. This method is called only on windows. See also :meth:`can_handle`.
sv: Valfri metod för att utföra ytterligare kontroller på en enhet för att se om den här drivrutinen kan hantera det. Om det inte är det ska returnera Falsk. Denna metod anropas endast efter leverantör, produkt-ID och bcd har passats, så det kan göra några relativt tidskrävande kontroller. Genomförandet standard returnerar Sann. Denna metod kallas bara i Windows. Se även :meth:`can_handle`.

source: On windows a device ID string. On Unix a tuple of ``(vendor_id, product_id, bcd)``.
sv: På windows en enhets ID-sträng. På Unix en tupel av ``(vendor_id, product_id, bcd)``.

source: Unix version of :meth:`can_handle_windows`
sv: Unix-version av :meth:`can_handle_windows`

source: Is a tuple of (vid, pid, bcd, manufacturer, product, serial number)
sv: Är en tupel av (VID, pid, BCD, tillverkare, produkt, serienummer)

source: Perform any device specific initialization. Called after the device is detected but before any other functions that communicate with the device. For example: For devices that present themselves as USB Mass storage devices, this method would be responsible for mounting the device or if the device has been automounted, for finding out where it has been mounted. The method :meth:`calibre.devices.usbms.device.Device.open` has an implementation of this function that should serve as a good example for USB Mass storage devices.
sv: Utför specifik initiering på alla enheter. Anropas efter att enheten identifieras men innan några andra funktioner kommunicerar med enheten. Till exempel: För enheter som presenterar sig som USB-masslagringsenheter, skulle denna metod vara ansvarig för montering av enheten eller om enheten har en automatisk montering, för att ta reda på var det har monterats. Metoden :meth:`calibre.devices.usbms.device.Device.open` har en implementering av denna funktion som bör tjäna som ett gott exempel för USB-masslagringsenheter.

source: This method can raise an OpenFeedback exception to display a message to the user.
sv: Denna metod kan indikera ett OpenFeedback-undantag för att visa ett meddelande till användaren.

source: The device that we are trying to open. It is a tuple of (vendor id, product id, bcd, manufacturer name, product name, device serial number). However, some devices have no serial number and on windows only the first three fields are present, the rest are None.
sv: Den enhet som vi försöker öppna. Det är en tupel av (leverantörs id, produkt-id, BCD, tillverkarens namn, produktnamn, enhetens serienummer). Vissa enheter har inget serienummer och i Windows är endast de tre första fälten närvarande, resten är None.

source: The UUID of the current calibre library. Can be None if there is no library (for example when used from the command line).
sv: UUID för det aktuella calibre-biblioteket. Kan vara None om det inte finns något bibliotek (till exempel när det används från kommandoraden).

source: Un-mount / eject the device from the OS. This does not check if there are pending GUI jobs that need to communicate with the device.
sv: Avmontera/mata ut enheten från OS. Detta innebär inte kontroll om det finns väntande jobb som behöver kommuniceras med enheten.

source: NOTE: That this method may not be called on the same thread as the rest of the device methods.
sv: OBS: Att denna metod kan inte kallas på samma tråd som resten av enhetsmetoderna.

source: Called if the user yanks the device without ejecting it first.
sv: Anropas om användaren rycker enheten utan att mata ut det först.

source: Set a function to report progress information.
sv: Sätter en funktion för att rapportera progressinformationen.

source: Ask device for device information. See L{DeviceInfoQuery}.
sv: Fråga enheten efter enhetsinformation . Se L{DeviceInfoQuery}.

source: (device name, device version, software version on device, mime type) The tuple can optionally have a fifth element, which is a drive information dictionary. See usbms.driver for an example.
sv: (enhetsnamn, enhetsversion, programvaruversion på enheten, MIME-typ) Tupeln kan eventuellt ha ett femte element, som är en enhetsinformationsordlista. Se usbms.driver för ett exempel.

source: Return the driveinfo dictionary. Usually called from get_device_information(), but if loading the driveinfo is slow for this driver, then it should set SLOW_DRIVEINFO. In this case, this method will be called by calibre after the book lists have been loaded. Note that it is not called on the device thread, so the driver should cache the drive info in the books() method and this function should return the cached data.
sv: Returnera driveinfo-ordlistan. Vanligtvis anropas från get_device_information(), men om laddning av driveinfo är långsam för denna drivrutin, så borde den sätta SLOW_DRIVEINFO. I detta fall kommer den här metoden anropas av calibre efter bokenlistor har laddats. Observera att den inte anropas på enhetens processtråd, så att drivrutinen ska buffra driveinfo i books() och funktionen ska returnera det buffrade datat.

source: Return a 2 element list of the prefix to paths on the cards. If no card is present None is set for the card's prefix. E.G. ('/place', '/place2') (None, 'place2') ('place', None) (None, None)
sv: Returnera en 2-elementlista med prefixet till sökvägar på korten. Om inget kort finns sätts Noneför kortets prefix. Till exempel ('/place', '/place2') (None, 'place2') ('place', None) (None, None)

source: Get total space available on the mountpoints:
sv: Få total utrymme på monteringspunkter:

source: Main memory
sv: Inbyggt minne

source: Memory Card A
sv: Minneskort A

source: Memory Card B
sv: Minneskort B

source: A 3 element list with total space in bytes of (1, 2, 3). If a particular device doesn't have any of these locations it should return 0.
sv: En 3-elementlista med totalt utrymme i oktetter av (1, 2, 3). Om en viss enhet inte har någon av dessa platser den ska visa 0.

source: Get free space available on the mountpoints:
sv: Få ledigt utrymme på monteringspunkter:

source: Card A
sv: Kort A

source: Card B
sv: Kort B

source: A 3 element list with free space in bytes of (1, 2, 3). If a particular device doesn't have any of these locations it should return -1.
sv: En 3-elementlista med fritt utrymme i oktetter av (1, 2, 3). Om en viss enhet inte har någon av dessa platser den ska returnera -1.

source: Return a list of ebooks on the device.
sv: Returnera en lista av e-böcker på enheten.

source: If 'carda' or 'cardb' return a list of ebooks on the specific storage card, otherwise return list of ebooks in main memory of device. If a card is specified and no books are on the card return empty list.
sv: Om "carda" eller "cardb" returnera en lista med e-böcker på den specifika minneskortet, annars returnera lista med e-böcker i huvudminnet av enhet. Om ett kort är specificerad och inga böcker finns på kortet returnera den tomma listan.

source: A BookList.
sv: En BookList.

source: Upload a list of books to the device. If a file already exists on the device, it should be replaced. This method should raise a :class:`FreeSpaceError` if there is not enough free space on the device. The text of the FreeSpaceError must contain the word "card" if ``on_card`` is not None otherwise it must contain the word "memory".
sv: Ladda upp en lista med böcker till enheten. Om en fil redan finns på enheten, ska den bytas ut. Denna metod bör signalera ett :class:`FreeSpaceError` om det inte finns tillräckligt med ledigt utrymme på enheten. Texten till FreeSpaceError måste innehålla ordet "kort" om ``on_card`` inte None annars måste innehålla ordet "minne".

source: A list of paths
sv: En lista av sökvägar

source: A list of file names that the books should have once uploaded to the device. len(names) == len(files)
sv: En lista med filnamn som böckerna skulle ha när väl uppladdade till enheten. len(names) == len(files)

source: If not None, it is a list of :class:`Metadata` objects. The idea is to use the metadata to determine where on the device to put the book. len(metadata) == len(files). Apart from the regular cover (path to cover), there may also be a thumbnail attribute, which should be used in preference. The thumbnail attribute is of the form (width, height, cover_data as jpeg).
sv: Om inte None, det är en lista av :class:`Metadata` objekt. Tanken är att använda metadata för att avgöra var på enheten att lägga boken. len(metadata) == len(files). Bortsett från det vanliga omslaget (sökväg för omslaget), kan det också finnas ett omslagsikonattribut, som ska användas i stället. Omslagsikonattributet är på formen (bredd, höjd, cover_data som jpeg).

source: A list of 3-element tuples. The list is meant to be passed to :meth:`add_books_to_metadata`.
sv: En lista med 3-elements tupler. Listan är tänkt att skickas till :meth:`add_books_to_metadata`.

source: Add locations to the booklists. This function must not communicate with the device.
sv: Lägg till platser till boklistor. Denna funktion får inte kommunicera med enheten.

source: Result of a call to L{upload_books}
sv: Resultat av ett anrop till L{upload_books}

source: List of :class:`Metadata` objects, same as for :meth:`upload_books`.
sv: Lista av :class:`Metadata` objects, samma som för :meth:`upload_books`.

source: A tuple containing the result of calls to (:meth:`books(oncard=None)`, :meth:`books(oncard='carda')`, :meth`books(oncard='cardb')`).
sv: En tupel innehåller resultatet av anrop till (:meth:`books(oncard=None)`, :meth:`books(oncard='carda')`, :meth`books(oncard='cardb')`).

source: Delete books at paths on device.
sv: Ta bort böcker i sökvägar på enhet.

source: Remove books from the metadata list. This function must not communicate with the device.
sv: Ta böcker från metadatalistan. Denna funktion får inte kommunicera med enheten.

source: paths to books on the device.
sv: sökvägar till böcker på enheten.

source: Update metadata on device.
sv: Uppdatera metadata på enhet.

source: Read the file at ``path`` on the device and write it to outfile.
sv: Läs filen på ``sökväg`` på enheten och skriva den till utfil.

source: file object like ``sys.stdout`` or the result of an :func:`open` call.
sv: filobjekt som ``sys.stdout`` eller resultatet av ett :func:`open` anrop.

source: Should return a QWidget. The QWidget contains the settings for the device interface
sv: Bör returnera en QWidget-gränssnittskomponent. QWidget-gränssnittskomponent innehåller inställningarna för enhetens gränssnitt

source: Should save settings to disk. Takes the widget created in :meth:`config_widget` and saves all settings to disk.
sv: Ska spara inställningar till disk. Tar gränssnittskomponenten som skapas i :meth:`config_widget` och sparar alla inställningar till disk.

source: Should return an opts object. The opts object should have at least one attribute `format_map` which is an ordered list of formats for the device.
sv: Ska returnera ett opts-objekt. Den opts-objektet bör ha minst ett attribut `format_map` vilket är en ordnad lista av format för enheten.

source: provide the driver the current set of plugboards and a function to select a specific plugboard. This method is called immediately before add_books and sync_booklists.
sv: ge drivrutin den aktuella uppsättningen kontrollpaneler och en funktion för att välja kontrollpanel. Denna metod kallas omedelbart före add_books och sync_booklists.

source: pb_func is a callable with the following signature::
sv: pb_func är anropbar med följande signatur::

source: You give it the current device name (either the class name or DEVICE_PLUGBOARD_NAME), the format you are interested in (a 'real' format or 'device_db'), and the plugboards (you were given those by set_plugboards, the same place you got this method).
sv: Du ger den nuvarande enheten namn (antingen klassnamnet eller DEVICE_PLUGBOARD_NAME), det format du är intresserad av (en "riktig" format eller "device_db"), och de kontrollpaneler (du fick dem från set_plugboards, på samma ställe som du fick denna metod).

source: None or a single plugboard instance.
sv: Ingen eller en kontrollpanelinstans.

source: Set the device name in the driveinfo file to 'name'. This setting will persist until the file is re-created or the name is changed again.
sv: Ange enhetens namn i driveinfo-filen till "namn". Inställningen kvarstår tills filen återskapas eller namnet ändras igen.

source: Non-disk devices should implement this method based on the location codes returned by the get_device_information() method.
sv: Icke-diskenheter bör genomföra denna metod baserad på platskoder som returneras av get_device_information() metoden.

source: Given a list of paths, returns another list of paths. These paths point to addable versions of the books.
sv: Givet en lista över sökvägar, returnerar en annan lista med sökvägar. Dessa sökvägar pekar på adderbara versioner av böckerna.

source: If there is an error preparing a book, then instead of a path, the position in the returned list for that book should be a three tuple: (original_path, the exception instance, traceback)
sv: Om det finns ett fel vid förberedning av en bok, så i stället för en sökväg, den position i den returnerade listan för att boken ska vara en tre tupel: (original_path, undantaget instans, återsöknings)

source: Called when calibre is is starting the device. Do any initialization required. Note that multiple instances of the class can be instantiated, and thus __init__ can be called multiple times, but only one instance will have this method called. This method is called on the device thread, not the GUI thread.
sv: Anropas när calibre starar enheten. Gör godtycklig initiering som krävs. Notera att flera instanser av klassen kan instansieras, och sålunda __init__ kan anropas flera gånger, men bara en instans kommer att ha den här metoden anropad. Denna metod kallas på enhetens processtråd, inte GUI-tråden.

source: Called when calibre is shutting down, either for good or in preparation to restart. Do any cleanup required. This method is called on the device thread, not the GUI thread.
sv: Anropas när calibre stängs, antingen för gott eller är under förberedelser för att starta om. Gör den sanering som krävs. Denna metod kallas på enhetens processtråd, inte GUI-tråden.

source: Must return a unique id for the currently connected device (this is called immediately after a successful call to open()). You must implement this method if you set ASK_TO_ALLOW_CONNECT = True
sv: Måste returnera ett unikt ID för ansluten enhet (detta kallas direkt efter ett lyckat anrop till open()). Du måste implementera den här metoden om du sätter ASK_TO_ALLOW_CONNECT = Sann

source: Should ignore the device identified by uid (the result of a call to get_device_uid()) in the future. You must implement this method if you set ASK_TO_ALLOW_CONNECT = True. Note that this function is called immediately after open(), so if open() caches some state, the driver should reset that state.
sv: Borde ignorera enheten som identifieras av uid (resultatet av ett anrop till get_device_uid()) i framtiden. Du måste implementera den här metoden om du sätter ASK_TO_ALLOW_CONNECT = Sann. Observera att denna funktion kallas direkt efter open(), så om open() buffrar vissa tillstånd, bör drivrutinen återställa det tillståndet.

source: Return map of device uid to friendly name for all devices that the user has asked to be ignored.
sv: Returnera lista över enheten uid till eget namn på alla enheter som användaren begärt att ignorera.

source: Set the list of device uids that should be ignored by this driver.
sv: Ställ en lista över enhets uid:er som ska ignoreras av denna drivrutin.

source: Implement this method if your device wants to override a particular preference. You must ensure that all call sites that want a preference that can be overridden use device_prefs['something'] instead of prefs['something']. Your method should call device_prefs.set_overrides(pref=val, pref=val, ...). Currently used for: metadata management (prefs['manage_device_metadata'])
sv: Implementera denna metod om din enhet vill överrida en viss preferens. Du måste se till att alla anrops platser som vill ha en inställning som kan överridas använder device_prefs ['något'] istället för prefs['något']. Din metod ska anropa device_prefs.set_overrides(pref = val, pref = val, ...). För närvarande används för: metadata management (prefs['manage_device_metadata'])

source: Implement this method if you want information about the current calibre library. This method is called at startup and when the calibre library changes while connected.
sv: Implementera den här metoden om du vill ha information om den aktuella calibre-biblioteket. Denna metod kallas vid uppstart och när calibres biblioteket ändras när den är ansluten.

source: Called by the device manager when starting plugins. If this method returns a string, then a) it supports the device manager's dynamic control interface, and b) that name is to be used when talking to the plugin.
sv: Anropas av enhetshanteraren vid start av tillägg. Om den här metoden returnerar en sträng, då a) den stödjer enhetshanteraren dynamiska kontroll gränssnitt, och b) det namnet ska användas när man talar med tillägget.

source: This method can be called on the GUI thread. A driver that implements this method must be thread safe.
sv: Den här metoden kan anropas i GUI-processtråden. En drivrutin som implementerar den här metoden måste vara trådsäkert.

source: This method is called to start the plugin. The plugin should begin to accept device connections however it does that. If the plugin is already accepting connections, then do nothing.
sv: Denna metod anropas för att starta tillägget. Tillägget ska börja acceptera enhetsanslutningar men det gör det. Om tillägget redan acceptera anslutningar, så gör ingenting.

source: This method is called to stop the plugin. The plugin should no longer accept connections, and should cleanup behind itself. It is likely that this method should call shutdown. If the plugin is already not accepting connections, then do nothing.
sv: Denna metod kallas för att stoppa tillägget. Tillägget bör inte längre acceptera anslutningar, och bör städa upp efter sig. Det är troligt att denna metod ska anropa avstängning. Om tillägget redan slutat emot anslutningar, så gör ingenting.

source: Return the value of the option indicated by opt_string. This method can be called when the plugin is not started. Return None if the option does not exist.
sv: Returnera värdet av optionen indikerad av opt_string. Den här metoden kan anropas när tillägget inte startats. Returnera None om alternativet inte finns.

source: Set the value of the option indicated by opt_string. This method can be called when the plugin is not started.
sv: Ange värdet av alternativ som indikeras av opt_string. Den här metoden kan anropas när tillägget inte startats.

source: Return True if the plugin is started, otherwise false
sv: Returnera Sann om tillägg startas, annars falsk

source: Called during book matching when a book on the device is matched with a book in calibre's db. The method is responsible for syncronizing data from the device to calibre's db (if needed).
sv: Anropas under bokenpassning när en bok på enheten jämförs med en bok i calibres db. Metoden är ansvarig för synkronisering av data från enheten till calibres db (om det behövs).

source: The method must return a two-value tuple. The first value is a set of calibre book ids changed if calibre's database was changed or None if the database was not changed. If the first value is an empty set then the metadata for the book on the device is updated with calibre's metadata and given back to the device, but no GUI refresh of that book is done. This is useful when the calibre data is correct but must be sent to the device.
sv: Metoden ska returnera en två-värd tupel. Det första värdet är en uppsättning av calbres bok-ids som ändras om calbres databas ändrades eller None om databasen inte ändrades. Om det första värdet är en tom mängd så uppdateras metadata för boken på med calbres metadata och ges tillbaka till enheten, men ingen GUI-uppdatering av den boken sker. Detta är användbart när calbres data är korrekt, men måste skickas till enheten.

source: The second value is itself a 2-value tuple. The first value in the tuple specifies whether a book format should be sent to the device. The intent is to permit verifying that the book on the device is the same as the book in calibre. This value must be None if no book is to be sent, otherwise return the base file name on the device (a string like foobar.epub). Be sure to include the extension in the name. The device subsystem will construct a send_books job for all books with not- None returned values. Note: other than to later retrieve the extension, the name is ignored in cases where the device uses a template to generate the file name, which most do. The second value in the returned tuple indicated whether the format is future-dated. Return True if it is, otherwise return False. Calibre will display a dialog to the user listing all future dated books.
sv: Det andra värdet är i sig en 2-värdes tupel. Det första värdet i tupeln anger om ett bokformat ska skickas till enheten. Avsikten är att möjliggöra kontroll av att boken på enheten är densamma som boken i calibre. Värdet måste vara None om ingen bok ska skickas, annars returnera basfilnamnet på enheten (en sträng som foobar.epub). Var noga med att inkludera en förlängning i namnet. Enhets delsystem kommer att bygga ett send_books jobb för alla böcker med inte- None returnerade värden. Obs: annat än att senare hämta filtyp, är namnet ignoreras i de fall där enheten använder en mall för att skapa filnamnet, vilket de flesta gör. Det andra värdet i den returnerade tupeln anges om formatet är framtidsdaterad. Returnera Sann om det är, annars returnera Falsk. Calibre visar en dialogruta där användaren listar alla framtida daterade böcker.

source: Extremely important: this method is called on the GUI thread. It must be threadsafe with respect to the device manager's thread.
sv: Extremt viktigt: den här metoden anropas på GUI-processtråden. Den måste vara trådsäker i förhållande till enhetens huvudtråd.

source: book_id: the calibre id for the book in the database. book_metadata: the Metadata object for the book coming from the device. first_call: True if this is the first call during a sync, False otherwise
sv: book_id: calibres id för boken i databasen. book_metadata: Metadataobjektet för boken som kommer från enheten. first_call: Sann om det är första anropet under en synkronisering, Falsk annars

source: Bases: :class:`list`
sv: Bas: :class:`list`

source: A list of books. Each Book object must have the fields
sv: En lista med böcker. Varje bokobjektet måste ha fälten

source: title
sv: titel

source: authors
sv: författare

source: size (file size of the book)
sv: storlek (filstorlek av boken)

source: datetime (a UTC time tuple)
sv: datumtid (en UTC-tids tupel)

source: path (path on the device to the book)
sv: sökväg (sökväg på enheten till boken)
