Repository: Easonqsp/calibre-translations
Catalog: manual/*/plugins.po
Languages: sv

source: Every Metadata object put into result_queue by this method must have a `source_relevance` attribute that is an integer indicating the order in which the results were returned by the metadata source for this query. This integer will be used by :meth:`compare_identify_results`. If the order is unimportant, set it to zero for every result.
sv: Varje metadataobjekt infört i result_queue med denna metod måste ha en `source_relevance` attribut som är ett heltal som anger i vilken ordning resultaten returnerades av metadatakällan för den här frågan. Detta heltal kommer att användas av :meth:`compare_identify_results`. Om ordningen är oviktigt, sätt den till noll för varje resultat.

source: Make sure that any cover/isbn mapping information is cached before the Metadata object is put into result_queue.
sv: Se till att alla omslag/isbn korsreferensinformation mellanlagras innan Metadataobjektet läggs i result_queue.

source: A log object, use it to output debugging information/errors
sv: Ett logg-objekt, använd det för att överföra felsökningsinformation/fel

source: A result Queue, results should be put into it. Each result is a Metadata object
sv: Ett resultat Kö, resultaten läggas in i den. Varje resultat är ett metadataobjekt

source: If abort.is_set() returns True, abort further processing and return as soon as possible
sv: Om abort.is_set() returnerar Sann, avbryt vidare bearbetning och återvända så snart som möjligt

source: The title of the book, can be None
sv: Titel av boken, kan vara None

source: A list of authors of the book, can be None
sv: En lista av författare av en bok, kan vara None

source: A dictionary of other identifiers, most commonly {'isbn':'1234...'}
sv: En ordlista av andra identifieringsuppgifter oftast {'isbn':'1234...'}

source: Timeout in seconds, no network request should hang for longer than timeout.
sv: Tidsbegränsning i sekunder bör ingen nätverksbegäran dröja längre än timeout

source: None if no errors occurred, otherwise a unicode representation of the error suitable for showing to the user
sv: None om inga fel har inträffat, annars en Unicode-representation av felet som är lämplig för att visa för användaren

source: Download a cover and put it into result_queue. The parameters all have the same meaning as for :meth:`identify`. Put (self, cover_data) into result_queue.
sv: Ladda ner ett omslag och sätta det i result_queue. Parametrarna alla har samma betydelse som för :meth:`identify`. Put (jaget, cover_data) i result_queue.

source: This method should use cached cover URLs for efficiency whenever possible. When cached data is not present, most plugins simply call identify and use its results.
sv: Denna metod bör använda buffrade omslags-URLer för effektivitet när det är möjligt. När buffrat data inte är närvarande, de flesta tillägg anropar helt enkelt identifiera och använder dess resultat.

source: If the parameter get_best_cover is True and this plugin can get multiple covers, it should only get the "best" one.
sv: Om parametern get_best_cover är Sann, och kan detta tillägg få flera omslag, det bör bara få det "bästa".

source: Generate a sort key for comparison of the relevance of Metadata objects, given a search query. This is used only to compare results from the same metadata source, not across different sources.
sv: Generera en slags nyckel för jämförelse av relevansen av metadataobjekt, ges en sökfråga. Detta används endast för att jämföra resultat från samma metadatakälla, inte mellan olika informationskällor.

source: The sort key ensures that an ascending order sort is a sort by order of decreasing relevance.
sv: Sorteringsnyckeln säkerställer att en stigande ordning sortera är en sortera fallande relevans.

source: The algorithm is:
sv: Algoritmen är:

source: Prefer results that have at least one identifier the same as for the query
sv: Föredrar resultat som har åtminstone en identifierare samma som för frågan

source: Prefer results with a cached cover URL
sv: Föredrar resultat med en buffrad omslags-URL

source: Prefer results with all available fields filled in
sv: Föredrar resultat med alla tillgängliga fält ifyllda

source: Prefer results with the same language as the current user interface language
sv: Föredrar resultat med samma språk som aktuella användarens gränssnittsspråk

source: Prefer results that are an exact title match to the query
sv: Föredrar resultat som är en exakt titelpassning på frågan

source: Prefer results with longer comments (greater than 10% longer)
sv: Föredrar resultat med längre kommentarer (mer än 10% längre)

source: Use the relevance of the result as reported by the metadata source's search
sv: Använd relevansen av resultatet som rapporterats av metadatakällans sökning

source: Conversion plugins
sv: Konverteringstillägg

source: InputFormatPlugins are responsible for converting a document into HTML+OPF+CSS+etc. The results of the conversion *must* be encoded in UTF-8. The main action happens in :meth:`convert`.
sv: InputFormatPlugins ansvarar för att omvandla ett dokument till HTML+OPF+CSS+ osv. Resultatet av konverteringen *måste* kodas i UTF-8. Den viktigaste åtgärden händer i :meth:`convert`.

source: Set of file types for which this plugin should be run For example: ``set(['azw', 'mobi', 'prc'])``
sv: Uppsättning med filtyper som detta tillägg ska köra Till exempel: ``set(['azw', 'mobi', 'prc'])``

source: If True, this input plugin generates a collection of images, one per HTML file. This can be set dynamically, in the convert method if the input files can be both image collections and non-image collections. If you set this to True, you must implement the get_images() method that returns a list of images.
sv: Om Sann, genererar detta indatatillägg en samling bilder, en per HTML-fil. Detta kan ställas in dynamiskt, i konverteringsmetoden om indatafilerna kan vara både bildsamlingar och icke-bildsamlingar. Om du ställer in detta till Sann måste du implementera get_images () som returnerar en lista med bilder.

source: Number of CPU cores used by this plugin A value of -1 means that it uses all available cores
sv: Antal CPU-kärnor används av detta tillägg Ett värde av -1 betyder att den använder alla tillgängliga kärnor

source: If set to True, the input plugin will perform special processing to make its output suitable for viewing
sv: Om värdet är Sann, kommer indatatillägget specialbearbeta att göra sitt utdata lämpligt för visning

source: The encoding that this input plugin creates files in. A value of None means that the encoding is undefined and must be detected individually
sv: Kodningen som detta indatatillägg skapar filer i. Ett värde på None betyder att kodningen är odefinierad och måste upptäckas var för sig

source: Options shared by all Input format plugins. Do not override in sub-classes. Use :attr:`options` instead. Every option must be an instance of :class:`OptionRecommendation`.
sv: Alternativ som delas av alla indatatillägg. Överrids inte i underklasser. Användning :attr:`options` istället. Varje alternativ skall vara en instans av :class:`OptionRecommendation`.

source: Options to customize the behavior of this plugin. Every option must be an instance of :class:`OptionRecommendation`.
sv: Alternativ för att anpassa beteendet hos detta tillägg. Varje alternativ skall vara en instans av :class:`OptionRecommendation`.

source: A set of 3-tuples of the form (option_name, recommended_value, recommendation_level)
sv: En uppsättning av 3-tupler av formen (option_name, recommended_value, recommendation_level)

source: Return a list of absolute paths to the images, if this input plugin represents an image collection. The list of images is in the same order as the spine and the TOC.
sv: Returnerar en lista med absoluta sökvägar till bilderna, om detta indatatillägg representerar en bildsamling. Listan med bilder är i samma ordning som bokryggen och innehållsförteckningen.

source: This method must be implemented in sub-classes. It must return the path to the created OPF file or an :class:`OEBBook` instance. All output should be contained in the current directory. If this plugin creates files outside the current directory they must be deleted/marked for deletion before this method returns.
sv: Denna metod måste implementeras i underklasser. Den måste returnera sökvägen till den skapade OPF-filen eller en :class:`OEBBook` instans. All utdata skall ingå i den aktuella katalogen. Om detta tilläggskapar filer utanför den aktuella katalogen som de måste raderas / markeras för borttagning innan denna metod avslutas.

source: A file like object that contains the input file.
sv: En fil som objekt som innehåller indatafilen.

source: Options to customize the conversion process. Guaranteed to have attributes corresponding to all the options declared by this plugin. In addition, it will have a verbose attribute that takes integral values from zero upwards. Higher numbers mean be more verbose. Another useful attribute is ``input_profile`` that is an instance of :class:`calibre.customize.profiles.InputProfile`.
sv: Alternativ för att anpassa konverteringen. Garanterat att ha attribut som motsvarar alla de alternativ som deklarerats av detta tillägg. Dessutom kommer det att ha en utförlig attribut som tar intergralvärden från noll och uppåt. Högre siffror innebär att vara mer utförlig. En annan användbar egenskap är ``input_profile`` det är en instans av :class:`calibre.customize.profiles.InputProfile`.

source: The extension (without the .) of the input file. It is guaranteed to be one of the `file_types` supported by this plugin.
sv: Filtyp (utan . ) i indatafilen. Det är garanterat att vara en av de `file_types` stöds av detta tillägg.

source: A :class:`calibre.utils.logging.Log` object. All output should use this object.
sv: Ett :class:`calibre.utils.logging.Log` objekt. All utdata bör använda detta objekt.

source: A dictionary of various information that the input plugin can get easily that would speed up the subsequent stages of the conversion.
sv: En ordlista för olika uppgifter indatatillägg kan få lätt som skulle kunna påskynda de efterföljande stegen i omvandlingen.

source: Called to allow the input plugin to perform postprocessing after the book has been parsed.
sv: Anropas för att tillåta indatatillägg för att utföra efterbehandling efter att boken har tolkats.

source: Called to allow the input plugin to specialize the parsed book for a particular output format. Called after postprocess_book and before any transforms are performed on the parsed book.
sv: Anropas för att tillåta indatatillägg att specialisera den analyserade boken för en viss utdataformat. Anropas efter postprocess_book och innan några transformer utförs på den analyserade boken.

source: Called to create the widget used for configuring this plugin in the calibre GUI. The widget must be an instance of the PluginWidget class. See the builting input plugins for examples.
sv: Anroas för att skapa gränssnittskomponenten som används för att konfigurera detta tillägg i calibres GUI. Gränssnittskomponenten måste vara en instans av PluginWidget klass. Se bygga indatatillägg för exempel.

source: OutputFormatPlugins are responsible for converting an OEB document (OPF+HTML) into an output ebook.
sv: UtdataFormatTillägg är ansvariga för att omvandla ett OEB-dokument (OPF + HTML) till e-bokutdata.

source: The OEB document can be assumed to be encoded in UTF-8. The main action happens in :meth:`convert`.
sv: OEB-dokumentet kan antas vara kodade i UTF-8. Den viktigaste åtgärden händer i :meth:`convert`.

source: The file type (extension without leading period) that this plugin outputs
sv: Filtypen (typ utan ledande punkt) att detta tillägg matar ut

source: Render the contents of `oeb_book` (which is an instance of :class:`calibre.ebooks.oeb.OEBBook` to the file specified by output.
sv: Återge innehållet i `oeb_book` (som är en instans av :class:`calibre.ebooks.oeb.OEBBook` ) till filen som anges av utdata.

source: Either a file like object or a string. If it is a string it is the path to a directory that may or may not exist. The output plugin should write its output into that directory. If it is a file like object, the output plugin should write its output into the file.
sv: Antingen en fil som ett objekt eller en sträng. Om det är en sträng är sökvägen till en katalog som kan eller inte kan existera. Utdatatillägget ska skriva utdata till den katalogen. Om det är en fil som objekt, bör utdatatillägget skriva utdata i filen.

source: The input plugin that was used at the beginning of the conversion pipeline.
sv: Indatatillägget som användes i början av omvandlingsrörledningen.

source: Conversion options. Guaranteed to have attributes corresponding to the OptionRecommendations of this plugin.
sv: Konverteringsalternativ. Garanterat att ha attribut som motsvarar OptionRecommendations av detta tillägg.

source: The logger. Print debug/info messages etc. using this.
sv: Loggern. Skriv ut felsöknings/infomeddelanden etc. med hjälp av denna.

source: Can be used to make changes to the css during the CSS flattening process.
sv: Kan användas för att göra ändringar i css under CSS tillplattningsprocessen.

source: The item (HTML file) being processed
sv: Elementet (HTML-fil) som bearbetas

source: A Stylizer object containing the flattened styles for item. You can get the style for any element by stylizer.style(element).
sv: Ett stiliseringsobjekt som innehåller de tillplattade stilarna för objektet. Du kan få stilen för alla element av stylizer.style(element).

source: Called to create the widget used for configuring this plugin in the calibre GUI. The widget must be an instance of the PluginWidget class. See the builtin output plugins for examples.
sv: Anropas för att skapa gränssnittskomponent som används för att konfigurera detta tillägg i calibres GUI. Gränssnittskomponenten måste vara en instans av PluginWidget klass. Se inbyggda utdatatillägg för exempel.

source: Device Drivers
sv: Enhetsdrivrutiner

source: The base class for all device drivers is :class:`DevicePlugin`. However, if your device exposes itself as a USBMS drive to the operating system, you should use the USBMS class instead as it implements all the logic needed to support these kinds of devices.
sv: Basklass för alla drivrutiner är :class:`DevicePlugin`. Men om din enhet exponerar sig som en USBMS-enhet till operativsystemet, bör du använda USBMS-klassen i stället eftersom den genomför all logik som behövs för att stödja dessa typer av enheter.

source: Defines the interface that should be implemented by backends that communicate with an ebook reader.
sv: Definierar gränssnitt som ska implementeras av bakomliggande system som kommunicerar med en e-bokläsare.

source: Ordered list of supported formats
sv: Ordnad lista över format som stöds

source: VENDOR_ID can be either an integer, a list of integers or a dictionary If it is a dictionary, it must be a dictionary of dictionaries, of the form::
sv: VENDOR_ID kan vara antingen ett heltal, en lista av heltal eller ett ordlista om det är ett ordlista, måste det vara en ordlista av ordlistor, på formen::

source: An integer or a list of integers
sv: Ett heltal eller en lista med heltal

source: BCD can be either None to not distinguish between devices based on BCD, or it can be a list of the BCD numbers of all devices supported by this driver.
sv: BCD kan vara antingen None att inte skilja mellan enheter baserade på BCD, eller det kan vara en lista över BCD-numren för alla enheter som stöds av denna drivrutin.

source: Height for thumbnails on the device
sv: Höjd för omslagsikoner på enheten

source: Width for thumbnails on the device. Setting this will force thumbnails to this size, not preserving aspect ratio. If it is not set, then the aspect ratio will be preserved and the thumbnail will be no higher than THUMBNAIL_HEIGHT Compression quality for thumbnails. Set this closer to 100 to have better quality thumbnails with fewer compression artifacts. Of course, the thumbnails get larger as well.
sv: Bredd för omslagsikoner på enheten. Ställa detta kommer att tvinga bilderna till denna storlek, inte med bibehållet bildförhållande. Om den inte är inställd, då kommer bildförhållandet att bevaras och omslagsikoner inte skall vara högre än THUMBNAIL_HEIGHT kompressionskvalitet för omslagsikoner. Ställ in denna närmare 100 för att få bättre kvalitet och omslagsikoner med färre komprimeringsartefakter. Naturligtvis blir omslagsikoner större också.

source: Set this to True if the device supports updating cover thumbnails during sync_booklists. Setting it to true will ask device.py to refresh the cover thumbnails during book matching
sv: Ställ in den här till Sann om enheten stödjer uppdatering av omslagsikoner under sync_booklists. Ställ in den till Sann kommer att be device.py att uppdatera omslagsikoner under bokpassning

source: Whether the metadata on books can be set via the GUI.
sv: Huruvida metadata om böckerna kan ställas in via GUI.

source: Whether the device can handle device_db metadata plugboards
sv: Hurvida enheten kan hantera device_db metadatakontrollpaneler

source: Path separator for paths to books on device
sv: Sökvägsseparator för sökvägar till böcker på enheten

source: Icon for this device
sv: Ikon för denna enhet

source: GUI displays this as a message if not None. Useful if opening can take a long time
sv: Gränssnittet visar detta som ett meddelande om inte None. Användbart om öppning kan ta lång tid

source: Set of extensions that are "virtual books" on the device and therefore cannot be viewed/saved/added to library For example: ``frozenset(['kobo'])``
sv: Uppsättning av typer som är "virtuella böcker" på enheten och därför kan inte visas/sparas/läggas till biblioteket Till exempel: ``frozenset(['kobo'])``

source: Whether to nuke comments in the copy of the book sent to the device. If not None this should be short string that the comments will be replaced by.
sv: I fall det ska förstöra kommentarer i kopian av boken som skickas till enheten. Om inte None bör detta vara kort sträng som kommentarerna kommer att ersättas av.

source: If True indicates that this driver completely manages device detection, ejecting and so forth. If you set this to True, you *must* implement the detect_managed_devices and debug_managed_device_detection methods. A driver with this set to true is responsible for detection of devices, managing a blacklist of devices, a list of ejected devices and so forth. calibre will periodically call the detect_managed_devices() method and if it returns a detected device, calibre will call open(). open() will be called every time a device is returned even is previous calls to open() failed, therefore the driver must maintain its own blacklist of failed devices. Similarly, when ejecting, calibre will call eject() and then assuming the next call to detect_managed_devices() returns None, it will call post_yank_cleanup().
sv: Om Sann indikerar att denna drivrutin helt hanterar enhetsupptäckt, utmatning och så vidare. Om du ställer in detta till Sann, *måste* du implmentera detect_managed_devices och debug_managed_device_detection metoder. En drivrutin med denna uppsättning till Sann är ansvarig för upptäckt av enheter, hantering av en svartlista över enheter, en förteckning över de utmatade enheter och så vidare. calibre kommer regelbundet kalla detect_managed_devices() metoden och om det returnerar en detekterad enhet, kommer calibre anropa open(). open() kommer att anropas varje gång en enhet returneras även om tidigare anrop för att open() misslyckades, därför måste drivrutin bibehålla sin egen svartlista över misslyckade enheter. Likaså vid utmatning, kommer calibre anropa eject() och sedan antar nästa anrop till detect_managed_devices() returnerar None, kommer det att anropa post_yank_cleanup().

source: If set the True, calibre will call the :meth:`get_driveinfo()` method after the books lists have been loaded to get the driveinfo.
sv: Om satt Sannt, kommer calibre anropa :meth:`get_driveinfo()` metoden efter boklistor har lästs för att få "driveinfo".

source: If set to True, calibre will ask the user if they want to manage the device with calibre, the first time it is detected. If you set this to True you must implement :meth:`get_device_uid()` and :meth:`ignore_connected_device()` and :meth:`get_user_blacklisted_devices` and :meth:`set_user_blacklisted_devices`
sv: Om värdet är Sann, kommer calibre fråga användaren om de vill hantera enheten med calibre, första gången den upptäcktes. Om du ställer in detta till Sann måste du implementera :meth:`get_device_uid()` och :meth:`ignore_connected_device()` och :meth:`get_user_blacklisted_devices` och :meth:`set_user_blacklisted_devices`

source: Set this to a dictionary of the form {'title':title, 'msg':msg, 'det_msg':detailed_msg} to have calibre popup a message to the user after some callbacks are run (currently only upload_books). Be careful to not spam the user with too many messages. This variable is checked after *every* callback, so only set it when you really need to.
sv: Ställ in den till en ordlista av formen {'title':title, 'msg':msg, 'det_msg':detailed_msg} låta calibre ta fram ett meddelande till användaren efter några återanrop körs (för närvarande endast upload_books). Var noga med att inte spamma användaren med för många meddelanden. Denna variabel kontrolleras efter *varje* anrop, så att bara den sätts när du verkligen behöver.

source: Return True, device_info if a device handled by this plugin is currently connected.
sv: Returnera Sann, device_info om en enhet som hanteras av detta tillägg är ansluten.

source: List of devices currently connected
sv: Förteckning över anslutna enheter

source: Called only if MANAGES_DEVICE_PRESENCE is True.
sv: Anropas bara om MANAGES_DEVICE_PRESENCE är Sann.

source: Scan for devices that this driver can handle. Should return a device object if a device is found. This object will be passed to the open() method as the connected_device. If no device is found, return None. The returned object can be anything, calibre does not use it, it is only passed to open().
sv: Sök efter enheter som denna drivrutin kan hantera. Ska returnera en enhetsobjekt om en enhet hittas. Detta syfte kommer att vidarebefordras till open() metoden som connected_device. Om ingen enhet hittas, retruneras None. Den returnerade objektet kan vara vad som helst, calibre använder inte den, det skickas bara till open().

source: This method is called periodically by the GUI, so make sure it is not too resource intensive. Use a cache to avoid repeatedly scanning the system.
sv: Denna metod kallas periodiskt av användargränssnittet, så se till att den inte är för resurskrävande. Använd en buffert för att inte behöva skanna systemet.

source: Set of USB devices found on the system.
sv: Sätts om USB-enhet hittas i systemet

source: If True and the driver uses a cache to prevent repeated scanning, the cache must be flushed.
sv: Om Sann och drivrutinen använder en buffert för att förhindra upprepad skanning måste bufferten vara tömd.

source: Should write information about the devices detected on the system to output, which is a file like object.
sv: Bör skriva information om enheterna som upptäckts på systemet till utdata, vilket är en fil som objekt.

source: Should return True if a device was detected and successfully opened, otherwise False.
sv: Ska returnera Sann om en enhet upptäcktes och öppnades, annars Falsk.

source: The key to unlock the device
sv: Nyckel för att låsa upp enhet

source: If true the packet stream to/from the device is logged
sv: Om Sann loggas paketströmmen till/från enheten
