Repository: Easonqsp/calibre-translations
Catalog: manual/*/plugins.po
Languages: sv

source: Save any changed settings. Return True if the changes require a restart, False otherwise. Raise an :class:`AbortCommit` exception to indicate that an error occurred. You are responsible for giving the user feedback about what the error is and how to correct it.
sv: Spara alla ändrade inställningar. Returnerar Sann om förändringarna kräver en omstart, annars Falsk. Signalera ett :class:`AbortCommit` undantag för att indikera att ett fel har inträffat. Du är ansvarig för att ge användaren återkoppling på vad felet är och hur man rättar till det.

source: Called once after this widget is committed. Responsible for causing the gui to reread any changed settings. Note that by default the GUI re-initializes various elements anyway, so most widgets won't need to use this method.
sv: Anropas en gång efter denna gränssnittskomponent läggs in. Ansvarig för att orsakat gui att läsa om ändrade inställningar. Observera att som standard åter initierar grafiska gränssnittet olika element i alla fall, så de flesta gränssnittskomponenter inte behöver använda den här metoden.

source: Base class that contains code to easily add standard config widgets like checkboxes, combo boxes, text fields and so on. See the :meth:`register` method.
sv: Basklass som innehåller kod för att enkelt lägga till standard konfigureringsgränssnittskomponenter som kryssrutor, kombinationsrutor, textfält och så vidare. se :meth:`register` method.

source: This class automatically handles change notification, resetting to default, translation between gui objects and config objects, etc. for registered settings.
sv: Denna klass hanterar automatiskt förändringsnoteringar, återställning till standard, översättning mellan gui-objekt och konfigurationsobjekt etc. för registrerade inställningar.

source: If your config widget inherits from this class but includes setting that are not registered, you should override the :class:`ConfigWidgetInterface` methods and call the base class methods inside the overrides.
sv: Om din konfigureringsgränssnittskomponent ärver från denna klass men inkluderar inställning som inte är registrerade, bör du överrida :class:`ConfigWidgetInterface` metoder och kallar basklassmetoder inuti överridningarna.

source: Register a setting.
sv: Registrera en inställning.

source: The setting name
sv: Satta namnet

source: The config object that reads/writes the setting
sv: Konfigureringsobjektet som läser/skriver instälningen

source: The name of the GUI object that presents an interface to change the setting. By default it is assumed to be ``'opt_' + name``.
sv: Namnet på det grafiska objekt som presenterar ett gränssnitt för att ändra inställningen. Som standard antas vara ``'opt_' + name``.

source: If this setting is a multiple choice (combobox) based setting, the list of choices. The list is a list of two element tuples of the form: ``[(gui name, value), ...]``
sv: Om inställningen är en flervals (ComboBox) baserad inställning, listan över alternativ. Listan är en lista på två-elements tupler av formen: ``[(gui name, value), ...]``

source: The class responsible for managing this setting. The default class handles almost all cases, so this param is rarely used.
sv: Klassen ansvarar för att hantera den här inställningen. Standard klassen hanterar nästan alla fall, så den här param används sällan.

source: Viewer plugins
sv: Visningstillägg

source: These plugins are used to add functionality to the calibre viewer.
sv: Dessa tillägg används för att lägga till funktionalitet till calibres granskare.

source: This method is called once at viewer startup. It should load any fonts it wants to make available. For example::
sv: Denna metod anropas en gång vid start av granskare. Det borde ladda godtyckligt typsnitt som det vill göra tillgängligt. Till exempel::

source: This method is called every time a new HTML document is loaded in the viewer. Use it to load javascript libraries into the viewer. For example::
sv: Denna metod anropas varje gång ett nytt HTML-dokument laddas i granskaren. Använd det för att ladda javaskriptsbibliotek in i granskaren. Till exempel::

source: This method is called every time a document has finished loading. Use it in the same way as load_javascript().
sv: Denna metod anropas varje gång ett dokument laddats klart. Använd det på samma sätt som load_javascript().

source: This method is called once when the viewer is created. Use it to make any customizations you want to the viewer's user interface. For example, you can modify the toolbars via ui.tool_bar and ui.tool_bar2.
sv: Denna metod anropas en gång när betraktaren skapas. Använd den för att göra några anpassningar som du vill till tittarens användargränssnitt. Till exempel kan du ändra verktygsfält via ui.tool_bar och ui.tool_bar2.

source: This method is called every time the context (right-click) menu is shown. You can use it to customize the context menu. ``event`` is the context menu event and hit_test_result is the QWebHitTestResult for this event in the currently loaded document.
sv: Denna metod anropas varje gång menyn i sammanhanget (högerklicka) visas. Du kan använda den för att anpassa snabbmenyn. ``event`` är snabbmenyn händelsen och hit_test_result är QWebHitTestResult för denna händelse i det inlästa dokumentet.
