Repository: Easonqsp/calibre-translations
Catalog: manual/*/plugins.po
Languages: sv

source: API Documentation for plugins
sv: API dokumentation för tilläggsprogram

source: Defines various abstract base classes that can be subclassed to create powerful plugins. The useful classes are:
sv: Definiera diverse abstrakta klasser som kan vara underklasser för att skapa kraftfulla tilläggsprogram. Dessa användbara klasser är:

source: Plugin
sv: Tilläggsprogram

source: A calibre plugin. Useful members include:
sv: Ett Calibre-tilläggsprogram. Användbara medlemmar inkluderar:

source: ``self.plugin_path``: Stores path to the zip file that contains
sv: ``self.plugin_path``: Lagrar sökvägen till zip-filen som innehåller

source: this plugin or None if it is a builtin plugin
sv: detta tillägg eller None om det är ett inbyggt tillägg

source: ``self.site_customization``: Stores a customization string entered
sv: ``self.site_customization``: Lagrar en anpassad inmatad sträng

source: by the user.
sv: av användaren.

source: Methods that should be overridden in sub classes:
sv: Metoder som ska överridas i underklasser

source: Useful methods:
sv: Användbara metoder:

source: List of platforms this plugin works on. For example: ``['windows', 'osx', 'linux']``
sv: Lista av platformar som detta tillägg fungerar på. Till exempel: ``['windows', 'osx', 'linux']``

source: The name of this plugin. You must set it something other than Trivial Plugin for it to work.
sv: Namnet på detta tillägg. Du måste ange något annan än Trivial Plugin för att den ska fungera.

source: The version of this plugin as a 3-tuple (major, minor, revision)
sv: Versionen på detta tillägg är n 3-tupel (major, minor, revision)

source: A short string describing what this plugin does
sv: En kort sträng som beskriver vad detta tillägg gör

source: The author of this plugin
sv: Författare av tillägget

source: When more than one plugin exists for a filetype, the plugins are run in order of decreasing priority i.e. plugins with higher priority will be run first. The highest possible priority is ``sys.maxint``. Default priority is 1.
sv: När mer än ett tillägg finns för en filtyp, kommer tilläggen att köras i fallande prioritet dvs tillägg med högre prioritet kommer köras först. Det högsta möjliga prioritet är ``sys.maxint``. Grundinställning på prioritet är 1.

source: The earliest version of calibre this plugin requires
sv: Den tidigaste versionen av calibre som detta tillägg kräver

source: If False, the user will not be able to disable this plugin. Use with care.
sv: Om Falsk, kommer inte användaren kunna deaktivera detta tillägg. Använd med försiktighet.

source: The type of this plugin. Used for categorizing plugins in the GUI
sv: Typen av detta tillägg. Används för kategorisera tillägg i användargränsnittet

source: Called once when calibre plugins are initialized. Plugins are re-initialized every time a new plugin is added. Also note that if the plugin is run in a worker process, such as for adding books, then the plugin will be initialized for every new worker process.
sv: Anropas en gång när calibre-tillägg initieras. Tillägg åter initieras varje gång ett nytt tillägg läggs till. Observera också att om tillägg körs i en arbetsprocess, såsom att lägga till böcker, då kommer tillägg att initieras för varje ny arbetsprocess.

source: Perform any plugin specific initialization here, such as extracting resources from the plugin zip file. The path to the zip file is available as ``self.plugin_path``.
sv: Utför godtyckligt tilläggsinitialisering här, såsom att utvinna resurser från tilläggets zip-fil. Sökvägen till zip-filen är tillgänglig som ``self.plugin_path``.

source: Note that ``self.site_customization`` is **not** available at this point.
sv: Notera att ``self.site_customization`` är **inte** tillgänglig vid detta tillfälle.

source: Implement this method and :meth:`save_settings` in your plugin to use a custom configuration dialog, rather then relying on the simple string based default customization.
sv: Implementera denna metod och :meth:`save_settings` i ditt tillägg för att anpassa en konfigurationsdialog, snarare än att förlita sig på en enkel strängbaserad standard anpassning.

source: This method, if implemented, must return a QWidget. The widget can have an optional method validate() that takes no arguments and is called immediately after the user clicks OK. Changes are applied if and only if the method returns True.
sv: Denna metod, om implementerad, måste returnera en QWidget. Denna grej kan ha en alternativ metod validate() som inte tar några argument och anropas omedelbart efter användaren klickat OK. Förändringar tillämpas om och bara om metoden returnerar Sann.

source: If for some reason you cannot perform the configuration at this time, return a tuple of two strings (message, details), these will be displayed as a warning dialog to the user and the process will be aborted.
sv: Om du av någon anledning inte kan utföra konfigurationen vid denna tid, returnera en tupel av två strängar (meddelande, detaljer), kommer dessa att visas som en varningsdialogruta för användaren och processen avbryts.

source: Save the settings specified by the user with config_widget.
sv: Spara inställningarna som anges av användaren med config_widget.

source: The widget returned by :meth:`config_widget`.
sv: Gränssnittskomponenten som returneras av :meth:`config_widget`.

source: This method shows a configuration dialog for this plugin. It returns True if the user clicks OK, False otherwise. The changes are automatically applied.
sv: Denna metod visar en inställningsdialogruta för detta tillägg. Den returnerar Sann om användaren klickar på OK, annars Falsk. Ändringarna tillämpas automatiskt.

source: If this plugin comes in a ZIP file (user added plugin), this method will allow you to load resources from the ZIP file.
sv: Om detta tillägg kommer i en ZIP-fil (användartillagt tillägg), kommer denna metod tillåta dig läsa in resurser från ZIP-fil.

source: For example to load an image::
sv: Till exempel att läsa in en bild::

source: List of paths to resources in the zip file using / as separator
sv: Förteckning över sökvägar till resurser i zip-filen som använder / som avskiljare

source: A dictionary of the form ``{name: file_contents}``. Any names that were not found in the zip file will not be present in the dictionary.
sv: En ordlista av formen ``{namn:file_contents}``. Några namn som inte finns i zip-filen kommer inte att vara närvarande i ordlistan.

source: Return a string giving help on how to customize this plugin. By default raise a :class:`NotImplementedError`, which indicates that the plugin does not require customization.
sv: Returnera en sträng som ger hjälp om hur du anpassar detta tillägg. Som standard upp en :class:`NotImplementedError`, vilket tyder på att tillägget inte kräver anpassning.

source: If you re-implement this method in your subclass, the user will be asked to enter a string as customization for this plugin. The customization string will be available as ``self.site_customization``.
sv: Om du åter-implementera den här metoden i din underklass, kommer användaren att bli ombedd att skriva in en sträng som anpassning för detta tillägg. Den anpassning strängen kommer att finnas tillgänglig som ``self.site_customization``.

source: Site customization could be anything, for example, the path to a needed binary on the user's computer.
sv: Platsanpassning skulle kunna vara vad som helst, till exempel vägen till en välbehövlig binär på användarens dator.

source: If True return HTML help, otherwise return plain text help.
sv: Om Sann returneras HTML-hjälp, annars returneras vanlig hjälptext.

source: Return a file-like object that is a temporary file on the file system. This file will remain available even after being closed and will only be removed on interpreter shutdown. Use the ``name`` member of the returned object to access the full path to the created temporary file.
sv: Returnera en fil-liknande objekt som är en temporär fil i filsystemet. Denna fil kommer att vara tillgänglig även efter nedstängning och kommer endast att tas bort på vid avstängning. Använd ``name`` medlem av den returnerade objektet för att komma åt den fullständiga sökvägen till den skapade temporärfilen.

source: The suffix that the temporary file will have.
sv: Suffixet att den temporära filen kommer att ha.

source: This method is the main entry point for your plugins command line interface. It is called when the user does: calibre-debug -r "Plugin Name". Any arguments passed are present in the args variable.
sv: Denna metod är den viktigaste inkörsporten för tilläggskommandoradsgränssnitt. Det kallas när användaren utför calibre-debug -r "Tilläggsnamn". Alla argument som skickas finns i variabeln args.

source: Bases: :class:`calibre.customize.Plugin`
sv: Bas: :class:`calibre.customize.Plugin`

source: A plugin that is associated with a particular set of file types.
sv: Ett tillägg som är associerad med en viss uppsättning filtyper.

source: Set of file types for which this plugin should be run. For example: ``{'lit', 'mobi', 'prc'}``
sv: Uppsättning med filtyper som detta tillägg ska köra. Till exempel: ``{'lit', 'mobi', 'prc'}``

source: If True, this plugin is run when books are added to the database
sv: Om Sann, körs detta tillägg när böcker läggs till i databasen

source: If True, this plugin is run after books are added to the database
sv: Om Sann, körs detta tillägg efter böcker läggs till i databasen

source: If True, this plugin is run just before a conversion
sv: Om Sann, körs detta tillägg alldeles innan konvertering

source: If True, this plugin is run after conversion on the final file produced by the conversion output plugin.
sv: Om Sann, körs detta tillägg efter konvertering på den sista filen som produceras av konvertering utdatatillägget.

source: Run the plugin. Must be implemented in subclasses. It should perform whatever modifications are required on the ebook and return the absolute path to the modified ebook. If no modifications are needed, it should return the path to the original ebook. If an error is encountered it should raise an Exception. The default implementation simply return the path to the original ebook.
sv: Kör tillägg. Måste genomföras i underklasser. Det bör utföra vad som behöver modifieras på e-boken och returnera den absoluta sökvägen till den modifierade e-boken. Om inga ändringar behövs, bör den returnera sökvägen till den ursprungliga e-boken. Om ett fel inträffar bör det ge ett undantag. Genomförandet returnerar som standard sökvägen till den ursprungliga e-boken.

source: The modified ebook file should be created with the :meth:`temporary_file` method.
sv: Den modifierade e-bokfilen ska skapas med :meth:`temporary_file` metod.

source: Absolute path to the ebook.
sv: Absolut sökväg till e-boken.

source: Absolute path to the modified ebook.
sv: Absolut sökväg till den modifierade e-boken.

source: Called post import, i.e., after the book file has been added to the database.
sv: Anropas efter import, dvs efter att bokfilen har lagts till i databasen.

source: Database id of the added book.
sv: Databas id för tillagda boken.

source: The file type of the book that was added.
sv: Den filtyp av boken som lades till.

source: Library database.
sv: Biblioteksdatabas.

source: Metadata plugins
sv: Metadatatillägg

source: A plugin that implements reading metadata from a set of file types.
sv: Ett tillägg som implementerar läsning av metadata från en uppsättning filtyper.

source: Set of file types for which this plugin should be run For example: ``set(['lit', 'mobi', 'prc'])``
sv: Uppsättning med filtyper som detta tillägg ska köra Till exempel: ``set(['lit', 'mobi', 'prc'])``

source: Return metadata for the file represented by stream (a file like object that supports reading). Raise an exception when there is an error with the input data. :param type: The type of file. Guaranteed to be one of the entries in :attr:`file_types`. :return: A :class:`calibre.ebooks.metadata.book.Metadata` object
sv: Returnerar metadata för filen som representeras av ström (en fil som objekt som stöder behandlingen). Signalera ett undantag när det finns ett fel med indata. :param type: Typen av fil. Garanterat för att vara en av de uppgifter i :attr:`file_types`. :return: A :class:`calibre.ebooks.metadata.book.Metadata` objekt

source: Set metadata for the file represented by stream (a file like object that supports reading). Raise an exception when there is an error with the input data. :param type: The type of file. Guaranteed to be one of the entries in :attr:`file_types`. :param mi: A :class:`calibre.ebooks.metadata.book.Metadata` object
sv: Ange metadata för filen som representeras av ström (en fil som objekt som stöder behandlingen). Signalera ett undantag när det finns ett fel med indata. :param type: Typen av fil. Garanterat för att vara en av de uppgifter i :attr:`file_types`. :param mi: A :class:`calibre.ebooks.metadata.book.Metadata` objekt

source: Catalog plugins
sv: Katalogtillägg

source: A plugin that implements a catalog generator.
sv: Ett tillägg som implementerar en kataloggenerator.

source: Output file type for which this plugin should be run For example: 'epub' or 'xml'
sv: Utdatafiltyp som detta tillägg ska köra Till exempel: "epub" eller "xml"

source: CLI parser options specific to this plugin, declared as namedtuple Option::
sv: CLI tolkningsalternativ som är specifika för detta tillägg, deklareras som namngiven tupel Alternativ::

source: If plugin is not a built-in, copy the plugin's .ui and .py files from the zip file to $TMPDIR. Tab will be dynamically generated and added to the Catalog Options dialog in calibre.gui2.dialogs.catalog.py:Catalog
sv: Om tillägget inte är ett inbyggt, kopiera tillägget .ui och .py filer från zip-filen till $TMPDIR. Tab kommer att genereras dynamiskt och läggas till dialogrutan Katalogalternativ i calibre.gui2.dialogs.catalog.py:Catalog

source: Run the plugin. Must be implemented in subclasses. It should generate the catalog in the format specified in file_types, returning the absolute path to the generated catalog file. If an error is encountered it should raise an Exception.
sv: Kör tillägget. Måste implementeras i underklasser. Det ska generera katalogen i det format som anges i file_types, återvänder den absoluta sökvägen till den genererade katalogfilen. Om ett fel inträffar bör det signalera ett undantag.

source: The generated catalog file should be created with the :meth:`temporary_file` method.
sv: Den genererade katalogfilen ska skapas med :meth:`temporary_file` metod.

source: Absolute path to the generated catalog file.
sv: Absoluta sökvägen till den genererade katalogfilen.

source: A dictionary of keyword arguments
sv: En ordlista av nyckelordsargument

source: A LibraryDatabase2 object
sv: Ett LibraryDatabase2 objekt

source: Metadata download plugins
sv: Metadata-nedladdningstillägg

source: Set of capabilities supported by this plugin. Useful capabilities are: 'identify', 'cover'
sv: Uppsättning funktioner som stöds av detta tillägg. Användbara funktioner är: "identify", "cover"

source: List of metadata fields that can potentially be download by this plugin during the identify phase
sv: Lista över metadatafält som potentiellt kan laddas ner från detta tillägg under identifieringsfasen

source: Set this to True if your plugin returns HTML formatted comments
sv: Sätt detta till Sann om ditt tillägg returnerar HTML-formaterade kommentarer

source: Setting this to True means that the browser object will add Accept-Encoding: gzip to all requests. This can speedup downloads but make sure that the source actually supports gzip transfer encoding correctly first
sv: Sätta den här Sann innebär att webbläsaren objektet kommer att lägga Accept-Encoding: gzip på alla förfrågningar. Detta kan snabba upp nedladdningar men se till att källan faktiskt stöder gzip-överföringskodning korrekt först

source: Cached cover URLs can sometimes be unreliable (i.e. the download could fail or the returned image could be bogus. If that is often the case with this source set to False
sv: Buffrade omslags-URL:er kan ibland vara otillförlitliga (dvs nedladdningen kan misslyckas eller returnerad binär kan vara falsk. Om så är ofta fallet med denna källa sätt till Falsk

source: A list of :class:`Option` objects. They will be used to automatically construct the configuration widget for this plugin
sv: En lista av :class:`Option` objects. De kommer användas för automatiskt skapa konfigurationsgränssnittskomponenten för detta tillägg

source: A string that is displayed at the top of the config widget for this plugin
sv: En sträng som visas högst upp på gränssnittskomponenten för detta tillägg

source: If True this source can return multiple covers for a given query
sv: Om Sann kan denna källa returnera flera omslag för en viss fråga

source: If set to True covers downloaded by this plugin are automatically trimmed.
sv: Om satt till Sann nedladdade omslag trimmas automatiskt av detta tillägg.

source: If set to True, and this source returns multiple results for a query, some of which have ISBNs and some of which do not, the results without ISBNs will be ignored
sv: Om värdet är Sann, och denna källa returnerar flera resultat för en fråga, av vilka några har ISBN och av vilka en del inte, så ignoreras resultaten utan ISBN

source: Return False if your plugin needs to be configured before it can be used. For example, it might need a username/password/API key.
sv: Returnerar Falsk om ditt tillägg måste konfigureras innan det kan användas. Till exempel kan det behöva ett användarnamn/lösenord/API-nyckel.

source: Take a list of authors and return a list of tokens useful for an AND search query. This function tries to return tokens in first name middle names last name order, by assuming that if a comma is in the author name, the name is in lastname, other names form.
sv: Ta en lista över författare och returnera en lista med symboler som är användbara för en OCH sökfrågan. Denna funktion försöker returnera stafettpinnar i ordningen mellannamn förnamn efternamn, genom att anta att om ett komma är i författarens namn, är namnet i efternamn, andra namn bildningar.

source: Take a title and return a list of tokens useful for an AND search query. Excludes connectives(optionally) and punctuation.
sv: Ta en titel och returnera en lista med symboler som är användbara för en OCH sökfrågan. Utesluter konnektiva (valfritt) och skiljetecken.

source: Split a list of jobs into at most num groups, as evenly as possible
sv: Dela upp en lista med jobb i högst num grupper, så jämnt som möjligt

source: Return the first field from self.touched_fields that is null on the mi object
sv: Återgå till det första fältet från self.touched_fields som är null på mi objektet

source: Call this method in your plugin's identify method to normalize metadata before putting the Metadata object into result_queue. You can of course, use a custom algorithm suited to your metadata source.
sv: Anropa den här metoden i ditt tillägg för att identifiera metod att normalisera metadata innan metadataobjektet läggs i result_queue. Du kan naturligtvis använda en anpassad algoritm som passar din metadatakälla.

source: Return a 3-tuple or None. The 3-tuple is of the form: (identifier_type, identifier_value, URL). The URL is the URL for the book identified by identifiers at this source. identifier_type, identifier_value specify the identifier corresponding to the URL. This URL must be browseable to by a human using a browser. It is meant to provide a clickable link for the user to easily visit the books page at this source. If no URL is found, return None. This method must be quick, and consistent, so only implement it if it is possible to construct the URL from a known scheme given identifiers.
sv: Returnerar en 3-tupel eller None. 3-tupeln har formen: (identifier_type, identifier_value, URL). URLn är webbadressen till boken som identifieras av identifierare vid denna källa. identifier_type, identifier_value anger identifierare som motsvarar URL. Den här URLn måste vara bläddringsbar av en människa med en webbläsare. Det är tänkt att ge en klickbar länk för användaren att enkelt besöka sidan böcker vid denna källa. Om ingen URL hittas returneras None. Denna metod måste vara snabb, och konsekvent, så att bara genomföra det om det är möjligt att konstruera URLn från ett känt schema av givna identifierare.

source: Return a human readable name from the return value of get_book_url().
sv: Returnerar ett läsbart namn från returvärdet för get_book_url().

source: Override this method if you would like to return multiple urls for this book. Return a list of 3-tuples. By default this method simply calls :func:`get_book_url`.
sv: Åsidosätta denna metod om du vill återvända flera webbadresser för den här boken. Returnera en lista med 3-tupler. Som standard kallar metoden helt enkelt :func:`get_book_url`.

source: Return cached cover URL for the book identified by the identifiers dict or None if no such URL exists.
sv: Returnera buffrad omslags-URL för boken som identifieras av identifierare dict eller None om ingen sådan URL finns.

source: Note that this method must only return validated URLs, i.e. not URLS that could result in a generic cover image or a not found error.
sv: Observera att den här metoden bara måste återvända validerade URL:er, dvs inte webbadresser som kan resultera i en generisk omslagsbild eller inte hittat felet.

source: Return a function that is used to generate a key that can sort Metadata objects by their relevance given a search query (title, authors, identifiers).
sv: Returnerar en funktion som används för att generera en nyckel som kan sortera metadataobjekt genom deras relevans givet en sökfråga (titel, författare, kännetecken).

source: These keys are used to sort the results of a call to :meth:`identify`.
sv: Dessa nycklar används för att sortera resultatet av ett anrop till :meth:`identify`.

source: For details on the default algorithm see :class:`InternalMetadataCompareKeyGen`. Re-implement this function in your plugin if the default algorithm is not suitable.
sv: Mer information om standardalgoritmen, se: klass :class:`InternalMetadataCompareKeyGen`. Åter implementera denna funktion i ditt tillägg om standardalgoritmen inte är lämplig.

source: Identify a book by its title/author/isbn/etc.
sv: Identifiera en bok med dess titel/författare/isbn/etc.

source: If identifiers(s) are specified and no match is found and this metadata source does not store all related identifiers (for example, all ISBNs of a book), this method should retry with just the title and author (assuming they were specified).
sv: Om identifierare anges och ingen passning hittas och detta metadatakälla inte lagrar alla relaterade identifierare (till exempel alla ISBN i en bok), bör denna metod försöka igen med bara titel och författare (förutsatt att de specificerades).

source: If this metadata source also provides covers, the URL to the cover should be cached so that a subsequent call to the get covers API with the same ISBN/special identifier does not need to get the cover URL again. Use the caching API for this.
sv: Om denna metadatakälla också ger omslag, ska den webbadress till omslaget buffras så att ett efterföljande anrop till get omslags-API med samma ISBN/special identifierare inte behöver få omslags-URL igen. Använd buffrings-API för detta.
