Repository: Easonqsp/calibre-translations
Catalog: manual/*/plugins.po
Languages: sv

source: thumbnail (can be None) thumbnail is either a str/bytes object with the image data or it should have an attribute image_path that stores an absolute (platform native) path to the image
sv: omslagsikon (kan vara None) omslagsikon är antingen ett str/bytes-objekt med bilddata eller det borde ha ett attribut image_path som lagrar en absolut (plattformsberoende) sökvägen till bilden

source: tags (a list of strings, can be empty).
sv: etiketter (en lista med strängar, kan vara tom).

source: Return True if the device supports collections for this book list.
sv: Returnera Sann om enheten stöder kollektioner för denna boklista.

source: Add the book to the booklist. Intent is to maintain any device-internal metadata. Return True if booklists must be sync'ed
sv: Lägg boken till boklista. Avsikten är att behålla alla enheters interna metadata. Returnerar Sann om boklistor måste synkroniseras

source: Remove a book from the booklist. Correct any device metadata at the same time
sv: Ta bort en bok från boklista. Rätta en enhets metadata samtidigt

source: Return a dictionary of collections created from collection_attributes. Each entry in the dictionary is of the form collection name:[list of books]
sv: Returnera en ordlista av samlingar som skapats från collection_attributes. Varje post i ordlistan är på formen kollektionsnamn:[lista med böcker]

source: The list of books is sorted by book title, except for collections created from series, in which case series_index is used.
sv: Listan över böcker sorterad efter boktitel, förutom samlingar som skapats från serien, i vilket fall series_index används.

source: A list of attributes of the Book object
sv: En lista med attribut av bokobjektet

source: USB Mass Storage based devices
sv: USB-masslagringsbaserade enheter

source: The base class for such devices is :class:`calibre.devices.usbms.driver.USBMS`. This class in turn inherits some of its functionality from its bases, documented below. A typical basic USBMS based driver looks like this:
sv: Basklass för sådan enhet är :class:`calibre.devices.usbms.driver.USBMS`. Denna klass ärver i sin tur en del av dess funktioner från sina baser, dokumenterad nedan. En typisk grund USBMS baserad drivrutin ser ut så här:

source: Bases: :class:`calibre.devices.usbms.deviceconfig.DeviceConfig`, :class:`calibre.devices.interface.DevicePlugin`
sv: Bas: :class:`calibre.devices.usbms.deviceconfig.DeviceConfig`, :class:`calibre.devices.interface.DevicePlugin`

source: This class provides logic common to all drivers for devices that export themselves as USB Mass Storage devices. Provides implementations for mounting/ejecting of USBMS devices on all platforms.
sv: Denna klass ger logik som är gemensam för alla drivrutiner för enheter som exporterar själva som USB-masslagringsenheter. Ger implementationer för montering/utmatning av USBMS-enheter på alla plattformar.

source: String identifying the main memory of the device in the windows PnP id strings This can be None, string, list of strings or compiled regex
sv: Sträng identifierar huvudminne på enheten i Windows PnP id strängar Detta kan vara None, string, lista med string eller sammanställad regex

source: String identifying the first card of the device in the windows PnP id strings This can be None, string, list of strings or compiled regex
sv: Sträng som identifierar det första kortet av anordningen i Windows PnP id strängar Detta kan vara None, string, lista med string eller sammanställad regex

source: String identifying the second card of the device in the windows PnP id strings This can be None, string, list of strings or compiled regex
sv: Sträng som identifierar det andra kortet av anordningen i Windows PnP id strängar Detta kan vara None, string, lista med string eller sammanställad regex

source: Used by the new driver detection to disambiguate main memory from storage cards. Should be a regular expression that matches the main memory mount point assigned by OS X
sv: Används av den nya drivrutinens upptäckt att klargöra huvudminnet från minneskort. Bör vara ett reguljärt uttryck som passar huvudminnets monteringspunkt tilldelad av OS X

source: The maximum length of paths created on the device
sv: Den maximala längden av sökvägar som skapats på enheten

source: Put news in its own folder
sv: Lägg nyheter i en egen mapp

source: Called to disambiguate main memory and storage card for devices that do not distinguish between them on the basis of `WINDOWS_CARD_NAME`. For e.g.: The EB600
sv: Anriopas för att klargöra huvudminnet och minneskortet för enheter som inte skiljer mellan dem på grundval av `WINDOWS_CARD_NAME`. För t.ex .: The EB600

source: Callback to allow individual device drivers to override the path sanitization used by :meth:`create_upload_path`.
sv: Tillbakaanrop för att låta enskilda drivrutiner överrida sökvägens sanering som används av :meth:`create_upload_path`.

source: Callback to allow drivers to change the default file name set by :meth:`create_upload_path`.
sv: Tillbakaanrop för att låta enskilda drivrutiner ändra standard filnamnet fastställt av :meth:`create_upload_path`.

source: Perform any device specific sanitization on the path components for files to be uploaded to the device
sv: Utför någon enhetsspecifik sanering på sökvägskomponenter för filer som laddas upp till enheten

source: Resolve path_map to annotation_map of files found on the device
sv: Lösa upp path_map till annotation_map filer som finns på enheten

source: Add an annotation to the calibre library
sv: Lägg en anteckning till calibres biblioteket

source: Bases: :class:`calibre.devices.usbms.cli.CLI`, :class:`calibre.devices.usbms.device.Device`
sv: Bas: :class:`calibre.devices.usbms.cli.CLI`, :class:`calibre.devices.usbms.device.Device`

source: The base class for all USBMS devices. Implements the logic for sending/getting/updating metadata/caching metadata/etc.
sv: Basklass för alla USBMS-enheter. Implementerar logiken för att skicka/få/uppdatera metadata/buffra metadata / etc.

source: Upload book cover to the device. Default implementation does nothing.
sv: Ladda upp bokomslag till enheten. Grundinställning gör implementationen ingenting.

source: The full path to the directory where the associated book is located.
sv: Den fullständiga sökvägen till katalogen där den tillhörande boken är placerad.

source: The name of the book file without the extension.
sv: Namnet på bokfilen utan filtyp.

source: metadata belonging to the book. Use metadata.thumbnail for cover
sv: metadata som hör till boken. Använd metadata.thumbnail för omslag

source: The full path to the ebook file
sv: Fullständig sökväg till e-bokfilen

source: Return path with platform native path separators
sv: Returnera sökväg med plattformsursprungliga sökvägsseparatorer

source: User Interface Actions
sv: Användargränssnittsåtgärder

source: If you are adding your own plugin in a zip file, you should subclass both InterfaceActionBase and InterfaceAction. The :meth:`load_actual_plugin` method of you InterfaceActionBase subclass must return an instantiated object of your InterfaceBase subclass.
sv: Om du lägger till ditt eget tillägg i en zip-fil, ska du skapa underklass både till InterfaceActionBase och InterfaceAction. Den :meth:`load_actual_plugin` metod för din InterfaceActionBase underklass måste returnera ett instansierat objekt för din InterfaceBase underklass.

source: Bases: :class:`PyQt5.QtCore.QObject`
sv: Bas: :class:`PyQt5.QtCore.QObject`

source: A plugin representing an "action" that can be taken in the graphical user interface. All the items in the toolbar and context menus are implemented by these plugins.
sv: Ett tillägg som representerar en "åtgärd" som kan tas i det grafiska användargränssnittet. Alla objekt i verktygsfältet och snabbmenyer implementerar av dessa tillägg.

source: Note that this class is the base class for these plugins, however, to integrate the plugin with calibre's plugin system, you have to make a wrapper class that references the actual plugin. See the :mod:`calibre.customize.builtins` module for examples.
sv: Observera att den här klassen är basklassen för dessa tillägg, dock att integrera tillägg med calibre tilläggssystem, måste du göra en omslagsklass som refererar till det faktiska tillägget. Se :mod:`calibre.customize.builtins` modul för exempel.

source: If two :class:`InterfaceAction` objects have the same name, the one with higher priority takes precedence.
sv: Om två :class:`InterfaceAction` objekt har samma namn, tar den med högre prioritet företräde.

source: Sub-classes should implement the :meth:`genesis`, :meth:`library_changed`, :meth:`location_selected` :meth:`shutting_down` and :meth:`initialization_complete` methods.
sv: Underklasser bör implementera :meth:`genesis`, :meth:`library_changed`, :meth:`location_selected` :meth:`shutting_down` och :meth:`initialization_complete` metoder.

source: Once initialized, this plugin has access to the main calibre GUI via the :attr:`gui` member. You can access other plugins by name, for example::
sv: När initierats, har detta tillägg tillgång till de calibres huvud-GUI via :attr:`gui` medlem. Du kan komma åt andra tillägg med namn, till exempel::

source: To access the actual plugin, use the :attr:`interface_action_base_plugin` attribute, this attribute only becomes available after the plugin has been initialized. Useful if you want to use methods from the plugin class like do_user_config().
sv: För att komma åt själva tillägget, använd :attr:`interface_action_base_plugin` attribut, detta attribut blir först tillgänglig efter det tillägget har initierats. Användbart om du vill använda metoder från tilläggklassen som do_user_config().

source: The QAction specified by :attr:`action_spec` is automatically create and made available as ``self.qaction``.
sv: QAction anges av :attr:`action_spec` skapas automatiskt och blir tillgänglig via ``self.qaction``.

source: The plugin name. If two plugins with the same name are present, the one with higher priority takes precedence.
sv: Tilläggnamnet. Om två tillägg med samma namn är närvarande, tar en med högre prioritet företräde.

source: The plugin priority. If two plugins with the same name are present, the one with higher priority takes precedence.
sv: TIlläggets prioritet. Om två tillägg med samma namn är närvarande, tar en med högre prioritet företräde.

source: The menu popup type for when this plugin is added to a toolbar
sv: Extrafönstermenytypen när detta tillägg läggs till ett verktygsfält

source: Whether this action should be auto repeated when its shortcut key is held down.
sv: Huruvida denna åtgärd bör automatiskt upprepas när dess kortkommando hålls nere.

source: Of the form: (text, icon_path, tooltip, keyboard shortcut) icon, tooltip and keyboard shortcut can be None shortcut must be a string, None or tuple of shortcuts. If None, a keyboard shortcut corresponding to the action is not registered. If you pass an empty tuple, then the shortcut is registered with no default key binding.
sv: Av formen: (text, icon_path, verktygstips, kortkommando) ikonen, verktygstips och kortkommandot kan vara None genväg måste vara en sträng, None eller tupel av genvägar. Om None är ett kortkommando som motsvarar åtgärden inte är registrerad. Om du skickar en tom tabellrad, då registreras genvägen utan bindande standardnyckel.

source: If True, a menu is automatically created and added to self.qaction
sv: Om Sann, skapas en meny automatiskt och läggs till self.qaction

source: If True, a clone of self.qaction is added to the menu of self.qaction If you want the text of this action to be different from that of self.qaction, set this variable to the new text
sv: Om Sann, läggs en klon av self.qaction till menyn för self.qaction Om du vill att texten i denna åtgärd att vara annorlunda än self.qaction, ställa in den här variabeln till den nya texten

source: Set of locations to which this action must not be added. See :attr:`all_locations` for a list of possible locations
sv: Uppsättning av platser som denna åtgärd får inte tilläggas. Se :attr:`all_locations` för en lista över möjliga platser

source: Set of locations from which this action must not be removed. See :attr:`all_locations` for a list of possible locations
sv: Uppsättning av platser som denna åtgärd inte får ta bort. Se :attr:`all_locations` för en lista över möjliga platser

source: Type of action 'current' means acts on the current view 'global' means an action that does not act on the current view, but rather on calibre as a whole
sv: Typ av åtgärd "nuvarande" innebär, agerar på den aktuella vyn "global": en åtgärd som inte verkar på den aktuella vyn, utan snarare på calibre som helhet

source: If True, then this InterfaceAction will have the opportunity to interact with drag and drop events. See the methods, :meth:`accept_enter_event`, :meth`:accept_drag_move_event`, :meth:`drop_event` for details.
sv: Om Sann, kommer detta InterfaceAction att ha möjlighet att interagera med dra och släpp händelser. Se de metoder, :meth:`accept_enter_event`, :meth`:accept_drag_move_event`, :meth:`drop_event` för mer information.

source: This method should return True iff this interface action is capable of handling the drag event. Do not call accept/ignore on the event, that will be taken care of by the calibre UI.
sv: Metoden ska returnera sant om och endast detta gränssnitt åtgärd kan hantera dra händelsen. Anropa inte acceptera/ignorera vid händelsen, som kommer att tas om hand av den calibres UI

source: This method should perform some useful action and return True iff this interface action is capable of handling the drop event. Do not call accept/ignore on the event, that will be taken care of by the calibre UI. You should not perform blocking/long operations in this function. Instead emit a signal or use QTimer.singleShot and return quickly. See the builtin actions for examples.
sv: Denna metod bör utföra några användbara åtgärder och returnera Sann om endast om detta gränssnittsåtgärd kan hantera händelsen "drop". Anropa inte acceptera/ignorera vid händelsen, som kommer att tas om hand av den calibres UI. Du ska inte utföra blockering/långa operationer i denna funktion. Istället avger en signal eller använd QTimer.singleShot och returnera snabbt tillbaka. Se de inbyggda åtgärder för exempel.

source: Convenience method to easily add actions to a QMenu. Returns the created QAction, This action has one extra attribute calibre_shortcut_unique_name which if not None refers to the unique name under which this action is registered with the keyboard manager.
sv: Bekväm metod för att enkelt lägga handlingar till en QMenu. Returnerar den skapade QAction, denna åtgärd har ett extra attribut calibre_shortcut_unique_name som om den inte None avser det unika namn under vilket denna åtgärd är registrerad med tangentbordsansvarig.

source: The QMenu the newly created action will be added to
sv: QMenu:s nyskapade åtgärder kommer att läggas till

source: A unique name for this action, this must be globally unique, so make it as descriptive as possible. If in doubt add a uuid to it.
sv: Ett unikt namn för denna åtgärd, detta måste vara globalunikt, så gör det så beskrivande som möjligt. Om du är osäker lägg till ett uuid till den.

source: The text of the action.
sv: Texten för denna åtgärd.

source: Either a QIcon or a file name. The file name is passed to the I() builtin, so you do not need to pass the full path to the images directory.
sv: Antingen en QIcon eller ett filnamn. Filnamnet skickas till inbyggda I(), så du behöver inte ange den fullständiga sökvägen till bildkatalogen.

source: A string, a list of strings, None or False. If False, no keyboard shortcut is registered for this action. If None, a keyboard shortcut with no default keybinding is registered. String and list of strings register a shortcut with default keybinding as specified.
sv: En sträng, en lista med strängar, None eller Falsk. Om Falsk har inget kortkommando registrerats för denna åtgärd. Om None har ett kortkommando med ingen standardtangentbindning registrerats. Sträng och lista med strängar registrerar en genväg med standardtangentbindning som anges.

source: A description for this action. Used to set tooltips.
sv: En beskrivning för denna åtgärd. Används för att ställa in verktygsråd.

source: A callable which is connected to the triggered signal of the created action.
sv: En anropbar som är ansluten till den utlösta signalen i den skapade åtgärden.

source: The test displayed to the user when customizing the keyboard shortcuts for this action. By default it is set to the value of ``text``.
sv: Testet visas för användaren när du anpassar kortkommandon för denna åtgärd. Som standard är satt till värdet på ``text``.

source: A dictionary of the form ``{name : file_contents}``. Any names that were not found in the zip file will not be present in the dictionary.
sv: En ordlista på formen ``{name : file_contents}``. Namn som inte finns i zip-filen kommer inte att vara närvarande i ordlistan.

source: Setup this plugin. Only called once during initialization. self.gui is available. The action specified by :attr:`action_spec` is available as ``self.qaction``.
sv: Ställ in detta tillägg. Endast anropas en gång under initieringen. self.gui är tillgänglig. Den funktion som specificerats :attr:`action_spec` finns som ``self.qaction``.

source: Called whenever the book list being displayed in calibre changes. Currently values for loc are: ``library, main, card and cardb``.
sv: Anropas när boken listan som visas i calibre förändringas. För närvarande är värden för loc: ``bibliotek, huvud, kort och cardb``.

source: This method should enable/disable this action and its sub actions as appropriate for the location.
sv: Denna metod bör aktivera/inaktivera denna åtgärd och dess underåtgärder som är lämpliga för platsen.

source: Called whenever the current library is changed.
sv: Anropas var gång det aktuella biblioteket är ändrat.

source: The LibraryDatabase corresponding to the current library.
sv: LibraryDatabase motsvarar det aktuella biblioteket.

source: Called once per action when the layout of the main GUI is completed. If your action needs to make changes to the layout, they should be done here, rather than in :meth:`initialization_complete`.
sv: Anropas en gång per åtgärd när formgivningen hos huvud-GUI är avslutad. Om åtgärder måste göra ändringar i formgivningen, bör de göras här, snarare än i :meth:`initialization_complete`.

source: Called once per action when the initialization of the main GUI is completed.
sv: Anropas en gång per åtgärd när installationen av huvud-GUI är färdigt.

source: Called once per plugin when the main GUI is in the process of shutting down. Release any used resources, but try not to block the shutdown for long periods of time.
sv: Anropas en gång per tillägg när huvud-GUI är i färd med att stängas av. Släpp alla använda resurser, men försök att inte blockera avstängning under långa tidsperioder.

source: False to halt the shutdown. You are responsible for telling the user why the shutdown was halted.
sv: Falsk för att stoppa avstängningen. Du är ansvarig för att tala om för användaren varför avstängningen stoppades.

source: This method must return the actual interface action plugin object.
sv: Denna metod måste returnera själva gränssnittsåtgärden av tilläggsobjektet.

source: Preferences Plugins
sv: Inställningar Tillägg

source: A plugin representing a widget displayed in the Preferences dialog.
sv: Ett tillägg som representerar en gränssnittskomponenten visas i inställningsdialogen.

source: This plugin has only one important method :meth:`create_widget`. The various fields of the plugin control how it is categorized in the UI.
sv: Detta tillägg har bara en viktig metod :meth:`create_widget`. De olika fälten i tillägget styr hur den kategoriseras i användargränssnittet.

source: Import path to module that contains a class named ConfigWidget which implements the ConfigWidgetInterface. Used by :meth:`create_widget`.
sv: Importera sökväg till modul som innehåller en klass namngiven ConfigWidget vilken implementerar ConfigWidgetInterface. Används av :meth:`create_widget`.

source: Where in the list of categories the :attr:`category` of this plugin should be.
sv: Var i listan av kategorier :attr:`category` av detta tillägg bör vara.

source: Where in the list of names in a category, the :attr:`gui_name` of this plugin should be
sv: Var i listan av namn i en kategori :attr:`gui_name` detta tillägg bör vara

source: The category this plugin should be in
sv: Kategorin detta tillägg bör vara i

source: The category name displayed to the user for this plugin
sv: Kategorinamnet som visas till användaren för detta tillägg

source: The name displayed to the user for this plugin
sv: Namnet som visar till användaren för detta tillägg

source: The icon for this plugin, should be an absolute path
sv: Ikonen för detta tillägg, bör vara en absolut sökväg

source: The description used for tooltips and the like
sv: Beskrivning som används för verktygsråd och liknande

source: Create and return the actual Qt widget used for setting this group of preferences. The widget must implement the :class:`calibre.gui2.preferences.ConfigWidgetInterface`.
sv: Skapa och returnerar den faktiska Qt-gränssnittskomponenten som används för ställa in denna grupps inställningar. Gränssnittskomponenten måste implementera :class:`calibre.gui2.preferences.ConfigWidgetInterface`.

source: The default implementation uses :attr:`config_widget` to instantiate the widget.
sv: Standard implementationen använder :attr:`config_widget` för att instansiera gränssnittskomponenten.

source: This class defines the interface that all widgets displayed in the Preferences dialog must implement. See :class:`ConfigWidgetBase` for a base class that implements this interface and defines various convenience methods as well.
sv: Denna klass definierar gränssnittet som alla gränssnittskomponenter visar i Inställningsdialogen som måste implementeras. Se :class:`ConfigWidgetBase` för en basklass som implementerar detta gränssnitt och också definierar olika bekväma metoder.

source: This signal must be emitted whenever the user changes a value in this widget
sv: Denna signal ska avges när användaren ändrar ett värde i den här gränssnittskomponenten

source: Set to True iff the :meth:`restore_to_defaults` method is implemented.
sv: Sätt till Sann om och bara om :meth:`restore_to_defaults` metoden är implementerad.

source: The tooltip for the Restore to defaults button
sv: Verktygsrådet för Återställning till grundinställningsknappen

source: If True the Preferences dialog will not allow the user to set any more preferences. Only has effect if :meth:`commit` returns True.
sv: Om Sann tillåter inte Inställningsdialogrutan inte användaren att ställa in några fler inställningar. Endast har verkan om :meth:`commit` returnerar Sann.

source: Called once before the widget is displayed, should perform any necessary setup.
sv: Anropas en gång innan gränssnittskomponent visas, borde utföra alla nödvändig inställningar.

source: The main calibre graphical user interface
sv: calibres huvudanvändargränssnitt

source: Should set all config values to their initial values (the values stored in the config files).
sv: Bör sätta alla konfigureringsvärden till deras initiala värden (värdena lagras i konfigurationsfiler).

source: Should set all config values to their defaults.
sv: Bör sätta alla konfigureringsvärden till deras grundinställningar.
