Repository: Easonqsp/calibre-translations
Catalog: manual/*/polish.po
Languages: sv

source: API Documentation for the ebook editing tools
sv: API-dokumentation för e-bok redigeringsverktyg

source: The ebook editing tools consist of a :class:`calibre.ebooks.oeb.polish.container.Container` object that represents a book as a collection of HTML + resource files, and various tools that can be used to perform operations on the container. All the tools are in the form of module level functions in the various ``calibre.ebooks.oeb.polish.*`` modules.
sv: E-boksredigeringsverktygen består av :class:`calibre.ebooks.oeb.polish.container.Container` objekt som representerar en bok som en samling av HTML + resursfiler, samt olika verktyg som kan användas för att utföra operationer på behållaren . Alla verktyg är i form av modulnivåsfunktioner i de olika `calibre.ebooks.oeb.polish.*`` moduler.

source: You obtain a container object for a book at a path like this::
sv: Du erhåller ett behållarobjekt för en bok på en sökväg så här::

source: If you are writing a plugin for the ebook editor, you get the current container for the book being edited like this::
sv: Om du skriver ett tillägg för e-bokeditorn, får du den aktuella behållaren för boken som redigeras så här::

source: The Container object
sv: Behållarobjektet

source: A container represents an Open EBook as a directory full of files and an opf file. There are two important concepts:
sv: En behållare är en Open eBook som en katalog full av filer och en opf-fil. Det finns två viktiga begrepp:

source: The root directory. This is the base of the ebook. All the ebooks files are inside this directory or in its sub-directories.
sv: Rotkatalogen. Detta är basen i e-boken. Alla e-boksfilerna är inne katalogen och i dess underkataloger.

source: Names: These are paths to the books' files relative to the root directory. They always contain POSIX separators and are unquoted. They can be thought of as canonical identifiers for files in the book. Most methods on the container object work with names. Names are always in the NFC unicode normal form.
sv: Namn: Dessa är sökvägar till böckernas filerna relativt rotkatalogen. De innehåller alltid POSIX separatorer och är utan citattecken. De kan ses som kanoniska identifierare för filer i boken. De flesta metoder på behållarobjektet arbetar med namn. Namn är alltid i NFC unicode normalformen

source: Clones: the container object supports efficient on-disk cloning, which is used to implement checkpoints in the ebook editor. In order to make this work, you should never access files on the filesystem directly. Instead, use :meth:`raw_data` or :meth:`open` to read/write to component files in the book.
sv: Kloner: behållarobjektet stödjer effektiva on-disk kloning, som används för att implementera kontrollpunkter i e-bokeditorn. För att göra detta arbete, bör du aldrig komma åt filer på filsystemet direkt. Istället används :meth:`raw_data` eller :meth:` open` att läsa / skriva till komponentfiler i boken.

source: When converting between hrefs and names use the methods provided by this class, they assume all hrefs are quoted.
sv: När du konverterar mellan hrefs och namn använd de metoder som denna klass tillhandahåller, de antar att alla hrefs är i citattecken.

source: Convert an absolute path to a canonical name relative to :attr:`root`
sv: Konvertera en absolut sökväg till en kanoniskt namn i förhållande till :attr:`root`

source: The base directory. By default the root for this container object is used.
sv: Baskatalogen. Som standard används roten till detta behållarobjekt.

source: Add a file to this container. Entries for the file are automatically created in the OPF manifest and spine (if the file is a text document)
sv: Lägg en fil till denna behållare. Posten för filen skapas automatiskt i OPF manifestet och ryggrad (om filen är ett textdokument)

source: Add an entry to the manifest for a file with the specified name. Returns the manifest id.
sv: Lägg till en post i manifestet för en fil med det angivna namnet. Returnerar manifestet id.

source: The type of book (epub for EPUB files and azw3 for AZW3 files)
sv: Typen av bok (epub för EPUB-filer och azw3 för AZW3 filer)

source: Commit all dirtied parsed objects to the filesystem and write out the ebook file at outpath. :param output: The path to write the saved ebook file to. If None, the path of the original book file is used. :param keep_parsed: If True the parsed representations of committed items are kept in the cache.
sv: Överlämna alla nedsmutsade tolkade objekt till filsystemet och skriver ut e-boksfilen på :param output: Sökvägen att skriva den sparade e-boksfilen till. Om None, är sökvägen till den ursprungliga bokfilen som används. :param keep_parsed: Om Sann hålls tolkade representationer av engagerade poster i buffertminnet.

source: Commit a parsed object to disk (it is serialized and written to the underlying file). If ``keep_parsed`` is True the parsed representation is retained in the cache. See also: :meth:`parsed`
sv: Överlämnar ett tolkat objekt till disken (det är serialiserade och skrivs till den underliggande fil). Om ``keep_parsed`` är Sann behålls den tolkade representationen i bufferten. Se också: :meth:`parsed`

source: Automatically decode ``data`` into a ``unicode`` object.
sv: Automatiskt avkoda ``data`` in i ett ``unicode`` objekt.

source: Normalize returned unicode to the NFC normal form as is required by both the EPUB and AZW3 formats.
sv: Normalisera tillbaka unicode till NFC normalform som krävs av både EPUB och AZW3 format.

source: Mark the parsed object corresponding to name as dirty. See also: :meth:`parsed`.
sv: Markera analyserad objekt som motsvarar namnet som smutsiga. Se även: :meth:`parsed`.

source: True iff a file corresponding to the canonical name exists. Note that this function suffers from the limitations of the underlying OS filesystem, in particular case (in)sensitivity. So on a case insensitive filesystem this will return True even if the case of name is different from the case of the underlying filesystem file. See also :meth:`has_name`
sv: Sann om en fil som motsvarar det kanoniska namn som finns. Observera att denna funktion lider av begränsningarna i det underliggande operativsystemets filsystemet, i särskilda fall (i) känsligheten. Så ifall okänsligt filsystem kommer tillbaka gäller även om det rör sig om namn skiljer sig från fallet med den underliggande filsystemet filen. Se även :meth:`has_name`

source: Return the size in bytes of the file represented by the specified canonical name. Automatically handles dirtied parsed objects. See also: :meth:`parsed`
sv: Returnera storlek i oktetter av filen som representeras av det angivna kanoniska namnet. Automatiskt hanterar smutsiga tolkade objekt. Se även: :met:'parsed`

source: Add an item to the manifest with href derived from the given name. Ensures uniqueness of href and id automatically. Returns generated item.
sv: Lägg till ett objekt i manifestetet med href som härrör från förnamnet. Säkerställer unika href och id automatiskt. Returnerar genererade objekt.

source: Return the expected mimetype for the specified file name based on its extension.
sv: Returnera de förväntade mimetype för den angivna filnamnet baserat på dess ändelse.

source: Mapping of guide type to canonical name
sv: Översättning styr guidetyp till kanoniskt namn

source: Return True iff a file with the same canonical name as that specified exists. Unlike :meth:`exists` this method is always case-sensitive.
sv: Return true om en fil med samma kanoniska namn som angetts existerar. Till skillnad :meth:`exists` denna metod är alltid små och stora bokstäver.

source: Convert an href (relative to base) to a name. base must be a name or None, in which case self.root is used.
sv: Konvertera en href (i förhållande till bas) till ett namn. basen måste vara ett namn eller None, i vilket fall self.root används.

source: Insert item into parent (or append if index is None), fixing indentation. Only works with self closing items.
sv: Infoga objekt i förälder (eller lägga om index är None), fastställande indrag. Fungerar endast med självstängande objekt.

source: Iterate over all links in name. If get_line_numbers is True the yields results of the form (link, line_number, offset). Where line_number is the line_number at which the link occurs and offset is the number of characters from the start of the line. Note that offset could actually encompass several lines if not zero.
sv: Iterera över alla länkar i namnet. Om get_line_numbers är Sann ger det resultat i form (länk, line_number, offset). Där line_number är line_number där länken förekommer och offset är antalet tecken från början av raden. Observera att offset kan faktiskt omfatta flera rader om inte noll.

source: Return True if the manifest has an entry corresponding to name
sv: Returnar True om manifestet har en post som motsvarar namnet

source: Mapping of manifest id to canonical names
sv: Översättning av manifest id till kanoniska namn

source: Mapping of manifest media-type to list of canonical names of that media-type
sv: Översättnig av manifest mediatyp till lista av kanoniska namn av den mediatypen

source: The metadata of this book as a Metadata object. Note that this object is constructed on the fly every time this property is requested, so use it sparingly.
sv: Metadatat som ett metadataobjekt av denna bok. Observera att detta objekt är konstruerad i farten varje gång den här egenskapen begärs, så använd den sparsamt.

source: Convert a canonical name to an absolute OS dependant path
sv: Konvertera ett kanoniskt namn till en absolut OS-beroende sökväg

source: Convert a name to a href relative to base, which must be a name or None in which case self.root is used as the base
sv: Konvertera ett namn till en href förhållande till basen, som måste vara ett namn eller None i vilket fall self.root används som bas

source: Set of names that must never be renamed. Depends on the ebook file format.
sv: Uppsättning med namn som aldrig få byta nytt namn. Beror på e-bokformat.

source: Set of names that must never be deleted from the container. Depends on the ebook file format.
sv: Uppsättning med namn som aldrig får tas bort från behållaren. Beror på e-bokformat.

source: Set of names that are allowed to be missing from the manifest. Depends on the ebook file format.
sv: Uppsättning av namn som får saknas i manifestet. Beror på e-bokformat.

source: Open the file pointed to by name for direct read/write. Note that this will commit the file if it is dirtied and remove it from the parse cache. You must finish with this file before accessing the parsed version of it again, or bad things will happen.
sv: Öppna filen som utpekas av namn för direkt läs / skriv. Observera att detta kommer att förkasta filen om den är smutsig och ta bort den från tolkningsbufferten. Du måste avsluta med den här filen innan du öppnar den tolkas versionen av den igen, eller dåliga saker kommer att hända.

source: The parsed OPF file
sv: Den analyserad OPF-filen

source: Convenience method to either return the first XML element with the specified name or create it under the opf:package element and then return it, if it does not already exist.
sv: Bekvämlig metod för att antingen returnera första XML-element med det angivna namnet eller skapar den under opf:package element och sedan lämna tillbaka den, om den inte redan finns.

source: The version set on the OPF's <package> element
sv: Den version som ställts in på OPF s <package> -elementet

source: Convenience method to evaluate an XPath expression on the OPF file, has the opf: and dc: namespace prefixes pre-defined.
sv: Bekväm metod för att beräkna ett XPath-uttryck på OPF-filen har fördefinierade opf: och dc:namespace prefix.

source: Return a parsed representation of the file specified by name. For HTML and XML files an lxml tree is returned. For CSS files a cssutils stylesheet is returned. Note that parsed objects are cached for performance. If you make any changes to the parsed object, you must call :meth:`dirty` so that the container knows to update the cache. See also :meth:`replace`.
sv: Returnerar en analyserad representation av den fil som anges med namn. För HTML och XML-filer returneras ett lxml träd. För CSS-filer returneras ett cssutils format. Observera att analyserat objekt mellanlagras för prestanda. Om du gör några ändringar i objekttolkningen måste du anropa :meth:`dirty` så att behållaren vet att bufferten ska uppdateras. Se även :meth:`replace`.

source: Return the raw data corresponding to the file specified by name
sv: Returnera rådata motsvarande filen som anges med namn

source: If True and the file has a text based mimetype, decode it and return a unicode object instead of raw bytes.
sv: Om Sann och filen har en textbaserad mimetype, avkoda den och returnera ett unicode-objekt i stället för råa oktetten.

source: If True the returned unicode object is normalized to the NFC normal form as is required for the EPUB and AZW3 file formats.
sv: Om Sann det returneras unicode objektet som är normaliserad till NFC normalform som krävs för EPUB- och AZW3-filformat.

source: Convert an absolute path (with os separators) to a path relative to base (defaults to self.root). The relative path is *not* a name. Use :meth:`abspath_to_name` for that.
sv: Konvertera en absolut sökväg (med os avskiljare) till en sökväg i förhållande till basen (standard att self.root). Den relativa sökvägen är *inte* ett namn. Använd :meth:`abspath_to_name` för detta.

source: Remove the specified items (by canonical name) from the spine. If ``remove_if_no_longer_in_spine`` is True, the items are also deleted from the book, not just from the spine.
sv: Ta bort de angivna objekten (av kanoniskt namn) från ryggraden. Om ``remove_if_no_longer_in_spine`` är Sann, tas även objekten bort från boken, inte bara från bokryggen.

source: Removes item from parent, fixing indentation (works only with self closing items)
sv: Tar bort objektet från förälder, fasta indrag (fungerar bara med självstängande artiklar)

source: Remove the item identified by name from this container. This removes all references to the item in the OPF manifest, guide and spine as well as from any internal caches.
sv: Ta bort objektet identifierat med namn från denna behållare. Detta tar bort alla referenser till objektet i OPF-manifestet, guide och bokrygg samt från eventuella interna buffertar.

source: Renames a file from current_name to new_name. It automatically rebases all links inside the file if the directory the file is in changes. Note however, that links are not updated in the other files that could reference this file. This is for performance, such updates should be done once, in bulk.
sv: Byter namn på en fil från current_name till NEW_NAME. Det automatiskt baserar om alla länkar inne i filen om katalogfilen har förändringar. Observera dock att länkar inte uppdateras i de övriga filer som kan referera den här filen. Detta är för prestanda, sådana uppdateringar ska göras en gång, i grupp.

source: Replace the parsed object corresponding to name with obj, which must be a similar object, i.e. an lxml tree for HTML/XML or a cssutils stylesheet for a CSS file.
sv: Byt analyserade objekt som motsvarar namn med obj, som måste vara ett liknande objekt, det vill säga en lxml-träd för HTML / XML eller cssutils formatmall för en CSS-fil.

source: Replace all links in name using replace_func, which must be a callable that accepts a URL and returns the replaced URL. It must also have a 'replaced' attribute that is set to True if any actual replacement is done. Convenient ways of creating such callables are using the :class:`LinkReplacer` and :class:`LinkRebaser` classes.
sv: Byt ut alla länkar i namn med replace_func, vilket måste vara en anropsbar som accepterar en URL och returnerar den utbytta URL. Den måste också ha en "ersatt" attribut som är satt till Sann om någon faktisk ersättning görs. Praktiska sätt att skapa sådana anropbara använd :class:`LinkReplacer` och :class:`LinkRebaser` klasser.

source: Convert a parsed object (identified by canonical name) into a bytestring. See :meth:`parsed`.
sv: Konvertera en analyserat objekt (identifieras av kanoniskt namn) i en oktettsträng. Se :meth:`parsed`.

source: Set the spine to be spine_items where spine_items is an iterable of the form (name, linear). Will raise an error if one of the names is not present in the manifest.
sv: Ställ in bokryggen att vara spine_items där spine_items visas som en iterabel av formen (namn, linjär). Kommer ge ett felmeddelande om ett av namnen finns inte i manifestet.

source: An iterator yielding canonical name for every item in the books' spine. See also: :attr:`spine_iter` and :attr:`spine_items`.
sv: En iterator som ger kanoniskt namn för varje post i bokens rygg. Se även: :attr:`spine_iter` och :attr:`spine_iter`.

source: An iterator that yields item, name is_linear for every item in the books' spine. item is the lxml element, name is the canonical file name and is_linear is True if the item is linear. See also: :attr:`spine_names` and :attr:`spine_items`.
sv: En iterator som ger posten, namn is_linear för varje post i bokens rygg. Posten är lxml elementet, som har det kanoniska filnamnet och is_linear är Sann om objektet är linjärt. Se även: :attr:`spine_names` och :attr:`spine_items`.

source: An iterator yielding name and is_linear for every item in the books' spine. See also: :attr:`spine_iter` and :attr:`spine_items`.
sv: En iterator som ger namn och is_linear för varje post i bokens rygg. Se även: :attr:`spine_iter` and :attr:`spine_items`.

source: Managing component files in a container
sv: Hantera komponentfiler i en behållare

source: Replace links to files in the container. Will iterate over all files in the container and change the specified links in them.
sv: Byt länkar till filer i behållaren. Kommer iterera över alla filer i behållaren och ändra de angivna länkar i dem.

source: A mapping of old canonical name to new canonical name. For example: :code:`{'images/old.png': 'images/new.png'}`
sv: En översättning av kanoniska namn till nya kanoniska namn. Till exempel: :code:`{'images/old.png': 'images/new.png'}`

source: A callable that takes two arguments ``(name, anchor)`` and returns a new anchor. This is useful if you need to change the anchors in HTML files. By default, it does nothing.
sv: Ett anropbart som tar två argument ``(namn, ankare)`` och returnerar ett nytt ankare. Detta är användbart om du behöver ändra ankare i HTML-filer. Som standard gör det ingenting.

source: If False, links are not replaced in the OPF file.
sv: Om Falsk, ersätts inte länkar i OPF-filen.

source: Rename files in the container, automatically updating all links to them.
sv: Byt namn på filer i behållaren, automatiskt uppdatera alla länkar till dem.

source: A mapping of old canonical name to new canonical name, for example: :code:`{'text/chapter1.html': 'chapter1.html'}`.
sv: En översättning av gamla kanoniska namn till nya kanoniska, till exempel: :code:`{'text/chapter1.html': 'chapter1.html'}`.

source: Return the folders that are recommended for the given filenames. The recommendation is based on where the majority of files of the same type are located in the container. If no files of a particular type are present, the recommended folder is assumed to be the folder containing the OPF file.
sv: Returnerar mapparna som rekommenderas för de givna filnamnen. Rekommendationen är baserad på var majoriteten av filer av samma typ finns i behållaren. Om inga filer av en viss typ är närvarande, antas den rekommenderade mappen vara den mapp som innehåller OPF-filen.

source: Pretty printing and auto fixing parse errors
sv: Fin utskrift och automatisk reparation av tolkningsfel

source: Fix any parsing errors in the HTML represented as a string in raw. Fixing is done using the HTML5 parsing algorithm.
sv: Åtgärda eventuella tolkningsfel i HTML representeras som en råsträng. Åtgärd görs med HTML5 tolkningsalgoritmen.

source: Fix any parsing errors in all HTML files in the container. Fixing is done using the HTML5 parsing algorithm.
sv: Åtgärda eventuella tolkningsfel i alla HTML-filer i containern. Åtgärd görs med HTML5 tolkningsalgoritmen.

source: Pretty print the HTML represented as a string in raw
sv: Fin utskrift HTML representeras som en råsträng

source: Pretty print the CSS represented as a string in raw
sv: Fin utskrift CSS representerad som en råsträng

source: Pretty print the XML represented as a string in raw. If ``name`` is the name of the OPF, extra OPF-specific prettying is performed.
sv: Fin utskrift XML representeras som en råsträng. Om ``name`` är namnet på OPF, är extra OPF-specifik försköning utförs.

source: Pretty print all HTML/CSS/XML files in the container
sv: Fin utskrift alla HTML / CSS / XML-filer i behållaren

source: Managing book jackets
sv: Hantera bokomslag

source: Remove an existing jacket, if any. Returns False if no existing jacket was found.
sv: Ta bort ett befintligt skyddsomslag, om något. Returnerar Falsk om inget befintligt skyddsomslag hittades.

source: Either create a new jacket from the book's metadata or replace an existing jacket. Returns True if an existing jacket was replaced.
sv: Antingen skapa ett nytt omslag från bokens metadata eller ersätta en befintligt omslag. Returnerar Sann om ett befintligt omslag ersattes.

source: Splitting and merging of files
sv: Delning och sammanslagning av filer

source: Split the file specified by name at the position specified by loc_or_xpath. Splitting automatically migrates all links and references to the affected files.
sv: Dela upp filen som anges med namn vid den position som anges av loc_or_xpath. Uppdelning migrerar automatiskt alla länkar och referenser till de berörda filerna.

source: Should be an XPath expression such as //h:div[@id="split_here"]. Can also be a *loc* which is used internally to implement splitting in the preview panel.
sv: Bör vara ett XPath-uttryck som //h:div[@id="split_here"]. Kan också vara en *loc* som används internt för att genomföra uppdelningen i förhandsvisningspanelen.

source: If True the split occurs before the identified element otherwise after it.
sv: Om Sann sker uppdelningen innan det identifierade elementet annars efter det.

source: Used internally
sv: Används internt

source: Split the specified file at multiple locations (all tags that match the specified XPath expression. See also: :func:`split`. Splitting automatically migrates all links and references to the affected files.
sv: Dela den angivna filen på flera platser (alla etiketter som passar det angivna XPath-uttrycket Se också: :func:`split` Delning migrerar automatiskt alla länkar och referenser till de berörda filerna

source: If True the splits occur before the identified element otherwise after it.
sv: Om Sann sker uppdelningar innan det identifierade elementet annars efter det.

source: Merge the specified files into a single file, automatically migrating all links and references to the affected files. The file must all either be HTML or CSS files.
sv: Slå ihop de angivna filerna till en enda fil, automatiskt migrera alla länkar och referenser till de berörda filerna. Alla filet måste vara antingen HTML eller CSS-filer.

source: Must be either ``'text'`` for HTML files or ``'styles'`` for CSS files
sv: Måste vara antingen ``'text'`` för HTML-filer eller ``'styles'`` för CSS-filer

source: The list of files to be merged
sv: Listan över filer som ska slås samman

source: Which of the merged files is the *master* file, that is, the file that will remain after merging.
sv: Vilken av de sammanslagna filer är *huvud* -fil, som är den fil som kommer att finnas kvar efter sammanslagning.

source: Managing covers
sv: Hanterar omslag
