Repository: Easonqsp/calibre-translations
Catalog: manual/*/polish.po
Languages: sv

source: Set the cover of the book to the image pointed to by cover_path.
sv: Ställ in omslaget till boken till den bild som utpekas av cover_path.

source: Either the absolute path to an image file or the canonical name of an image in the book. When using an image in the book, you must also set options, see below.
sv: Antingen den absoluta sökvägen till en bildfil eller kanoniska namn på en bild i boken. När du använder en bild i boken, måste du också ställa in alternativ, se nedan.

source: An optional callable that takes a single argument. It will be called with information about the tasks being processed.
sv: En valfri anropsbar som tar ett enda argument. Det kommer att kallas med information om de uppgifter som behandlas.

source: None or a dictionary that controls how the cover is set. The dictionary can have entries: **keep_aspect**: True or False (Preserve aspect ratio of covers in EPUB) **no_svg**: True or False (Use an SVG cover wrapper in the EPUB titlepage) **existing**: True or False (``cover_path`` refers to an existing image in the book)
sv: Ingen eller en ordlista som styr hur omslaget sätts in. Ordlistan kan ha poster: **keep_aspect**: Sann eller Falsk (Bevara bildförhållande på omslag i EPUB) **no_svg**: Sann eller Falsk (Använd en SVG omslagshölje i EPUB Titeln) **befintliga**: Sann eller Falsk (`` cover_path`` refererar till en befintlig bild i boken)

source: Mark the specified image as the cover image.
sv: Markera den angivna bilden som omslagsbild.

source: Mark the specified HTML file as the titlepage of the EPUB.
sv: Markera den angivna HTML-filen som Titel av EPUB.

source: If True the HTML file is moved to the start of the spine
sv: Om Sann HTML-filen flyttas till början av ryggen

source: Working with CSS
sv: Att arbeta med CSS

source: Change a font family from old_name to new_name. Changes all occurrences of the font family in stylesheets, style tags and style attributes. If the old_name refers to an embedded font, it is removed. You can set new_name to None to remove the font family instead of changing it.
sv: Ändra ett typsnitt familj från old_name att NEW_NAME. Ändrar alla förekomster av typsnittet i stilmallar, formatetiketter och stilattribut. Om old_name avser ett inbäddat teckensnitt, tas det bort. Du kan ställa NEW_NAME till None för att ta bort typsnittet i stället för att ändra det.

source: Remove all unused CSS rules from the book. An unused CSS rule is one that does not match any actual content.
sv: Ta bort alla oanvända CSS-regler från boken. En oanvänd CSS-regel är en som inte passar allt materiellt innehåll.

source: An optional callable that takes a single argument. It is called with information about the operations being performed.
sv: En valfri anropsbar som tar ett enda argument. Det kallas med information om den verksamhet som utförs.

source: If True, class attributes in the HTML that do not match any CSS rules are also removed.
sv: Om Sann, klassattribut i HTML som inte passar några CSS-regler tas också bort.

source: Remove the specified CSS properties from all CSS rules in the book.
sv: Ta bort de angivna CSS-egenskaperna från alla CSS-regler i boken.

source: Set of properties to remove. For example: :code:`{'font-family', 'color'}`.
sv: Uppsättning av egenskaper för att ta bort. Till exempel: :code:`{'font-family', 'color'}`.

source: The files from which to remove the properties. Defaults to all HTML and CSS files in the book.
sv: Filerna som att ta bort egenskaper. Standardvärden för alla HTML- och CSS-filer i boken.

source: Working with the Table of Contents
sv: Arbetar med innehållsförteckning

source: Generate a Table of Contents from a list of XPath expressions. Each expression in the list corresponds to a level of the generate ToC. For example: :code:`['//h:h1', '//h:h2', '//h:h3']` will generate a three level table of contents from the ``<h1>``, ``<h2>`` and ``<h3>`` tags.
sv: Generera en innehållsförteckning från en lista med XPath-uttryck. Varje uttryck i listan motsvarar en nivå av den genererade innehållsförteckningen. Till exempel: :code:`['//h:h1', '//h:h2', '//h:h3']` kommer att generera en trenivåers innehållsförteckning från ``<h1>``, ``<h2>`` and ``<h3>`` etiketter.

source: Generate a Table of Contents from links in the book.
sv: Generera innehållsförteckning från länkar i boken.

source: Generate a Table of Contents from files in the book.
sv: Generera innehållsförteckning från filer i boken.

source: Create an inline (HTML) Table of Contents from an existing NCX table of contents.
sv: Skapa en infogad (HTML) Innehållsförteckning från en befintlig NCX innehållsförteckning.

source: The title for this table of contents.
sv: Titel för denna innehållsförteckning.

source: Edit Book Tool
sv: Bokredigeringsverktyg

source: Bases: :class:`object`
sv: Bas: :class:`object`

source: The base class for individual tools in an Edit Book plugin. Useful members include:
sv: Basklass för enskilda verktyg i ett bokredigeringstillägg. Användbara medlemmar är:

source: ``self.plugin``: A reference to the :class:`calibre.customize.Plugin` object to which this tool belongs.
sv: ``self.plugin``: En referens till: :class:`calibre.customize.Plugin` objekt till vilket detta verktyg tillhör.

source: Methods that must be overridden in sub classes:
sv: Metoder som måste bli ersatta i underklasser:

source: Set this to a unique name it will be used as a key
sv: Ställ in detta till ett unikt namn det kommer att användas som en nyckel

source: If True the user can choose to place this tool in the plugins toolbar
sv: Om Sann användaren kan välja att placera detta verktyg i tilläggsverktygsfältet

source: If True the user can choose to place this tool in the plugins menu
sv: Om Sann användaren kan välja att placera detta verktyg i tilläggsmenyn

source: The popup mode for the menu (if any) of the toolbar button. Possible values are 'delayed', 'instant', 'button'
sv: Rullgardinsläget för menyn (om någon) på knappen i verktygsfältet. Möjliga värden är "fördröjt", "snabb", "knappen"

source: The :class:`calibre.gui2.tweak_book.boss.Boss` object. Used to control the user interface.
sv: :class:`calibre.gui2.tweak_book.boss.Boss` objektet. Används för att styra användargränssnittet.

source: The main window of the user interface
sv: Huvudfönstret i användargränssnittet

source: Return the current :class:`calibre.ebooks.oeb.polish.container.Container` object that represents the book being edited.
sv: Returnera nuvarande :class:`calibre.ebooks.oeb.polish.container.Container` objekt som representerar boken som redigeras.

source: Register a keyboard shortcut that will trigger the specified ``qaction``. This keyboard shortcut will become automatically customizable by the user in the Keyboard section of the editor preferences.
sv: Registrera ett kortkommando som utlöser den angivna ``qaction``. Detta kortkommandot blir automatiskt anpassningsbart av användaren i avsnittet Tangentbord av editorinställningar.

source: A QAction object, it will be triggered when the configured key combination is pressed by the user.
sv: En QAction objekt kommer det att utlösas när den konfigurerade tangentkombinationen trycks av användaren.

source: A unique name for this shortcut/action. It will be used internally, it must not be shared by any other actions in this plugin.
sv: Ett unikt namn för genvägen / åtgärd. Den kommer att användas internt, får den inte delas av några andra åtgärder i detta tillägg.

source: A list of the default keyboard shortcuts. If not specified no default shortcuts will be set. If the shortcuts specified here conflict with either builtin shortcuts or shortcuts from user configuration/other plugins, they will be ignored. In that case, users will have to configure the shortcuts manually via Preferences. For example: ``default_keys=('Ctrl+J', 'F9')``.
sv: En lista över standardtangentbordsgenvägarna. Om inget anges kommer inga standardgenvägar att fastställas. Om genväg anges här konflikt med antingen inbyggda genvägar och genvägar från användarkonfigurations / andra tillägg, kommer de att ignoreras. I så fall kommer användarna att behöva anpassa snabb manuellt via Inställningar. Till exempel: ``default_keys = ('Ctrl+J","F9")``.

source: An optional short description of this action. If not specified the text from the QAction will be used.
sv: En valfri kort beskrivning av denna åtgärd. Om inte angivet kommer texten från QAction att användas.

source: An optional longer description of this action, it will be used in the preferences entry for this shortcut.
sv: En valfri längre beskrivning av denna åtgärd, det kommer att användas i inställningsposten för den här genvägen.

source: Create a QAction that will be added to either the plugins toolbar or the plugins menu depending on ``for_toolbar``. For example::
sv: Skapa en QAction som kommer att läggas till antingen tilläggets verktygsfält eller tilläggets meny beroende på ``for_toolbar``. Till exempel::

source: Method :meth:`register_shortcut`.
sv: Metod :meth:`register_shortcut`.

source: Controlling the editor's user interface
sv: Styr editorns användargränssnitt

source: The ebook editor's user interface is controlled by a single global *Boss* object. This has many useful methods that can be used in plugin code to perform common tasks.
sv: E-bokeditorns användargränssnitt styrs av ett enda global *Boss* objekt. Detta har många användbara metoder som kan användas i tilläggskod för att utföra vanliga uppgifter.

source: Create a restore checkpoint with the name specified as ``msg``
sv: Skapa en återställningskontrollpunkt med det namn som anges som ``msg``

source: Update all the components of the user interface to reflect the latest data in the current book container.
sv: Uppdatera alla komponenter i användargränssnittet för att återspegla de senaste data i den aktuella bokbehållaren.

source: If True, the book will be marked as modified, so the user will be prompted to save it when quitting.
sv: Om Sann, kommer boken att markeras som ändrad, så att användaren uppmanas att spara den när du avslutar.

source: Close the editor that is editing the file specified by ``name``
sv: Stäng editorn som redigerar filen som anges av ``namn``

source: Commit any changes that the user has made to files open in editors to the container. You should call this method before performing any actions on the current container
sv: Utför eventuella ändringar som användaren har gjort i filer öppnas i editorn till behållaren. Du bör anropa den här metoden innan du utför några åtgärder på den aktuella behållaren

source: Return the name of the file being edited currently or None if no file is being edited
sv: Returnamnet på filen som redigeras för närvarande eller None om ingen fil redigeras

source: Open the file specified by name in an editor
sv: Öppna filen som namnges i en editor

source: The media type of the file, for example, ``'text/html'``. If not specified it is guessed from the file extension.
sv: Mediatypen för filen, till exempel, ``'text/html'``. Om inget anges det gissas den från filändelsen.

source: A template to initialize the opened editor with
sv: En mall för att initiera öppnade editorn med

source: Open the ebook at ``path`` for editing. Will show an error if the ebook is not in a supported format or the current book has unsaved changes.
sv: Öppna e-bok på ``sökväg`` för redigering. Kommer att visa ett fel om e-boken inte är i ett format som stöds eller den aktuella boken har osparade ändringar.

source: The name of a file inside the newly opened book to start editing. Can also be a list of names.
sv: Namnet på en fil inne i den nyöppnade boken för att börja redigera. Kan också vara en lista med namn.

source: Undo the previous creation of a restore checkpoint, useful if you create a checkpoint, then abort the operation with no changes
sv: Ångra föregående skapande en återställningskontrollpunkt, användbart om du skapar en kontrollpunkt, sedan avbryta med inga ändringar

source: Save the book. Saving is performed in the background
sv: Spara boken. Sparning utförs i bakgrunden

source: Mark the book as having been modified
sv: Markera boken som har modifierats

source: Show the changes to the book from its last checkpointed state
sv: Visa ändringarna i boken från sitt senaste kontrollpunktstillstånd

source: If True the diff dialog will have a button to allow the user to revert all changes
sv: Om Sann kommer skillnadsdialogrutan att ha en knapp för att göra det möjligt för användaren att återställa alla förändringar

source: A container object to compare the current container to. If None, the previously checkpointed container is used
sv: En behållarobjekt för att jämföra den aktuella behållaren till. Om None är det tidigare kontrollspunktsbehållare som används

source: Show the editor that is editing the file specified by ``name``
sv: Visa editorn som redigerar filen som anges av ``namn``

source: Sync the position of the preview panel to the current cursor position in the current editor
sv: Synkronisera position av förhandsvisningspanelen till den aktuella markörpositionen i den aktuella editorn
