Repository: Easonqsp/calibre-translations
Catalog: manual/*/regexp.po
Languages: es, fr

source: All about using regular expressions in calibre
es: Todo acerca de cómo utilizar expresiones regulares en calibre

source: Regular expressions are features used in many places in calibre to perform sophisticated manipulation of ebook content and metadata. This tutorial is a gentle introduction to getting you started with using regular expressions in calibre.
es: Las expresiones regulares son funciones utilizadas en muchos lugares en calibre para llevar a cabo sofisticadas manipulaciones de contenido y metadatos de libros electrónicos. Este cursillo es una breve introducción al uso de expresiones regulares en calibre.

source: Contents
es: Índice
fr: Contenu

source: First, a word of warning and a word of courage
es: Primero, una advertencia y unas palabras de aliento
fr: Tout d'abord, un mot d'avertissement et un mot d'encouragement

source: This is, inevitably, going to be somewhat technical- after all, regular expressions are a technical tool for doing technical stuff. I'm going to have to use some jargon and concepts that may seem complicated or convoluted. I'm going to try to explain those concepts as clearly as I can, but really can't do without using them at all. That being said, don't be discouraged by any jargon, as I've tried to explain everything new. And while regular expressions themselves may seem like an arcane, black magic (or, to be more prosaic, a random string of mumbo-jumbo letters and signs), I promise that they are not all that complicated. Even those who understand regular expressions really well have trouble reading the more complex ones, but writing them isn't as difficult- you construct the expression step by step. So, take a step and follow me into the rabbit hole.
es: Esto, inevitablemente, va a ser un poco técnico, después de todo, las expresiones regulares son una herramienta técnica para hacer cosas técnicas. Voy a tener que usar una jerga y conceptos que pueden parecer complicados o enrevesados. Voy a tratar de explicar esos conceptos tan claramente como pueda, pero realmente no puedo hacerlo sin utilizarlos en absoluto. Dicho esto, no se desanime por la jerga según intento explicar las cosas nuevas. Y mientras que las expresiones regulares en sí pueden parecer cosa magia negra y arcana (o, siendo más prosaicos, una serie aleatoria de letras y signos sin sentido), le aseguro que no son tan complicadas. Incluso los que entienden las expresiones regulares muy bien tienen problemas para leer las más complejas, pero escribirlas no es tan difícil: se va construyendo la expresión paso a paso. Dicho esto, dé el primer paso y sígame en la madriguera.
fr: Ceci est, inévitablement, en train de devenir quelque peu technique- après tout, les expressions régulières sont des outils techniques pour faire une chose technique. Je vais devoir utiliser un certain jargon et des concepts qui peuvent sembler compliqués ou alambiqués. Je vais essayer d'expliquer ces concepts aussi clairement que je peux, mais je ne peux vraiment pas le faire sans les utiliser du tout.. Cela veut dire, ne soyez pas découragé par un tel jargon, comme j'ai essayé d'expliquer tout ce qui est nouveau. Et alors que les expressions régulières en elles mêmes peuvent paraître comme une arcane, de la magie noire (ou, pour être plus prosaïque, une chaîne aléatoire d'un charabia de lettres et de signes). Je promets qu'elles n'ont pas toutes cette complication. Même ceux qui comprennent bien les expressions régulières ont des difficultés à lire les plus complexes, mais les écrire n'est pas une difficulté- vous construisez l'expression pas à pas. Aussi, faites un pas et suivez moi dans le trou du lapin.

source: Where in calibre can you use regular expressions?
es: ¿Dónde puedo utilizar expresiones regulares en calibre?

source: There are a few places calibre uses regular expressions. There's the Search & Replace in conversion options, metadata detection from filenames in the import settings and Search & Replace when editing the metadata of books in bulk.
es: Son pocos los lugares donde calibre utiliza expresiones regulares. Están en Buscar y reemplazar en las opciones de conversión, en la detección de metadatos desde los nombres de archivo en los ajustes de importación y en Buscar & Reemplazar al editar los metadatos de los libros en forma masiva.

source: What on earth *is* a regular expression?
es: ¿Pero qué *es* una expresión regular?
fr: Que diable *est* une expression régulière ?

source: A regular expression is a way to describe sets of strings. A single regular expression can *match* a number of different strings. This is what makes regular expression so powerful -- they are a concise way of describing a potentially large number of variations.
es: Una expresión regular es una manera de describir conjuntos de cadenas de texto. Una sola expresión regular puede hacer *coincidir* una serie de diferentes cadenas. Esto es lo que hace tan poderosa una expresión regular - son una forma concisa de describir un número potencialmente elevado de variaciones.
fr: Une expression régulière est une manière de décrire des ensembles de chaînes. Une expression régulière simple peut *correspondre* à un nombre différent de chaînes. C'est ce qui fait les expressions régulières si puissantes -- elles sont une manière concise de décrire un nombre potentiellement grand de variations.

source: I'm using string here in the sense it is used in programming languages: a string of one or more characters, characters including actual characters, numbers, punctuation and so-called whitespace (linebreaks, tabulators etc.). Please note that generally, uppercase and lowercase characters are not considered the same, thus "a" being a different character from "A" and so forth. In calibre, regular expressions are case insensitive in the search bar, but not in the conversion options. There's a way to make every regular expression case insensitive, but we'll discuss that later. It gets complicated because regular expressions allow for variations in the strings it matches, so one expression can match multiple strings, which is why people bother using them at all. More on that in a bit.
es: Estoy usando cadena aquí en el sentido de cómo es utilizado en los lenguajes de programación: una cadena de uno o más caracteres, caracteres incluyendo caracteres reales, números, puntuacion y los llamados espacios en blanco (tabuladores, saltos de línea, etc.). Por favor, tenga en cuenta que en general, los caracteres en mayúsculas y minúsculas no se consideran iguales, por lo tanto "a" es diferente de "A" y así sucesivamente. En calibre, las expresiones regulares no distinguen mayúsculas y minúsculas en la barra de búsqueda, pero si en las opciones de conversión. Hay una manera de hacer que todos los casos de expresiones regulares sean insensibles a las mayúsculas y minúsculas, pero hablaremos de eso más tarde. Así se complica porque las expresiones regulares permiten variaciones en las cadenas que coincide, por lo que una expresión pueden coincidir varias cadenas, y el por qué las personas se fastidian al usarlas. Más sobre esto en un momento.

source: Care to explain?
es: ¿Me lo puede explicar?
fr: Prendre soin d'expliquer ?

source: Well, that's why we're here. First, this is the most important concept in regular expressions: *A string by itself is a regular expression that matches itself*. That is to say, if I wanted to match the string ``"Hello, World!"`` using a regular expression, the regular expression to use would be ``Hello, World!``. And yes, it really is that simple. You'll notice, though, that this *only* matches the exact string ``"Hello, World!"``, not e.g. ``"Hello, wOrld!"`` or ``"hello, world!"`` or any other such variation.
es: Bueno, es por eso que estamos aquí. En primer lugar, este es el concepto más importante en las expresiones regulares: *Una cadena por sí misma es una expresión regular que coincide así misma*. Es decir, si yo quería que coincida la cadena ``"¡Hola, mundo!"`` utilizando una expresión regular, la misma sería ``Hola, mundo!''. Y sí, realmente es así de simple. Se dará cuenta, sin embargo, que esto *sólo* coincide con la cadena exacta ``"¡Hola, mundo!"``, no por ejemplo ``"¡Hola, mUndo!"`` u ``"hola, mundo!"`` o cualquier otra variación.
fr: Bien, c'est ce pourquoi nous sommes ici. D'abord, c'est le concept le plus important dans les expressions régulières : *Une chaîne en-soi est une expression régulière qui correspond à elle même*. Ceci est pour dire, si je voulais faire correspondre la chaîne ``"Hello, World!"`` en utilisant une expression régulière, l'expression régulière à utiliser devra être ``"Hello, World!"``. Et oui, c'est vraiment aussi simple. Vous noterez, cependant, que cela correspond *uniquement* à la chaîne exacte ``"Hello, World!"``, pas par ex. à ``"Hello, wOrld!"`` ou à ``"hello, world!"`` ou à n'importe quelle autre variation.

source: That doesn't sound too bad. What's next?
es: No suena tan mal. ¿Qué viene después?
fr: Cela ne semble pas trop mauvais. Quelle est la suite ?

source: Next is the beginning of the really good stuff. Remember where I said that regular expressions can match multiple strings? This is were it gets a little more complicated. Say, as a somewhat more practical exercise, the ebook you wanted to convert had a nasty footer counting the pages, like "Page 5 of 423". Obviously the page number would rise from 1 to 423, thus you'd have to match 423 different strings, right? Wrong, actually: regular expressions allow you to define sets of characters that are matched: To define a set, you put all the characters you want to be in the set into square brackets. So, for example, the set ``[abc]`` would match either the character "a", "b" or "c". *Sets will always only match one of the characters in the set*. They "understand" character ranges, that is, if you wanted to match all the lower case characters, you'd use the set ``[a-z]`` for lower- and uppercase characters you'd use ``[a-zA-Z]`` and so on. Got the idea? So, obviously, using the expression ``Page [0-9] of 423`` you'd be able to match the first 9 pages, thus reducing the expressions needed to three: The second expression ``Page [0-9][0-9] of 423`` would match all two-digit page numbers, and I'm sure you can guess what the third expression would look like. Yes, go ahead. Write it down.
es: El siguiente es el principio de cosas realmente buenas. ¿Recuerda cuando dije que las expresiones regulares pueden coincidir varias cadenas? Aquí se pone un poco más complicado. Digamos, como un ejercicio un poco más práctico, el libro electrónico que quería convertir tenía un desagradable pie de página contando las páginas, como "Página 5 de 423". Obviamente el número de página se elevaría de 1 a 423, así que tendría que coincidir con 423 cadenas diferentes, ¿no? Equivocado: las expresiones regulares permiten definir conjuntos de caracteres que coinciden: para definir un conjunto, disponga de todos los caracteres que desea que estén en el conjunto entre corchetes. Así, por ejemplo, el conjunto ``[abc]`` coincidirían el carácter "a", "b" o "c". *Los conjuntos solo coincidirán uno de los caracteres del conjunto*. Ellos "entienden" rangos de caracteres, es decir, si se quería hacer coincidir todos los caracteres en minúsculas, tendrá que utilizar el conjunto de minúsculas ``[az]`` y para mayúsculas tendría que utilizar ``[a-zA-Z]`` y así sucesivamente. ¿Comprendido? Así, obviamente, usando la expresión ``Página [0-9] de 423`` será capaz de seleccionar las primeras 9 páginas, reduciendo así las expresiones necesarias a tres. La segunda expresión ``Página [0-9] [0-9] de 423`` hará coincidir todos los números de página de dos dígitos, y estoy seguro que puede adivinar como la tercera expresión se vería. Sí, adelante. Escríbalo.
fr: La suite est le commencement des choses vraiment intéressantes. Vous souvenez-vous où j'ai dit que les expressions régulières peuvent correspondre à plusieurs chaînes ? C'est ce qui les rendaient un peu plus compliquées. Disons, comme une sorte d'exercice plus pratique, le livre numérique que vous vouliez convertir avait de méchantes notes de bas de page comptant les pages, comme "Page 5 de 423". Evidemment le nombre de pages devrait augmenter de 1 à 423, donc vous devriez avoir à faire correspondre 423 chaînes, juste ? Mauvais, actuellement : les expressions régulières vous permettent de définir un ensemble de caractères qui correspond : Pour définir un ensemble, vous mettez tous les caractères que vous voulez y voir figurer entre crochets. Aussi, par exemple, l'ensemble ``[abc]``devra correspondre soit au caractère "a", soit au "b" ou au "c". *Les ensembles correspondront toujours uniquement à un des caractères dans l'ensemble*, c'est à dire, si vous voulez faire correspondre tous les caractères minuscules, vous devrez utiliser l'ensemble ``[a-z]`` pour les caractères minuscules et majuscules vous devrez utiliser l'ensemble ``[a-zA-Z]`` et ainsi de suite. Vous voyez l'idée ? Ainsi, évidemment, en utilisant l'expression ``Page [0-9] de 423`` vous serez capable de correspondre aux 9 premières pages, donc par conséquent les expressions en ont besoin de trois : la seconde expression ``Page [0-9][0-9] de 423` correspondra aux numéros de pages à deux chiffres, et je suis sûr que vous pouvez deviner à quoi ressemblera la troisième expression. Oui, poursuivons. Mettez-la par écrit.

source: Hey, neat! This is starting to make sense!
es: Hey, hermano! ¡Esto está empezando a tener sentido!
fr: He, joli ! Cela commence à prendre sens !

source: I was hoping you'd say that. But brace yourself, now it gets even better! We just saw that using sets, we could match one of several characters at once. But you can even repeat a character or set, reducing the number of expressions needed to handle the above page number example to one. Yes, ONE! Excited? You should be! It works like this: Some so-called special characters, "+", "?" and "*", *repeat the single element preceding them*. (Element means either a single character, a character set, an escape sequence or a group (we'll learn about those last two later)- in short, any single entity in a regular expression.) These characters are called wildcards or quantifiers. To be more precise, "?" matches *0 or 1* of the preceding element, "*" matches *0 or more* of the preceding element and "+" matches *1 or more* of the preceding element. A few examples: The expression ``a?`` would match either "" (which is the empty string, not strictly useful in this case) or "a", the expression ``a*`` would match "", "a", "aa" or any number of a's in a row, and, finally, the expression ``a+`` would match "a", "aa" or any number of a's in a row (Note: it wouldn't match the empty string!). Same deal for sets: The expression ``[0-9]+`` would match *every integer number there is*! I know what you're thinking, and you're right: If you use that in the above case of matching page numbers, wouldn't that be the single one expression to match all the page numbers? Yes, the expression ``Page [0-9]+ of 423`` would match every page number in that book!
es: Esperaba que dijeras eso. Pero prepárate, ahora se pone aún mejor! Acabamos de ver que el uso de conjuntos, podríamos coincidir con uno de los varios caracteres a la vez. Pero incluso se puede repetir un carácter o conjunto, reduciendo el número de expresiones necesarias para manejar el ejemplo anterior de la numeración de página a uno. Sí, ¡UNO! ¿Emocionado? Funciona así: Algunos de los así llamados caracteres especiales, "+", "?" y "*", *repetir el elemento único precediéndolos*. (Elemento significa ya sea un único carácter, un conjunto de caracteres, una secuencia de escape o un grupo (vamos a aprender acerca de los últimos dos más tarde) - en resumen, cualquier entidad individual en una expresión regular) Estos caracteres son llamados comodines o cuantificadores. Para ser más precisos, "?" coincide *0 ó 1* del elemento anterior, "*" coincide *0 o más* del elemento anterior y "+" coincide *1 o más* del elemento anterior. Unos pocos ejemplos: La expresión ``a?`` coincidiría ya sea "" (que es una cadena vacía, no estrictamente útil en este caso) o "a", la expresión ``a*`` coincidiría con "", "a", "aa" o cualquier número de aes seguidas, y, finalmente, la expresión ``a+`` se correspondería con "a", "aa" o cualquier número de aes seguidas (Nota: no coincidiría la cadena vacía!). Igual trato para los conjuntos. La expresión ``[0-9]+`` coincidiría *todo número entero que exista*! Sé lo que está pensando, y tienes razón: si lo utiliza en el caso anterior de números de página coincidentes, ¿no que sea la única expresión que coincide con todos los números de página? Sí, la expresión ``Página [0-9] + de 423`` se correspondería con cada número de página de ese libro!
fr: J'espère que vous vous dites cela. Mais accrochez vous, maintenant cela va devenir meilleur ! Nous avons juste dis qu'en utilisant les ensembles, nous pouvons correspondre à un ou plusieurs caractères en une fois. Mais vous pouvez même répéter un caractère ou un ensemble, réduisant le nombres d'expressions nécessaires pour gérer l'exemple numéro de page ci dessus à une. Oui, UNE ! Enthousiaste ? Vous devriez l'être ! Cela fonctionne comme ceci : certains caractères qu'on appelle spéciaux, "+", "?" et "*", répète l'élément simple le précédant. (Élément signifie soit un caractère seul, un ensemble de caractères, une séquence d'échappement ou un groupe) (nous apprendrons au sujet de ces deux derniers plus tard)- en bref, n'importe quelle entité simple dans une expression régulière. Ces caractères sont appelés des caractères de remplacement ou des quantificateurs. Pour être plus précis, "?" correspond à *0 ou 1* de l'élément précédant, "*" correspond à *0 ou plus* de l'élément précédant et "+" correspond à *1 ou plus* de l'élément précédant. Quelques exemples : l'expression ``a?`` correspondrait soit à "" (qui est la chaîne vide, pas strictement utile dans ce cas) ou "a", l'expression "a*" correspondrait à "", "a", "aa" ou n'importe quel nombre de a dans une ligne, finalement, l'expression "a+" correspondrait à "a", "aa" ou n'importe quel nombre de a dans une ligne(Notez : il ne correspondra pas à une chaîne vide !). Même affaire avec les ensembles, l'expression ``[0-9]+`` correspondra à *chaque numéro entier qu'il y a* ! Je sais à quoi vous êtes occupé à penser, et vous avez raison : si vous utilisez cela dans le cas ci-dessus de la correspondance du numéro de page, est-ce que cette simple expression ne pourrait pas correspondre à tous les numéros de page ? Oui, l'expression ``[0-9]+ de 423`` correspondra à chaque numéro de page dans ce livre !

source: A note on these quantifiers: They generally try to match as much text as possible, so be careful when using them. This is called "greedy behaviour"- I'm sure you get why. It gets problematic when you, say, try to match a tag. Consider, for example, the string ``"<p class="calibre2">Title here</p>"`` and let's say you'd want to match the opening tag (the part between the first pair of angle brackets, a little more on tags later). You'd think that the expression ``<p.*>`` would match that tag, but actually, it matches the whole string! (The character "." is another special character. It matches anything *except* linebreaks, so, basically, the expression ``.*`` would match any single line you can think of.) Instead, try using ``<p.*?>`` which makes the quantifier ``"*"`` non-greedy. That expression would only match the first opening tag, as intended. There's actually another way to accomplish this: The expression ``<p[^>]*>`` will match that same opening tag- you'll see why after the next section. Just note that there quite frequently is more than one way to write a regular expression.
es: Una nota sobre estos cuantificadores: Tratan generalmente de hacer coincidir tanto más texto como sea posible, así que tenga cuidado al usarlos. Esto se conoce como "comportamiento codicioso" - Estoy seguro que entiende por qué. Se vuelve problemático cuando, por ejemplo, se trata de hacer coincidir una etiqueta. Consideremos, por ejemplo, la cadena ``"<p class="calibre2">Título aquí</p>"`` y digamos que le gustaría que coincida con la etiqueta de apertura (la parte entre el primer par de corchetes angulares, un poco más sobre las etiquetas más adelante). Se podría pensar que la expresión ``<p.*>`` se correspondería con esa etiqueta, pero en realidad, coincide toda la cadena! (El carácter "." es otro carácter especial. Coincide cualquier cosa *excepto* saltos de línea, por lo que, básicamente, la expresión ``.*`` se correspondería con cualquier línea que se pueda imaginar.) En su lugar, trate de usar ``<p.*?>`` lo que hace que el cuantificador ``"*"`` no ambicioso. Esa expresión sólo coincidiría con la primera etiqueta de apertura, como se pretende. De hecho, hay otra manera de lograr esto. La expresión ``<p[^>]*>`` coincidirá con la misma etiqueta de apertur,a verá por qué después de la siguiente sección. Tenga en cuenta que frecuentemente hay más de una manera de escribir una expresión regular.
fr: Une note sur ces quantificateurs : Ils essaient généralement de correspondre au plus de texte possible, aussi soyez prudent lors de leur utilisation. Ceci est appelé "un comportement glouton"- Je suis sûr que vous comprenez pourquoi. Ils deviennent problématiques quand vous, disons, essayez de correspondre à une balise. Considérons, par exemple, la chaîne ``"<p class="calibre2">Titre ici</p>"`` et laissons nous dire que vous voulez correspondre à la balise d'ouverture (la partie entre la première paire de chevrons, un peu plus sur les balises plus tard). Vous devez penser que l'expression ``<p.*>`` devrait correspondre à cette balise, mais actuellement, elle correspond à l'entièreté de la chaîne ! (Le caractère "." est un autre caractère spécial. Il correspond à n'importe quoi *excepté* les sauts de ligne, aussi, essentiellement, l'expression ``.*`` devrait correspondre à n'importe quelle ligne à laquelle vous pensez.) A la place, essayez d'utiliser ``<p.*?>`` qui rend le quantifier ``"*"`` non-glouton. Cette expression ne correspondrait qu'à la première balise d'ouverture, comme attendu. Il y a en fait une autre manière d'y parvenir : L'expression ``<p[^>]*>`` correspondra à la même balise d'ouverture - vous verrez pourquoi après la prochaine section. Notez juste qu'il y a assez fréquemment plus d'une manière d'écrire une expression régulière.

source: Well, these special characters are very neat and all, but what if I wanted to match a dot or a question mark?
es: Bien, estos caracteres especiales son perfectos, pero ¿que hay si quería que coincida con un punto o un signo de interrogación?
fr: Bien, ces caractères spéciaux sont bien jolis et tout, mais qu'en est-il si je veux correspondre à un point ou à un point d'interrogation ?
