Repository: Easonqsp/calibre-translations
Catalog: manual/*/regexp.po
Languages: es, fr

source: Another thing you can use regular expressions for is to extract metadata from filenames. You can find this feature in the "Adding books" part of the settings. There's a special feature here: You can use field names for metadata fields, for example ``(?P<title>)`` would indicate that calibre uses this part of the string as book title. The allowed field names are listed in the windows, together with another nice test field. An example: Say you want to import a whole bunch of files named like ``Classical Texts: The Divine Comedy by Dante Alighieri.mobi``. (Obviously, this is already in your library, since we all love classical italian poetry) or ``Science Fiction epics: The Foundation Trilogy by Isaac Asimov.epub``. This is obviously a naming scheme that calibre won't extract any meaningful data out of - its standard expression for extracting metadata is ``(?P<title>.+) - (?P<author>[^_]+)``. A regular expression that works here would be ``[a-zA-Z]+: (?P<title>.+) by (?P<author>.+)``. Please note that, inside the group for the metadata field, you need to use expressions to describe what the field actually matches. And also note that, when using the test field calibre provides, you need to add the file extension to your testing filename, otherwise you won't get any matches at all, despite using a working expression.
es: También puede utilizar expresiones regulares para extraer metadatos de los nombres de archivo. Puede encontrar esta función de "Adición de libros" en la sección de ajustes. Hay una característica especial: puede utilizar nombres de campo para los campos de metadatos, por ejemplo ``(?P<title>)`` que indicaría que calibre utiliza esta parte de la cadena como el título del libro. Los nombres de los campos permitidos se enumeran en las ventanas, junto con otro campo de prueba. Un ejemplo: digamos que desea importar un montón de archivos llamados así ``Textos Clásicos: La Divina Comedia de Dante Alighieri.mobi``. (Obviamente, ya está en la biblioteca, ya que a todos nos gusta la poesía italiana clásica) o `` Ciencia ficción épica: La Trilogía de la Fundación por Isaac Asimov.epub``. Esto es obviamente un esquema de nombres que calibre no va a extraer datos significativos - la expresión estándar para la extracción de los metadatos es ``(?P<titulo>.+) - (?P<autor>[^_]+)``. Una expresión regular que funciona aquí sería ``[a-zA-Z]+: (?P<titulo>.+) by (?P<autor>.+)``. Tenga en cuenta que, dentro del grupo para el campo de metadatos, es necesario utilizar expresiones para describir lo que el campo actualmente iguala. Y también tenga en cuenta que, cuando se utiliza el campo de prueba que calibre ofrece, es necesario agregar la extensión de archivo a su nombre de archivo de prueba, de lo contrario no recibirá ninguna correspondencia en absoluto, a pesar de utilizar una expresión de trabajo.

source: Bulk editing metadata
es: Edición de metadatos masiva
fr: Edition des métadonnées par lot

source: The last part is regular expression search and replace in metadata fields. You can access this by selecting multiple books in the library and using bulk metadata edit. Be very careful when using this last feature, as it can do **Very Bad Things** to your library! Doublecheck that your expressions do what you want them to using the test fields, and only mark the books you really want to change! In the regular expression search mode, you can search in one field, replace the text with something and even write the result into another field. A practical example: Say your library contained the books of Frank Herbert's Dune series, named after the fashion ``Dune 1 - Dune``, ``Dune 2 - Dune Messiah`` and so on. Now you want to get ``Dune`` into the series field. You can do that by searching for ``(.*?) \d+ - .*`` in the title field and replacing it with ``\1`` in the series field. See what I did there? That's a reference to the first group you're replacing the series field with. Now that you have the series all set, you only need to do another search for ``.*? -`` in the title field and replace it with ``""`` (an empty string), again in the title field, and your metadata is all neat and tidy. Isn't that great? By the way, instead of replacing the entire field, you can also append or prepend to the field, so, if you *wanted* the book title to be prepended with series info, you could do that as well. As you by now have undoubtedly noticed, there's a checkbox labeled :guilabel:`Case sensitive`, so you won't have to use flags to select behaviour here.
es: La última parte es la búsqueda y reemplazo de expresiones regulares en los campos de metadatos. Puede acceder a ésta seleccionando varios libros en la biblioteca y editar metadatos masivamente. Tenga mucho cuidado al utilizar esta última característica, ya que puede hacer **cosas muy malas** en su biblioteca! Verifique que sus expresiones hacen lo que quiere que haga en los campos de prueba, y sólo marcan los libros que realmente quiere cambiar! En el modo de búsqueda de expresiones regulares, puede buscar en un campo, reemplazar el texto con algo e incluso escribir el resultado en otro campo. Un ejemplo práctico: Digamos que su biblioteca contenía los libros de la serie Dune de Frank Herbert, nombrados de este modo `` Dune 1 - Dune``, ``Dune 2 - Dune Messiah`` y así sucesivamente. Ahora desea conseguir ``Dune`` en el campo series. Puede hacerlo mediante la búsqueda ``(.*?) \d+ - .*`` en el campo Título y reemplazando con ``\1`` en el campo series. Ve lo que hice allí? Eso es una referencia al primer grupo que está reemplazando. Ahora que tiene toda la serie lista, sólo tiene que hacer otra búsqueda ``.*? -`` en el campo Título y reemplazarlo con ``""`` (una cadena vacía), de nuevo en el campo Título, y sus metadatos están todos limpios y ordenado. ¿No es genial? Por cierto, en lugar de sustituir todo el campo, puede también añadir o anteponer al campo, por lo que, si *quería* el título del libro que se anteponga con la información de la serie, puede hacerlo también. Como sin duda se ha dado cuenta, hay una casilla etiquetada :guilabel:`Mayúsculas-minúsculas`, así no tendrá que usar marcas para seleccionar comportamientos aquí.
fr: La dernière partie est le rechercher et remplacer par expression régulière dans les champs de métadonnées. Vous pouvez accéder à ceci en sélectionnant de multiples livres dans la bibliothèque et en utilisant l'édition de métadonnées par lot. Soyez très prudent en utilisant cette dernière fonction, vu qu'elle peut faire de **Très Vilaines Choses** à votre bibliothèque. Vérifiez par deux fois que vos expressions font ce que vous attendez d'elles en utilisant les champs de test, et marquez uniquement les livres que vous voulez réellement changer ! Dans le mode recherche par expression régulière, vous pouvez rechercher dans un champ, remplacer le texte avec quelque chose et même écrire le résultat dans un autre champ. Un exemple pratique : disons que votre bibliothèque contient les livres de la série Dune de Frank Herbert, nommés selon le modèle ``Dune 1 - Dune``, ``Dune 2 - Dune Messiah`` et ainsi de suite. Maintenant vous voulez obtenir ``Dune`` dans le champ série Vous pouvez faire cela en recherchant après ``(.*?) \d+ - .*`` dans le champ titre et en le remplaçant avec ``\1`` dans le champ séries. Vous voyez ce que je veux dire ? C'est une référence au premier groupe avec lequel vous allez remplacer le champ série. Maintenant que vous avez toutes vos séries prêtes, vous avez uniquement besoin de faire une autre recherche de ``.*? -`` et le remplacer avec ``""`` (une chaîne vide) encore dans le champ titre, et vos métadonnées sont toutes ordonnées et rangées. De cette manière, au lieu de remplacer le champ entier, vous pouvez également apposer ou ajouter au début au champ, ainsi, si vous *voulez* le titre de livre à ajouter au début avec des infos de séries, vous pourriez faire cela également. Comme vous l'avez suremment noté, il y a une case à cocher marquée :guilabel:`Sensible à la casse`, ainsi vous ne devrez pas employer des bannières pour sélectionner le comportement ici.

source: Well, that just about concludes the very short introduction to regular expressions. Hopefully I'll have shown you enough to at least get you started and to enable you to continue learning by yourself- a good starting point would be the `Python documentation for regexps <http://docs.python.org/library/re.html>`_.
es: Bueno, casi llegamos a la conclusión de la muy breve introducción a las expresiones regulares. Esperemos que le haya mostrado lo suficiente como para, al menos, comenzar y seguir aprendiendo por sí mismo. Un buen punto de partida sería la documentación `Python para expresiones regulares <http://docs.python.org/library/re.html> `_.
fr: Voilà, c'est juste pour conclure cette très courte introduction aux expressions régulières. Si tout va bien je vous aurai montré assez que pour vous permettre au moins de démarrer et de vous donner l'envie de continuer d'apprendre par vous-même- un bon point de départ serait la `Documentation Python pour les regexps <http://docs.python.org/library/re.html>`_.

source: One last word of warning, though: Regexps are powerful, but also really easy to get wrong. calibre provides really great testing possibilities to see if your expressions behave as you expect them to. Use them. Try not to shoot yourself in the foot. (God, I love that expression...) But should you, despite the warning, injure your foot (or any other body parts), try to learn from it.
es: Una última palabra de advertencia: las expresiones regulares son poderosas, pero también es muy fácil equivocarse. calibre ofrece muy buenas posibilidades de pruebas para ver si sus expresiones se comportan como se espera que lo hagan. Úselos. Trate de dispararse los pies. (Dios, me encanta esa expresión ...) Pero en caso de que, a pesar de la advertencia, lesionar su pie (o cualquier otra parte del cuerpo), trate de aprender de ellas.

source: Credits
es: Créditos
fr: Crédits

source: Thanks for helping with tips, corrections and such:
es: Gracias por ayudar con sugerencias, correcciones y demás:
fr: Remerciements pour l'aide avec les astuces, les correction et analogues :

source: For more about regexps see `The Python User Manual <http://docs.python.org/library/re.html>`_.
es: Para saber más acerca de las expresiones regulares, vea `El manual de usuario de Python <http://docs.python.org/library/re.html>`_ (en inglés).
fr: Pour plus d'informations à propos des regexp voir `Le Manuel Utilisateur Python <http://docs.python.org/library/re.html>`_.

source: All about using regular expressions in |app|
fr: Tout à propos de l'utilisation des expressions régulières dans |app|

source: Regular expressions are features used in many places in |app| to perform sophisticated manipulation of ebook content and metadata. This tutorial is a gentle introduction to getting you started with using regular expressions in |app|.
fr: Les expressions régulières sont des fonctions utilisées dans différents endroits dans |app| pour effectuer des manipulations élaborées sur le contenu et sur les métadonnées de vos livres numériques. Ce tutoriel est une introduction légère pour vous permettre de démarrer dans l'utilisation des expressions régulières dans |app|.

source: Where in |app| can you use regular expressions?
fr: Où pouvez-vous utiliser les expressions régulières dans |app| ?

source: There are a few places |app| uses regular expressions. There's the Search & Replace in conversion options, metadata detection from filenames in the import settings and Search & Replace when editing the metadata of books in bulk.
fr: Il y a quelques endroits où |app| utilise les expressions régulières. Il y a le Rechercher & Remplacer dans les options de conversion, la détection de métadonnées à partir des noms de fichier dans les paramètres d'importation et le Rechercher & Remplacer lors de l'édition par lot des métadonnées.

source: I'm using string here in the sense it is used in programming languages: a string of one or more characters, characters including actual characters, numbers, punctuation and so-called whitespace (linebreaks, tabulators etc.). Please note that generally, uppercase and lowercase characters are not considered the same, thus "a" being a different character from "A" and so forth. In |app|, regular expressions are case insensitive in the search bar, but not in the conversion options. There's a way to make every regular expression case insensitive, but we'll discuss that later. It gets complicated because regular expressions allow for variations in the strings it matches, so one expression can match multiple strings, which is why people bother using them at all. More on that in a bit.
fr: J'utilise ici le mot chaîne dans le sens où il est utilisé dans les langages de programmation : une chaîne d'un ou plusieurs caractères, caractères incluant des caractères habituels, des nombres, de la ponctuation et ce qu'on appelle les whitespace (retours de ligne, tabulations, etc...). Veuillez noter que généralement, les caractères majuscules et minuscules ne sont pas considérés les mêmes, donc "a" est un caractère différent de "A" et ainsi de suite. Dans |app|, les expressions régulières sont sensibles à la casse dans la barre de recherche, mais pas dans les options de conversion. Il y a une manière pour rendre chaque expression régulière insensible à la casse, mais nous en discuterons plus tard. Ça devient compliqué parce que les expressions régulières tiennent compte des variations des chaînes qu'elles font correspondre, ainsi une expression peut correspondre à des chaînes multiples, ce qui est pourquoi les gens ne prennent pas la peine de les employer du tout. Plus sur cela dans un moment.

source: Yes, I did, thanks for paying attention and reminding me. You can tell |app| how you want certain things handled by using something called flags. You include flags in your expression by using the special construct ``(?flags go here)`` where, obviously, you'd replace "flags go here" with the specific flags you want. For ignoring case, the flag is ``i``, thus you include ``(?i)`` in your expression. Thus, ``test(?i)`` would match "Test", "tEst", "TEst" and any case variation you could think of.
fr: Oui, je l'ai fait, merci de votre attention et de me l'avoir rappelé. Vous pouvez dire à |app| comment vous voulez que certaines choses soient traitées en utilisant quelque chose appelée bannière. Vous incluez des bannières dans votre expression en utilisant la construction spéciale ``(?bannières vont ici)`` où, évidemment, vous devrez remplacer "bannières vont ici" avec les bannières spécifiques que vous voulez. Pour ignorer la casse, la bannière est le ``i``, donc vous incluez ``test(?i)`` dans votre expression. Dès lors, ``test(?i)`` correspondra à Test, tEst, TEst et toutes les variations imaginables.

source: I think I'm beginning to understand these regular expressions now... how do I use them in |app|?
fr: Je pense que je commence à comprendre ces expressions régulières maintenant... comment dois-je les utiliser dans |app|?

source: Let's begin with the conversion settings, which is really neat. In the Search and Replace part, you can input a regexp (short for regular expression) that describes the string that will be replaced during the conversion. The neat part is the wizard. Click on the wizard staff and you get a preview of what |app| "sees" during the conversion process. Scroll down to the string you want to remove, select and copy it, paste it into the regexp field on top of the window. If there are variable parts, like page numbers or so, use sets and quantifiers to cover those, and while you're at it, remember to escape special characters, if there are some. Hit the button labeled :guilabel:`Test` and |app| highlights the parts it would replace were you to use the regexp. Once you're satisfied, hit OK and convert. Be careful if your conversion source has tags like this example::
fr: Commençons avec les paramètres de conversion, qui est vraiment bien. Dans la partie Rechercher et Remplacer, on peut utiliser une regexp (abréviation pour expression régulière) qui décrit la chaîne qui sera remplacée pendant la conversion. La partie magique, c’est l’assistant. En cliquant sur l’assistant, on obtient la prévisualisation de ce que |app| "verra" pendant le processus de conversion. Défilez vers le bas jusqu'à la chaque vous voulez supprimer, sélectionnez-la et copiez-la, collez la dans le champ regexp au dessus de la fenêtre. S'ils ont des parties variables, comme les numéros de page ou autre, utilisez les ensembles et les quantificateurs pour couvrir ceux-ci, et pendant que vous y êtes, souvenez-vous d'échapper les caractères spéciaux, s'il y en a certains. Appuyez le bouton labellé :guilabel:`Test` et |app| mettra en évidence les parties qu'il devrait remplacer s'il utilisait la regexp. Une fois que vous êtes satisfait, appuyez OK et convertissez. Soyez prudent si votre source de conversion à des balises comme dans cet exemple::

source: (shamelessly ripped out of `this thread <http://www.mobileread.com/forums/showthread.php?t=75594">`_). You'd have to remove some of the tags as well. In this example, I'd recommend beginning with the tag ``<b class="calibre2">``, now you have to end with the corresponding closing tag (opening tags are ``<tag>``, closing tags are ``</tag>``), which is simply the next ``</b>`` in this case. (Refer to a good HTML manual or ask in the forum if you are unclear on this point.) The opening tag can be described using ``<b.*?>``, the closing tag using ``</b>``, thus we could remove everything between those tags using ``<b.*?>.*?</b>``. But using this expression would be a bad idea, because it removes everything enclosed by <b>- tags (which, by the way, render the enclosed text in bold print), and it's a fair bet that we'll remove portions of the book in this way. Instead, include the beginning of the enclosed string as well, making the regular expression ``<b.*?>\s*Generated\s+by\s+ABC\s+Amber\s+LIT.*?</b>`` The ``\s`` with quantifiers are included here instead of explicitly using the spaces as seen in the string to catch any variations of the string that might occur. Remember to check what |app| will remove to make sure you don't remove any portions you want to keep if you test a new expression. If you only check one occurrence, you might miss a mismatch somewhere else in the text. Also note that should you accidentally remove more or fewer tags than you actually wanted to, |app| tries to repair the damaged code after doing the removal.
fr: (honteusement tiré de `ce poste <http://www.mobileread.com/forums/showthread.php?t=75594">`_). Vous devriez également enlever certaines des balises . Dans cet exemple, je recommanderais de commencer par la balise ``<b class="calibre2">``, maintenant vous devez terminé avec la balise fermante correspondante(les balises ouvrantes sont ``<balise>``, les balises fermantes sont ``</tag>``, qui est simplement le prochain ``</b>`` dans ce cas. (Référez-vous à un bon manuel HTML ou posez la question sur le forum si vous n’êtes pas au clair sur ce point). La balise ouvrante peut être décrite en utilisant ``<b.*?>``, la balise fermante en utilisant ``</b>``, donc nous pourrions retirer entièrement ce qui se trouve entre ces deux balises en utilisant ``<b.*?>.*?</b>``. Mais utiliser cette expression serait une mauvaise idée, parce qu'elle retire tout ce qui se trouve encadré par des balises <b>- (qui, par ailleurs, rend le texte encadré en gras), et c'est un pari gagné que nous enlèverons des parties du livre de cette façon. A la place, inclure également le commencement de la chaîne encadrée, faisant l'expression régulière ``<b.*?>\s*Generated\s+by\s+ABC\s+Amber\s+LIT.*?</b>`` Le ``\s`` avec les quantificateurs sont inclus ici à la place d'utiliser explicitement les espaces comme considéré dans la chaîne pour saisir toutes les variations de la chaîne qui pourraient survenir. Souvenez-vous de vérifier qu'est ce que |app| retirera pour vous assurer que vous ne retirez pas des portions que vous voulez garder si vous testez une nouvelle expression. Si vous vérifiez uniquement une occurrence, vous pourriez manquer une disparité ailleurs dans le texte. Notez également que si vous enlevez accidentellement plus ou moins de balises que vous ne le vouliez réellement, |app| essaye de réparer le code endommagé après avoir fait le retrait.

source: Another thing you can use regular expressions for is to extract metadata from filenames. You can find this feature in the "Adding books" part of the settings. There's a special feature here: You can use field names for metadata fields, for example ``(?P<title>)`` would indicate that calibre uses this part of the string as book title. The allowed field names are listed in the windows, together with another nice test field. An example: Say you want to import a whole bunch of files named like ``Classical Texts: The Divine Comedy by Dante Alighieri.mobi``. (Obviously, this is already in your library, since we all love classical italian poetry) or ``Science Fiction epics: The Foundation Trilogy by Isaac Asimov.epub``. This is obviously a naming scheme that |app| won't extract any meaningful data out of - its standard expression for extracting metadata is ``(?P<title>.+) - (?P<author>[^_]+)``. A regular expression that works here would be ``[a-zA-Z]+: (?P<title>.+) by (?P<author>.+)``. Please note that, inside the group for the metadata field, you need to use expressions to describe what the field actually matches. And also note that, when using the test field |app| provides, you need to add the file extension to your testing filename, otherwise you won't get any matches at all, despite using a working expression.
fr: Une autre chose pour laquelle vous pouvez utiliser les expressions régulières est l'extraction des métadonnées à partir des noms de fichier. Vous pouvez trouver cette fonctionnalité dans la partie *Ajout de livres* des préférences. Il y a une fonctionnalité spéciale ici : vous vous utiliser les noms de champ pour les champs de métadonnées, par exemple ``(?P<title>)`` indiquera que calibre utilise cette parie de la chaîne comme titre du livre. Les noms de champs permis sont listés dans la fenêtre, accompagné d'un autre joli champ de test. Un exemple : disons que vous voulez importer un tas de fichiers nommés ``Textes Classiques: La Divine Comédie par Dante Alighieri.mobi``. (Evidemment, ceci est déjà dans votre bibliothèque, puisque nous aimons tous la poésie italienne classique) ou ``Les épiques de la Science Fiction : La Trilogie Fondation par Isaac Asimov.epub``. Ceci est évidemment un schéma de nommage dont |app| ne peut extraire aucunes données significatives - son expression standard pour l'extraction de métadonnées est ``(?P<title>.+) - (?P<author>[^_]+)``. Une expression régulière qui fonctionnera ici devra être ``[a-zA-Z]+: (?P<title>.+) par (?P<author>.+)``. Merci de noter que, à l'intérieur du groupe pour le champ métadonnées , vous devez utiliser des expressions pour décrire ce à quoi le champ correspond réellement. Et notez également que, lors de l'utilisation de la zone de test de calibre, vous devez ajouter l'extension de fichier, sinon vous n'aurez pas de résultats du tout, malgré l'utilisation d'une expression correcte.
