Repository: Easonqsp/calibre-translations
Catalog: manual/*/regexp.po
Languages: es, fr

source: You can of course do that: Just put a backslash in front of any special character and it is interpreted as the literal character, without any special meaning. This pair of a backslash followed by a single character is called an escape sequence, and the act of putting a backslash in front of a special character is called escaping that character. An escape sequence is interpreted as a single element. There are of course escape sequences that do more than just escaping special characters, for example ``"\t"`` means a tabulator. We'll get to some of the escape sequences later. Oh, and by the way, concerning those special characters: Consider any character we discuss in this introduction as having some function to be special and thus needing to be escaped if you want the literal character.
es: Por supuesto, puede hacer lo siguiente: solo hay que poner una barra invertida delante de cualquier carácter especial y es interpretado como un carácter literal, sin ningún significado especial. Este par de barras invertidas seguida por un solo personaje se llama una secuencia de escape, y el acto de poner una barra invertida delante de un carácter especial se llama escapando ese carácter. Una secuencia de escape se interpreta como un solo elemento. Hay, por supuesto, secuencias de escape que hacen más que sólo escapar caracteres especiales, como por ejemplo ``"\t"`` significa un tabulador. Vamos a llegar a algunas de las secuencias de escape más tarde. Ah, y por cierto, en relación con esos caracteres especiales: considere a cualquier carácter que señalamos en esta introducción como poseedores de alguna función especial y por lo tanto necesita ser escapado si desea que sea un carácter literal.
fr: Vous pouvez bien sûr faire cela : insérez juste une barre oblique inversée devant tout caractère spécial et il sera interprété comme un caractère littéral, sans aucune autre signification. Cette paire de barres obliques inversées suivie d'un caractère seul est appelée une séquence d'échappement, et l'action de mettre une barre oblique inversée devant un caractère spécial est appelée un échappant de ce caractère. Une séquence d'échappement est interprétée comme un élément seul. Il y a bien sûr des séquences d'échappement qui font plus que juste échapper des caractères spéciaux, par exemple ``"\t"`` signifie une tabulation. Nous verrons certaines des séquences d'échappement plus tard. Ah, et temps que nous y sommes, au sujet de ces caractères spécia: Considérez n'importe quel caractère dont nous discutons dans cette introduction comme ayant une certaine fonction pour être spéciaux et de ce fait devant être échappé si vous voulez le caractère littéral.

source: So, what are the most useful sets?
es: ¿Y cuáles son los conjuntos más útiles?
fr: Bien, quels sont les ensembles les plus utiles ?

source: Knew you'd ask. Some useful sets are ``[0-9]`` matching a single number, ``[a-z]`` matching a single lowercase letter, ``[A-Z]`` matching a single uppercase letter, ``[a-zA-Z]`` matching a single letter and ``[a-zA-Z0-9]`` matching a single letter or number. You can also use an escape sequence as shorthand::
es: Sabía que lo preguntarías. Algunos conjuntos útiles son ``[0-9]`` donde coinciden un solo número, ``[az]`` donde coincide con una sola letra en minúscula, ``[AZ]`` donde coinciden una sola letra mayúscula, ``[a-zA-Z]`` donde coincide una sola letra y ``[a-zA-Z0-9]`` donde coincide una sola letra o un número. También puede utilizar una secuencia de escape como taquigrafía::
fr: Je savais que vous demanderiez. Certains des ensembles utiles sont ``[0-9]`` correspondant à un nombre unique, ``[a-z]`` correspondant à un caractère minuscule unique, ``[A-Z]`` correspondant à un caractère majuscule unique, ``[a-zA-Z]`` correspondant à un caractère unique et ``[a-zA-Z0-9]`` correspondant à une lettre ou un nombre unique. Vous pouvez aussi utiliser une séquence d'échappement comme sténographie::

source: "Whitespace" is a term for anything that won't be printed. These characters include space, tabulator, line feed, form feed and carriage return.
es: "Espacios en blanco" es un término para cualquier cosa que no se imprime. Estos caracteres incluyen el espacio, tabulador, avance de línea, salto de página y retorno de carro.
fr: "Whitespace" est un terme pour tout ce qui ne sera pas imprimé. Ces caractères incluent l'espace, la tabulation, le retour à la ligne, le saut de page et le retour de chariot.

source: As a last note on sets, you can also define a set as any character *but* those in the set. You do that by including the character ``"^"`` as the *very first character in the set*. Thus, ``[^a]`` would match any character excluding "a". That's called complementing the set. Those escape sequence shorthands we saw earlier can also be complemented: ``"\D"`` means any non-number character, thus being equivalent to ``[^0-9]``. The other shorthands can be complemented by, you guessed it, using the respective uppercase letter instead of the lowercase one. So, going back to the example ``<p[^>]*>`` from the previous section, now you can see that the character set it's using tries to match any character except for a closing angle bracket.
es: Como una última nota sobre los conjuntos, también puede definir un conjunto como cualquier personaje *pero* aquellos del conjunto. Lo hace al incluir el carácter ``"^" '' como el *primer carácter en el conjunto*. Por lo tanto, ``[^a]`` haría coincidir con cualquier carácter excluyendo "a". Eso se llama complementar el conjunto. Esos taquigráficas secuencias de escape que vimos anteriormente también pueden complementarse. ``"\D"`` significa cualquier carácter que no sea un número, siendo por lo tanto equivalente a ``[^0-9]``. Las otras abreviaturas pueden ser complementadas por, lo has adivinado, utilizando la respectiva letra mayúscula en lugar de la minúscula. Así que, volviendo al ejemplo ``<p[^>]*>`` de la sección anterior, ahora se puede ver que el juego de caracteres está intentando coincidir con cualquier carácter excepto el corchete angular de cierre.
fr: Comme dernière note sur les ensembles, vous pouvez aussi définir un ensemble de n'importe quel caractère*mais* ceux dans l'ensemble. Vous faites cela en incluant le caractère ``"^"`` comme le *tout premier caractère dans l'ensemble*. Donc, ``[^a]`` correspondra à n'importe quel caractère en excluant le "a". C'est ce qu'on appelle complémenter l'ensemble. Ces sténographies de séquences d'échappement que nous avons vues plus tôt peuvent aussi être complémentées : ``"\D"`` signifie n'importe quel caractère qui n'est pas un nombre, donc étant équivalent à ``[^0-9]``. Les autres sténographies peuvent être complémentées par, vous le devinez, l'utilisation de la majuscule respective à la place de la minuscule. Aussi, revenons à l'exemple ``<p[^>]*>`` de la section précédente, maintenant vous pouvez voir que le jeu de caractères utilise des essais pour correspondre à n'importe quel caractère excepté un chevron fermant.

source: But if I had a few varying strings I wanted to match, things get complicated?
es: Pero ¿si tuviera un par de cadenas diferentes a igualar, las cosas se complican?
fr: Mais si j'avais quelques chaînes variables que je voudrais faire correspondre, les choses deviennent-elles compliquées ?

source: Fear not, life still is good and easy. Consider this example: The book you're converting has "Title" written on every odd page and "Author" written on every even page. Looks great in print, right? But in ebooks, it's annoying. You can group whole expressions in normal parentheses, and the character ``"|"`` will let you match *either* the expression to its right *or* the one to its left. Combine those and you're done. Too fast for you? Okay, first off, we group the expressions for odd and even pages, thus getting ``(Title)(Author)`` as our two needed expressions. Now we make things simpler by using the vertical bar (``"|"`` is called the vertical bar character): If you use the expression ``(Title|Author)`` you'll either get a match for "Title" (on the odd pages) or you'd match "Author" (on the even pages). Well, wasn't that easy?
es: No temas, la vida todavía es buena y fácil. Considere este ejemplo: El libro que está convirtiendo tiene un "Título" escrito en cada página impar y "Autor" escrito en cada página par. Luce muy bien en la impresión, ¿no? Pero en libros electrónicos, es molesto. Puede agrupar expresiones enteras en paréntesis normales, y el carácter ``"|"`` hará coincidir *o* la expresión a la derecha *o* el de la izquierda. Combínelas y ya está. Demasiado rápido para usted? Bueno, en primer lugar, agrupamos las expresiones para páginas pares e impares, consiguiendo de este modo ``(Título)(Autor)`` como nuestras dos expresiones necesarias. Ahora hacemos las cosas más simples mediante el uso de la barra vertical (``"|"`` se llama al carácter de barra vertical). Si utiliza la expresión ``(Título|Autor)`` conseguiría "Título" (en las páginas impares) o conseguiría "Autor" (en las páginas pares). Bueno, no era tan fácil?
fr: N'ayez pas peur, la vie est belle et facile. Considérons cet exemple : Le livre que vous convertissez a "Titre" écrit sur chaque page impaire et "Auteur" écrit sur chaque page paire. Harmonieux à l'impression, pas vrai ? Mais dans les livres numériques, c'est ennuyeux. Vous pouvez grouper ensemble les expressions dans des parenthèses normales et le caractère ``"|"`` vous permettra de correspondre soit à l'expression à sa droite *ou* à l'expression à sa gauche. Combinez les et vous avez fini. Trop rapide pour vous ? Ok, tout d'abord, nous groupons les expressions pour les pages paires et impaires, donc nous obtenons `(Titre)(Auteur)`` comme nos deux expressions nécessaires. Maintenant nous rendons les choses plus simples en utilisant la barre verticale (``"|"`` est appelé le caractère barre verticale) : si vous utilisez l'expression ``(Titre|Auteur)`` vous obtiendrez une correspondance pour "Titre" (sur les pages impaires) ou vous correspondrez à "Auteur" (sur les pages paires). Bien, n'était-ce pas facile ?

source: You can, of course, use the vertical bar without using grouping parentheses, as well. Remember when I said that quantifiers repeat the element preceding them? Well, the vertical bar works a little differently: The expression "Title|Author" will also match either the string "Title" or the string "Author", just as the above example using grouping. *The vertical bar selects between the entire expression preceding and following it*. So, if you wanted to match the strings "Calibre" and "calibre" and wanted to select only between the upper- and lowercase "c", you'd have to use the expression ``(c|C)alibre``, where the grouping ensures that only the "c" will be selected. If you were to use ``c|Calibre``, you'd get a match on the string "c" or on the string "Calibre", which isn't what we wanted. In short: If in doubt, use grouping together with the vertical bar.
es: Puede, por supuesto, usar la barra vertical sin utilizar paréntesis de agrupamiento, también. ¿Recuerdas cuando dije que los cuantificadores repiten el elemento anterior a ellos? Bueno, la barra vertical funciona un poco diferente. La expresión "Título|Autor" también corresponde o a la cadena "Título" o la cadena "Autor", al igual que el ejemplo anterior utilizando agrupamiento. *La barra vertical selecciona entre toda la expresión anterior y posterior a la misma*. Así que, si quiere que coincidan las cadenas "Calibre" y "calibre" y quiso seleccionar sólo entre la "c" mayúsculas y minúsculas, tendría que utilizar la expresión `` (c|C)alibre``, donde el agrupamiento asegura que sólo la "c" se seleccionará. Si va a usar ``c|Calibre``, obtendrá coincidencias con la cadena "c" o la cadena "Calibre", que no es lo que queríamos. En caso de duda, utilice el agrupamiento con la barra vertical.
fr: Vous pouvez, bien sûr, utiliser la barre verticale sans utiliser les parenthèses de regroupement, aussi bien. Vous vous souvenez quand je disais que les caractères spéciaux répétaient l’élément le précédant, et bien pour le caractère barre verticale, c’est différent.L’expression "Titre|Auteur" permet de sélectionner soit auteur, soit titre, comme sur l’exemple précédent avec les parenthèses. *Le caractère barre verticale sélectionne l’expression devant lui ou celle derrière lui*. Donc si on veut sélectionner les chaînes "calibre" et "Calibre", il faudra utiliser l’expression (c|C)alibre, où le groupement assure qu'uniquement le "c" sera sélectionné. Si on avait utilisé ``c|Calibre``, alors on aurait obtenu c ou Calibre, ce qui n'est pas ce qui était attendu. Donc en cas de doute, il est nécessaire de grouper avec les parenthèses.

source: You missed...
es: Falta algo...
fr: Vous avez manqué...

source: ... wait just a minute, there's one last, really neat thing you can do with groups. If you have a group that you previously matched, you can use references to that group later in the expression: Groups are numbered starting with 1, and you reference them by escaping the number of the group you want to reference, thus, the fifth group would be referenced as ``\5``. So, if you searched for ``([^ ]+) \1`` in the string "Test Test", you'd match the whole string!
es: ...espere un minuto, hay un último asunto, cosas muy buenas se pueden hacer con los grupos. Si tiene un grupo que previamente fue coincidente, puede utilizar las referencias a ese grupo más adelante en la expresión. Los grupos se numeran comenzando por 1, y los referencia escapando por el número del grupo que desea hacer referencia, por lo tanto, el quinto grupo sería referencia como ``\5``. Así, si buscó ``([^ ]+) \1`` en la cadena "Prueba Prueba", coincidirá toda la cadena!
fr: ... Attendez une minute, il y a une dernière chose, vraiment bien, que vous pouvez faire avec les groupes. A partir d'un groupe que vous avez déjà récupéré, vous pouvez utiliser une référence à ce groupe plus tard dans l'expression. Les groupes trouvés sont numérotés à partir de 1, et vous pouvez y faire référence en échappant le numéro du groupe auquel vous vous référencé, donc le cinquième groupe devra être référencé comme ``\5``. Aussi si vous recherchiez après ``([^ ]+) \1`` dans la chaîne "Test Test", vous correspondriez à la chaîne entière !

source: In the beginning, you said there was a way to make a regular expression case insensitive?
es: En el inicio, ¿dijo que había una manera de hacer una especie de expresión regular que no dscrimina mayúsculas y minúsculas?
fr: Au début vous disiez qu'il y avait un moyen de rendre les expressions régulières insensibles à la casse ?

source: Yes, I did, thanks for paying attention and reminding me. You can tell calibre how you want certain things handled by using something called flags. You include flags in your expression by using the special construct ``(?flags go here)`` where, obviously, you'd replace "flags go here" with the specific flags you want. For ignoring case, the flag is ``i``, thus you include ``(?i)`` in your expression. Thus, ``test(?i)`` would match "Test", "tEst", "TEst" and any case variation you could think of.
es: Sí, lo hice, gracias por prestar atención y recordarme. Puede decirle a calibre cómo desea ciertas cosas se manejen mediante el uso de banderas. Incluya banderas en su expresión mediante el uso de construcción especial ``(?banderas van aquí)``, donde, obviamente, sustituya "banderas van aquí" con las banderas específicos que desea. Para ignorar caso, la bandera es ``i``, así que incluya ``(?I)`` en su expresión. Por lo tanto, ``prueba(?i)`` se correspondería con "Prueba", "pRueba", "PRueba" y cualquier variación en las mayúsculas y minúsculas que podría pensar.

source: Another useful flag lets the dot match any character at all, *including* the newline, the flag ``s``. If you want to use multiple flags in an expression, just put them in the same statement: ``(?is)`` would ignore case and make the dot match all. It doesn't matter which flag you state first, ``(?si)`` would be equivalent to the above. By the way, good places for putting flags in your expression would be either the very beginning or the very end. That way, they don't get mixed up with anything else.
es: Otra bandera útil le permite al punto coincidir con cualquier carácter en todo, *incluyendo* la nueva línea, la bandera ``s``. Si desea utilizar varias banderas en una expresión, sólo hay que ponerlas en la misma declaración: ``(?is)`` ignoraría las mayúsculas y minúsculas y hacer que el punto coincida con todo. No importa cual bandera declara en primer lugar, ``(?si)`` sería equivalente a la anterior. Por cierto, buenos lugares para poner banderas en su expresión podrían ser el principio o el final. De esa manera, no se mezclan con cualquier otra cosa.
fr: Une autre bannière utile laisse le point corresponde à n'importe quel caractère du tout, *incluant* le saut de ligne, la bannière ``s``. Si vous voulez utiliser de multiples bannières dans une expression, mettez les juste dans la même déclaration : ``('?is)`` ignorera la casse fera que le point correspondra à tout. Quelle bannière vous placez en premier n'est pas important, ``(?si)`` sera équivalent à celui ci-dessus. De cette manière, les bons endroits pour mettre des bannières dans votre expression seraient soit le tout début ou la toute fin. De cette façon, ils ne se mélangent à toute autre chose.

source: I think I'm beginning to understand these regular expressions now... how do I use them in calibre?
es: Creo que empiezo a entender esto de las expresiones regulares... ¿cómo las utilizo en calibre?

source: Conversions
es: Conversiones

source: Let's begin with the conversion settings, which is really neat. In the Search and Replace part, you can input a regexp (short for regular expression) that describes the string that will be replaced during the conversion. The neat part is the wizard. Click on the wizard staff and you get a preview of what calibre "sees" during the conversion process. Scroll down to the string you want to remove, select and copy it, paste it into the regexp field on top of the window. If there are variable parts, like page numbers or so, use sets and quantifiers to cover those, and while you're at it, remember to escape special characters, if there are some. Hit the button labeled :guilabel:`Test` and calibre highlights the parts it would replace were you to use the regexp. Once you're satisfied, hit OK and convert. Be careful if your conversion source has tags like this example::
es: Vamos a comenzar con la configuración de conversión, lo que es realmente bueno. En la sección Buscar y reemplazar, puede introducir una expresión regular (abreviatura de expresión regular) que describe la cadena que será sustituida durante la conversión. La parte interesante es el asistente. Haga clic en el asistente personal y se obtiene una vista previa de lo que calibre "ve" durante el proceso de conversión. Vaya a la cadena que desea eliminar, selecciónelo y copielo, péguelo en el campo de expresión regular en la parte superior de la ventana. Si hay partes variables, como números de página o más, use conjuntos y cuantificadores para alcanzarlos, y mientras estás allí, recuerde los caracteres especiales de escape, si hay algunos. Pulse el botón con la etiqueta :guilabel:`Test` y calibre resalta las partes que reemplazaría al utilizar la expresión regular. Una vez que esté satisfecho, pulse Aceptar y se inicia el proceso de convertir. Tenga cuidado si su fuente de conversión tiene etiquetas como este ejemplo::

source: (shamelessly ripped out of `this thread <http://www.mobileread.com/forums/showthread.php?t=75594">`_). You'd have to remove some of the tags as well. In this example, I'd recommend beginning with the tag ``<b class="calibre2">``, now you have to end with the corresponding closing tag (opening tags are ``<tag>``, closing tags are ``</tag>``), which is simply the next ``</b>`` in this case. (Refer to a good HTML manual or ask in the forum if you are unclear on this point.) The opening tag can be described using ``<b.*?>``, the closing tag using ``</b>``, thus we could remove everything between those tags using ``<b.*?>.*?</b>``. But using this expression would be a bad idea, because it removes everything enclosed by <b>- tags (which, by the way, render the enclosed text in bold print), and it's a fair bet that we'll remove portions of the book in this way. Instead, include the beginning of the enclosed string as well, making the regular expression ``<b.*?>\s*Generated\s+by\s+ABC\s+Amber\s+LIT.*?</b>`` The ``\s`` with quantifiers are included here instead of explicitly using the spaces as seen in the string to catch any variations of the string that might occur. Remember to check what calibre will remove to make sure you don't remove any portions you want to keep if you test a new expression. If you only check one occurrence, you might miss a mismatch somewhere else in the text. Also note that should you accidentally remove more or fewer tags than you actually wanted to, calibre tries to repair the damaged code after doing the removal.
es: (descaradamente tomado de `este hilo <http://www.mobileread.com/forums/showthread.php?t=75594"> `_). Habría que eliminar algunas de las etiquetas también. En este ejemplo, me gustaría recomendar empezando con la etiqueta ``<b class="calibre2">``, ahora tiene que acabar con la etiqueta de cierre correspondiente (etiquetas de apertura son ``<tag>``, etiquetas de cierre son ``</tag>``), que es simplemente el siguiente ``</b>'' en este caso. (Consulte a un buen manual de HTML o pregunte en el foro si tiene dudas sobre este punto.) La etiqueta de apertura puede ser descrito usando ``<b.*?>``, la etiqueta de cierre usando ``</b>'', por lo que podríamos quitar todo lo que está entre estas etiquetas usando ``<b.*?>.*?</b>``. Pero usando esta expresión sería una mala idea, ya que elimina todo lo encerrado entre las etiquetas <b> (que, por cierto, hacen que el texto encerrado se vean en negrita), y es una apuesta segura que eliminaremos porciones de este libro de esta manera. En su lugar, incluya el principio de la cadena cerrada también, haciendo la expresión regular ``<b.*?>\s*Generado\s+por+ABC\s+Ámbar\s+LIT.*?</b>`` La ``\s`` con cuantificadores se incluyen aquí en lugar de utilizar explícitamente los espacios como se ve en la cadena para atrapar cualquier variación de la cadena que pudiera ocurrir. Recuerde revisar qué eliminará calibre para asegurarse que no elimine cualquier parte que desea conservar si ensaya una nueva expresión. Si sólo examina una ocurrencia, es posible que se pierda un desajuste en otro lugar del texto. También tenga en cuenta que en caso que accidentalmente elimine algunas etiquetas de lo que realmente deseaba, calibre intenta reparar el código dañado después de hacer la eliminación.

source: Adding books
es: Añadir libros
fr: Ajout de livres
