Repository: Easonqsp/calibre-translations
Catalog: manual/*/regexp.po
Languages: es, fr

source: One last word of warning, though: Regexps are powerful, but also really easy to get wrong. |app| provides really great testing possibilities to see if your expressions behave as you expect them to. Use them. Try not to shoot yourself in the foot. (God, I love that expression...) But should you, despite the warning, injure your foot (or any other body parts), try to learn from it.
fr: Un dernier mot de l'avertissement, cependant : Les regexps sont puissantes, mais également vraiment facile à devenir erronées. |app| fournit des possibilités de vraiment grandes d'essai pour voir si vos expressions se comportent que vous vous y attendez à . Employez-les. Essayez de ne pas vous tirer dans le pied. (Dieu, j'aime cette expression…) Mais si vous vous, en dépit de l'avertissement, blessez votre pied (ou toutes autres parties du corps), essayez d'apprendre de celui-ci.
