Repository: Easonqsp/calibre-translations
Catalog: manual/*/server.po
Languages: cs, es

source: Integrating the |app| content server into other servers
cs: Integrace serveru s obsahem |app| do jiných serverů

source: Here, we will show you how to integrate the |app| content server into another server. The most common reason for this is to make use of SSL or more sophisticated authentication. There are two main techniques: Running the |app| content server as a standalone process and using a reverse proxy to connect it with your main server or running the content server in process in your main server with WSGI. The examples below are all for Apache 2.x on linux, but should be easily adaptable to other platforms.
cs: Zde vám ukážeme, jak integrovat server s obsahem |app| do dalších serverů. Nejběžnějším důvodem k tomu je použít SSl nebo propracovanějšího ověřování. Jsou dva hlavní postupy: Spuštění serveru s obsahem |app| jako samostatného procesu a použití reverzní proxy k propojení s vaším hlavním serverem, nebo spuštění serveru s obsahem v procesu ve vašem hlavním serveru s WSGI. Příklady níže jsou všechny pro Apache 2.x na Linuxu, ale měly by být snadno přizpůsobitelný na jiné platformy.

source: Contents
cs: Obsah
es: Índice

source: This only applies to calibre releases >= 0.7.25
cs: Toto platí pouze pro vydání calibre >= 0.7.25
es: Esto sólo se aplica a versiones de calibre >= 0.7.25

source: Using a reverse proxy
cs: Používání reverzní proxy
es: Usar un proxy inverso

source: A reverse proxy is when your normal server accepts incoming requests and passes them onto the calibre server. It then reads the response from the calibre server and forwards it to the client. This means that you can simply run the calibre server as normal without trying to integrate it closely with your main server, and you can take advantage of whatever authentication systems you main server has in place. This is the simplest approach as it allows you to use the binary calibre install with no external dependencies/system integration requirements. Below, is an example of how to achieve this with Apache as your main server, but it will work with any server that supports Reverse Proxies.
cs: Reverzní proxy je, když váš normální server přijímá příchozí požadavky a předává je serveru calibre. Pak přečte odpověď od serveru calibre a předá ji klientovi. To znamená, že můžete jednoduše spustit server calibre jako normálně, aniž byste se ho snažili úzce integrovat s vaším hlavním serverem, a můžete využít jakékoliv příhodné systémy ověřování, které má váš hlavní server. Toto je nejjednodušší přístup, protože vám umožňuje použít binární instalaci calibre bez žádných požadavků na externí závislosti nebo systémovou integraci. Níže je příklad, jak toho dosáhnout s Apache jako vaším hlavním serverem, ale bude to fungovat s jakýmkoliv server, který podporuje reverzní proxy.

source: First start the |app| content server as shown below::
cs: Nejdříve spusťte server s obsahem |app|, jak je zobrazeno níže::

source: The key parameter here is ``--url-prefix /calibre``. This causes the content server to serve all URLs prefixed by calibre. To see this in action, visit ``http://localhost:8080/calibre`` in your browser. You should see the normal content server website, but now it will run under /calibre.
cs: Klíčový parametr je zde ``--url-prefix /calibre``. Toto způsobí, že server s obsahem bude sloužit všem URL s předponou calibre. Abyste to viděli v akci, navštivte ve svém prohlížeči ``http://localhost:8080/calibre``. Měli byste vidět normální webovou stránku serveru s obsahem, ale nyní poběží pod /calibre.
es: El parámetro clave aquí es ``--url-prefix /calibre``. Esto hace que el servidor de contenidos sirva todos los URL con el prefijo calibre. Para verlo en acción, visite ``http://localhost:8080/calibre`` en su navegador. Debería ver la página web habitual del servidor de contenido, pero ahora se ejecutará desde /calibre.

source: Now suppose you are using Apache as your main server. First enable the proxy modules in apache, by adding the following to :file:`httpd.conf`::
cs: Nyní předpokládejme, že používáte Apache jako svůj hlavní server. Nejdříve povolte moduly proxy v Apache přidáním následujícího do :file:`httpd.conf`::
es: Supongamos ahora que Apache es el servidor principal. En primer lugar, habilite los módulos de proxy en Apache, añadiendo lo siguiente a :file:`httpd.conf`::

source: The exact technique for enabling the proxy modules will vary depending on your Apache installation. Once you have the proxy modules enabled, add the following rules to httpd.conf (or if you are using virtual hosts to the conf file for the virtual host in question::
cs: Přesný postup povolení modulů proxy se bude lišit v závislosti na vaší instalaci Apache. Jakmile budete mít povolené moduly proxy, přidejte následující pravidla do httpd.conf (nebo pokud používáte virtuální hostitele, tak do konfiguračního souboru příslušného virtuálního hostitele)::

source: That's all, you will now be able to access the |app| Content Server under the /calibre URL in your apache server. The above rules pass all requests under /calibre to the calibre server running on port 8080 and thanks to the --url-prefix option above, the calibre server handles them transparently.
cs: To je vše, nyní budete schopni přistupovat k serveru s obsahem |app| pod URL /calibre ve svém serveru Apache. Výše zmíněná pravidla předají všechny požadavky pod /calibre serveru calibre běžícím na portu 8080 a díky výše zmíněné volbě --url-prefix je server calibre zpracuje transparentně.

source: If you are willing to devote an entire VirtualHost to the content server, then there is no need to use --url-prefix and RewriteRule, instead just use the ProxyPass directive.
cs: Pokud chcete věnovat celého virtuálního hostitele serveru s obsahem, není potřeba používat --url-prefix a RewriteRule, namísto toho použijte pouze direktivu ProxyPass.
es: Si está dispuesto a dedicar todo un VirtualHost para el servidor de contenidos, entonces no hay necesidad de utilizar ``--url-prefix`` y ``RewriteRule``, simplemente use la directiva ``ProxyPass``.

source: The server engine calibre uses, CherryPy, can have trouble with proxying and KeepAlive requests, so turn them off in Apache, with the SetEnv directives shown above.
cs: Modul serveru používaný calibre, CherryPy, může mít potíže s používáním proxy a požadavky KeepAlive, takže je v Apache vypněte pomocí výše zobrazené direktivy SetEnv.
es: El motor del servidor que usa calibre, CherryPy, puede tener problemas cuando se utilizan proxys y peticiones KeepAlive, así que desactívelos en Apache, con las directivas SetEnv que se muestran arriba.

source: In process
cs: V rámci procesu
es: En proceso

source: The calibre content server can be run directly, in process, inside a host server like Apache using the WSGI framework.
cs: Server s obsahem calibre může být spuštěn přímo, v rámci procesu, uvnitř serveru hostitel, jako je Apache, pomocí rozhraní WSGI.
es: El servidor de contenidos de calibre se puede ejecutar directamente, en proceso, dentro de un servidor anfitrión como Apache utilizando el marco WSGI.

source: For this to work, all the dependencies needed by calibre must be installed on your system. Doing so is highly non-trivial and you are encouraged not to use in process servers. You will not get any assistance with debugging in process server problems.
cs: Aby toto fungovalo, musí být ve vašem systému nainstalovány všechny závislosti vyžadované calibre. To je velice netriviální a je doporučeno, abyste nepoužívali servery v rámci procesu. Nedostane se vám žádné pomoci s laděním problémů serveru v rámci procesu.
es: Para que esto funcione, todas las dependencias requeridas por calibre deben estar instaladas en el sistema. Conseguir esto no es en absoluto trivial, y se aconseja no usar servidores en proceso. No se proporcionará ninguna ayuda para depurar problemas relacionados con servidores en proceso.

source: First, we have to create a WSGI *adapter* for the calibre content server. Here is a template you can use for the purpose. Replace the paths as directed in the comments
cs: Nejdříve musíme vytvořit *adaptér* WSGI pro server s obsahem calibre. Zde je šablona, kterou můžete k tomuto účelu použít. Nahraďte cesty, jak je doporučeno v komentářích
es: Primero, debemos crear un *adaptador* WSGI para el servidor de contenidos de calibre. Aquí hay una plantilla que puede utilizar para dicho propósito. Reemplace las rutas de acceso como se indica en los comentarios.

source: Save this adapter as :file:`calibre-wsgi-adpater.py` somewhere your server will have access to it.
cs: Uložte tento adaptér jako :file:`calibre-wsgi-adpater.py` někam, kde k němu bude mít váš server přístup.
es: Guarde este adaptador como :file:`calibre-wsgi-adapter.py` en algún lugar al que el servidor tenga acceso.

source: Let's suppose that we want to use WSGI in Apache. First enable WSGI in Apache by adding the following to :file:`httpd.conf`::
cs: Předpokládejme, že chceme použít WSGI v Apache. Nejdříve povolte WSGI v Apache přidáním následujícího do :file:`httpd.conf`::
es: Supongamos que queremos usar WSGI en Apache. En primer lugar, habilite WSGI en Apache añadiendo lo siguiente a :file:`httpd.conf`::

source: The exact technique for enabling the wsgi module will vary depending on your Apache installation. Once you have the proxy modules enabled, add the following rules to httpd.conf (or if you are using virtual hosts to the conf file for the virtual host in question::
cs: Přesný postup povolení modulu wsgi se bude lišit v závislosti na vaší instalaci Apache. Jakmile budete mít povolené moduly proxy, přidejte následující pravidla do httpd.conf (nebo pokud používáte virtuální hostitele, tak do konfiguračního souboru příslušného virtuálního hostitele)::
es: La técnica exacta para habilitar el módulo WSGI variará según la instalación de Apache. Una vez que tenga los módulos proxy habilitados, agregue las siguientes reglas a :file:`httpd.conf` (o, si está usando servidores virtuales, en el archivo conf para el servidor virtual en cuestión)::

source: Change the path to :file:`calibre-wsgi-adapter.py` to wherever you saved it previously (make sure Apache has access to it).
cs: Změňte cestu k :file:`calibre-wsgi-adapter.py` podle toho, kam jste ho dříve uložili (ujistěte se, že k němu má Apache přístup).
es: Cambie la ruta de :file:`calibre-wsgi-adapter.py` a la ubicación donde lo haya guardado previamente (asegúrese de que Apache tenga acceso).

source: That's all, you will now be able to access the |app| Content Server under the /calibre URL in your apache server.
cs: To je vše, nyní budete schopni přistupovat k serveru s obsahem |app| pod URL /calibre ve svém serveru Apache.

source: For more help with using mod_wsgi in Apache, see `mod_wsgi <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
cs: Pro další nápovědu k používání mod_wsgi v Apache se podívejte na `mod_wsgi <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_.
es: Para más ayuda en el uso de mod_wsgi en Apache, vea `mod_wsgi <http://code.google.com/p/modwsgi/wiki/WhereToGetHelp>`_ (en inglés).

source: Integrating the calibre content server into other servers
es: Integrar el servidor de contenidos de calibre en otros servidores

source: Here, we will show you how to integrate the calibre content server into another server. The most common reason for this is to make use of SSL or more sophisticated authentication. There are two main techniques: Running the calibre content server as a standalone process and using a reverse proxy to connect it with your main server or running the content server in process in your main server with WSGI. The examples below are all for Apache 2.x on linux, but should be easily adaptable to other platforms.
es: Aquí, le mostraremos cómo integrar el servidor de contenidos de calibre en otro servidor. La razón más común para esto es hacer uso de SSL u otro tipo de autenticación más sofisticado. Existen dos técnicas principales: ejecutar el servidor de contenido calibre como un proceso independiente y utilizando un proxy inverso para conectar con el servidor principal, o ejecutar el servidor de contenido como un proceso en el servidor principal con WSGI. Los siguientes ejemplos son para Apache 2.x sobre linux, pero deberían ser fácilmente adaptables a otras plataformas.

source: A reverse proxy is when your normal server accepts incoming requests and passes them onto the calibre server. It then reads the response from the calibre server and forwards it to the client. This means that you can simply run the calibre server as normal without trying to integrate it closely with your main server, and you can take advantage of whatever authentication systems your main server has in place. This is the simplest approach as it allows you to use the binary calibre install with no external dependencies/system integration requirements. Below, is an example of how to achieve this with Apache as your main server, but it will work with any server that supports Reverse Proxies.
es: Un proxy inverso es cuando el servidor principal acepta peticiones entrantes y las traslada al servidor de calibre. A continuación, lee la respuesta desde el servidor de calibre y la envía al cliente. Esto significa que sólo tiene que ejecutar el servidor de calibre de forma normal sin tratar de integrarlo estrechamente con el servidor principal y aprovechar cualquier sistema de autenticación que posea el servidor principal. Éste es el método más sencillo, ya que le permite usar la instalación de binaria de calibre sin dependencias externas o requisitos de integración en el sistema. A continuación se muestra un ejemplo de cómo lograr esto con Apache como servidor principal, pero funcionará con cualquier servidor compatible con servidores proxy inversos.

source: First start the calibre content server as shown below::
es: Primero active el servidor de contenidos de calibre como se muestra a continuación::

source: The exact technique for enabling the proxy modules will vary depending on your Apache installation. Once you have the proxy modules enabled, add the following rules to httpd.conf (or if you are using virtual hosts to the conf file for the virtual host in question)::
es: La técnica exacta para habilitar los módulos proxy variará según la instalación de Apache. Una vez que tenga los módulos proxy habilitados, agregue las siguientes reglas a :file:`httpd.conf` (o, si está usando servidores virtuales, al archivo conf del servidor virtual en cuestión)::

source: That's all, you will now be able to access the calibre Content Server under the /calibre URL in your apache server. The above rules pass all requests under /calibre to the calibre server running on port 8080 and thanks to the --url-prefix option above, the calibre server handles them transparently.
es: Eso es todo, ahora podrá acceder al servidor de contenidos de calibre bajo el URL /calibre en su servidor Apache. Las reglas anteriores pasan todas las peticiones bajo /calibre al servidor de calibre que se ejecuta en el puerto 8080 y gracias a la opción ``--url-prefix`` mencionada anteriormente, el servidor de calibre las gestiona de forma transparente.

source: That's all, you will now be able to access the calibre Content Server under the /calibre URL in your apache server.
es: Eso es todo, ahora podrá acceder al servidor de contenidos de calibre bajo la dirección /calibre en su servidor Apache.
