Repository: Easonqsp/calibre-translations
Catalog: manual/*/sub_groups.po
Languages: es, sv

source: Before going on, please note that we are not talking about folders on the hard disk. Subgroups are not file folders. Books will not be copied anywhere. Calibre's library file structure is not affected. Instead, we are presenting a way to organize and display subgroups of books within a |app| library.
sv: Innan vi går vidare, observera att vi inte talar om mappar på hårddisken. Undergrupper är inte mappar. Böcker kopieras inte någonstans. Calibres bibliotek filstruktur påverkas inte. Istället presenterar vi ett sätt att organisera och visa undergrupper av böcker inom ett |app| bibliotek.

source: A subgroup (e.g., a genre) must contain (point to) books, not categories of books. This is what distinguishes subgroups from |app| user categories.
sv: En undergrupp (t.ex. en genre) ska innehålla (pekare till) böcker, inte kategorier av böcker. Detta är vad som skiljer undergrupper från |app| användarkategorier.

source: By now, your question might be "How was all of this up?" There are three steps: 1) create the custom column, 2) tell |app| that the new column is to be treated as a hierarchy, and 3) add genres.
sv: Nu kan din fråga vara &quot; Hur var allt detta upp&quot?; Det finns tre steg: 1) skapa den anpassade kolumnen, 2) berättar |app| att den nya kolumnen ska behandlas som en hierarki, och 3) lägga till genrer.

source: Then after restarting |app|, you must tell |app| that the column is to be treated as a hierarchy. Go to Preferences -> Look and Feel -> Tag Browser and enter the lookup name "#genre" into the "Categories with hierarchical items" box. Press Apply, and you are done with setting up.
sv: Sedan efter omstart av |app| måste du tala om för |app| att kolumnen ska behandlas som en hierarki. Gå till Inställningar - &gt; Utseende och känsla - &gt; Etikettläsare och anger uppslagsnamn &quot; # genre &quot; i &quot; Kategorier med hierarkiska objekt &quot; låda. Tryck på Verkställ och du är klar med att ställa in.

source: At the point there are no genres in the column. We are left with the last step: how to apply a genre to a book. A genre does not exist in |app| until it appears on at least one book. To learn how to apply a genre for the first time, we must go into some detail about what a genre looks like in the metadata for a book.
sv: Vid den punkt det inte finns genres i kolumnen. Vi är kvar med det sista steget: hur man tillämpar en genre till en bok. En genre finns inte i |app| tills det visas på minst en bok. För att lära sig att tillämpa en genre för första gången, måste vi gå in i detalj om vad en genre ser ut i metadata för en bok.

source: You might want to use the genre information in a template, such as with save to disk or send to device. The question might then be "How do I get the outermost genre name or names?" A |app| template function, subitems, is provided to make doing this easier.
sv: Du kanske vill använda genreinformation i en mall, till exempel med spara till disk eller skicka till enhet. Frågan kan då vara &quot; Hur får jag den yttersta genrenamn eller namn &quot?; En |app|-mallfunktion, underavdelningar, är nödvändig för att göra detta lättare.

source: See :ref:`The template language <templatelangcalibre>` for more information templates and the :func:`subitems` function.
sv: Se :ref:`Mallspråk <templatelangcalibre>` för mer informationsmallar och :func:`subitems` funktion.
