Repository: Easonqsp/calibre-translations
Catalog: manual/*/sub_groups.po
Languages: es, sv

source: Managing subgroups of books, for example "genre"
es: Gestionar subgrupos de libros, por ejemplo «género»
sv: Hantera undergrupper av böcker, till exempel "genre"

source: Some people wish to organize the books in their library into subgroups, similar to subfolders. The most commonly provided reason is to create genre hierarchies, but there are many others. One user asked for a way to organize textbooks by subject and course number. Another wanted to keep track of gifts by subject and recipient. This tutorial will use the genre example for the rest of this post.
es: Algunas personas prefieren organizar los libros de su biblioteca en subgrupos, de forma similar a las subcarpetas. El motivo más frecuente es crear jerarquías de géneros, pero hay muchas otras. Un usuario pide una forma de organizar los libros de texto por número de curso y tema. Otro usuario quiere hacer un seguimiento de los regalos por tema y destinatario. Este cursillo usará el caso de los géneros para el resto de esta entrada.
sv: Vissa människor vill organisera böcker i deras bibliotek i undergrupper, liknande undermappar. Den mest allmänt givna anledningen är att skapa genrehierarkier, men det finns många andra. En användare begärde ett sätt att organisera läroböcker efter ämne och kursnummer. En annan ville hålla reda på gåvor efter ämne och mottagare. Denna handledning kommer att använda genren exempel för resten av det här inlägget.

source: Before going on, please note that we are not talking about folders on the hard disk. Subgroups are not file folders. Books will not be copied anywhere. Calibre's library file structure is not affected. Instead, we are presenting a way to organize and display subgroups of books within a calibre library.
es: Antes de continuar, tenga en cuenta que no estamos hablando de carpetas en el disco duro. Los subgrupos no son carpetas de archivos. Los libros no se copiarán en ningún lugar. La estructura de archivos de la biblioteca de calibre no se ve afectada. En su lugar, se trata de una forma de organizar y mostrar subgrupos de libros en una biblioteca calibre.

source: The commonly-provided requirements for subgroups such as genres are:
es: Los requisitos normalmente establecidos para subgrupos tales como géneros son:
sv: De gemensamt som krav för undergrupper såsom genrer är:

source: A subgroup (e.g., a genre) must contain (point to) books, not categories of books. This is what distinguishes subgroups from calibre user categories.
es: Un subgrupo (por ejemplo, un género) debe contener (o señalar a) libros, no categorías de libros. Esto es lo que distingue los subgrupos de las categorías de usuarios calibre.

source: A book can be in multiple subgroups (genres). This distinguishes subgroups from physical file folders.
es: Un libro puede estar en varios subgrupos (géneros). Esto distingue a los subgrupos de las carpetas de archivos físicos.
sv: En bok kan vara i flera undergrupper (genrer). Detta skiljer grupper från fysiska mappar.

source: Subgroups (genres) must form a hierarchy; subgroups can contain subgroups.
es: Los subgrupos (géneros) deben formar una jerarquía; los subgrupos pueden contener subgrupos.
sv: Undergrupper (genrer) måste bilda en hierarki; undergrupper kan innehålla undergrupper.

source: Tags give you the first two. If you tag a book with the genre then you can use the tag browser (or search) for find the books with that genre, giving you the first. Many books can have the same tag(s), giving you the second. The problem is that tags don't satisfy the third requirement. They don't provide a hierarchy.
es: Las etiquetas satisfacen los dos primeros. Si etiqueta un libro con el género, puede utilizar el explorador de etiquetas (o una búsqueda) para encontrar los libros con ese género, lo que satisface el primer requisito. Varios libros pueden tener la misma etiqueta, lo que satisface el segundo. El problema es que las etiquetas no satisfacen el tercer requisito. No proporcionan una jerarquía.
sv: Etiketter ger dig de två första. Om du etiketterar en bok med genren kan du använda etikettläsaren (eller sök) för att hitta de böcker med den genren, vilket ger dig den första. Många böcker kan ha samma etikett(er), vilket ger dig den andra. Problemet är att etiketter inte uppfyller det tredje kravet. De ger inte en hierarki.

source: |sgtree| Calibre's hierarchy feature gives you the third, the ability to see the genres in a 'tree' and the ability to easily search for books in genre or sub-genre. For example, assume that your genre structure is similar to the following::
es: |sgtree| La función jerárquica de calibre proporciona la tercer opción, la posibilidad de ver los géneros como un «árbol» y la capacidad de buscar libros por género o subgénero. Por ejemplo, supongamos que la estructura de géneros es parecida a la siguiente::
sv: |sgtree| Calibres hierarki funktion ger dig den tredje, förmågan att se de genrer i ett "träd" och möjligheten att enkelt söka efter böcker i genre eller undergenre. Antag till exempel att din genrestruktur är ungefär så här::

source: By using the hierarchy feature, you can see these genres in the tag browser in tree form, as shown in the screen image. In this example the outermost level (Genre) is a custom column that contains the genres. Genres containing sub-genres appear with a small triangle next to them. Clicking on that triangle will open the item and show the sub-genres, as you can see with History and Science Fiction.
es: Mediante la función de jerarquía se pueden ver estos géneros en el explorador de etiquetas en forma de árbol, como se muestra en la imagen de la pantalla. En este ejemplo, el nivel superior (Género) es una columna personalizada que contiene los géneros. Éstos contienen subgéneros que aparecen con un pequeño triángulo a su lado. Al pulsar en ese triángulo se abrirá el elemento y se mostrarán los subgéneros, como se puede ver con Historia y Ciencia ficción.
sv: Genom att använda hierarkifunktionen kan du se dessa genrer i etikettläsaren i trädform , som visas på skärmbilden. I detta exempel den yttersta nivån (Genre) är en anpassad kolumn som innehåller genrer. Genrer som innehåller undergenrer visas med en liten triangel bredvid dem. Genom att klicka på den triangel ska öppna objektet och visa undergenrer, som ni kan se med Historia och Science Fiction.

source: Clicking on a genre can search for all books with that genre or children of that genre. For example, clicking on Science Fiction can give all three of the child genres, Alternate History, Military, and Space Opera. Clicking on Alternate History will give books in that genre, ignoring those in Military and Space Opera. Of course, a book can have multiple genres. If a book has both Space Opera and Military genres, then you will see that book if you click on either genre. Searching is discussed in more detail below.
es: Al hacer clic en un género puede buscar todos los libros con ese género o de sus descendientes en ese género. Por ejemplo, al hacer clic en Ciencia Ficción puede buscar también en los tres géneros descendientes, por ejemplo: Historia alternativa, Militar y Opera espacial. Al hacer clic en Historia Alternativa dará los libros de ese género, haciendo caso omiso de los géneros Militar y Opera espacial. Por supuesto, un libro puede tener múltiples géneros. Si un libro tiene tanto los géneros Opera espacial y Militar, entonces va a ver ese libro si hace clic en cualquiera de los dos géneros. Las búsquedas se discuten con más detalle a continuación.
sv: Genom att klicka på en genre kan sökning ske efter alla böcker med denna genre eller barn i samma genre. Till exempel kan klicka på science fiction ge alla tre av de underordnade genrer, alternativ historia, militär och rymdopera. Genom att klicka på alternativ historia kommer att ge böcker i denna genre, och ignorera de i militär and rymdopera. Naturligtvis kan en bok ha flera genres. Om en bok har både rymdopera -och militärgenrer, så kommer du se att boken om du klickar på någon av genrerna. Sökning diskuteras mer i detalj nedan.

source: Another thing you can see from the image is that the genre Military appears twice, once under History and once under Science Fiction. Because the genres are in a hierarchy, these are two separate genres. A book can be in one, the other, or (doubtfully in this case) both. For example, the books in Winston Churchill's "The Second World War" could be in "History.Military". David Weber's Honor Harrington books could be in "Science Fiction.Military", and for that matter also in "Science Fiction.Space Opera."
es: Otra cosa que puede ver en la imagen es que el género Militar aparece dos veces, una vez bajo Historia y otra Ciencia Ficción. Debido a que los géneros se encuentran en una jerarquía, se trata de dos géneros distintos. Un libro puede estar en uno; el otro, o (dudosamente en este caso) en ambos. Por ejemplo, los libros de Winston Churchill "La Segunda Guerra Mundial" podría estar en "Historia.Militar". Los libros de David Weber "Honor Harrington" podría estar en "Ciencia Ficción.Militar", y para el caso también en "Ciencia Ficción.Opera espacial."
sv: En annan sak du kan se från bilden är att genren militä visas två gånger, en gång i historia och en gång i science fiction. Eftersom genrer är i en hierarki, är dessa två skilda genrer. En bok kan vara i den ena, i den andra, eller (tveksamt i det här fallet) båda. Till exempel kan böckerna i Winston Churchills "Andra världskriget" vara i "historia.militär". David Webers Honor Harrington böckerna kan vara i "science fiction.militär", och för den delen även i "science fiction.rymdopera."

source: Once a genre exists, that is at least one book has that genre, you can easily apply it to other books by dragging the books from the library view onto the genre you want the books to have. You can also apply genres in the metadata editors; more on this below.
es: Una vez que existe un género, esto es, por lo menos existe un libro que tiene ese género, puede fácilmente aplicarlo a otros libros arrastrando los libros desde la vista de biblioteca al género que desea que los libros posean. También puede aplicar los géneros con los editores de metadatos; más sobre esto, más adelante.
sv: När en genre finns, det är att genren har minst en bok, kan du enkelt använda den på andra böcker genom att dra böcker från biblioteket vyn till genren som du vill att böckerna ska ha. Du kan också använda genrer i metadata redaktörer; mer om detta nedan.

source: Setup
es: Configuración
sv: Ställ in

source: By now, your question might be "How was all of this up?" There are three steps: 1) create the custom column, 2) tell calibre that the new column is to be treated as a hierarchy, and 3) add genres.
es: Por ahora, su pregunta podría ser "¿Cómo fue todo esto?" Hay tres pasos: 1) crear la columna personalizada, 2) comunicar a calibre que la nueva columna ha de ser tratada como una jerarquía y 3) agregar los géneros.

source: You create the custom column in the usual way, using Preferences -> Add your own columns. This example uses "#genre" as the lookup name and "Genre" as the column heading. The column type is "Comma-separated text, like tags, shown in the tag browser."
es: Cree la columna personalizada de la forma habitual, usando :guilabel:`Preferencias > Interfaz > Añadir columnas personalizadas`. Este ejemplo utiliza «#género» como el nombre de búsqueda y «Género» como el encabezado de columna. El tipo de columna es «texto separado por comas, como las etiquetas, se mostrará en el explorador de etiquetas."
sv: Du skapar den anpassade kolumnen på vanligt sätt, med hjälp av Inställningar->Lägg till dina egna kolumner. Det här exemplet använder "#genre" som uppslagsnamn och "Genre" som kolumnrubriken. Kolumntypen är "kommaseparerad text, liksom etiketter, som visas i etikett webbläsaren."

source: Then after restarting calibre, you must tell calibre that the column is to be treated as a hierarchy. Go to Preferences -> Look and Feel -> Tag Browser and enter the lookup name "#genre" into the "Categories with hierarchical items" box. Press Apply, and you are done with setting up.
es: Después de reiniciar calibre, debe informar a calibre de que la columna debe ser tratada como una jerarquía. En :guilabel:`Preferencias > Apariencia > Explorador de etiquetas` escriba el nombre de la búsqueda «#género» en «Categorías con elementos jerárquicos». Pulse «Aplicar», y ya está concluida la configuración.

source: At the point there are no genres in the column. We are left with the last step: how to apply a genre to a book. A genre does not exist in calibre until it appears on at least one book. To learn how to apply a genre for the first time, we must go into some detail about what a genre looks like in the metadata for a book.
es: Hasta el punto, no hay géneros en la columna. Nos quedamos con el último paso: cómo aplicar un género en un libro. Un género no existe en calibre hasta que aparece en al menos un libro. Para aprender cómo aplicar un género por primera vez, hay que entrar en algunos detalles acerca de cómo un género se visualiza en los metadatos de un libro.

source: A hierarchy of 'things' is built by creating an item consisting of phrases separated by periods. Continuing the genre example, these items would "History.Military", "Mysteries.Vampire", "Science Fiction.Space Opera", etc. Thus to create a new genre, you pick a book that should have that genre, edit its metadata, and enter the new genre into the column you created. Continuing our example, if you want to assign a new genre "Comics" with a sub-genre "Superheroes" to a book, you would 'edit metadata' for that (comic) book, choose the Custom metadata tab, and then enter "Comics.Superheroes" as shown in the following (ignore the other custom columns):
es: Una jerarquía de 'cosas' se construye mediante la creación de un elemento que consiste en frases separadas por puntos. Continuando con el género de ejemplo, estos artículos serían "Historia.Militar", "Misterios.Vampiro", "Ciencia Ficción.Opera espacial", etc. Por lo tanto la creación de un nuevo género, simplemente elija un libro que debería tener ese género, edite sus metadatos e introduzca el nuevo género dentro de la columna que ha creado. Continuando con nuestro ejemplo, si desea asignar un nuevo género "Historietas" con un sub-género "Superhéroes" a un libro, 'editaría los metadatos' de ese libro (historieta), eligiría la pestaña de metadatos personalizados y a continuación ingresar "Historieta.Superhéroes" como se muestra a continuación (ignorar las otras columnas personalizadas):
sv: En hierarki av "saker" är byggd genom att skapa ett objekt som består av fraser åtskilda av punkter. Fortsätt genren exempel dessa poster skulle "historia.militär", "mysterier. vampyr", "science fiction.rymdopera", etc. Alltså för att skapa en ny genre, väljer du en bok som borde ha den genren, redigera dess metadata och ange den nya genren i kolumnen du skapat. Fortsätter vårt exempel, om du vill tilldela en ny genre "Comics" med en sub-genre "superhjältar" till en bok, skulle du "redigera metadata" för det (komiker) bok väljer fliken Anpassad metadata och ange "Comics.superhjältar "som visas i det följande (ignorera andra anpassade kolumner):

source: After doing the above, you see in the tag browser:
es: Después de hacer lo anterior, el explorador de etiquetas mostrará:
sv: Efter att ha gjort ovanstående, ser du i etikettlläsaren:

source: From here on, to apply this new genre to a book (a comic book, presumably), you can either drag the book onto the genre, or add it to the book using edit metadata in exactly the same way as done above.
es: A partir de aquí, para aplicar este nuevo género a un libro (un libro de historietas, presumiblemente), puede arrastrar el libro o sobre el género o añadirlo al libro usando el editor de metadatos exactamente de la misma manera como lo hizo anteriormente.
sv: Från och med nu, tillämpa denna nya genre till en bok (en serietidning, förmodligen), kan du antingen dra boken på genre eller lägga till det i boken med hjälp av redigera metadata på exakt samma sätt som görs ovan.

source: Searching
es: Búsqueda
sv: Sökning

source: The easiest way to search for genres is using the tag browser, clicking on the genre you wish to see. Clicking on a genre with children will show you books with that genre and all child genres. However, this might bring up a question. Just because a genre has children doesn't mean that it isn't a genre in its own right. For example, a book can have the genre "History" but not "History.Military". How do you search for books with only "History"?
es: La forma más fácil de buscar géneros es utilizar el explorador de etiquetas, pulsando en el género que desee ver. Al hacerlo sobre un género con descendientes se mostrarán los libros con ese género y todos los géneros de sus descendientes. Sin embargo, esto suscita una cuestión. El hecho de que un género tenga descendientes, no significa que no sea un género en sí mismo. Por ejemplo, un libro puede tener el género «Historia», pero no «Historia.Militar». ¿Cómo buscar libros con sólo «Historia»?
sv: Det enklaste sättet att söka efter genrer använder etikettläsare, klicka på den genre du vill se. Genom att klicka på en genre med barn kommer att visa dig böcker med denna genre och alla underordnade genrer. Detta kan dock ta upp en fråga. Bara för att en genre har barn betyder inte att det inte är en genre i sig. Till exempel kan en bok ha genren "historia", men inte "historia.militär". Hur du söka efter böcker med endast "historia"

source: The tag browser search mechanism knows if an item has children. If it does, clicking on the item cycles through 5 searches instead of the normal three. The first is the normal green plus, which shows you books with that genre only (e.g., History). The second is a doubled plus (shown above), which shows you books with that genre and all sub-genres (e.g., History and History.Military). The third is the normal red minus, which shows you books without that exact genre. The fourth is a doubled minus, which shows you books without that genre or sub-genres. The fifth is back to the beginning, no mark, meaning no search.
es: El mecanismo de búsqueda del explorador de etiquetas sabe si un elemento tiene descendientes. Si es así, al pulsar sobre el elemento se pasa sucesivamente por cinco búsquedas en lugar de las tres normales. La primera es el signo «+» verde, que muestra libros con sólo ese género (por ejemplo, «Historia»). El segundo es un doble signo «+» (mostrado arriba), que muestra libros con ese género y todos los subgéneros (por ejemplo, «Historia» e «Historia.Militar»). El tercero es el signo «-» rojo normal, que muestra los libros sin ese género exacto. El cuarto es un signo «-» duplicado, que muestra libros sin ese género o subgéneros. El quinto vuelve nuevamente al principio, ninguna marca, es decir, sin ninguna búsqueda.
sv: Etikettläsarens sökmekanism vet om ett objekt har barn. Om den gör det, klicka på posten utförs 5 sökningar i stället för som normalt tre. Den första är den normala gröna plus, vilket visar böcker med denna genre bara (t.ex. historia). Den andra är en fördubblad plus (visas ovan), vilket visar böcker med denna genre och alla undergenrer (t.ex. Historia och historia.militär). Den tredje är den normala röd minus, vilket visar böcker utan att exakt genre. Den fjärde är en fördubblad minus, vilket visar böcker utan att genre eller undergenrer. Den femte är tillbaka till början, inget märke, vilket innebär ingen sökning.

source: Restrictions
es: Restricciones
sv: Begränsningar

source: If you search for a genre then create a saved search for it, you can use the 'restrict to' box to create a virtual library of books with that genre. This is useful if you want to do other searches within the genre or to manage/update metadata for books in the genre. Continuing our example, you can create a saved search named 'History.Japanese' by first clicking on the genre Japanese in the tag browser to get a search into the search box, entering History.Japanese into the saved search box, then pushing the "save search" button (the green box with the white plus, on the right-hand side).
es: Si busca un género, cree una búsqueda guardada; puede utilizar la opción «restringir a» para crear una biblioteca virtual de libros con ese género. Esto es útil si quiere hacer otras búsquedas dentro del género o para gestionar o actualizar metadatos de los libros de ese género. Continuando con nuestro ejemplo, puede crear una búsqueda guardada llamada «Historia.Japonesa» pulsando primero en el género «Japonesa» del explordor de etiquetas para obtener una búsqueda en el cuadro de búsqueda, introduciendo «Historia.Japonesa» dentro del cuadro de búsqueda guardada y a continuación pulsando el botón «guardar búsqueda» (el cuadro verde con el signo + blanco, en el lado derecho).
sv: Om du söker efter en genre och sedan skapar en sparad sökning för det, kan du använda "Begränsa till" rutan för att skapa ett virtuellt bibliotek med böcker med genren. Detta är användbart om du vill göra andra sökningar inom genren eller hantera / uppdatera metadata för böcker i genren. Fortsätter vårt exempel kan du skapa en sparad sökning som heter "historia.japansk" genom att först klicka på genre japanska i etikettläsare för att få en sökning i sökrutan, in historia.japansk i den sparade sökrutan trycka på "spara sökning "knappen (den gröna rutan med den vita plus, på höger sida).

source: After creating the saved search, you can use it as a restriction.
es: Una vez creada la búsqueda guardada, puede utilizarla como una restricción.
sv: När du har skapat den sparade sökning kan du använda den som en begränsning.

source: Useful Template Functions
es: Funciones de plantilla útiles
sv: Användbara mallfunktioner

source: You might want to use the genre information in a template, such as with save to disk or send to device. The question might then be "How do I get the outermost genre name or names?" A calibre template function, subitems, is provided to make doing this easier.
es: Es posible que desee utilizar la información de género en una plantilla, tales como guardar en disco o enviar a dispositivo. La pregunta podría ser entonces "¿Cómo puedo obtener el nombre de género o nombres más extremos?" Una función de la plantilla calibre, subítems, es proporcionada para hacer esto más fácil.

source: For example, assume you want to add the outermost genre level to the save-to-disk template to make genre folders, as in "History/The Gathering Storm - Churchill, Winston". To do this, you must extract the first level of the hierarchy and add it to the front along with a slash to indicate that it should make a folder. The template below accomplishes this::
es: Por ejemplo, suponga que desea agregar el nivel de género más extremo a la plantilla de guardar en disco para hacer carpetas de género, como "Historia/La tormenta que se avecina - Churchill, Winston". Para ello, debe extraer el primer nivel de la jerarquía y añadirlo a la parte delantera, junto con una barra para indicar que se debe hacer una carpeta. La plantilla a continuación cumple con esto::
sv: Antag till exempel att du vill lägga till det yttersta genrenivån till spara-till-disk mall för att göra genre mappar, som i "Historia / The Gathering Storm - Churchill, Winston". För att göra detta måste du extrahera den första nivån i hierarkin och lägga till den i fronten tillsammans med ett snedstreck för att ange att den ska göra en mapp. Mallen nedan åstadkommer detta::

source: See :ref:`The template language <templatelangcalibre>` for more information about templates and the :func:`subitems` function.
es: Vea :ref:`El lenguaje de plantillas <templatelangcalibre>` para más información sobre las plantillas y la función :func:`subitems`.
