Repository: Easonqsp/calibre-translations
Catalog: manual/*/template_lang.po
Languages: fr, sv

source: ``cmp(x, y, lt, eq, gt)`` -- compares x and y after converting both to numbers. Returns ``lt`` if x < y. Returns ``eq`` if x == y. Otherwise returns ``gt``.
fr: ``cmp(x, y, lt, eq, gt)`` -- compare x et y après les avoir converti tous les deux en nombres. Renvoie ``lt`` si x < y. Renvoie ``eq`` si x == y. Sinon renvoie ``gt``.
sv: ``cmp(x, y, lt, eq, gt)`` -- jämför x och y efter konvertering både siffror. Returnerar ``lt`` om x < y. Returnerar ``eq`` om x == y. Annars returnerar ``gt``.

source: ``current_library_name() -- `` return the last name on the path to the current calibre library. This function can be called in template program mode using the template ``{:'current_library_name()'}``.
fr: ``current_library_name()`` -- retourne le dernier nom du chemin de la bibliothèque calibre actuelle. Cette fonction peut-être appelée en mode modèle de programme en utilisant le modèle "{:'current_library_name()'}".
sv: ``current_library_name() -- `` returnerar efternamnet på sökvägen till den nuvarande calibre-biblioteket. Denna funktion kan anropas i mallprogramläge med mallen ``{:'current_library_name()'}``.

source: ``current_library_path() -- `` return the path to the current calibre library. This function can be called in template program mode using the template ``{:'current_library_path()'}``..
fr: ``current_library_path()`` -- retourne le chemin de la bibliothèque calibre actuelle. Cette fonction peut-être appelée en mode modèle de programme en utilisant le modèle "{:'current_library_path()'}".
sv: ``current_library_path() -- `` returnerar sökvägen till den aktuella calibre-biblioteket. Denna funktion kan anropas i mallprogramläge med mallen ``{:'current_library_path()'}``..

source: ``days_between(date1, date2)`` -- return the number of days between ``date1`` and ``date2``. The number is positive if ``date1`` is greater than ``date2``, otherwise negative. If either ``date1`` or ``date2`` are not dates, the function returns the empty string.
fr: ``days_between(date1, date2)`` -- renvoie le nombre de jours entre ``date1`` et ``date2``. Le nombre est positif si ``date1`` est plus grand que ``date2``, sinon négatif. Si ``date1`` ou ``date2`` ne sont pas des dates, la fonction renvoie une chaîne vide.
sv: ``days_between(date1, date2)`` -- returnera antalet dagar mellan ``date1`` och ``date2``. Numret är positivt om ``date1`` är större än ``date2``, annars negativt. Om någon ``date1`` eller ``date2`` inte datum, returnerar funktionen en tom sträng.

source: ``divide(x, y)`` -- returns x / y. Throws an exception if either x or y are not numbers.
fr: ``divide(x, y)`` -- renvoie x / y. Renvoie une exception si x ou y ne sont pas des nombres.
sv: ``divide(x, y)`` -- returnerar x / y. Ger ett undantag om någon x eller y inte är tal.

source: ``eval(string)`` -- evaluates the string as a program, passing the local variables (those ``assign`` ed to). This permits using the template processor to construct complex results from local variables. Because the `{` and `}` characters are special, you must use `[[` for the `{` character and `]]` for the '}' character; they are converted automatically. Note also that prefixes and suffixes (the `|prefix|suffix` syntax) cannot be used in the argument to this function when using template program mode.
fr: ``eval(string)`` -- évalue la chaîne, en analysant les variables locales (celles ``assign``ées à). Cela permet en utilisant le traitement du modèle de construire des résultats complexes à partir de variables locales. Parce que les caractères `{` et `}` sont spéciaux, vous devez utiliser `[[` pour le caractère `{` et `]]` pour le caractère `}` ; ils sont convertis automatiquement. Notez également que les préfixes et les suffixes (la syntaxe `|prefix|suffix`) ne peuvent pas être utilisés dans les arguments de cette fonction lorsque le mode modèle de programmation est utilisé.
sv: ``eval(string)`` -- utvärderar strängen som ett program, som skickar de lokala variabler (de ``assign`` ade till). Detta gör det möjligt att använda mallprocessorn för att konstruera komplexa resultat från lokala variabler. Eftersom `{` och `}` tecken är speciella, måste du använda `[[` för `{` tecken och `]] 'för'} 'tecken; de omvandlas automatiskt. Observera också att prefix och suffix (det så kallade | prefixet | suffix` syntax) inte kan användas i argumentet till funktionen när du använder mallprogramläge.

source: ``field(name)`` -- returns the metadata field named by ``name``.
fr: ``field(name)`` -- renvoie le champ de métadonnée nommé par ``name``.
sv: ``field(name)`` -- returnerar metatdatafältet med namn ``name``.

source: ``first_matching_cmp(val, cmp1, result1, cmp2, r2, ..., else_result)`` -- compares "val < cmpN" in sequence, returning resultN for the first comparison that succeeds. Returns else_result if no comparison succeeds. Example::
fr: ``first_matching_cmp(val, cmp1, result1, cmp2, r2, ..., else_result)`` -- compare "val < cmpN" dans la séquence, retourne resultN pour la première comparaison qui réussit. Retourne un autre résultat si aucune comparaison ne réussit. Exemple::
sv: ``first_matching_cmp(val, cmp1, result1, cmp2, r2, ..., else_result)`` -- jämför "val < cmpN" i sekvens, returnerar resultN för första jämförelsen som lyckas. Returnerar else_result om ingen jämförelse lyckas. Till exempel::

source: returns "large". The same example with a first value of 16 returns "giant". * ``first_non_empty(value, value, ...)`` -- returns the first value that is not empty. If all values are empty, then the empty value is returned. You can have as many values as you want. * ``format_date(x, date_format)`` -- format_date(val, format_string) -- format the value, which must be a date field, using the format_string, returning a string. The formatting codes are::
fr: retourne "large". Le même exemple avec une première valeur de 16 retourne "giant". * ``first_non_empty(value, value, ...)`` -- renvoie la première valeur qui n'est pas vide. Si toutes les valeurs sont vides, alors la valeur vide est retournée. Vous pouvez avoir autant de valeurs que vous voulez. * ``format_date(x, date_format)`` -- format_date(val, format_string) -- formate la valeur, qui doit être un champ date, en utilisant format_string, retournant une chaîne. Les codes de formatage sont::
sv: returns "large". Samma exempel med ett första värde på 16 returer av "giant". * ``first_non_empty(value, value, ...)`` -- returnerar det första värdet som inte är tom. Om alla värden är tomma, då den tomma värdet returneras. Du kan ha så många värden som du önskar. * ``format_date(x, date_format)`` -- format_date(val, format_string) -- formaterar värdet, som måste vara ett datumfält, med hjälp av format_string, returnera en sträng. Formateringskoderna är::

source: You might get unexpected results if the date you are formatting contains localized month names, which can happen if you changed the format tweaks to contain MMMM. In this case, instead of using something like ``{pubdate:format_date(yyyy)}``, write the template using template program mode as in ``{:'format_date(raw_field('pubdate'),'yyyy')'}``.
fr: Vous pourriez obtenir des résultats inattendus si la date que vous formatez contient des noms de mois localisés, ce qui peut arriver si vous changez les ajustements de format pour contenir MMMM. Dans ce cas, à la place d'utiliser quelque chose comme ``{pubdate:format_date(yyyy)}``, écrivez le modèle en utilisant le mode programmation de modèle comme dans ``{:'format_date(raw_field('pubdate'),'yyyy')'}``.
sv: Du kan få oväntade resultat om det datum du formaterar innehåller lokaliserade månadsnamn, vilket kan hända om du ändrade formatjusteringar att innehålla MMMM. I detta fall, istället för att använda något i stil med `` {pubDate: format_date (åååå)} ``, skriv mallen med mallprogramläge som i `` {: "format_date (raw_field (" pubDate ")," yyyy ")" } ``.

source: finish_formatting(val, fmt, prefix, suffix) -- apply the format, prefix, and suffix to a value in the same way as done in a template like ``{series_index:05.2f| - |- }``. This function is provided to ease conversion of complex single-function- or template-program-mode templates to :ref:`general program mode <general_mode>` (see below) to take advantage of GPM template compilation. For example, the following program produces the same output as the above template::
fr: finish_formatting(val, fmt, prefix, suffix) -- applique le format, le préfixe, et le suffixe à une valeur de la même manière que cela est fait dans un modèle comme ``{series_index:05.2f| - |- }``. Cette fonction est fournie pour facilité la conversion d'une fonction-simple complexe - ou des modèles template-program-mode en :ref:`mode général de programmation <general_mode>` (voir ci-dessous) pour profiter de l'avantage de la compilation de modèle GPM. Par exemple, le programme suivant produit la même sortie que le modèle ci-dessus::
sv: finish_formatting(val, fmt, prefix, suffix) -- tillämpa format, prefix och suffix till ett värde på samma sätt som görs i en mall som ``{series_index:05.2f| - |- }``. Denna funktion finns för att underlätta omvandlingen av komplexa enkelfunktions- eller mallprogrammods mallar till :ref:`allmänna programläge <general_mode>` (se nedan) för att dra nytta av GPM-mallskompilering. Till exempel ger följande program på samma utdata som ovanstående mall::

source: Another example: for the template ``{series:re(([^\s])[^\s]+(\s|$),\1)}{series_index:0>2s| - | - }{title}`` use::
fr: Un autre exemple: pour le modèle ``{series:re(([^\s])[^\s]+(\s|$),\1)}{series_index:0>2s| - | - }{title}`` utilisez::
sv: Ytterligare exempel: för mallen ``{series:re(([^\s])[^\s]+(\s|$),\1)}{series_index:0>2s| - | - }{title}`` använd::

source: ``formats_modtimes(date_format)`` -- return a comma-separated list of colon_separated items representing modification times for the formats of a book. The date_format parameter specifies how the date is to be formatted. See the date_format function for details. You can use the select function to get the mod time for a specific format. Note that format names are always uppercase, as in EPUB.
fr: ``formats_modtimes(date_format)`` -- retourne une liste séparée par des virgules d’éléments séparés par deux-points représentant les dates de modification pour les formats d’un livre. Le paramètre date_format indique comment la date doit être formatée. Regardez la fonction date_format pour des détails. Vous pouvez utiliser la fonction select afin d’obtenir la date de modification d’un format donné. Veuillez noter que les noms de format sont toujours en majuscules, comme dans EPUB.
sv: ``formats_modtimes(date_format)`` -- returnerar en kommaseparerad lista med colon_separated objekt som representerar modifieringstider för formaten i en bok. Den date_format parametern anger hur datumet ska formateras. Se date_format funktionen för detaljer. Du kan använda funktionen för val för att få modifieringstider för ett visst format. Observera att formatnamn är alltid versaler, som i EPUB.

source: ``formats_paths()`` -- return a comma-separated list of colon_separated items representing full path to the formats of a book. You can use the select function to get the path for a specific format. Note that format names are always uppercase, as in EPUB.
fr: ``formats_paths()`` -- retourne une liste séparées par des virgules d'éléments séparés par deux points représentant le chemin absolu vers les formats d'un livre. Vous pouvez utiliser cette fonction pour obtenir le chemin d'un livre particulier. Notez que ces noms de formats sont toujours en majuscule, comme dans EPUB.
sv: ``formats_paths()`` -- returnerar en kommaseparerad lista med colon_separated objekt som representerar fullständig sökväg till format i en bok. Du kan använda select-funktionen för att få sökvägen för ett visst format. Observera att formatnamn är alltid versaler, som i EPUB.

source: ``formats_sizes()`` -- return a comma-separated list of colon_separated items representing sizes in bytes of the formats of a book. You can use the select function to get the size for a specific format. Note that format names are always uppercase, as in EPUB.
fr: ``formats_sizes()`` -- renvoie une liste séparée par des virgules correspondant à des articles représentant les tailles en octets des formats du livre. Vous pouvez utiliser la fonction select pour obtenir la taille d’un format spécifique. Notez que ces noms de formats sont toujours en majuscule, comme dans EPUB.
sv: ``formats_sizes()`` -- returnerar en kommaseparerad lista med colon_separated poster som representerar storlekar i oktetter av formaten i en bok. Du kan använda select-funktionen för att få storleken för ett visst format. Observera att formatnamn är alltid versaler, som i EPUB.

source: ``has_cover()`` -- return ``Yes`` if the book has a cover, otherwise return the empty string
fr: ``has_cover()`` -- renvoie ``Yes`` si le livre a une couverture, sinon renvoie une chaine vide
sv: ``has_cover()`` -- returnerar ``Yes`` om boken har ett omslag annars returneras tomma strängen

source: ``not(value)`` -- returns the string "1" if the value is empty, otherwise returns the empty string. This function works well with test or first_non_empty. You can have as many values as you want.
fr: ``not(value)`` -- renvoie la chaine "1" si la valeur est vide, sinon renvoie la chaine vide. Cette fonction fonctionne très bien avec test ou first_non_empty. Vous pouvez avoir autant de valeurs que vous voulez.
sv: ``not(value)`` -- returnerar strängen "1" om value är tom, annars returneras tomma strängen. Denna funktion fungerar bra med test eller first_non_empty. Du kan ha så många värden som du önskar.

source: ``list_difference(list1, list2, separator)`` -- return a list made by removing from `list1` any item found in `list2`, using a case-insensitive compare. The items in `list1` and `list2` are separated by separator, as are the items in the returned list.
fr: ``list_difference(list1, list2, separator)`` -- retourne une liste en retirant de `list1` n'importe quel élément trouvé dans `list2`, en utilisant une comparasion non sensible à la casse. Les éléments dans `list1` et `list2` sont séparées par un séparateur, comme le sont les éléments dans la liste retournée.
sv: ``list_difference(list1, list2, separator)`` -- returnerar en lista gjord genom att ta bort från `list1` alla poster som finns i `list2`, med hjälp av en skiftlägeskänslig jämförelse. Posterna i `list1` och `list2` separeras av separator, som är posterna i den returnerade listan.

source: ``list_equals(list1, sep1, list2, sep2, yes_val, no_val)`` -- return `yes_val` if `list1` and `list2` contain the same items, otherwise return `no_val`. The items are determined by splitting each list using the appropriate separator character (`sep1` or `sep2`). The order of items in the lists is not relevant. The compare is case insensitive.
fr: ``list_equals(list1, sep1, list2, sep2, yes_val, no_val)`` --retourne `yes_val` si `list1` et `list2` contiennent les mêmes éléments, sinon retourne `no_val`. Les éléments sont déterminés en éclatant chaque liste à l’aide du séparateur approprié (`sep1` ou `sep2`). L’ordre des éléments dans la liste n’est pas pris en compte. La comparaison est insensible à la casse.
sv: ``list_equals(list1, sep1, list2, sep2, yes_val, no_val)`` -- returnerar `yes_val` om `list1` och `list2` innehåller samma poster, annars returneras `no_val`. Posterna bestäms genom att dela upp varje lista med hjälp av lämplig avgränsningstecken (`sep1` eller `sep2`). Ordningen på posterna i listorna är inte relevant. Jämförelsen är skiftlägesomkänslig.

source: ``list_intersection(list1, list2, separator)`` -- return a list made by removing from `list1` any item not found in `list2`, using a case-insensitive compare. The items in `list1` and `list2` are separated by separator, as are the items in the returned list.
fr: ``list_intersection(list1, list2, separator)`` -- retourne une liste faite en supprimant de `list1` n'importe quel élément trouvé dans `list2`, en utilisant une comparaison non sensible à la casse. Les éléments dans `list1` et `list2` sont séparés par un séparateur, comme le sont les éléments dans la liste retournée.
sv: ``list_intersection(list1, list2, separator)`` -- returnerar en lista gjord genom att ta bort från `list1` någon post som inte finns i `list2`, med hjälp av en skiftlägeskänsliga jämförelse. Posterna i `list1` och `list2` separeras av separator, som är poster i den returnerade listan.

source: ``list_re(src_list, separator, include_re, opt_replace)`` -- Construct a list by first separating `src_list` into items using the `separator` character. For each item in the list, check if it matches `include_re`. If it does, then add it to the list to be returned. If `opt_replace` is not the empty string, then apply the replacement before adding the item to the returned list.
fr: ``list_re(src_list, separator, include_re, opt_replace)`` -- Construit une liste en séparant d'abord `src_list` en éléments utilisant le caractère de séparation. Pour chaque élément dans la liste, vérifie s'il correspond à `include_re`. Si c'est le cas, alors il l'ajoute à la liste à renvoyer. Si `opt_replace` n'est pas une chaîne vide, alors effectue le remplacement avant d'ajouter l'élément à la liste renvoyée.
sv: ``list_re(src_list, separator, include_re, opt_replace)`` -- Konstruera en lista genom att först separera `src_list` in poster med `separator` tecken. För varje post i listan, kolla om det passar `include_re`. Om den gör det, så lägga till den i listan som ska returneras. Om `opt_replace` inte är den tomma strängen, så tillämpa bytet innan du lägger till posten till den returnerade listan.

source: ``list_re_group(src_list, separator, include_re, search_re, template_for_group_1, for_group_2, ...)`` -- Like list_re except replacements are not optional. It uses re_group(item, search_re, template ...) when doing the replacements.
fr: ``list_re_group(src_list, separator, include_re, search_re, template_for_group_1, for_group_2, ...)`` -- Comme list_re excepté que les remplacements ne sont pas optionnels. Il utilise re_group(item, search_re, template ...) quand il effectue les remplacements.
sv: ``list_re_group(src_list, separator, include_re, search_re, template_for_group_1, for_group_2, ...)`` -- Liksom list_re utom ersättare inte är valbar. Den använder re_group (item, search_re, mall ...) när man gör ersättning.

source: ``list_sort(list, direction, separator)`` -- return list sorted using a case-insensitive sort. If `direction` is zero, the list is sorted ascending, otherwise descending. The list items are separated by separator, as are the items in the returned list.
fr: ``list_sort(list, direction, separator) -- retourne une liste triée en utilisant un tri insensible à la casse. Si `direction` est zéro, la liste est triée de manière ascendante, sinon descendante. Les éléments sont séparés par le séparateur, comme ceux de la liste retournée.
sv: ``list_sort(list, direction, separator)`` -- returerar lista sorterad med hjälp av en skiftlägeskänslig sortering. Om `direction` är noll, är listan sorteras stigande, annars fallande. Listposter är separerade med separator, likasom de poster i den returnerade listan.

source: ``list_union(list1, list2, separator)`` -- return a list made by merging the items in list1 and list2, removing duplicate items using a case-insensitive compare. If items differ in case, the one in list1 is used. The items in list1 and list2 are separated by separator, as are the items in the returned list.
fr: ``list_union(list1, list2, separator)`` -- retourne une liste faite par la fusion des éléments dans list1 et list2, supprimant les éléments en double en utilisant une comparaison non sensiblez à la casse. Si les éléments ont une casse différente, celui de list1 est utilisé. Les éléments dans list1 et list2 sont séparés par un séparateur, comme le sont les éléments dans la liste retournée.
sv: ``list_union(list1, list2, separator)`` -- returnerar en lista gjord genom att slå samman poster i lista1 och lista2, ta bort dubbletter med hjälp av en skiftlägesokänslig jämförelse. Om poster skiljer sig i skiftläge, är det i lista1 används. Posterna i lista1 och lista2 separeras av separator, likasom de poster i den returnerade listan.

source: ``multiply(x, y)`` -- returns x * y. Throws an exception if either x or y are not numbers.
fr: ``multiply(x, y)`` -- renvoie x * y. Renvoie une exception si x ou y ne sont pas des nombres.
sv: ``multiply(x, y)`` -- returnerar x * y. Ger ett undantag om någon x eller y inte är tal.

source: ``ondevice()`` -- return the string "Yes" if ondevice is set, otherwise return the empty string
fr: ``ondevice()`` -- renvoie la chaîne "Yes" si ondevice est paramétré, sinon renvoie la chaîne vide
sv: ``ondevice()`` -- returnerar strängen "Yes" om ondevice ställs in, annars returneras den tomma strängen

source: ``or(value, value, ...)`` -- returns the string "1" if any value is not empty, otherwise returns the empty string. This function works well with test or first_non_empty. You can have as many values as you want.
fr: ``or(value, value, …)`` -- renvoie la chaîne "1" si n'importe quelle valeur n’est pas vide, sinon renvoie la chaine vide. Cette fonction fonctionne très bien avec test ou first_non_empty. Vous pouvez avoir autant de valeurs que vous voulez.
sv: ``or(value, value, ...)`` -- returnerar strängen "1", om något värde inte är tomt, annars returneras den tomma strängen. Den här funktionen fungerar bra med test eller first_non_empty. Du kan ha så många värden som du önskar.

source: ``print(a, b, ...)`` -- prints the arguments to standard output. Unless you start calibre from the command line (``calibre-debug -g``), the output will go to a black hole.
fr: ``print(a, b, …)`` -- affiche les arguments dans la console standard. Sauf si vous avez démarré calibre à partir de la ligne de commande (``calibre-debug -g``), la sortie ira dans un trou noir.
sv: ``print(a, b, ...)`` -- skriver ut argument till standard ut. Såvida du börjar calibre från kommandoraden (`` calibre-debug -g``), kommer utdata att gå till ett svart hål.

source: ``raw_field(name)`` -- returns the metadata field named by name without applying any formatting.
fr: ``raw_field(name)`` -- renvoie le champ de métadonnée nommé par name sans appliquer aucun formatage.
sv: ``raw_field(name)`` -- returnerar metadatafält med namnet med 'name' utan att tillämpa någon formatering.

source: ``raw_list(name, separator)`` -- returns the metadata list named by name without applying any formatting or sorting and with items separated by separator.
fr: ``raw_field(name, separator)`` -- renvoie la liste de métadonnées nommée par name sans appliquer aucun formatage ou triage et avec les éléments séparés par separator.
sv: ``raw_list(name, separator)`` -- returnerar listan metadata med namnet name utan att tillämpa någon formatering eller sortering och med poster åtskilda av separator.
