Repository: Easonqsp/calibre-translations
Catalog: manual/*/template_lang.po
Languages: fr, sv

source: The lookup function lets us do even fancier processing. For example, assume that if a book has a series, then we want the folder structure `series/series index - title.fmt`. If the book does not have a series, then we want the folder structure `genre/author_sort/title.fmt`. If the book has no genre, we want to use 'Unknown'. We want two completely different paths, depending on the value of series.
fr: La fonction de recherche nous permet de faire le traitement encore plus poussé. Par exemple, supposons que si un livre est dans une série, alors nous voulons que la structure soit la suivante : `series/series index - title.fmt`.. Si le livre n'est pas dans une série, alors nous voulons que la structure des dossiers soit `genre/author_sort/title.fmt`. Si le livre n'a pas de genre, nous voulons utiliser 'Inconnu'. Nous voulons deux chemins de répertoire totalement différents en fonction de la valeur de la série.
sv: Uppslagsfunktionen låter oss göra ännu snyggare bearbetning. Antag till exempel att om en bok har en serie, så vi vill att mappstrukturen `series/series index - title.fmt`. Om boken inte har en serie, så vi vill att mappstrukturen `genre/author_sort/title.fmt`. Om boken inte har någon genre, vill vi använda "Unknown"(Okänd). Vi vill två helt olika vägar, beroende på värdet av serien.

source: To accomplish this, we:
fr: Pour accomplir cela, nous :
sv: För att åstadkomma detta, vi:

source: Create a composite field (call it AA) containing ``{series}/{series_index} - {title'}``. If the series is not empty, then this template will produce `series/series_index - title`.
fr: Créons une colonne composite (appelons là AA) contenant ``{series}/{series_index} - {title'}``. Si la série n'est pas vide, alors ce modèle produit `series/series_index - title`.
sv: Skapa en sammansatt fält (kalla det AA) som innehåller ``{series}/{series_index} - {title'}``. Om serien inte är tom, så kommer den här mallen att producera `series/series_index - title`.

source: Create a composite field (call it BB) containing ``{#genre:ifempty(Unknown)}/{author_sort}/{title}``. This template produces `genre/author_sort/title`, where an empty genre is replaced wuth `Unknown`.
fr: Créons une colonne composite (appelons là BB) contenant ``{#genre:ifempty(Unknown)}/{author_sort}/{title}``. Ce modèle produit `genre/author_sort/title`, où un genre vide est remplacé par `Inconnu`.
sv: Skapa en sammansatt fält (kalla det BB) som innehåller``{#genre:ifempty(Unknown)}/{author_sort}/{title}``. Denna mall ger `genre/author_sort/title`, där en tom genre ersätts med `Unknown` (okänd).

source: Set the save template to ``{series:lookup(.,AA,BB)}``. This template chooses composite field AA if series is not empty, and composite field BB if series is empty. We therefore have two completely different save paths, depending on whether or not `series` is empty.
fr: Paramétrez le modèle de sauvegarde à ``{series:lookup(.,AA,BB)}``. Ce modèle choisit le champ composite AA si série n'est pas vide, et le champ composite BB si série est vide. Nous avons dès lors deux chemins de sauvegarde complètement différents, dépendant du fait que `series` soit vide ou pas.
sv: Ställ spara mallen till ``{series:lookup(.,AA,BB)}``. Denna mall väljer sammansatta fält AA om serien inte är tom, och sammansatta fält BB om serien är tom. Vi har alltså två helt olika sparvägar, beroende på om eller inte `series` är tom.

source: Templates and Plugboards
fr: Modèles et Tableaux de connexions
sv: Mallar och kontrollpaneler

source: Plugboards are used for changing the metadata written into books during send-to-device and save-to-disk operations. A plugboard permits you to specify a template to provide the data to write into the book's metadata. You can use plugboards to modify the following fields: authors, author_sort, language, publisher, tags, title, title_sort. This feature helps people who want to use different metadata in books on devices to solve sorting or display issues.
fr: Les tableaux de connexions sont utilisés pour modifier les métadonnées écrites dans les livres pendant l'envoi à une liseuse et les opérations de sauvegarde sur le disque. Le tableau de connexion vous permet de spécifier pour un modèle de lecteur précis quelles données à insérer dans les métadonnées du livre. Vous pouvez utiliser les tableaux de connexions pour modifier les champs suivants : authors, author_sort, language, publisher, tags, title, title_sort. Cette fonctionnalité aide ceux qui veulent utiliser les différentes métadonnées des livres pour contrôler le tri ou l'affichage des livres sur leurs périphériques.
sv: Kontrollpanel används för att ändra metadata som skrivs in böcker under "skicka till enhet" och "spara till disk" operationer. En kontrollpanel tillåter dig att ange en mall för att tillhandahålla de uppgifter att skriva in bokens metadata. Du kan använda kontrollpaneler att ändra följande fält: författare, author_sort, språk, förläggare, etiketter, titel, title_sort. Denna funktion hjälper människor som vill använda olika metadata i böcker på enheter för att lösa sortering- eller visningsproblem.

source: When you create a plugboard, you specify the format and device for which the plugboard is to be used. A special device is provided, save_to_disk, that is used when saving formats (as opposed to sending them to a device). Once you have chosen the format and device, you choose the metadata fields to change, providing templates to supply the new values. These templates are `connected` to their destination fields, hence the name `plugboards`. You can, of course, use composite columns in these templates.
fr: Lorsque vous créez un tableau de connexion, vous spécifiez le format et le périphérique pour lequel le tableau de connexion doit être utilisé. Un périphérique spécial est procuré, save_to_disk qui est utilisé lors de la sauvegarde de formats (en opposition à les envoyer vers le périphérique). Une fois que vous avez choisi le format et le périphérique, vous choisissez les champs de métadonnées à modifier, indiquez le modèle à appliquer pour fournir les nouvelles valeurs. Ces modèles sont `reliés` à leurs champs de destination, d'où le nom de `tableau de connexions`. Vous pouvez, bien sûr, utiliser des colonnes composites dans ces modèles.
sv: När du skapar en kontrollpanel anger du format och enheten för vilken kontrollpanelen ska användas. En speciell anordning tillhandahålls, save_to_disk, som används när du sparar format (i motsats till att skicka dem till en enhet). När du har valt formatet och enheten, väljer du de metadatafälten att ändra, ger mallar för att leverera de nya värdena. Dessa mallar är `anslutna` till sina destinationsfält, därav namnet `kontrollpanel`. Du kan naturligtvis använda sammansatta kolumner i dessa mallar.

source: When a plugboard might apply (content server, save to disk, or send to device), calibre searches the defined plugboards to choose the correct one for the given format and device. For example, to find the appropriate plugboard for an EPUB book being sent to an ANDROID device, calibre searches the plugboards using the following search order:
fr: Quand un tableau de connexion doit s'appliquer (serveur de contenu, sauvegarde sur disque ou envoyer au périphérique), calibre recherche les tableau de connexions définis et celui qui est correct pour le format donné et le périphérique. Par exemple, pour trouver le tableau de connexion approprié pour un livre EPUB envoyé à un périphérique ANDROID, calibre recherche dans les tableaux de connexion dans l'ordre de recherche suivant :
sv: När en kontrollpanel kan gälla (innehållsserver, spara till disk, eller skicka till enhet), söker calibre de definierade kontrollpaneler att välja den rätta för givet format och enhet. Till exempel, för att hitta rätt kontrollpanel för en EPUB-bok som skickas till en Android-enhet, söker calibre dessa kontrollpaneler enligt följande sökordning:

source: a plugboard with an exact match on format and device, e.g., ``EPUB`` and ``ANDROID``
fr: un tableau de connexion avec une correspondance exacte sur le format et le périphérique, par ex., ``EPUB`` et ``ANDROID``
sv: en kontrollpanel med en exakt passning på format och enhet, till exempel, ``EPUB`` och ``ANDROID``

source: a plugboard with an exact match on format and the special ``any device`` choice, e.g., ``EPUB`` and ``any device``
fr: un tableau de connexion avec une correspondance exacte sur le format et le choix spécial ``n'importe quel périphérique``, par ex., ``EPUB`` et ``n'importe quel périphérique``
sv: en kontrollpanel med en exakt passning på format och den speciella ``any device`` val, till exempel, `` EPUB`` och ``any device``

source: a plugboard with the special ``any format`` choice and an exact match on device, e.g., ``any format`` and ``ANDROID``
fr: un tableau de connexion avec le choix spécial ``n'importe quel format`` et une correspondance exacte sur le périphérique, par ex., ``n'importe quel format`` et ``ANDROID``
sv: en kontrollpanel med en exakt passning på format och den speciella ``any device`` val, och ``ANDROID``

source: a plugboard with ``any format`` and ``any device``
fr: un tableau de conversion avec ``n'importe quel format`` et ``n'importe quel périphérique``
sv: en kontrollpanel med ``något format`` och ``någon enhet``

source: The tags and authors fields have special treatment, because both of these fields can hold more than one item. A book can have many tags and many authors. When you specify that one of these two fields is to be changed, the template's result is examined to see if more than one item is there. For tags, the result is cut apart wherever calibre finds a comma. For example, if the template produces the value ``Thriller, Horror``, then the result will be two tags, ``Thriller`` and ``Horror``. There is no way to put a comma in the middle of a tag.
fr: Les étiquettes et les champs auteur ont un traitement spécial, parce que ces deux champs peuvent contenir plusieurs données. Un livre peut avoir plusieurs étiquettes et plusieurs auteurs. Lorsque vous spécifiez que l'un de ces deux champs doit être modifié, le résultat du modèle est examiné pour voir s'il y a plus d'un élément dedans. Pour les étiquettes, le résultat est découpé partout où calibre trouve une virgule. Par exemple, si le modèle produit les valeurs ``Thriller, Horreur``, alors ke résultat sera deux étiquettes, ``Thriller`` et ``Horreur``. Il n'est pas possible de mettre une virgule au milieu d'une étiquette.
sv: Etiketterna och författare fält har särskild behandling, eftersom båda dessa områden kan ha mer än en post. En bok kan ha många etiketter och många författare. När du anger att ett av dessa två områden ska ändras, är mallens resultat som undersöks för att se om mer än en post finns. För etiketter, skärs resultatet bort varhelst calibre finner ett kommatecken. Till exempel, om mallen producerar värdet ''Thriller, Horror``, då blir resultatet två etiketter, ``Thriller`` och ''Horror``. Det finns inget sätt att sätta ett kommatecken i mitten av en etikett.

source: The same thing happens for authors, but using a different character for the cut, a `&` (ampersand) instead of a comma. For example, if the template produces the value ``Blogs, Joe&Posts, Susan``, then the book will end up with two authors, ``Blogs, Joe`` and ``Posts, Susan``. If the template produces the value ``Blogs, Joe;Posts, Susan``, then the book will have one author with a rather strange name.
fr: La même chose se produit pour les auteurs, mais en utilisant un caractère différent comme séparateur, le `&` (esperluette) au lieu d'une virgule. Par exemple, si le modèle produit la valeur ``Blogs, Joe&Posts, Susan``, alors le livre finira avec deux auteurs ``Blogs, Joe`` et ``Posts, Susan``. Si le modèle produit la valeur ``Blogs, Joe;Posts, Susan``, alors ce livre aura un auteur avec un nom assez étrange.
sv: Samma sak händer för författare, men med en annan karaktär för snittet, en `&` (et-tecken) i stället för ett kommatecken. Till exempel, om mallen producerar värdet ``Blogs, Joe&Posts, Susan``, då kommer boken att sluta med två författare, ``Blogs, Joe`` och ``Posts, Susan``. Om mallen producerar värdet ``Blogs, Joe;Posts, Susan``, då kommer boken att ha en författare med ett ganska konstigt namn.

source: Plugboards affect the metadata written into the book when it is saved to disk or written to the device. Plugboards do not affect the metadata used by ``save to disk`` and ``send to device`` to create the file names. Instead, file names are constructed using the templates entered on the appropriate preferences window.
fr: Les tableaux de connexions affectent les métadonnées écrites dans le livre quand il est sauvegardé sur le disque ou copié sur le périphérique. Les tableaux de connexions n'affecte pas les métadonnées utilisées par ``Enregistrer sur le disque`` et ``Envoyer au périphérique``. A la place, les noms de fichiers sont construits en utilisant les modèles entrés dans la fenêtre de préférence appropriée.
sv: Kontrollpaneler påverkar metadata som skrivs in i boken när den sparas till disk eller skrivs till enheten. Kontrollpaneler påverkar inte metadata som används av ``spara till disk`` och ``skicka till enhet`` för att skapa filnamnen. Istället konstrueras filnamn med hjälp av mallar som anges i lämpliga inställningsfönster.

source: Helpful Tips
fr: Astuces utiles
sv: Användbara tips

source: You might find the following tips useful.
fr: Vous devriez trouver les astuces suivantes utiles.
sv: Du kan hitta följande tips användbart.

source: Create a custom composite column to test templates. Once you have the column, you can change its template simply by double-clicking on the column. Hide the column when you are not testing.
fr: Créez une colonne composite pour tester vos modèles. Une fois la colonne en place, vous pouvez modifier son modèle en double cliquant simplement dessus.Masquez cette colonne lorsque vous ne testez pas.
sv: Skapa en anpassad sammansatt kolumn för att testa mallar. När du har kolumnen, kan du ändra dess mall genom att dubbelklicka på kolumnen. Dölj kolumnen när du inte testar.

source: Templates can use other templates by referencing a composite custom column.
fr: Les modèles peuvent utiliser d'autres modèles se référençant à des colonnes composites.
sv: Mallar kan använda andra mallar genom att referera en sammansatt anpassad kolumn.

source: In a plugboard, you can set a field to empty (or whatever is equivalent to empty) by using the special template ``{}``. This template will always evaluate to an empty string.
fr: Dans un tableau de connexions, vous pouvez paramétrer un champ à vide (ou quelque soit sont équivalent à vide) en utilisant le modèle spécial ``{}``. Ce modèle sera toujours évalué à une chaîne vide.
sv: I en kontrolpanel, kan du ställa in ett fält för att vara tomt (eller vad som motsvarar tom) med hjälp av särskild mall ``{}``. Denna mall kommer alltid utvärderas till en tom sträng.

source: The technique described above to show numbers even if they have a zero value works with the standard field series_index.
fr: La technique indiquée ci-dessus pour montrer les nombre même s'ils ont une valeur zéro fonctionne avec le champ standard series_index.
sv: Den teknik som beskrivs ovan för att visa siffror även om de har ett nollvärde fungerar med standardfält series_index.

source: The calibre template language comes from python and for more details on the syntax of these advanced formatting operations, look at the `Python documentation <https://docs.python.org/2/library/string.html#format-string-syntax>`_.
sv: calibres mallspråk kommer från python och för mer information om syntaxen för dessa avancerade formaterings operationer, titta på `Python dokumentation <https://docs.python.org/2/library/string.html#format-string-syntax>`_.
