Repository: Easonqsp/calibre-translations
Catalog: manual/*/template_lang.po
Languages: fr, sv

source: ``uppercase()`` -- return the value of the field in upper case.
fr: ``uppercase()`` -- renvoie la valeur du champ en majuscule.
sv: ``uppercase()`` -- returnerar värde av fältet som versaler.

source: ``titlecase()`` -- return the value of the field in title case.
fr: ``titlecase()`` -- renvoie la valeur du champ en casse titre.
sv: ``titlecase()`` -- returnerar värde av fältet som rubrikformat.

source: ``capitalize()`` -- return the value with the first letter upper case and the rest lower case.
fr: ``capitalize()`` -- renvoie la valeur avec la première lettre en majuscule et le reste en minuscule.
sv: ``capitalize()`` -- returnerar värde av fältet med första bokstav versal och övriga gemener.

source: ``contains(pattern, text if match, text if not match)`` -- checks if field contains matches for the regular expression `pattern`. Returns `text if match` if matches are found, otherwise it returns `text if no match`.
fr: ``contains(pattern, text if match, text if not match)`` -- vérifie si le champ contient des correspondances pour l’expression régulière `pattern`. Renvoie `texte si correspondance` si des correspondances sont trouvées, sinon `texte si pas de correspondance`
sv: ``contains(pattern, text if match, text if not match)`` -- kollar om fältet innehåller träffar för det reguljära uttrycket `pattern`. Returnerar `text vid träff` om träff hittas annars returneras` text om ingen träff`.

source: ``count(separator)`` -- interprets the value as a list of items separated by `separator`, returning the number of items in the list. Most lists use a comma as the separator, but authors uses an ampersand. Examples: `{tags:count(,)}`, `{authors:count(&)}`
fr: ``count(separator)`` -- interprète la valeur comme une liste d’articles séparés par `separator`, retourne le nombre d’articles dans la liste. Beaucoup de listes utilisent une virgule comme séparateur, mais les auteurs utilisent l’esperluette. Exemples: `{tags:count(,)}`, `{authors:count(&)}`
sv: ``count(separator)`` -- tolkar värde som en lista med objekt åtskilda med `separator`, returnerar antalet objekt i listan. De flesta listor använder kommatecken som skiljetecken, men författarna använder ett et-tecken. Exempel: `{tags:count(,)}`, `{authors:count(&)}`

source: ``format_number(template)`` -- interprets the value as a number and format that number using a python formatting template such as "{0:5.2f}" or "{0:,d}" or "${0:5,.2f}". The field_name part of the template must be a 0 (zero) (the "{0:" in the above examples). See the template language and python documentation for more examples. Returns the empty string if formatting fails.
fr: ``format_number(template)`` -- interprète la valeur comme un nombre et formate ce nombre en utilisant un modèle de formatage python comme "{0:5.2f}" ou "{0:,d}" ou "${0:5,.2f}". Le partie field_name du modèle doit être un 0 (zéro) (le "{0:" dans les exemples ci-dessus). Regardez le langage des modèles et la documentation python pour plus d’exemples. Retourne une chaîne vide si le formatage échoue.
sv: ``format_number(template)`` -- tolkar värdet som ett tal och formatera det numret med hjälp av en python formateringsmall som "{0:5.2f}" eller "{0:,d}" eller "${0:5,.2f}". FIELD_NAME del av mallen måste vara en 0 (noll) (den "{0:" i ovanstående exempel). Se mallspråk och python-dokumentation för fler exempel. Returnerar tom sträng om formatering misslyckas.

source: ``human_readable()`` -- expects the value to be a number and returns a string representing that number in KB, MB, GB, etc.
fr: ``human_readable()`` -- s'attend que la valeur soit un nombre et renvoie une chaîne représentant ce nombre en KB, MB, GB, etc.
sv: ``human_readable()`` -- förväntar sig att värdet är ett nummer och returnerar en sträng som representerar det numret i kB, MB, GB, etc.

source: ``ifempty(text)`` -- if the field is not empty, return the value of the field. Otherwise return `text`.
fr: ``ifempty(text)`` -- si le champ n'est pas vide, renvoie la valeur du champ. Autrement renvoie `text`.
sv: ``ifempty(text)`` -- Om fältet inte är tomt, returnera värdet av fältet. annars returnera `text`.

source: ``in_list(separator, pattern, found_val, not_found_val)`` -- interpret the field as a list of items separated by `separator`, comparing the `pattern` against each value in the list. If the pattern matches a value, return `found_val`, otherwise return `not_found_val`.
fr: ``in_list(separator, pattern, found_val, not_found_val)`` -- interprète le champ comme une liste d'articles séparés par 'separator, comparant `pattern`avec chaque valeur de la liste. Si le modèle correspond à une valeur, renvoie `found_val` sinon renvoie `not_found_val`.
sv: ``in_list(separator, pattern, found_val, not_found_val)`` -- tolkar fältet som en lista med objekt åtskilda med `separator`, jämför `pattern` mot varje värde i listan. Om mönstret passar ett värde, returneras `found_val`, annars returneras` not_found_val`.

source: ``language_codes(lang_strings)`` -- return the language codes for the strings passed in `lang_strings`. The strings must be in the language of the current locale. `Lang_strings` is a comma-separated list.
fr: ``language_codes(lang_strings)`` -- retourne les codes de langue pour les chaines passées dans `lang_strings`. Les chaines doivent être dans la langue actuelle de localisation. `Lang_strings` est une liste séparée par des virgules.
sv: ``language_codes (lang_strings) `` - returnera språkkoder för strängar passerade i `lang_strings`. Strängarna ska vara på samma språk som den aktuella platsen. `Lang_strings` är en kommaseparerad lista.

source: ``language_strings(lang_codes, localize)`` -- return the strings for the language codes passed in `lang_codes`. If `localize` is zero, return the strings in English. If localize is not zero, return the strings in the language of the current locale. `Lang_codes` is a comma-separated list.
fr: ``language_strings(lang_codes, localize)`` -- retourne les chaines des codes de langue passées dans `lang_codes`. Si `localize`est égal à zéro, retourne les chaines en anglais. Si localisation est différente de zéro, retourne les chaines dans la langue utilisée actuellement. `Lang_codes` est une liste séparée par des virgules.
sv: ``language_strings (lang_codes, lokalisera) `` - returnerar strängarna för de koder språk passerade i `lang_codes`. Om `localize` är noll, returnerar strängarna på engelska. Om lokalisera inte är noll, returnerar strängarna på språket på den aktuella platsen. `Lang_codes` är en kommaseparerad lista.

source: ``list_item(index, separator)`` -- interpret the field as a list of items separated by `separator`, returning the `index`th item. The first item is number zero. The last item can be returned using `list_item(-1,separator)`. If the item is not in the list, then the empty value is returned. The separator has the same meaning as in the `count` function.
fr: ``list_item(index, separator)`` -- interprète la valeur comme une liste d’articles séparés par `separator`, retourne l’article `index`. Le premier article est le nombre zéro. Le dernier article peut être retourné en utilisant `list_item(-1,separator)`. Si l’article n’est pas dans liste, alors une valeur vide est renvoyée. Le séparateur a la même signification que dans la fonction `count`.
sv: ``list_item(index, separator)`` -- tolkar fältet som en lista med objekt åtskilda med `separator`, returnerar` index` objektet. Den första elementet är siffran noll. Den sista punkten kan returneras med `list_item (-1, separator)`. Om elementet inte finns i listan, då returneras det tomma värdet. Separatorn har samma betydelse som i `count` funktionen.

source: ``lookup(pattern, field, pattern, field, ..., else_field)`` -- like switch, except the arguments are field (metadata) names, not text. The value of the appropriate field will be fetched and used. Note that because composite columns are fields, you can use this function in one composite field to use the value of some other composite field. This is extremely useful when constructing variable save paths (more later).
fr: ``lookup(pattern, field, pattern, field, ..., else_field)`` -- lcomme switch, sauf que les arguments sont des noms de champs (métadonnées), et pas du texte. La valeur du champ approprié sera récupérée et utilisée. Notez que vu que les colonnes composées sont des champs, vous pouvez utiliser cette fonction dans un champ composé pour utiliser la valeur d’autres champs composés. C’est extrêmement utile dans la construction des chemins d’enregistrement variables (plus à ce propos ultérieurement).
sv: ``lookup(pattern, field, pattern, field, ..., else_field)`` -- som switch-funktionen, förutom att argumenten är fältet (metadata) namn, inte text. Värdet på lämpligt fält att hämtas och används. Observera att eftersom sammansatta kolumnerna är fält, kan du använda den här funktionen i en sammansatt fält för att använda värdet av något annat sammansatt fält. Detta är mycket användbart när man konstruerar variabel spara sökvägar (mer senare).

source: ``re(pattern, replacement)`` -- return the field after applying the regular expression. All instances of `pattern` are replaced with `replacement`. As in all of calibre, these are python-compatible regular expressions.
fr: ``re(pattern, replacement)`` -- renvoie le champ après avoir appliquer l’expression régulière. Toutes les instances de `pattern seront remplacées par `replacement`. Comme tout dans calibre, celles-ci sont des expressions régulières python-compatible.
sv: ``re(pattern, replacement)`` -- returnerar fältet efter applicering av reguljära uttryck. Alla förekomster av `pattern` ersätts med `replacement`. Som i alla calibre, är dessa python-kompatibla reguljära uttryck.

source: ``select(key)`` -- interpret the field as a comma-separated list of items, with the items being of the form "id:value". Find the pair with the id equal to key, and return the corresponding value. This function is particularly useful for extracting a value such as an isbn from the set of identifiers for a book.
fr: ``select(key)`` -- interprète la valeur comme une liste d'articles séparés par des virgules, ceux-ci étant de la forme "id:valeur". Trouve la paire avec l’id égale à la clé, et retourne la valeur correspondante.Cette fonction est particulièrement utile pour extraire une valeur telle qu'un isbn à partir d'un ensemble d'identifiants pour un livre.
sv: ``select(key)`` -- tolkar fält som en kommaseparerad lista med objekten är av formen "id:värde". Hitta det par med id lika med nyckel, och returnera motsvarande värde. Den här funktionen är särskilt användbar för att extrahera ett värde såsom ett isbn från uppsättningen av identifierare för en bok.

source: ``shorten(left chars, middle text, right chars)`` -- Return a shortened version of the field, consisting of `left chars` characters from the beginning of the field, followed by `middle text`, followed by `right chars` characters from the end of the string. `Left chars` and `right chars` must be integers. For example, assume the title of the book is `Ancient English Laws in the Times of Ivanhoe`, and you want it to fit in a space of at most 15 characters. If you use ``{title:shorten(9,-,5)}``, the result will be `Ancient E-nhoe`. If the field's length is less than ``left chars`` + ``right chars`` + the length of ``middle text``, then the field will be used intact. For example, the title `The Dome` would not be changed.
fr: ``shorten(left chars, middle text, right chars)`` -- Retourne une version raccourcie du champ, constituée par les `left chars` caractères du début du champ, suivis par `middle text` et enfin par `right chars` de la fin de la chaîne. `left chars` et `right chars` doivent être des entiers. Par exemple, supposons que le titre du livre est `Ancient English Laws in the Times of Ivanhoe`, et que vous voulez que ce titre rentre dans un espace maximal de 15 charactéres. Si vous utilisez ``{title:shorten(9,-,5)}``, le resultat sera `Ancient E-nhoe`. Si la longueur du champ est inférieure à ``left chars`` + ``right chars`` + la longueur de ``middle text``, alors le champ ne sera pas modifié. Par exemple, le titre `The Dome` ne serait pas modifié.
sv: ``shorten(left chars, middle text, right chars)`` -- Returnerar en förkortad version av fältet, som består av `vänster chars` tecken från början av fältet, följt av `mellan text`, följt av `höger chars` tecken från slutet av strängen. `Vänster chars` och `höger chars` måste vara heltal. Antag till exempel titeln på boken är `Ancient English Lagar i Times of Ivanhoe`, och du vill att den ska passa in i ett utrymme av högst 15 tecken. Om du använder ``{title:shorten(9, -, 5)}``, kommer resultatet att bli `Ancient E-nhoe`. Om fältets längd är mindre än ``vänster chars`` + ``höger chars`` + längden på ``mellan text``, då området kommer att användas intakt. Till exempel, den i rubriken 'Domen` skulle inte ändras..

source: ``str_in_list(val, separator, string, found_val, not_found_val)`` -- treat val as a list of items separated by separator, comparing the string against each value in the list. If the string matches a value, return found_val, otherwise return not_found_val. If the string contains separators, then it is also treated as a list and each value is checked.
fr: ``str_in_list(val, separator, string, found_val, not_found_val)`` -- traite val comme une liste d’éléments séparés par un séparateur, comparant la chaîne de caractères avec chaque valeur de la liste. Si la chaîne correspond à une valeur, cela retourne found_val, sinon, cela retourne not_found_val. Si la chaîne contient des séparateurs, alors c’est également traité comme une liste et chaque valeur est vérifiée.
sv: ``str_in_list(val, separator, string, found_val, not_found_val)`` -- behandla val som en lista med objekt åtskilda av separator, jämför strängen mot varje värde i listan. Om strängen passar ett värde, returneras found_val, annars returneras not_found_val. Om strängen innehåller separatorer, då behandlas det också som en lista och varje värde kontrolleras.

source: ``subitems(val, start_index, end_index)`` -- This function is used to break apart lists of tag-like hierarchical items such as genres. It interprets the value as a comma-separated list of tag-like items, where each item is a period-separated list. Returns a new list made by first finding all the period-separated tag-like items, then for each such item extracting the components from `start_index` to `end_index`, then combining the results back together. The first component in a period-separated list has an index of zero. If an index is negative, then it counts from the end of the list. As a special case, an end_index of zero is assumed to be the length of the list. Examples::
fr: ``subitems(val, start_index, end_index)`` -- Cette fonction est utilisée pour séparer des listes d’éléments analogues de type hiérarchique comme les genres. Elle interprète la valeur comme une liste d’éléments séparés par des virgules d'éléments analogues, où chaque élément est une liste séparée par des points. Retourne une nouvelle liste composée en recherchant d’abord tous les éléments analogues séparés par des points, puis pour chacun de ces éléments en extrayant les composantes entre `start_index` et `fin_index` avant de les recombiner. Le premier élément dans une liste séparée par des points a un index de 0. Si un index est négatif, alors il part de la fin de la liste. Comme cas spécial, un fin_index de zéro est considéré comme étant la longueur de la liste. Exemples::
sv: ``subitems(val, start_index, end_index)`` -- Denna funktion används för att bryta isär listor över etikettlika hierarkiska poster såsom genrer. Det tolkar värde som en kommaseparerad lista med etikettliknande objekt, där varje objekt är en period separerad lista. Ger en ny lista görs genom att först hitta alla period separerad etikett liknande föremål, därefter för varje sådan post extrahera komponenterna från `start_index` till` end_index`, sedan kombinera resultaten tillbaka tillsammans. Den första komponenten i en period separerad lista har ett index på noll. Om ett index är negativ, så det räknas från slutet av listan. Som ett specialfall är en END_INDEX av noll antas vara längden av listan. Exempel::

source: ``sublist(val, start_index, end_index, separator)`` -- interpret the value as a list of items separated by `separator`, returning a new list made from the items from `start_index`to `end_index`. The first item is number zero. If an index is negative, then it counts from the end of the list. As a special case, an end_index of zero is assumed to be the length of the list. Examples assuming that the tags column (which is comma-separated) contains "A, B ,C"::
fr: ``sublist(val, start_index, end_index, separator) -- interprète la valeur comme une liste d’éléments séparés par `separator`, retournant une nouvelle liste composée des éléments compris entre `start_index` et `fin_index`. Le premier élément est le numéro 0. Si un index est négatif, alors il part de la fin de la liste. Comme cas spécial, un fin_index de zéro est considéré comme étant la longueur de la liste. Des exemples supposant que la colonne des étiquettes (qui sont séparées par des virgules) contient "A, B, C"::
sv: ``sublist(val, start_index, end_index, separator)`` -- tolkar värde som en lista med objekt åtskilda med `separator`, återvänder en ny lista gjord av objekten från `start_index`till `end_index`. Den första punkten är siffran noll. Om ett index är negativ, så det räknas från slutet av listan. Som ett specialfall är en END_INDEX av noll antas vara längden av listan. Exempel om man antar att etikettkolumnen (som är kommaseparerade) innehåller "A, B ,C"::

source: ``swap_around_comma(val) `` -- given a value of the form ``B, A``, return ``A B``. This is most useful for converting names in LN, FN format to FN LN. If there is no comma, the function returns val unchanged.
fr: ``swap_around_comma(val)`` -- pour une valeur au format "B, A", renvoie "A B". Ceci est très utile pour la conversion des noms du format LN, FN vers FN LN. Si il n’y a pas de virgule, la fonction renvoie val non modifié.
sv: ``swap_around_comma(val) `` -- ges ett värde av formen ``B, A``, returneras ``AB``. Detta är mest användbart för att konvertera namnen i LN, FN-format till FN LN. Om det inte finns någon kommatecken returneras funktionen val oförändrad.

source: ``switch(pattern, value, pattern, value, ..., else_value)`` -- for each ``pattern, value`` pair, checks if the field matches the regular expression ``pattern`` and if so, returns that ``value``. If no ``pattern`` matches, then ``else_value`` is returned. You can have as many ``pattern, value`` pairs as you want.
fr: ``switch(pattern, value, pattern, value, …, else_valeur)`` -- pour chaque paire ``pattern, value``, vérifie si le champ à des correspondances pour l’expression régulière ``pattern`` et si oui renvoie cette ``valeur``. Si aucun ``pattern`` ne correspond, alors else_value est renvoyé. Vous pouvez avoir autant de paires ``pattern, value`` que vous voulez.
sv: ``switch(pattern, value, pattern, value, ..., else_value)`` -- för varje ``pattern, value`` par, kontrollerar om fältet passar det reguljära uttrycket ``pattern`` och i så fall returnerar att ``value``. Om inget ``pattern`` passar, då returneras ``else_value``. Du kan ha så många ``pattern, value`` par som du vill.

source: ``test(text if not empty, text if empty)`` -- return `text if not empty` if the field is not empty, otherwise return `text if empty`.
fr: ``test(text if not empty, text if empty)`` -- renvoie `text if not empty` si le champ n’est pas vide, sinon renvoie `text if empty`.
sv: ``test(text if not empty, text if empty)`` -- returnerar `text om inte empty` om fältet inte är tomt, annars returneras `text om empty`.

source: ``transliterate()`` -- Returns a string in a latin alphabet formed by approximating the sound of the words in the source field. For example, if the source field is ``Фёдор Миха́йлович Достоевский`` the function returns ``Fiodor Mikhailovich Dostoievskii``.'
fr: ``transliterate()`` - Restitue une chaîne en alphabet latin représentant approximativement le son des mots de la chaîne source. Par exemple, si le champ source est `Фёдор Миха́йлович Достоевский`` la fonction renverra ``Fiodor Mikhailovich Dostoievskii``.'
sv: ``transliterate()`` -- Returnerar en sträng i ett latinskt alfabet som bildas genom en tillnärmning av ljudet av orden i källfältet. Till exempel, om källområdet är`Фёдор Миха́йлович Достоевский`` returnerar funktionen ``Fiodor Mikhailovich Dostoievskii``.'

source: Now, what about using functions and formatting in the same field. Suppose you have an integer custom column called ``#myint`` that you want to see with leading zeros, as in ``003``. To do this, you would use a format of ``0>3s``. However, by default, if a number (integer or float) equals zero then the field produces the empty value, so zero values will produce nothing, not ``000``. If you really want to see ``000`` values, then you use both the format string and the ``ifempty`` function to change the empty value back to a zero. The field reference would be::
fr: Maintenant, qu'en est-il de l'utilisation des fonctions et du formatage dans le même champ. Supposons que vous avez une colonne personnalisée appelée ``#myint`` que vous voulez avoir avec des 0 devant, tel que ``003``. Pour ce faire, vous devez utiliser un format de ``0>3s``. Cependant, par défaut, si un nombre (entier ou flottant) est égal à zéro alors le champ retourne une valeur vide, et les valeurs nulles ne produisent rien, pas ``000``. Si vous voulez vraiment voir la valeur ``000``, alors vous utilisez à la fois un format de chaîne et la fonction ``ifempty`` pour traiter la valeur vide et la transformer en zéro. La référence de champ serait::
sv: Nu, hur är det med funktioner och formatering inom samma område. Anta att du har en heltalsanpassad kolumn kallad ``#myint`` som du vill se med ledande nollor, som i ``003``. För att göra detta, skulle du använda ett format på ``0>3s``. Men som standard, om ett nummer (heltal eller flyttal) är lika med noll då producerar fältet tomt värde, så nollvärden kommer att producera någonting, inte ``000``. Om du verkligen vill se ``000`` värden, då använder du både formatsträngen och ``ifempty`` funktionen för att ändra det tomma värdet till noll. Fältreferens vore::

source: Note that you can use the prefix and suffix as well. If you want the number to appear as ``[003]`` or ``[000]``, then use the field::
fr: Notez que vous pouvez également utiliser préfixe et suffixe, si vous voulez que le nombre apparaisse comme ``[003]`` ou ``[000]``, utilisez alors le champ::
sv: bservera att du kan använda prefix och suffix också. Om du vill att numret ska visas som ``[003]`` eller ``[000]``, använd då fältet::

source: Using functions in templates - template program mode
fr: Utiliser les fonctions dans les modèles - mode modèle de programme
sv: Använda funktioner i mallar - mallprogramläge

source: The template language program mode differs from single-function mode in that it permits you to write template expressions that refer to other metadata fields, modify values, and do arithmetic. It is a reasonably complete programming language.
fr: Le langage du mode modèle de programme diffère du mode fonction seule en ce qu'il permet d'écrire des expressions de modèles qui font référence à d'autres champs de métadonnées, champs, de modifier les valeurs et faire de l'arithmétique. Il s'agit d'un langage de programmation assez complet.
sv: Mallens språk för programläge skiljer sig från enkelfunktionsläge genom att den tillåter dig att skriva malluttryck som refererar till andra metadatafält, ändra värden och utföra aritmetik. Det är en ganska komplett programmeringsspråk.
