Repository: Easonqsp/calibre-translations
Catalog: manual/*/template_lang.po
Languages: fr, sv

source: You can use the functions documented above in template program mode. See below for details.
fr: Vous pouvez utiliser les fonctions documentées ci-dessus dans le mode de programmation de modèle. Voir ci-dessous pour plus de détails.
sv: Du kan använda de funktioner som dokumenterats ovan i mallprogramsläge. Se nedan för mer information.

source: Beginning with an example, assume that you want your template to show the series for a book if it has one, otherwise show the value of a custom field #genre. You cannot do this in the basic language because you cannot make reference to another metadata field within a template expression. In program mode, you can. The following expression works::
fr: Commençons par un exemple : supposons que vous voulez que votre modèle vous donne la série d'un livre s'il en a une, et sinon vous donne la valeur du champ personnalisé #genre. Vous ne pouvez pas le faire dans la langue de base, parce que vous ne pouvez pas faire référence à un autre champ de métadonnées dans l'expression d'un modèle. En mode programmation, vous pouvez. L'expression suivante fonctionne::
sv: Från och med ett exempel, anta att du vill att din mall visar serien för en bok om den har en, annars visar värdet av ett anpassat fält #genre. Du kan inte göra det i den grundläggande språket eftersom du inte kan hänvisa till en annan metadatafält i ett malluttryck. I programläget kan du. Följande uttryck fungerar::

source: The example shows several things:
fr: L'exemple montre plusieurs choses :
sv: Exemplet visar flera saker:

source: program mode is used if the expression begins with ``:'`` and ends with ``'``. Anything else is assumed to be single-function.
fr: le mode modèle de programmation est utilisé si l'expression commence par ``:'`` et se termine par ``'``. Tout le reste est considéré comme étant fonction-seule.
sv: programläge används om uttrycket börjar med ``:'`` och slutar med ``'``. Något annat antas vara enkelfunktion.

source: the variable ``$`` stands for the field the expression is operating upon, ``#series`` in this case.
fr: la variable ``$`` représente le champ sur lequel porte l'expression opère, ``#series`` dans ce cas.
sv: variabeln ``$`` står för fältet uttrycket fungerar på, ``#series`` i detta fall.

source: functions must be given all their arguments. There is no default value. For example, the standard built-in functions must be given an additional initial parameter indicating the source field, which is a significant difference from single-function mode.
fr: les fonctions doivent être donnés avec tous leurs arguments. Il n'y a pas de valeur par défaut. Par exemple, les fonctions intégrées standard doivent avoir un paramètre initial supplémentaire indiquant le champ source, ce qui est une différence importante avec le mode fonction-seule.
sv: funktioner måste få alla deras argument. Det finns inget standardvärde. Till exempel måste de inbyggda standard funktioner ges en extra initial parameter som indikerar källområdet, vilket är en avsevärd skillnad från enkelfunktionsläge.

source: white space is ignored and can be used anywhere within the expression.
fr: les espaces sont ignorés et peuvent être utlisés n'importe où dans l'expression.
sv: blanktecken ignoreras och kan användas var som helst i uttrycket.

source: constant strings are enclosed in matching quotes, either ``'`` or ``"``.
fr: les chaînes constantes sont entre guillemets, soit ``'`` ou ``"``.
sv: konstanta strängar är inneslutna i passande citat, antingen ``'`` eller ``"` `.

source: The language is similar to ``functional`` languages in that it is built almost entirely from functions. A statement is a function. An expression is a function. Constants and identifiers can be thought of as functions returning the value indicated by the constant or stored in the identifier.
fr: Le langage est similaire aux langages ``fonctionnels`` en ce qu'il est construit presque entièrement à partir de fonctions. Une déclaration est une fonction. Une expression est une fonction. Constantes et identificateurs peuvent être considérés comme des fonctions renvoyant la valeur indiquée par la constante ou stockés dans l'identificateur.
sv: Språket liknar ``funktionella`` språk genom att det är byggt nästan helt från funktioner. En förklaring är en funktion. Ett uttryck är en funktion. Konstanter och kännetecken kan ses som funktioner som returnerar värdet indikeras av konstanten eller lagrad i identifieraren.

source: The syntax of the language is shown by the following grammar::
fr: La syntaxe du langage est représentée par la grammaire suivante::
sv: Syntaxen för språket visas med följande grammatik::

source: Comments are lines with a '#' character at the beginning of the line.
fr: Les commentaires sont des lignes avec le caractère '#' au début de la ligne.
sv: Kommentarer är rader med ett "#" tecknet i början av raden.

source: An ``expression`` always has a value, either the value of the constant, the value contained in the identifier, or the value returned by a function. The value of a ``statement`` is the value of the last expression in the sequence of statements. As such, the value of the program (statement)::
fr: Une ``expression`` a toujours une valeur, soit la valeur d'une constante, soit la valeur contenue dans un identifiant, ou la valeur retournée par une fonction. La valeur d'une ``déclaration`` est la valeur de la dernière expression d'une phrase de déclarations. De même, la valeur d'un programme (déclaration)::
sv: Ett ``uttryck`` har alltid ett värde, antingen värdet på konstanten, det värde som finns i identifierare, eller det värde som returneras av en funktion. Värdet av ett ''påstående`` är värdet av det sista uttrycket i sekvensen av påståendet. Som sådan, värdet av programmet (påstående)::

source: is 3.
fr: est 3.
sv: är 3.

source: Another example of a complex but rather silly program might help make things clearer::
fr: Un autre exemple d'un programme complexe, même s'il est un peu ridicule, pourrait aider à clarifier les choses::
sv: Ett annat exempel på ett komplext men ganska dumt program kan bidra till att göra saker och ting tydligare::

source: This program does the following:
fr: Ce programme fait ce qui suit :
sv: Detta program gör följande:

source: specify that the field being looked at is series_index. This sets the value of the variable ``$``.
fr: précise que le champ qui doit être traité est series_index. Cela définit la valeur de la variable ``$``.
sv: ange att det område som betraktas på är series_index. Detta ställer in värdet på variabeln ``$ ``.

source: calls the ``substr`` function, which takes 3 parameters ``(str, start, end)``. It returns a string formed by extracting the start through end characters from string, zero-based (the first character is character zero). In this case the string will be computed by the ``strcat`` function, the start is 0, and the end is 6. In this case it will return the first 6 characters of the string returned by ``strcat``, which must be evaluated before substr can return.
fr: appelle la fonction ``substr``, qui comprend 3 paramètres ``(str, start, end)``. Elle renvoie une chaîne qui est formée par l'extraction des caractères du début à la fin de la chaîne, base zéro (le premier caractère est un caractére zéro). Dans ce cas, la chaîne sera calculée par la fonction ``strcat``, le début est 0, et la fin est 6. Dans ce cas, elle retournera les 6 premiers caractères de la chaîne renvoyée par ``strcat``, qui doit être évaluée avant que substr puisse renvoyer.
sv: anrop av ``substr`` funktionen, som tar 3 parametrar ``(str, start, slut) ``. Den returnerar en sträng som bildas genom att extrahera start genom sluttecken från strängen, nollbaserad (det första tecknet är tecknet noll). I detta fall strängen kommer att beräknas av ``strcat`` funktionen, är början 0, och slutet är 6. I detta fall den ger de 6 första tecknen i strängen som returneras av ``strcat``, vilket måste utvärderas innan substr kan återvända.

source: calls the ``strcat`` (string concatenation) function. Strcat accepts 1 or more arguments, and returns a string formed by concatenating all the values. In this case there are three arguments. The first parameter is the value in ``$``, which here is the value of ``series_index``. The second paremeter is the constant string ``'->'``. The third parameter is the value returned by the ``cmp`` function, which must be fully evaluated before ``strcat`` can return.
fr: appelle la fonction ``strcat`` (concaténation de chaîne). Strcat accepte 1 ou plus d'arguments, et renvoie une chaîne formée par la concaténation de toutes les valeurs. Dans ce cas il y a trois arguments. Le premier paramètre est la valeur dans ``$``, qui ici est la valeur de ``series_index``. Le deuxième paramètre est la chaîne constante ``'->'``. Le troisième paramètre est la valeur retournée par la fonction ``cmp``, qui doit être complètement évaluée avant que ``strcat`` puisse renvoyer.
sv: anropar ``strcat`` (strängsammanfogning) funktionen. Strcat accepterar 1 eller flera argument, och returnerar en sträng som bildas genom att sammanfoga alla värden. I detta fall finns det tre argument. Den första parametern är värdet i ``$``, vilket här är värdet på ``series_index``. Den andra parametern är en konstantsträng `` '->' ``. Den tredje parametern är värdet som returneras av ``cmp`` funktionen, som ska vara fullt utvärderad innan ``strcat`` kan returnera.

source: The ``cmp`` function takes 5 arguments ``(x, y, lt, eq, gt)``. It compares x and y and returns the third argument ``lt`` if x < y, the fourth argument ``eq`` if x == y, and the fifth argument ``gt`` if x > y. As with all functions, all of the parameters can be statements. In this case the first parameter (the value for ``x``) is the result of dividing the series_index by 2. The second parameter ``y`` is the constant ``1``. The third parameter ``lt`` is a statement (more later). The fourth parameter ``eq`` is the constant string ``'eq'``. The fifth parameter is the constant string ``'gt'``.
fr: La fonction ``cmp`` comprend 5 arguments ``(x, y, lt, eq, gt)``. Elle compare x et y et renvoie le troisième argument ``lt`` si x < y, le quatrième argument ``eq`` si x == y, et le cinquième argument ``gt`` si x > y. Comme avec toutes les fonctions, tous les paramètres peuvent être des déclarations. Dans ce cas le premier paramètre (la valeur pour ``x``) est le résultat de la division de series_index par 2. Le deuxième paramètre ``y`` est la constante ``1``. Le troisième paramètre ``t`` est une déclaration (plus à ce sujet plus tard). Le quatrième paramètre ``eq`` est la chaîne constante ``'eq'``. Le cinquième paramètre est la chaîne constante ``'gt'``.
sv: ` cmp`` funktionen tar 5 argument ``(x, y, lt, eq, gt)``. Den jämför x och y och returnerar det tredje argumentet ``lt`` om x<y, den fjärde argumentet ``eq`` om x == y, och den femte argumentet ``gt`` om x>y. Som med alla funktioner kan alla parametrar vara påstående. I detta fall är den första parametern (värdet för ``x``) är resultatet av att dividera series_index med 2. Den andra parametern ``y`` är konstant `` 1``. Den tredje parametern ``lt`` är ett påstående (mer senare). Den fjärde parametern ``eq`` är konstantsträngen ``'eq'``.. Den femte parametern är konstant sträng ``'gt'``.

source: The third parameter (the one for ``lt``) is a statement, or a sequence of expressions. Remember that a statement (a sequence of semicolon-separated expressions) is also an expression, returning the value of the last expression in the list. In this case, the program first assigns the value ``1`` to a local variable ``c``, then returns a substring made by extracting the c'th character to the end. Since c always contains the constant ``1``, the substring will return the second through end'th characters, or ``'t123'``.
fr: Le troisième paramètre (celui pour ``it``) est une déclaration ou une séquence d'expressions. Rappelez-vous qu'une déclaration (une séquence d'expressions séparées par des points-virgules) est également une expression et renvoie la valeur de la dernière expression dans la liste. Dans ce cas, le programme affecte d'abord la valeur ``1`` à une variable locale ``c``, puis retourne une sous-chaîne faite par l'extraction du c'th caractère à la fin. Puisque c contient toujours la constante ``1``, la sous-chaîne retournera le deuxième jusqu'aux caractères de fin, ou ``t123``.
sv: Den tredje parametern (en för ``lt``) är ett påstående, eller en sekvens av uttryck. Tänk på att ett påstående (en sekvens av semikolonseparerade uttryck) är också ett uttryck, returnerar värdet för det sista uttrycket i listan. I detta fall tilldelar programmet först värdet ``1`` till en lokal variabel ``c`` returnerar sedan en delsträng genom att extrahera c'th karaktär till slutet. Sedan c innehåller alltid konstant ``1``, delsträngen kommer den andra returnera genom end'th tecknet, eller ``'t123'``.

source: Once the statement providing the value to the third parameter is executed, ``cmp`` can return a value. At that point, ``strcat` can return a value, then ``substr`` can return a value. The program then terminates.
fr: Une fois la déclaration donnant la valeur du troisième paramètre est exécutée, ``cmp`` peut renvoyer une valeur. A ce moment, ``strcat`` peut renvoyer une valeur, puis ``substr`` peut renvoyer une valeur. Ensuite, le programme se termine.
sv: När påståendet som ger värdet till den tredje parametern utförs, ``cmp`` kan ett värde returneras. Vid den tidpunkten, kan ``strcat` returnera ett värde, då ``substr`` kan returnera ett värde. Programmet avslutas därefter.

source: For various values of series_index, the program returns:
fr: Pour différentes valeurs de series_index, le programme renvoie :
sv: Vid olika värden för series_index returnerar programmet:

source: series_index == undefined, result = ``prefix ->t123 suffix``
fr: series_index == indéfini, résultat = ``préfixe ->t123 suffixe``
sv: series_index == odefinerad, result = ``prefix ->t123 suffix``

source: series_index == 0.5, result = ``prefix 0.50-> suffix``
fr: series_index == 0.5, resultat = ``prefix 0.50-> suffix``

source: series_index == 1, result = ``prefix 1->t12 suffix``
fr: series_index == 1, résultat = ``préfixe 1->t12 suffixe``

source: series_index == 2, result = ``prefix 2->eq suffix``
fr: series_index == 2, résultat = ``préfixe 2->eq suffixe``

source: series_index == 3, result = ``prefix 3->gt suffix``
fr: series_index == 3, résultat = ``préfixe 3->gt suffixe``

source: **All the functions listed under single-function mode can be used in program mode**. To do so, you must supply the value that the function is to act upon as the first parameter, in addition to the parameters documented above. For example, in program mode the parameters of the `test` function are ``test(x, text_if_not_empty, text_if_empty)``. The `x` parameter, which is the value to be tested, will almost always be a variable or a function call, often `field()`.
fr: **Toutes les fonctions listées sous le mode fonction-seule peuvent être utilisées dans le mode programmation**. Pour faire cela, vous devez fournir la valeur sur laquelle la fonction agit comme premier paramètre, en complément des paramètres documentés ci-dessus. Par exemple, en mode programmation les paramètres de la fonction `test` sont ``test(x, text_if_not_empty, text_if_empty)``. Le paramètre `x`, qui est la valeur à tester, sera presque toujours une variable ou un appel de fonction, souvent `field()`.
sv: **Alla funktioner som listas under enkelfunktionsläge kan användas i programläge**. För att göra det måste du ange det värde som funktionen ska verka på som första parameter, utöver de parametrar som dokumenterats ovan. Till exempel i programläge är parametrarna i `test` funktionen ``test(x, text_if_not_empty, text_if_empty)``. `x` parametern, vilket är det värde som ska testas, kommer nästan alltid att vara en variabel eller ett funktionsanrop, ofta `field()`.

source: The following functions are available in addition to those described in single-function mode. Remember from the example above that the single-function mode functions require an additional first parameter specifying the field to operate on. With the exception of the ``id`` parameter of assign, all parameters can be statements (sequences of expressions). Note that the definitive documentation for functions is available in the section :ref:`Function classification <template_functions_reference>`:
fr: Les fonctions suivantes sont disponibles en complément de celles décrites dans le mode fonction-seule. Rappelez-vous de l'exemple ci-dessus que les fonctions du mode fonction-seule requièrent un premier paramètre additionnel spécifiant le champ sur lequel opérer.Avec l'exception du paramètre ``id`` d'assign, tous les paramètres peuvent être des déclarations (séquences d'expressions). Notez que la documentation définitive pour les fonctions est disponible dans la section :ref:`Classification de fonction <template_functions_reference>`:
sv: Följande funktioner finns tillgängliga utöver de som beskrivs i enkelfunktionsläge. Minns från exemplet ovan att enkelfunktionsläges funktionerna kräver att ytterligare första parameter anges för vilket område som ska användas. Med undantag för ``id`` parametertilldelning, kan alla parametrar vara satser (sekvenser av uttryck). Observera att den slutgiltiga dokumentationen för funktioner finns i avsnittet :ref:`Funktionsklassificering <template_functions_reference>`:

source: ``and(value, value, ...)`` -- returns the string "1" if all values are not empty, otherwise returns the empty string. This function works well with test or first_non_empty. You can have as many values as you want.
fr: ``and(valeur, valeur, …)`` -- renvoie la chaîne "1" si toutes les valeurs ne sont pas vides, sinon renvoie la chaine vide. Cette fonction fonctionne très bien avec test ou first_non_empty. Vous pouvez avoir autant de valeurs que vous voulez.
sv: ``and(value, value, ...)`` -- returnerar strängen "1" om alla värdena är inte tomma, annars returneras en tom sträng. Den här funktionen fungerar bra med testet eller first_non_empty. Du kan ha så många värden som du önskar.

source: ``add(x, y)`` -- returns x + y. Throws an exception if either x or y are not numbers.
fr: ``add(x, y)`` -- renvoie x + y. Renvoie une exception si x ou y ne sont pas des nombres.
sv: ``add(x, y)`` -- returnerar x + y. Ger ett undantag om någon av x eller y inte är tal.

source: ``assign(id, val)`` -- assigns val to id, then returns val. id must be an identifier, not an expression
fr: ``assign(id, val)`` -- assigne val à id, puis renvoie val. id doit être un identifiant, pas une expression
sv: ``assign(id, val)`` -- tilldelar val till id, returnerar sedan val. id måste vara en identifierare, inte ett uttryck

source: ``approximate_formats()`` -- return a comma-separated list of formats that at one point were associated with the book. There is no guarantee that the list is correct, although it probably is. This function can be called in template program mode using the template ``{:'approximate_formats()'}``. Note that format names are always uppercase, as in EPUB.
fr: ``approximate_formats()`` -- retourne une liste de formats, séparées par des virgules, qui, à un certain moment, on été associés avec le livre. Il n'y a aucune garantie que cette liste est correcte, bien qu'elle le soit probablement. Cette fonction peut-être appelée en mode de modèle de programme en utilisant le modèle "{:'approximate_formats()'}". Notez que ces noms de formats sont toujours en majuscule, comme dans EPUB.
sv: ``approximate_formats()`` -- returnerar en kommaseparerad lista med format som vid ett tillfälle var förknippade med boken. Det finns ingen garanti att listan är korrekt, även om den antagligen är det. Denna funktion kan anropas i mallprogramläge med mallen ``{:'approximate_formats()'}``. Observera att formatnamn är alltid versaler, som i EPUB.

source: ``author_links(val_separator, pair_separator)`` -- returns a string containing a list of authors and that author's link values in the form ``author1 val_separator author1link pair_separator author2 val_separator author2link`` etc. An author is separated from its link value by the ``val_separator`` string with no added spaces. ``author:linkvalue`` pairs are separated by the ``pair_separator`` string argument with no added spaces. It is up to you to choose separator strings that do not occur in author names or links. An author is included even if the author link is empty.
fr: ``author_links(val_separator, pair_separator)`` -- retourne une chaîne contenant une liste d'auteurs et les valeurs de ce lien d'auteur dans la forme ``auteur1 val_separator author1link pair_separator auteur2 val_separator author2link`` etc. Un auteur est séparé de la valeur de son lien par la chaîne ``val_separator`` sans espaces ajoutés. Les paires ``author:linkvalue`` sont séparées par la chaîne d'argument ``pair_separator`` sans espaces ajoutés. Il vous incombe de choisir des chaines de séparateur qui n'apparaissent pas dans des noms ou des liens d'auteur. Un auteur est inclus même si le lien d'auteur est vide.
sv: ``author_links(val_separator, pair_separator)`` -- returnerar en sträng som innehåller en lista över författare och att författarens länkvärden i form ``author1 val_separator author1link pair_separator author2 val_separator author2link`` etc. En författare är separerad från dess länk värde av ``val_separator`` sträng utan tillsatta mellanslag. ``author:linkvalue`` paren skiljs åt av ``pair_separator`` strängargument utan tillsatta platser. Det är upp till dig att välja skiljesträngar som inte förekommer i författarnamn eller länkar. En författare ingår, även om författaren länken är tom.

source: ``author_sorts(val_separator)`` -- returns a string containing a list of author's sort values for the authors of the book. The sort is the one in the author metadata (different from the author_sort in books). The returned list has the form author sort 1 ``val_separator`` author sort 2 etc. The author sort values in this list are in the same order as the authors of the book. If you want spaces around ``val_separator`` then include them in the separator string
fr: ``author_sorts(val_separator)`` -- renvoie une chaîne contenant une liste des valeurs de tri de l'auteur pour les auteurs du livre. Le tri est celui des métadonnées auteur (différente de l'author_sort dans les livres). La liste renvoyée a ltri auteur 1 ``val_separator`` tri auteur 2 etc. Les valeurs de tri auteur dans cette liste sont dans le même ordre que les auteurs du livre. Si vous voulez les espaces autour du ``val_separator`` incluez les alors dans la chaîne separator
sv: ``author_sorts(val_separator)`` -- returnerar en sträng med en lista över författarens sorteringsvärden för författarna till boken. Sorteringen är författarens metadata (som skiljer sig från den author_sort i böcker). Den returnerade listan har formen författaren sortera 1 ``val_separator`` författare sort 2 etc. Författaren sortera värdena i denna lista är i samma ordning som författarna till boken. Om du vill ha mellanslag runt ``val_separator`` så inkludera dem i separatorsträngen

source: ``booksize()`` -- returns the value of the calibre 'size' field. Returns '' if there are no formats.
fr: ``booksize()`` -- renvoie la valeur du champ 'size' de calibre. Renvoie '' s'il n'y a pas de formats.
sv: ``booksize()`` -- returnerar värdet för den calibres 'storleks' fält. Returnerar '' om det inte finns några format.
