Repository: Easonqsp/calibre-translations
Catalog: manual/*/template_lang.po
Languages: fr, sv

source: The calibre template language
fr: Le langage de modèle calibre
sv: calibre språkmall

source: The calibre template language is used in various places. It is used to control the folder structure and file name when saving files from the calibre library to the disk or eBook reader. It is also used to define "virtual" columns that contain data from other columns and so on.
fr: Le langage de modèle de calibre est utilisé dans divers endroits. Il est utilisé pour contrôler la structure des dossiers et le nom des fichiers lors de la sauvegarde des fichiers de la bibliothèque calibre sur le disque ou sur votre appareil de lecture. Il est également utilisé pour définir les colonnes «virtuelles» qui contiennent des données provenant d'autres colonnes et ainsi de suite.
sv: calibres mallspråket används på olika ställen. Den används för att styra mappstruktur och filnamn när du sparar filer från calibre-biblioteket till disk eller e-bokläsare. Det används också för att definiera "virtuella" kolumner som innehåller data från andra kolumner och så vidare.

source: The basic template language is very simple, but has very powerful advanced features. The basic idea is that a template consists of text and names in curly brackets that are then replaced by the corresponding metadata from the book being processed. So, for example, the default template used for saving books to device in calibre is::
fr: Le langage de modèle de base est très simple, mais dispose de fonctionnalités avancées très puissantes. L'idée de base est que le modèle se compose de texte et de noms entre accolades qui sont ensuite remplacés par les métadonnées correspondantes de l'ouvrage en cours de traitement. Ainsi, par exemple, le modèle par défaut utilisé dans calibre pour l'enregistrement des livres sur un périphérique est::
sv: Den grundläggande mallspråket är mycket enkelt, men har mycket kraftfulla avancerade funktioner. Grundtanken är att en mall består av text och namnen i klammer som sedan ersätts av motsvarande metadata från boken som bearbetas. Så, till exempel, är standardmallen som används för att spara böcker till enheten i calibre::

source: For the book "The Foundation" by "Isaac Asimov" it will become::
fr: Pour le livre "The Foundation" par Isaac Asimov cela donnera::
sv: För boken "The Foundation" av "Isaac Asimov" kommer det bli::

source: The slashes are text, which is put into the template where it appears. For example, if your template is::
fr: Les barres obliques sont du texte, qui sont incluses dans le modèle où elles apparaissent. Par exemple, si votre modèle est::
sv: Snedstrecken är texter, vilka sätts in i mallen var de dyker upp. Till exempel, om den mall är::

source: You can use all the various metadata fields available in calibre in a template, including any custom columns you have created yourself. To find out the template name for a column simply hover your mouse over the column header. Names for custom fields (columns you have created yourself) always have a # as the first character. For series type custom fields, there is always an additional field named ``#seriesname_index`` that becomes the series index for that series. So if you have a custom series field named ``#myseries``, there will also be a field named ``#myseries_index``.
fr: Vous pouvez utiliser tous les champs de métadonnées disponibles dans calibre dans un modèle, y compris les colonnes personnalisées que vous avez créées vous-même. Pour connaître le nom à indiquer dans le modèle pour une colonne, passez votre souris sur l'en-tête de la colonne. Le nom des champs personnalisés (colonnes ajoutées par vos soins) ont toujours un # comme premier caractère. Pour les champs personnalisés de type série, il y a toujours un champ supplémentaire nommé ``#seriesname_index`` qui devient l'indice de série pour cette série. Donc si vous avez un champ de série personnalisé nommé ``#MesSeries``, il y aura aussi un champ appelé ``#MesSeries_index``.
sv: Du kan använda alla de olika metadatafält som finns i calibre i en mall, inklusive eventuella anpassade kolumner du har skapat själv. För att ta reda på mallnamnet för en kolumn håll bara musen över kolumnrubriken. Namn för anpassade fält (kolumner du har skapat själv) har alltid en # som första tecken. För egna fält av serietyp , det finns alltid ett extra fält som heter ``#seriesname_index`` som blir serieindex för den serien. Så om du har ett eget seriefält som heter ``#myseries``, kommer det också att finnas ett fält som heter ``#myseries_index``.

source: In addition to the column based fields, you also can use::
fr: En plus des champs basés sur des colonnes, vous pouvez aussi utiliser::
sv: Förutom de kolumnbaserade fälten, kan du också använda::

source: If a particular book does not have a particular piece of metadata, the field in the template is automatically removed for that book. Consider, for example::
fr: Si un livre en particulier n'a pas un morceau particulier de métadonnée , le champ dans le modèle est automatiquement supprimé pour ce livre. Considérons, par exemple::
sv: Om en viss bok inte har en särskild bit av metadata, är det område som automatiskt avlägsnas i mallen för att boken. Tänk till exempel::

source: If a book has a series, the template will produce::
fr: Si un livre a une série, le modèle produira::
sv: Om en bok har en serie, kommer mallen att producera::

source: and if a book does not have a series::
fr: et si un livre ne fait pas partie d'une série::
sv: och om en bok inte har en serie::

source: (calibre automatically removes multiple slashes and leading or trailing spaces).
fr: (calibre supprime automatiquement les barres obliques multiples et les espaces suivant ou précédant).
sv: (calibre tar automatiskt flera snedstreck och inledande eller avslutande blanksteg).

source: Advanced formatting
fr: Mise en forme avancée
sv: Advancerad formatering

source: You can do more than just simple substitution with the templates. You can also conditionally include text and control how the substituted data is formatted.
fr: Vous pouvez faire plus que juste une simple substitution avec les modèles. Vous pouvez également inclure conditionnellement du texte et contrôler la façon dont les données substituées sont formatées.
sv: Du kan göra mer än bara enkel substitution med mallarna. Du kan också villkora inkludera text och styra hur den substituerade data formateras.

source: First, conditionally including text. There are cases where you might want to have text appear in the output only if a field is not empty. A common case is ``series`` and ``series_index``, where you want either nothing or the two values with a hyphen between them. Calibre handles this case using a special field syntax.
fr: Premièrement, inclure du texte conditionnellement. Il y a des cas où vous pouvez vouloir avoir du texte qui apparaît dans la sortie seulement si un champ n'est pas vide. Une situation commune est ``series`` et ``series_index``, où vous voulez soit rien soit les deux valeurs séparées par un tiret. calibre prend en charge cette situation en utilisant une syntaxe spéciale de champ.
sv: Först, villkorad inkluderad text. Det finns fall där du kanske vill ha text som visas i utdata endast om ett fältet inte är tomt. Ett vanligt fall är ``series`` och ``series_index``, var du vill antingen ingenting eller de två värdena med ett bindestreck mellan dem. Calibre hanterar det här fallet med hjälp av en specialfältsyntax.

source: For example, assume you want to use the template::
fr: Par exemple, supposons que vous voulez utiliser le modèle::
sv: Anta till exempel att du vill använda mallen::

source: If the book has no series, the answer will be ``- - title``. Many people would rather the result be simply ``title``, without the hyphens. To do this, use the extended syntax ``{field:|prefix_text|suffix_text}``. When you use this syntax, if field has the value SERIES then the result will be ``prefix_textSERIESsuffix_text``. If field has no value, then the result will be the empty string (nothing); the prefix and suffix are ignored. The prefix and suffix can contain blanks. **Do not use subtemplates (`{ ... }`) or functions (see below) as the prefix or the suffix.**
fr: Si le livre n'a pas de série, la réponse sera ``- - titre``. Beaucoup de personnes voudrait plutôt que le résultat soit simplement ``titre``, sans les tirets.. Pour faire cela, utilisez la syntaxe étendue ``{field:|prefix_text|suffix_text}``. Quand vous utilisez cette syntaxe, si le champ à la valeur SERIES alors le résultat sera ``prefix_textSERIESsuffix_text``. Si le champ n'a pas de valeur, alors le résultat sera la chaîne vide (rien); le préfixe et le suffixe sont ignorés. Le préfixe et le suffixe peuvent contenir des blancs. **N'utilisez pas des sous-modèles (`{ ... }`) ou des fonctions (voir plus bas) comme préfixe ou suffixe.**
sv: Om boken inte har någon serie, kommer svaret att vara ``- - title``. Många människor skulle hellre vilja att resultatet blir helt enkelt ``title``, utan bindestreck. För att göra detta, använd den utökade syntaxen ```{field:|prefix_text|suffix_text}``. När du använder den här syntaxen, om fältet har värdet SERIES kommer resultatet då att bli ``prefix_textSERIESsuffix_text``. Om fältet inte har något värde, då kommer resultatet att vara den tomma strängen (ingenting); prefixet och suffixet ignoreras. Prefixet och suffixet kan innehålla blanksteg. **Använd inte subtemplates(`{...}`) eller funktioner (se nedan) som prefix eller suffix.**

source: Using this syntax, we can solve the above series problem with the template::
fr: En utilisant cette syntaxe, nous pouvons résoudre le problème des séries ci-dessus avec le modèle::
sv: Med hjälp av denna syntax, kan vi lösa ovanstående serien problem med mallen::

source: The hyphens will be included only if the book has a series index, which it will have only if it has a series.
fr: Les tirets seront inclus seulement si le livre a un index de séries, qu'il n'aura uniquement que s'il a une série.
sv: De bindestreck inkluderas endast om boken har ett serieindex, vilket den kommer att få endast om den har en serie.

source: Notes: you must include the : character if you want to use a prefix or a suffix. You must either use no \| characters or both of them; using one, as in ``{field:| - }``, is not allowed. It is OK not to provide any text for one side or the other, such as in ``{series:|| - }``. Using ``{title:||}`` is the same as using ``{title}``.
fr: Notez : vous devez inclure le caractère : si vous voulez utiliser un préfixe ou un suffixe. Vous devez soit ne pas utiliser de caractères \| ou les deux; en utiliser un, comme dans ``{field:| - }``, n'est pas permis. C'est OK pour ne procurer aucun pour un côté ou pour l'autre, tel que dans ``{series:|| - }``. Utiliser ``{title:||}`` est la même chose qu'utiliser ``{title}``.
sv: ￼Observera: Du måste inkludera: tecken om du vill använda ett prefix eller ett suffix. Du måste antingen använda några \| tecken eller båda; med hjälp av någon, som i ``{field:| -}``, är inte tillåtet. Det är OK att inte ge någon text för den ena eller den andra, såsom i ``{serien:|| -}``. Använda ``{title: ||}`` är detsamma som att använda ``{title}``.

source: Second: formatting. Suppose you wanted to ensure that the series_index is always formatted as three digits with leading zeros. This would do the trick::
fr: Deuxièmement : formater. Supposons que vous voulez vous assurer que series_index est toujours composé de trois chiffres avec des zéros devant. Ceci ferait l'affaire::
sv: Andra: formatering. Anta att du vill se till att series_index alltid är formaterad som tre siffror med inledande nollor. Detta bör göra susen::

source: If instead of leading zeros you want leading spaces, use::
fr: Si à la place des zéros devant vous voulez des espaces, utilisez::
sv: Om istället för inledande noll vill ha inledande mellanslag, använd::

source: For trailing zeros, use::
fr: Pour des zéros qui suivent, utilisez::
sv: För efterföljande nollor, använd::

source: If you use series indices with sub values (e.g., 1.1), you might want to ensure that the decimal points line up. For example, you might want the indices 1 and 2.5 to appear as 01.00 and 02.50 so that they will sort correctly. To do this, use::
fr: Si vous utilisez des indices de série avec des sous valeurs (Par ex., 1.1), vous pourriez vouloir vous assurer que cela que les virgules décimales s'alignent. Par exemple, vous voudrez peut-être que 1 et 2,5 apparaissent sous la forme 01.00 et 02.50 afin qu'ils puissent être triés correctement. Pour ce faire, utilisez::
sv: Om du använder indexserien med undervärden (t.ex. 1.1), kanske du vill se till att decimaler kommer i följd. Till exempel kanske du vill att index 1 och 2,5 framstå som 01.00 och 02.50, så att de kommer att sorteras rätt. För att göra detta använd::

source: If you want only the first two letters of the data, use::
fr: Si vous ne voulez que les deux premières lettres de la donnée, utilisez::
sv: Om du vill bara ha de två första bokstäverna i uppgifterna, använd:

source: The calibre template language comes from python and for more details on the syntax of these advanced formatting operations, look at the `Python documentation <http://docs.python.org/library/string.html#format-string-syntax>`_.
fr: Le langage de modèle de calibre vient de python. Pour plus de détails sur la syntaxe de ces opérations de mise en forme avancée, vous reporter à la `Documentation Python <http://docs.python.org/library/string.html#format-string-syntax>`_.

source: Advanced features
fr: Fonctionnalités avancées
sv: Avancerade funktioner

source: Using templates in custom columns
fr: Utiliser les modèles dans les colonnes personnalisées
sv: Använd mallar i anpassade kolumner

source: There are sometimes cases where you want to display metadata that calibre does not normally display, or to display data in a way different from how calibre normally does. For example, you might want to display the ISBN, a field that calibre does not display. You can use custom columns for this by creating a column with the type 'column built from other columns' (hereafter called composite columns), and entering a template. Result: calibre will display a column showing the result of evaluating that template. To display the ISBN, create the column and enter ``{identifiers:select(isbn)}`` into the template box. To display a column containing the values of two series custom columns separated by a comma, use ``{#series1:||,}{#series2}``.
fr: Il y a parfois des cas où vous souhaiteriez afficher des métadonnées que calibre n'affiche normalement pas ou afficher les données d'une manière différente de ce que calibre fait normalement. Par exemple, vous pouvez désirer afficher l'ISBN, un champ que calibre n'affiche pas. Pour cela, vous pouvez utiliser une colonne personnalisée de type 'colonne construite à partir d'autres colonnes' (ci-après dénommées colonnes composites) et y entrer un modèle. Résultat : calibre affiche une colonne indiquant le résultat de l'interprétation de ce modèle. Pour afficher l'ISBN, créer la colonne et entrez ``{identifiers:select(isbn)}`` dans le champ modèle. Pour afficher une colonne contenant les valeurs de deux colonnes personnalisées série séparées par une virgule, utilisez ``{#series1:||,}{#series2}``.
sv: Ibland finns det fall där man vill visa metadata som calibre normalt inte visar, eller för att visa data på ett sätt som skiljer sig från hur calibre gör normalt. Till exempel kanske du vill visa ISBN, ett fält som calibre inte visar. Du kan använda anpassade kolumner för detta genom att skapa en kolumn med typen "Kolumn byggs från andra kolumner" (nedan kallade sammansatta kolumner), och går in i en mall. Resultat: calibre kommer att visa en kolumn som visar resultatet av utvärderingen av den mallen. För att visa ISBN skapa kolumnen och skriv `` {identifierare: välj (isbn)} `` in i mallrutan. För att visa en kolumn som innehåller värdena för två serier anpassade kolumner separerade med ett kommatecken, använd ``{#series1:||,}{#series2}``.

source: Composite columns can use any template option, including formatting.
fr: Les colonnes composites peuvent utiliser n'importe quelle option des modèles, y compris le formatage.
sv: Sammansatta kolumner kan använda godtyckligt mallalternativ, även formatering.

source: You cannot change the data contained in a composite column. If you edit a composite column by double-clicking on any item, you will open the template for editing, not the underlying data. Editing the template on the GUI is a quick way of testing and changing composite columns.
fr: Vous ne pouvez pas modifier les données contenues dans une colonne composite. Si vous éditez une colonne composite en faisant un double clic sur n'importe quel élément, vous ouvrez le modèle pour l'édition, pas les données sous-jacentes. Modifier ainsi le modèle à partir de l'interface graphique est un moyen rapide de tester et de modifier les colonnes composites.
sv: Du kan inte ändra uppgifterna i en sammansatt kolumn. Om du redigerar en sammansatt kolumn genom att dubbelklicka på ett objekt, kommer du öppna mallen för redigering, inte de underliggande data. Redigera mallen på gränssnittet är ett snabbt sätt att testa och ändra sammansatta kolumner.

source: Using functions in templates - single-function mode
fr: Utiliser les fonctions dans les modèles - mode fonction-seule
sv: Använda funktioner i mallar - enkelfunktionsläge

source: Suppose you want to display the value of a field in upper case, when that field is normally in title case. You can do this (and many more things) using the functions available for templates. For example, to display the title in upper case, use ``{title:uppercase()}``. To display it in title case, use ``{title:titlecase()}``.
fr: Supposons que vous voulez afficher la valeur d'un champ en majuscules, lorsque ce champ est normalement en casse Titre. Vous pouvez faire cela (et bien d'autres choses) en utilisant les fonctions disponibles pour les modèles. Par exemple, pour afficher le titre en majuscules, utilisez ``{title:uppercase()}``. Pour l'afficher en casse titre, utilisez ``{title:titlecase()}``.
sv: Anta att du vill visa värdet på ett fält i versaler, då detta område är normalt i rubrikformat. Du kan göra detta (och många fler saker) med hjälp av de funktioner som finns för mallar. Till exempel, för att visa titeln med versaler, använd ``{title:uppercase()}``. För att via det i rubrikformat använd ``{title:titlecase()}``.

source: Function references appear in the format part, going after the ``:`` and before the first ``|`` or the closing ``}``. If you have both a format and a function reference, the function comes after another ``:``. Functions must always end with ``()``. Some functions take extra values (arguments), and these go inside the ``()``.
fr: Les références de fonction apparaissent dans la partie de format, allant après le ``:`` et avant le premier ``|`` ou le ``}`` fermant. Si vous avez à la fois un format et une fonction, la fonction vient après un autre ``:``. Les fonctions doivent toujours se terminer avec ``()``.Certaines fonctions prennent des valeurs supplémentaires (arguments), et ceux-ci vont à l'intérieur du ``()``.
sv: Funktionsreferenser återfinns i den del format, som går efter ``:`` och för första ``|`` eller avslutande ``}``. Om du har både ett format och en funktionsreferens, kommer funktionen efter den andra ``:``. Funktioner måste alltid avslutas med ``()``. Några funktioner använder extra värden (argument) och dessa ska finnas i ``()``.

source: Functions are always applied before format specifications. See further down for an example of using both a format and a function, where this order is demonstrated.
fr: Les fonctions sont toujours appliquées avant les spécifications de format. Voir plus bas la démonstration de l'ordre d'application, dans un exemple utilisant à la fois un format et une fonction.
sv: Funktioner alltid tillämpas innan formatspecifikationer. Se längre ner för ett exempel på att använda både ett format och en funktion, där denna ordning demonstreras.

source: The syntax for using functions is ``{field:function(arguments)}``, or ``{field:function(arguments)|prefix|suffix}``. Arguments are separated by commas. Commas inside arguments must be preceeded by a backslash ( '\\' ). The last (or only) argument cannot contain a closing parenthesis ( ')' ). Functions return the value of the field used in the template, suitably modified.
fr: La syntaxe pour l'utilisation des fonctions est ``{field:function(arguments)}``, ou ``{field:function(arguments)|prefix|suffix}``. Les arguments sont séparés par des virgules. Les virgules se trouvant à l'intérieur d'arguments doivent être précédéés d'une barre oblique inverse ( '\\' ).Le dernier argument (ou le seul) ne peut pas contenir une parenthèse fermante ( ')' ). Les fonctions renvoient la valeur du champ utilisé dans le modèle, convenablement modifiées.
sv: Syntax för att använda funktioner är ``{field:function(arguments)}``, eller ``{field:function(arguments)|prefix|suffix}``. Arguments are separated by commas. Commas inside arguments must be preceeded by a backslash ( '\\' ). The last (or only) argument cannot contain a closing parenthesis ( ')' ). Functions return the value of the field used in the template, suitably modified.

source: Important: If you have programming experience, please note that the syntax in this mode (single function) is not what you might expect. Strings are not quoted. Spaces are significant. All arguments must be constants; there is no sub-evaluation. **Do not use subtemplates (`{ ... }`) as function arguments.** Instead, use :ref:`template program mode <template_mode>` and :ref:`general program mode <general_mode>`.
fr: Important: Si vous avez de l'expérience en programmation, la syntaxe de ce mode (fonction seule) n'est pas ce que vous pourriez attendre. Les chaînes ne sont pas entre guillemets. Les espaces sont importants. Les arguments doivent être des constantes, il n'y a pas de sous-évaluation. **Ne pas utiliser les sous-modèles (`{...}`) comme des arguments de la fonction.** A la place, utilisez le :ref:`mode programme de modèle<template_mode>` et le :ref:`mode programme général <general_mode>`.
sv: Viktigt: Om du har programmeringserfarenhet, observera att syntaxen i det här läget (enkel funktion) är inte vad du kanske tror. Strängar som inte är noterade. Mellanslag är betydande. Alla argument måste vara konstanter; det finns ingen underutvärdering. **Använd inte undermallar (`{ ... }`) som funktionsargument.** Använd istället :ref:` mallprogramläge <template_mode>` och :ref:`general program mode <general_mode>`.

source: Many functions use regular expressions. In all cases, regular expression matching is case-insensitive.
fr: De nombreuses fonctions utilisent des expressions régulières. Dans tous les cas, la correspondance d'expression régulière est insensible à la casse.
sv: Många funktioner använder reguljära uttryck. I samtliga fall är passning med reguljära uttryck skiftlägeskänsliga.

source: The functions available are listed below. Note that the definitive documentation for functions is available in the section :ref:`Function classification <template_functions_reference>`:
fr: Les fonctions disponibles sont listées ci-dessous. La documentation exhaustive des fonctions est disponible dans la section :ref:`Classification de fonction <template_functions_reference>`:
sv: De funktioner som finns är listade nedan. Observera att den slutgiltiga dokumentationen för funktioner finns i avsnitt :ref:`Funktionsklassificering <template_functions_reference>`:

source: ``lowercase()`` -- return value of the field in lower case.
fr: ``lowercase()`` -- renvoie la valeur du champ en minuscule.
sv: ``lowercase()`` -- returnerar värde av fältet som gemener.
