Repository: Easonqsp/calibre-translations
Catalog: manual/*/template_lang.po
Languages: fr, sv

source: ``re_group(val, pattern, template_for_group_1, for_group_2, ...)`` -- return a string made by applying the reqular expression pattern to the val and replacing each matched instance with the string computed by replacing each matched group by the value returned by the corresponding template. The original matched value for the group is available as $. In template program mode, like for the template and the eval functions, you use [[ for { and ]] for }. The following example in template program mode looks for series with more than one word and uppercases the first word::
fr: ``re_group(val, pattern, template_for_group_1, for_group_2, ...)`` -- renvoie une chaîne faite en appliquant le modèle d'expression régulière à la valeur et en remplaçant chaque instance assortie par la chaîne calculée en remplaçant chaque groupe assorti par la valeur retournée par le modèle correspondant. La valeur assortie originale pour le groupe est disponible comme $. En mode programmation de modèle, comme pour le modèle et les fonctions eval, vous utiliserez [[ pour { et ]] pour }. L'exemple suivant en mode programmation de modèle recherche des séries avec plus d'un mot et des majuscules dans le premier mot::
sv: ``re_group(val, pattern, template_for_group_1, for_group_2, ...)`` -- returnerar en sträng med användande av reqular uttrycksmönstret för val och ersätter varje passande instans med strängen beräknad genom att ersätta varje passande grupp med värdet som returneras av motsvarande mall. Det ursprungliga passande värdet för gruppen finns som $. I mallprogramläge, som till mallen och de eval funktioner använder du [[för {och]] för}. Följande exempel på mallprogramläge letar efter serie med mer än ett ord och sätter det första ordet till versaler::

source: ``series_sort()`` -- returns the series sort value.
fr: ``series_sort()`` -- renvoie la valeur de tri des séries.
sv: ``series_sort()`` -- returnerar seriens sorterade värden.

source: ``strcat(a, b, ...)`` -- can take any number of arguments. Returns a string formed by concatenating all the arguments.
fr: ``strcat(a, b, …)`` -- peut avoir n'importe quel nombre d’arguments. Renvoie une chaine constituée par la concaténation de tous les arguments.
sv: ``strcat(a, b, ...)`` -- kan ta valfritt antal argument. Returnerar en sträng som bildas genom att sammanfoga alla argumenten.

source: ``strcat_max(max, string1, prefix2, string2, ...)`` -- Returns a string formed by concatenating the arguments. The returned value is initialized to string1. `Prefix, string` pairs are added to the end of the value as long as the resulting string length is less than `max`. String1 is returned even if string1 is longer than max. You can pass as many `prefix, string` pairs as you wish.
fr: ``strcat_max(max, string1, prefix1, string2, …)`` -- Retourne la chaîne formée par la concaténation des arguments. La valeur retournée est initialisée à string1. Les paires 'Prefix,string' sont ajoutées à la fin de la valeur tant que la taille de la chaîne de sortie est plus petite que 'max'. String1 est retournée même si string1 est plus grande que max. Vous pouvez passer autant de paires de 'prefix,string' que vous le souhaitez.
sv: ``strcat_max(max, string1, prefix2, string2, ...)`` -- Returnerar en sträng som bildas genom att sammanlänka argumenten. Det returnerade värdet initieras till string1. `Prefix, string` par som läggs till i slutet av värde så länge den resulterande strängens längd är mindre än `max`. String1 returneras även om string1 är längre än max. Du kan skicka så många `prefix, string` par som du vill.

source: ``strcmp(x, y, lt, eq, gt)`` -- does a case-insensitive comparison x and y as strings. Returns ``lt`` if x < y. Returns ``eq`` if x == y. Otherwise returns ``gt``.
fr: ``strcmp(x, y, lt, eq, gt)`` -- effectue une comparaison insensible à la casse des chaines x et y. Renvoie ``lt`` si x < y. Renvoie ``eq`` si x == y. Sinon renvoie ``gt``.
sv: ``strcmp(x, y, lt, eq, gt)`` -- gör en skiftlägesokänslig jämförelse x och y som strängar. Returnerar ``lt`` om x <y. Retur ``eq`` om x == y. Annars returnerar ''gt``.

source: ``strlen(a)`` -- Returns the length of the string passed as the argument.
fr: ``strlen(a)`` -- Retourne la longueur de la chaîne de caractères passée en argument.
sv: ``strlen(a)`` -- Returnerar längden på strängen som skickas som argument.

source: ``substr(str, start, end)`` -- returns the ``start``'th through the ``end``'th characters of ``str``. The first character in ``str`` is the zero'th character. If end is negative, then it indicates that many characters counting from the right. If end is zero, then it indicates the last character. For example, ``substr('12345', 1, 0)`` returns ``'2345'``, and ``substr('12345', 1, -1)`` returns ``'234'``.
fr: ``substr(str, start, end)`` -- renvoie les caractères de début jusqu'à fin de ``str``. Le premier caractère dans ``str`` est le caractère zéro. Si end est négatif, cela indique que beaucoup de caractères sont comptés à partir de la droite. Si end est zéro, cela indique le dernier caractère. Par exemple, ``substr('12345', 1, 0)`` renvoie ``'2345'``, et ``substr('12345', 1, -1)`` renvoie ``'234'``.
sv: ``substr(str, start, end)`` -- returnerar ``start`` genom ``end`` tecknen i ``str``. Det första tecknet i ``str`` är nolltecken. Om slutet är negativt, då det tyder på att många tecken räknat från höger. Om slutet är noll, då det tyder på det sista tecknet. Till exempel, ``substr("12345", 1, 0) `` returnerar ``'2345'`` och ``substr("12345", 1, -1)`` returnerar ``"234'`` .

source: ``subtract(x, y)`` -- returns x - y. Throws an exception if either x or y are not numbers.
fr: ``subtract(x, y)`` -- renvoie x - y. Renvoie une exception si x ou y ne sont pas des nombres.
sv: ``subtract(x, y)`` -- returnerar x - y. Ger ett undantag om någon x eller y inte är tal.

source: ``today()`` -- return a date string for today. This value is designed for use in format_date or days_between, but can be manipulated like any other string. The date is in ISO format.
fr: ``today()`` -- renvoie une chaine date pour aujourd’hui. Cette valeur est conçue pour être utiliser avec format_date ou days_between, mais peut être manipulée comme toute autre chaine. La date est au format ISO.
sv: ``today()`` -- returnerar en datumsträng för idag. Detta värde är konstruerad för användning i format_date eller days_between, men kan manipuleras precis som alla andra strängar. Datumet är i ISO-format.

source: ``template(x)`` -- evaluates x as a template. The evaluation is done in its own context, meaning that variables are not shared between the caller and the template evaluation. Because the `{` and `}` characters are special, you must use `[[` for the `{` character and `]]` for the '}' character; they are converted automatically. For example, ``template('[[title_sort]]') will evaluate the template ``{title_sort}`` and return its value. Note also that prefixes and suffixes (the `|prefix|suffix` syntax) cannot be used in the argument to this function when using template program mode.
fr: ``template(x)`` -- évalue x comme un modèle. L’évaluation est effectuée dans son propre contexte, cela veut dire que les variables ne sont pas partagées entre l’appelant et l’évaluation du modèle. Comme les caractères `{` et `}` sont spéciaux, vous devez utiliser `[[` pour le caractère `{` et `]]` pour le caractère `}` ; ils sont convertis automatiquement. Par exemple, ``template('[[title_sort]]')`` évaluera le modèle ``{title_sort}`` et retournera sa valeur. Notez également que les préfixes et les suffixes (la syntaxe `|prefix|suffix`) ne peuvent pas être utilisés dans les arguments de cette fonction lorsque le mode modèle de programme est utilisé.
sv: ``template(x)`` -- utvärderar x som mall. Bedömningen görs i en egen kontext, vilket innebär att variabler inte delas mellan den som anropar och utvärderingsmallen. Eftersom `{` och `}` tecken är speciella, måste du använda `[[` för `{` tecken och `]] 'för'} 'tecken; de omvandlas automatiskt. Till exempel, ``mall("[[title_sort]] ') kommer att utvärdera mallen ``{title_sort}``och returnera dess värde. Observera också att prefix och suffix (det så kallade `|prefix|suffix` syntax) inte kan användas i argumentet till funktionen när du använder mallprogramläge.

source: Function classification
fr: Classification de fonction
sv: Funktionsklassificering

source: Using general program mode
fr: En utilisant le mode général de programmation
sv: Använder allmän programmod

source: For more complicated template programs, it is sometimes easier to avoid template syntax (all the `{` and `}` characters), instead writing a more classical-looking program. You can do this in calibre by beginning the template with `program:`. In this case, no template processing is done. The special variable `$` is not set. It is up to your program to produce the correct results.
fr: Pour les modèles de programme plus complexes, il est parfois plus facile d'éviter la syntaxe des modèles (avec tous ces caractères `{` et `}`), et utiliser à la place un programme plus classique. Vous pouvez le faire avec calibre en commençant par le modèle par `program:`. Dans ce cas, aucun traitement de modèle n'est fait. La variable spéciale `$` n'est pas implémentée. C'est à votre programme de produire des résultats corrects.
sv: För mer komplicerade mallprogram, är det ibland lättare att undvika mallsyntax (alla `{` och `}` tecken), istället skriva i ett mer klassisk programutseende. Du kan göra detta i calibre genom att börja mallen med `program:`. I detta fall sker ingen mall behandling. Den speciella variabeln `$` är inte satt. Det är upp till ditt program för att producera rätt resultat.

source: One advantage of `program:` mode is that the brackets are no longer special. For example, it is not necessary to use `[[` and `]]` when using the `template()` function. Another advantage is that program mode templates are compiled to Python and can run much faster than templates in the other two modes. Speed improvement depends on the complexity of the templates; the more complicated the template the more the improvement. Compilation is turned off or on using the tweak ``compile_gpm_templates`` (Compile General Program Mode templates to Python). The main reason to turn off compilation is if a compiled template does not work, in which case please file a bug report.
fr: Un avantage du mode `program:` est que les accolades ne sont plus considérées comme des caractères spéciaux. Par exemple, il n'est pas nécessaire d'utiliser des `[[` et des `]]` quand vous utilisez la fonction `template()`. Un autre avantage est que ces modèles sont compilés avec Python et peuvent tourner beaucoup plus vite que les modèles crées dans les deux autres modes. L'amélioration de la vitesse dépend de la complexité des modèles, plus le modèle est plus compliqué, plus l'amélioration est sensible. La compilation est activé ou désactivé à l'aide de l'ajustement ``compile_gpm_templates`` (Compiler les modèles du Mode Général de Programme en Python). La raison principale pour suspendre la compilation est si un modèle compilé ne fonctionne pas. Dans ce cas, merci de remplir un rapport d'erreur.
sv: En fördel med `program:` läget är att hakparanteser inte längre speciella. Till exempel är det inte nödvändigt att använda `[[` och `]] 'när du använder `template()`-funktionen. En annan fördel är att programläges mallar sammanställs till Python och kan köras mycket snabbare än mallar i de andra två lägena. Hastighetsförbättring beror på komplexiteten i de mallar; ju mer komplicerad mall desto förbättringen. Kompileringen är avstängd eller om du använder justering ``compile_gpm_templates`` (Compile General Programläges mallar till Python). Det främsta skälet för att stänga av kompilering är om en sammanställd mall inte fungerar, i sådant fall skicka in en felrapport.

source: The following example is a `program:` mode implementation of a recipe on the MobileRead forum: "Put series into the title, using either initials or a shortened form. Strip leading articles from the series name (any)." For example, for the book The Two Towers in the Lord of the Rings series, the recipe gives `LotR [02] The Two Towers`. Using standard templates, the recipe requires three custom columns and a plugboard, as explained in the following:
fr: L'exemple suivant est un mode `program:` d'implémentation d'une recette sur le forum MobileRead : "Mettre les séries dans le titre, en utilisant soit les initiales soit une forme raccourcie. Retirer les articles principaux du nom de la série (n'importe lequel)." Par exemple, pour le livre The Two Towers dans la série Seigneur des Anneaux, la recette donne `LotR [02] The Two Towers`. En utilisant le modèle standard, la recette requiert trois colonnes personnalisées et un tableau de connexion, comme expliqué ci-après :
sv: Följande exempel är ett 'program:` läge implementerande av ett recept på MobileRead forumet:". Placera serier i titeln, antingen med initialer eller en förkortad form Strip ledande artiklar från serienamnet (någon). "Till exempel, för boken The Two Towers in the Lord of the Rings-serien, ger receptet `LotR [02] The Two Towers`. Genom att använda standardmallar, receptet kräver tre anpassade kolumner och en kontrollpanel, såsom förklaras i följande:

source: The solution requires creating three composite columns. The first column is used to remove the leading articles. The second is used to compute the 'shorten' form. The third is to compute the 'initials' form. Once you have these columns, the plugboard selects between them. You can hide any or all of the three columns on the library view.
fr: La solution requiert la création de trois colonnes composites. La première colonne est utilisée pour retirer les articles principaux. La seconde est utilisée pour calculer la forme 'raccourcie'. La troisième est pour calculer la forme 'initiales'. Une fois que vous avez ces colonnes, le tableau de connexion sélectionne entre elles. Vous pouvez masquer n'importe laquelle ou toutes les colonnes dans la vue bibliothèque.
sv: Lösningen kräver att skapa tre sammansatta kolumner. Den första kolumnen används för att avlägsna de ledande artiklarna. Det andra används för att beräkna den "korta" formen. Den tredje är för att beräkna 'initials' formen. När du har dessa kolumner, väljer kontrollpanel mellan dem. Du kan dölja någon eller alla av de tre kolumnerna på biblioteksvyn.

source: First column: Name: #stripped_series. Template: {series:re(^(A|The|An)\s+,)||}
fr: Première colonne : Nom #stripped_series. Modèle : {series:re(^(A|The|An)\s+,)||}
sv: Första kolumn: Namn: #stripped_series. Mall: {series:re(^(A|The|An)\s+,)||}

source: Second column (the shortened form): Name: #shortened. Template: {#stripped_series:shorten(4,-,4)}
fr: Seconde colonne (la forme raccourcie) : Nom :#shortened. Modéle : {#stripped_series:shorten(4,-,4)}
sv: Andra kolumn (förkortad form): Namn: #shortened. Mall: {#stripped_series:shorten(4,-,4)}

source: Third column (the initials form): Name: #initials. Template: {#stripped_series:re(([^\s])[^\s]+(\s|$),\1)}
fr: La troisième colonne (la forme des initiales) : Nom : #initials. Modèle : {#stripped_series:re(([^\s])[^\s]+(\s|$),\1)}
sv: Tredje kolumn (förkortad form): Namn: #initials. Mall: {#stripped_series:re(([^\s])[^\s]+(\s|$),\1)}

source: Plugboard expression: Template:{#stripped_series:lookup(.\s,#initials,.,#shortened,series)}{series_index:0>2.0f| [|] }{title} Destination field: title
fr: Expression du tableau de connexion : Modèle : {#stripped_series:lookup(.\s,#initials,.,#shortened,series)}{series_index:0>2.0f| [|] }{title} Champ de destination : title
sv: Kontrollpaneluttryck: Mall:{#stripped_series:lookup(.\s,#initials,.,#shortened,series)}{series_index:0>2.0f| [|] }{title} Destinationsfält: title

source: This set of fields and plugboard produces: Series: The Lord of the Rings Series index: 2 Title: The Two Towers Output: LotR [02] The Two Towers
fr: Cet ensemble de champs et le tableau de connexion produisent : Série : The Lord of the Ring Index : 2 Titre : The Two Towers Sortie : LotR [02] The Two Towers
sv: Denna uppsättning av fält och kontrollpanel producerar: Serie: The Lord of the Rings Serien index: 2 Titel: The Two Towers Utdata: LotR [02] The Two Towers

source: Series: Dahak Series index: 1 Title: Mutineers Moon Output: Dahak [01] Mutineers Moon
fr: Série : Dahak Index de la série : 1 Titre: Mutineers Moon Sortie: Dahak [01] Mutineers Moon
sv: Serier: Dahak Serieindex: 1 Titel: Mutineers Moon Utdata: Dahak [01] Mutineers Moon

source: Series: Berserkers Series Index: 4 Title: Berserker Throne Output: Bers-kers [04] Berserker Throne
fr: Série: Berserkers Index de la série : 4 Title: Berserker Throne Output: Bers-kers [04] Berserker Throne
sv: Serier: Berserkers Serieindex: 4 Titel: Berserker Throne Utdata: Bers-kers [04] Berserker Throne

source: Series: Meg Langslow Mysteries Series Index: 3 Title: Revenge of the Wrought-Iron Flamingos Output: MLM [03] Revenge of the Wrought-Iron Flamingos
fr: Série : Meg Langslow Mysteries Index de la série : 3 Titre : Revenge of the Wrought-Iron Flamingos Sortie : MLM [03] Revenge of the Wrought-Iron Flamingos
sv: Serier: Meg Langslow Mysteries Serieindex: 3 Titel: Revenge of the Wrought-Iron Flamingos Utdata: MLM [03] Revenge of the Wrought-Iron Flamingos

source: The following program produces the same results as the original recipe, using only one custom column to hold the results of a program that computes the special title value::
fr: Le programme qui suit produit le même résultat que la recette originale, en utilisant seulement une colonne personnalisée pour conserver le résultat d'un programme qui calcule la valeur spéciale titre::
sv: Följande program ger samma resultat som det ursprungliga receptet, med endast en anpassad kolumn för att hålla resultatet av ett program som beräknar den speciella titelvärdet::

source: It would be possible to do the above with no custom columns by putting the program into the template box of the plugboard. However, to do so, all comments must be removed because the plugboard text box does not support multi-line editing. It is debatable whether the gain of not having the custom column is worth the vast increase in difficulty caused by the program being one giant line.
fr: Il serait possible de faire ce qu'il y a ci-dessus sans colonnes personnalisées en mettant le programme dans la case modèle du tableau de connexion. Cependant, pour faire cela,tous les commentaires doivent être supprimés car la case de texte du tableau de connexion ne supporte pas l'édition multi-lignes. C'est discutable si le gain de ne pas avoir la colonne personnalisée vaille la vaste augmentation en difficulté provoquée par le fait que le programme soit une ligne géante.
sv: Det skulle vara möjligt att göra ovanstående utan extra kolumner genom att sätta programmet i mallen av kontrollpanel. Men för att göra det, måste alla kommentarer tas bort på grund av att kontrlpanelens textrutan inte stöder redigering över flera rader. Det kan diskuteras om vinsten av att inte ha den anpassade kolumnen är värd den stora ökningen i svårigheter på grund av det program som en gigantisk rad.

source: User-defined Template Functions
fr: Modèles de fonctions définies par l'utilisateur
sv: Användardefinierade mallfunktioner

source: You can add your own functions to the template processor. Such functions are written in python, and can be used in any of the three template programming modes. The functions are added by going to Preferences -> Advanced -> Template Functions. Instructions are shown in that dialog.
fr: Vous pouvez ajouter vos propres fonctions au traitement des modèles. Ces fonctions s'écrivent en python, et peuvent être utilisées dans n'importe lequel des trois modes de programmation de modèle. Les fonctions sont ajoutées en allant dans Préférences->Avancé->Modèles de fonction. Les instructions sont affichées dans cette boite de dialogue.
sv: Du kan lägga till egna funktioner till mallprocessorn. Sådana funktioner är skrivna i Python, och kan användas i någon av de tre mallprogrammeringslägena. Funktionerna läggs genom att gå till Inställningar->Avancerat->Mallfunktioner. Instruktioner visas i denna dialog.

source: Special notes for save/send templates
fr: Notes spéciales pour la sauvergarde/l'envoi des modèles
sv: Särskilda anvisningar för att spara/skicka mallar

source: Special processing is applied when a template is used in a `save to disk` or `send to device` template. The values of the fields are cleaned, replacing characters that are special to file systems with underscores, including slashes. This means that field text cannot be used to create folders. However, slashes are not changed in prefix or suffix strings, so slashes in these strings will cause folders to be created. Because of this, you can create variable-depth folder structure.
fr: Un traitement spécial est appliqué quand un modèle est utilisé dans un modèle `Enregistrer sur le disque` ou `Envoyer au périphérique`. Les valeurs des champs sont nettoyées, les caractères qui sont propres aux systèmes de fichiers sont remplacées par des traits de soulignement, y compris les barres obliques. Cela signifie que le texte d'un champ ne peut pas être utilisé pour créer des dossiers. Toutefois, les barres obliques ne sont pas modifiés dans des chaînes préfixe ou suffixe. Vous pouvez donc insérer des barres obliques qui et provoquer ainsi la création de dossiers. Ainsi, vous pouvez créer une structure de dossier avec des profondeurs variables.
sv: Särskilda bearbetning appliceras när en mall används i en 'spara på disk` eller `skicka till enhet` produkt mall. Värdena på fälten städas, ersätter tecken som är speciella till filsystem med streck, inklusive snedstreck. Detta innebär att textfältet inte kan användas för att skapa mappar. Men snedstreck inte förändrats prefix eller suffix strängar, så snedstreck i dessa strängar kommer att orsaka mappar skapas. På grund av detta kan du skapa mappstruktur variabelt djup.

source: For example, assume we want the folder structure `series/series_index - title`, with the caveat that if series does not exist, then the title should be in the top folder. The template to do this is::
fr: Par exemple, supposons que nous voulons que la structure des dossiers soit `series/series_index - titre`, en prévoyant que si la série n'existe pas, alors le titre devrait être dans le dossier racine (le premier dossier, pas le sous-dossier). Le modèle pour faire cela est :
sv: Antag till exempel att vi vill ha mappstrukturen `series/series_index - title`, med förbehållet att om serien inte existerar, så bör titeln vara i topp-mappen. Mallen för att göra detta är::

source: The slash and the hyphen appear only if series is not empty.
fr: La barre oblique et le trait d'union apparaissent uniquement si la série n'est pas vide.
sv: Det snedstreck och bindestreck visas bara om serien inte är tom.
