Repository: Easonqsp/calibre-translations
Catalog: manual/*/typesetting_math.po
Languages: cs, de, es, fr, pl, sv, uk

source: Typesetting Math in ebooks
cs: Sazba matematiky v e-knihách
de: Formeldarstellungen in eBooks
es: Escribir fórmulas matemáticas en libros electrónicos
fr: Composition Mathématique dans des livres numériques
pl: Składanie wzorów matematycznych w ebookach
sv: Typsättning Math i e-böcker
uk: Формули у електронних книгах

source: The |app| ebook viewer has the ability to display math embedded in ebooks (ePub and HTML files). You can typeset the math directly with TeX or MathML or AsciiMath. The |app| viewer uses the excellent `MathJax <http://www.mathjax.org>`_ library to do this. This is a brief tutorial on creating ebooks with math in them that work well with the |app| viewer.
cs: Prohlížeč e-knih |app| má schopnost zobrazit matematiku vloženou do e-knih (soubory ePub a HTML). Můžete sázet matematiku přímo pomocí TeX, MathML nebo AsciiMath. Prohlížeč |app| k tomuto používá vynikající knihovnu `MathJax <http://www.mathjax.org>`_. Toto je stručný kurz vytváření e-knih s matematikou, které fungují dobře s prohlížečem |app|.
de: Der |app| eBook-Betrachter hat die Fähigkeit, eingebettete Formeln in eBooks (EPUB und HTML-Dateien) anzuzeigen. Sie können Formeln direkt mit TeX oder MathML oder AsciiMath erstellen. Der |app| eBook-Betrachter verwendet hierzu die ausgezeichnete `MathJax <http://www.mathjax.org>`_-Bibliothek. Dies ist eine kurze Anleitung zum Erstellen von eBooks, die Formeln enthalten und gut mit den |app| eBook-Betrachter funktionieren.
es: El visor de libros de |app| tiene la capacidad de mostrar fórmulas matemáticas incrustadas en libros electrónicos (archivos ePub y HTML). Puede escribir las fórmulas directamente con TeX, MathML o ASCIIMath. El visor de |app| usa la excelente biblioteca `MathJax <http://www.mathjax.org>`_ para procesar las fórmulas. Esto es un breve cursillo para crear libros con fórmulas que funcionen con el visor de |app|.
uk: У програмі для перегляду електронних книг |app| передбачено можливість показу вбудованих до електронної книги формул (у файлах ePub та HTML). Формули може бути набрано безпосередньо у TeX, MathML або AsciiMath. Для показу формул у програмі для перегляду книг |app| використовується чудова бібліотека `MathJax <http://www.mathjax.org>`_. За допомогою цього короткого підручника ви зможете навчитися створенню електронних книг із формулами, які згодом можна буде переглядати у програмі для перегляду електронних книг |app|.

source: This only applies to calibre version 0.8.66 and newer
cs: Toto platí pouze pro Calibre verze 0.8.66 a novější
de: Dies gilt nur für |app| Version 0.8.66 und neuer.
es: Esto se aplica a sólo a versiones 0.8.66 o posteriores de |app|.

source: A simple HTML file with mathematics
cs: Zjednodušený soubor HTML s matematikou
de: Eine einfache HTML-Datei mit Formeln
es: Un archivo HTML sencillo con fórmulas
fr: Un simple fichier HTML avec des mathématiques
pl: Prosty HTML ze wzorami matematycznymi
sv: En enkel HTML-fil med matematik
uk: Простий файл HTML із формулами

source: You can write mathematics inline inside a simple HTML file and the |app| viewer will render it into properly typeset mathematics. In the example below, we use TeX notation for mathematics. You will see that you can use normal TeX commands, with the small caveat that ampersands and less than and greater than signs have to be written as &amp; &lt; and &gt; respectively.
cs: Můžete zapsat matematiku vloženou uvnitř souboru zjednodušeného HTML a prohlížeč |app| ji vykreslí se správnou sazbou matematiky. V příkladu níže používáme pro matematiku zápis TeX. Uvidíte, že můžete použít normální příkazy TeX, s malým upozorněním, že ampersandy a znaky menší než a větší než musí být zapsány jako &amp; &lt; a &gt; v uvedeném pořadí.
de: Sie können Formel-Inlines in eine einfache HTML-Datei schreiben und der |app| eBook-Betrachter wird diese in der richtigen Zeichensetzung für Formeln anzeigen. Im folgenden Beispiel verwenden wir die TeX-Notation für Formeln. Sie werden sehen, dass normale TeX-Befehle benutzt werden - mit einer kleinen Einschränkung, dass die Sonderzeichen für kaufmännisches und, kleiner als und größer als durch &amp; &lt; und &gt; ersetzt werden müssen.
es: Puede escribir fórmulas matemáticas directamente en el texto de un archivo HTML sencillo y el visor de |app| las mostrará con una composición matemática adecuada. En el ejemplo de abajo, usamos la notación de TeX para las fórmulas. Verá que puede usar las órdenes normales de TeX, con la pequeña precaución de que los signos &, < y > deben escrbirse como &amp;, &lt; y &gt respectivamente.
uk: Ви можете вписати формулу до простого файла HTML, і програма для перегляду книг |app| перетворить її на чудову типографіську композицію. У наведеному нижче прикладі ми скористаємося форматом TeX. Ви зможете переконатися, що можливе використання усіх звичайних команд TeX, за винятком амперсандів та символів «менше» та «більше», які слід записувати у позначеннях HTML: &amp; &lt; та &gt;, відповідно.

source: The first step is to tell |app| that this will contains maths. You do this by adding the following snippet of code to the <head> section of the HTML file::
cs: První krok je říct |app|, že toto bude obsahovat matematiku. To uděláte přidáním následujícího fragmentu kódu do oddílu <head> souboru HTML::
de: Im ersten Schritt wird |app| mitgeteilt, dass Formeln enthalten sind. Sie tun dies, indem Sie das nachfolgende Code-Stück in den Abschnitt <head> der HTML-Datei hinzufügen::
es: El primer paso es informar a |app| de que este documento contiene fórmulas. Para ello se añade el siguiente fragmente do código a la sección <head> del archivo HTML::
uk: Спочатку слід повідомити |app|, що документ містить формули. Зробити це можна додаванням такого фрагмента коду до розділу <head> файла HTML::

source: That's it, now you can type mathematics just as you would in a .tex file. For example, here are Lorentz's equations::
cs: To je vše, nyní můžete psát matematiku, jak byste to udělali v souboru .tex. Například zde jsou Lorentzovy rovnice::
de: Fertig, jetzt können Sie die Formel genauso, wie in einer .tex-Datei, eingeben. Beispielsweise hier für die Lorentz-Gleichung::
es: Eso es todo, ahora ya se pueden escribir formulas igual que se haría en un archivo .tex. Por ejemplo, éstas son las ecuaciones de Lorentz::
fr: C'est cela, maintenant vous pouvez entrer des mathématiques comme vous le feriez dans un fichier .tex. Par exemple, voici les équations de Lorentz::
pl: Teraz można już wpisać wzory dokładnie tak, jak to się robi w pliku .tex. Oto, dla przykładu, równanie Lorentza:
sv: Det var det, nu kan du skriva matematik på samma sätt som i en .tex fil. Till exempel, här är Lorentz ekvationer::
uk: Ось так, тепер можна вставляти формули у той самий спосіб, у який ви вставляєте їх у файлі .tex. Наприклад, ось так можна вставити рівняння Лоренца::

source: This snippet looks like the following screen shot in the |app| viewer.
cs: Tento fragment vypadá jako následující snímek obrazovky v prohlížeči |app|.
de: Dieses Code-Stück sieht im |app| eBook-Betrachter wie diese Abbildung aus:
es: Este fragmento aparece como la siguiente captura de pantalla en el visor de |app|.
uk: У програмі для перегляду книг |app| цей фрагмент буде показано так, як на наведеному нижче знімку.

source: :guilabel:`The Lorenz Equations`
cs: :guilabel:`Lorentzovy rovnice`
de: :guilabel:`Die Lorentz-Gleichung`
es: :guilabel:`Las ecuaciones de Lorentz`
fr: :guilabel:`Les Equations Lorenz`
pl: :gulabel: Równanie Lorentza
uk: :guilabel:`Рівняння Лоренца`

source: The complete HTML file, with more equations and inline mathematics is reproduced below. You can convert this HTML file to EPUB in |app| to end up with an ebook you can distribute easily to other people.
cs: Kompletní soubor HTML s více rovnicemi a vloženou matematikou je reprodukován níže. Tento soubor HTML můžete převést do EPUB v |app|, abyste získali e-knihu, kterou můžete snadno distribuovat ostatním lidem.
de: Die vollständige HTML-Datei mit mehr Gleichungen und Inline-Formeln ist nachstehend wiedergegeben. Sie können die HTML-Datei mit |app| in ein EPUB konvertieren, um am Ende ein einfach zu verteilendes eBook für andere Personen zu haben.
es: El archivo HTML completo, con más ecuaciones y fórmulas en el texto se reproduce más abajo. Puede convertir este archivo HTML a EPUB con |app| para obtener un libro electrónico fácilmente distribuible a otras personas.
uk: Код файла HTML з іншими рівняннями та вбудованими формулами повністю наведено нижче. Ви можете перетворити цей файл HTML на файл формату EPUB за допомогою |app|, щоб отримати електронну книгу, якою буде просто поділитися з іншими людьми.

source: Here is the generated EPUB file: `mathjax.epub <_static/mathjax.epub>`_.
de: Hier ist die generierte EPUB-Datei: `mathjax.epub <_static/mathjax.epub>`_.
fr: Ici se trouve le fichier EPUB généré : `mathjax.epub <_static/mathjax.epub>`_.
sv: Här är en skapad EPUB-fil: `mathjax.epub <_static/mathjax.epub>`_.
uk: Створений EPUB файл знаходиться тут: `mathjax.epub <_static/mathjax.epub>`_.

source: More information
cs: Více informací
de: Weitere Informationen
es: Más información
fr: Plus d'information
pl: Więcej informacji
sv: Mer information
uk: Додаткові відомості

source: Since the |app| viewer uses the MathJax library to render mathematics, the best place to find out more about math in ebooks and get help is the `MathJax website <http://www.mathjax.org>`_.
cs: Protože prohlížeč |app| používá pro vykreslení matematiky knihovnu MathJax, nejlepší místo pro zjištění více o matematice v e-knihách a získání nápovědy je `Webová stránka MathJax <http://www.mathjax.org>`_.
de: Da der |app| eBook-Betrachter zur Formel-Anzeige die Bibliothek MathJax verwendet, ist der beste Ort, um mehr über Formeln in eBooks zu erfahren und Hilfe zu finden, die `MathJax-Webseite <http://www.mathjax.org>`_.
es: Puesto que el visor de |app| usa la biblioteca MathJax para mostrar las fórmulas, el mejor lugar para encontrar más información sobre fórmulas matemáticas en libros electrónicos y obtener ayuda es la `página web de MathJax <http://www.mathjax.org>`_.
uk: Оскільки для показу формул у |app| використовується бібліотека MathJax, найкращим місцем для отримання додаткових відомостей щодо формул у електронних книгах та довідкової інформації є `сайт MathJax <http://www.mathjax.org>`_.

source: The calibre ebook viewer has the ability to display math embedded in ebooks (ePub and HTML files). You can typeset the math directly with TeX or MathML or AsciiMath. The calibre viewer uses the excellent `MathJax <http://www.mathjax.org>`_ library to do this. This is a brief tutorial on creating ebooks with math in them that work well with the calibre viewer.
fr: La visionneuse de livre numérique calibre à la capacité d'afficher les mathématiques intégrées dans les livres numériques (fichiers EPUB et HTML). Vous pouvez composer directement les mathématiques avec TeX ou MathML ou AsciiMath. La visionneuse de calibre utilise l'excellente librairie `MathJax <http://www.mathjax.org>`_ pour faire cela. Ceci est un bref tutoriel sur la création de livres numériques contenant des mathématiques qui fonctionne bien avec la visionneuse calibre.
pl: Przeglądarka książek calibre jest w stanie wyświetlić wzory matematyczne umieszczone w książkach (w formatach EPUB i HTML). Mogą być one napisane bezpośrednio w TeX, MathML lub AsciiMath. Przeglądarka wykorzystuje doskonałą bibliotekę MathJax <http://www.mathjax.org>`_ . Niniejszy samouczek jest krótkim przewodnikiem tworzenia ebooków ze wzrorami, które mogą być wyświetlone w przeglądarce calibre.
sv: calibre e-bokbläddraren har möjlighet att visa matte inbäddad i e-böcker (ePub-och HTML-filer). Du kan typsätta matten direkt med TeX eller MathML eller AsciiMath. calibre visaren använder utmärkta `MathJax <http://www.mathjax.org>` _ bibliotek för att göra detta. Detta är en kort genomgång på att skapa e-böcker med matematik och få dem att fungerar bra med den calibre visaren.

source: You can write mathematics inline inside a simple HTML file and the calibre viewer will render it into properly typeset mathematics. In the example below, we use TeX notation for mathematics. You will see that you can use normal TeX commands, with the small caveat that ampersands and less than and greater than signs have to be written as &amp; &lt; and &gt; respectively.
fr: Vous pouvez écrire des mathématiques en ligne à l'intérieur d'un fichier HTML simple et la visionneuse de calibre rendra des mathématiques correctement composées. Dans l'exemple ci-dessous, nous employons la notation de Tex pour les mathématiques. Vous verrez que vous pouvez employer des commandes normales de Tex, avec la petite mise en garde que les esperluettes et les signes moins grand que et plus grand que doivent être écrits respectivement comme &amp; &lt; et &gt;.
pl: Można umieścić wzory w tekście dokumentu HTML, a przeglądarka rozpozna je i automatycznie sformatuje. W poniższym przykładze została użyta notacja TeX. Jak widać można używać normalnych poleceń TeX, z niewielkim wyjątkiem - znaki ampersand, mniejsze od i większe od muszą być pisane jako, odpowiednio, &amp; &lt; and &gt;
sv: Du kan skriva matematik infogat i en enkel HTML-fil och calibre visaren kommer att göra det i rätt typsätt matematik. I exemplet nedan använder vi TeX notation för matematik. Du kommer att se att du kan använda vanliga TeX-kommandon, med det lilla förbehållet att et-tecken och mindre än och större än tecken måste skrivas som &amp; &lt och &gt.

source: The first step is to tell calibre that this will contains maths. You do this by adding the following snippet of code to the <head> section of the HTML file::
fr: La première étape est de dire à calibre que ceci contiendra des mathématiques. Vous faites cela en ajoutant l'extrait de code suivant à la section <head> du HTML::
pl: Pierwsz krok to poinformowanie calibre, że dokument zawiera wzory. Aby to zrobić należy umieścić w sekcj <head> następujący fragment kodu::
sv: Det första steget är att berätta för calibre att detta kommer innehålla matematik. Det gör du genom att lägga till följande kodsträng till <head> delen av HTML-filen::

source: This snippet looks like the following screen shot in the calibre viewer.
fr: Cet extrait ressemble à la copie d'écran suivante dans la visionneuse calibre.
pl: Ten fragment kodu będzie wyglądać jak na zrzucie ekranu przeglądarki poniżej.
sv: Detta klipp liknar som följande skärmbild i calibre visaren.

source: The complete HTML file, with more equations and inline mathematics is reproduced below. You can convert this HTML file to EPUB in calibre to end up with an ebook you can distribute easily to other people.
fr: Le fichier HTML complet, avec plus d'équations et de mathématiques intégrées est reproduit ci-dessous. Vous pouvez convertir ce fichier HTML en EPUB dans calibre pour obtenir un livre numérique que vous pouvez distribuer facilement à d'autres personnes.
pl: Kompletny kod HTML z wzorami umieszczonymi w tekście został pokazany poniżej. Za pomocą calibre można przekonwertować HTML do EPUB, aby zakończyć tworzenie ebooka i móc go bez problemu przekazać innym.
sv: Den kompletta HTML-fil med flera ekvationer och infogad matematik återges nedan. Du kan konvertera den här HTML-filen till EPUB in calibre för att hamna en e-bok som du kan dela ut lätt till andra människor.

source: Since the calibre viewer uses the MathJax library to render mathematics, the best place to find out more about math in ebooks and get help is the `MathJax website <http://www.mathjax.org>`_.
fr: Puisque la visionneuse calibre utilise la librairie MathJax pour présenter les mathématiques, le meilleur endroit pour en savoir plus à propos des mathématiques dans les livres numériques et obtenir de l'aide est `le site web de MathJax <http://www.mathjax.org>`_.
pl: Ponieważ calibre używa biblioteki MathJax do przetwarzania wzorów, miejscem, w którym uzyskasz najwięcej informacji na temat umieszczania wzorów w ebookach jest strona tej bliblioteki - <http://www.mathjax.org>`_.
sv: Eftersom calibre visaren använder MathJax-biblioteket för att göra matematik, är det bästa stället att ta reda på mer om matematik i e-böcker och få hjälp `MathJax webbplats <http://www.mathjax.org>` _.
