Repository: Easonqsp/calibre-translations
Catalog: manual/*/viewer.po
Languages: cs, de, es, fr, ms, sv

source: The Ebook Viewer
cs: Prohlížeč e-knih
de: Der eBook-Betrachter
es: El visor de libro electrónico
fr: La visionneuse de livre numérique
ms: Pelihat Ebuku
sv: E-bokläsare

source: calibre includes a built-in ebook viewer that can view all the major ebook formats. The viewer is highly customizable and has many advanced features.
cs: calibre obsahuje vestavěný prohlížeč e-knih, který umí zobrazit všechny hlavní formáty e-knih. Prohlížeč je vysoce přizpůsobitelný a má mnoho pokročilých funkcí.
de: calibre hat einen integrierten eBook-Betrachter, mit dem Sie alle gängigen eBook-Formate lesen können. Der Betrachter ist sehr anpassbar und hat viele zusätzliche Funktionen
es: calibre incluye un visor incorporado de libros electrónicos que puede ver todos los principales formatos de libros electrónicos. El visor es altamente personalizable y posee muchas funciones avanzadas.
fr: calibre inclut une visionneuse de livre numérique intégrée qui peut déchiffrer tous les principaux formats de livre numérique. La visionneuse est hautement personnalisable et possède de nombreuses fonctionnalités avancées.
ms: calibre menyertakan pelihat ebuku terbina-dalam yang dapat melihat semua format ebuku utama. Pelihat ini boleh diubahsuai dan mempunyai banyak fitur lanjutan.
sv: calibre inkluderar en inbyggd e-bokläsare som kan visa de flesta e-bokformaten. Denna läsare är väldigt anpassbar oc har många avancerade funktioner.

source: Starting the viewer
cs: Spuštění prohlížeče
de: Den eBook-Betrachter starten
es: Iniciando el visor
fr: Démarrer la visionneuse de livre numérique
ms: Memulakan pelihat
sv: Startar läsaren

source: You can view any of the books in your calibre library by selecting the book and pressing the View button. This will open up the book in the ebook viewer. You can also launch the viewer by itself from the Start menu in Windows or using the command :command:`ebook-viewer` in Linux and OS X (you have to install the command line tools on OS X first by going to :guilabel:`Preferences->Advanced->Miscellaneous`).
cs: Jakoukoliv z knih ve své knihovně calibre můžete zobrazit výběrem knihy a stisknutím tlačítka Zobrazit. To otevře knihu v prohlížeči e-knih. Můžete také spustit samotný prohlížeč z nabídky Start ve Windows nebo pomocí příkazu :command:`ebook-viewer` v Linuxu a OS X (nejdříve musíte nainstalovat nástroje příkazového řádku přejitím na :guilabel:`Předvolby->Rozšířené->Různé`).
de: Sie können jedes Buch der calibre Bibliothek anzeigen lassen, indem Sie das Buch auswählen und an auf die Schaltfläche "Vorschau" klicken. Dies öffnet das Buch im eBook-Betrachter. Sie können den eBook-Betrachter auch eigenständig über das Startmenü von Windows oder mithilfe des Befehls :command:`ebook viewer` in Linux und OS X starten (Sie müssen zuerst die Befehlszeilen-Tools unter OS X installieren, indem Sie auf :guilabel:`Einstellungen -> Erweitert -> Verschiedenes`).
es: Puede ver cualquiera de los libros de su biblioteca calibre, seleccionando el libro y pulsando el botón Ver. Esto abrirá el libro en el visor de libros electrónicos. También puede iniciar el visor por sí mismo desde el menú Inicio en Windows o utilizando el comando :command: `ebook-viewer` en Linux y OS X (primero hay que instalar las herramientas de línea de comandos en OS X e ir a :guilabel:`Preferencias->Avanzado->Misceláneas`).
fr: Vous pouvez visionner un livre de votre bibliothèque calibre en le sélectionnant et en cliquant sur le bouton Visualiser. Cela ouvrira le livre dans la visionneuse de livre numérique. Vous pouvez également lancer le visionneuse de manière indépendante à partir du menu Démarrer de Windows ou en utilisant la commande ebook-viewer dans Linux et OS X (vous devez d’abord installer les outils de ligne de commande sur OS X en allant dans :guilabel:`Préférences->Adancé->Divers`).
ms: Anda boleh lihat mana-mana buku di dalam pustaka calibre anda dengan memilih buku dan menekan butang Lihat. Ia akan membuka buku di dalam pelihat ebuku. Anda juga boleh lancarkan pelihat melalui Menu Mula di dalam Windows atau menggunakan perintah :command:`ebook-viewer` dalam Linux dan OS X (anda perlu memasang alat baris perintah di dalam OS X terlebih dahulu menerusi :guilabel:`Keutamaan->Lanjutan->Pelbagai`).
sv: Du kan visa godtycklig bok i ditt calibre-bibliotek genom att välja boken och trycka på visa-knappen. Detta kommer öppna upp boken i e-bokläsare. Du kan också sätta igång läsare själv från start-menyn i Windows eller genom att använda kommandot :command:`ebook-viewer` i Linux och OS X (du måste installera kommandoverktyget i OS X först genom :guilabel:`Inställningar->Avancerat->Diverse`).

source: Navigating around an ebook
cs: Navigace v e-knize
de: Durch ein eBook navigieren
es: Navegando alrededor del libro electrónico
fr: Naviguer dans un livre numérique
ms: Menavigasi ebuku
sv: Navigera omkring i en e-bok

source: You can "turn pages" in a book by using the :guilabel:`Page Next` and :guilabel:`Page Previous` buttons |pni|, or by pressing the Page Down/Page Up keys. Unlike most ebook viewers, calibre does not force you to view books in paged mode. You can scroll by amounts less than a page by using the scroll bar or various customizable keyboard shortcuts.
cs: V knize můžete "otáčet stránky" pomocí tlačítek :guilabel:`Další stránka` a :guilabel:`Předchozí stránka` |pni|, nebo stisknutím kláves Page Down a Page Up. Na rozdíl od většiny prohlížečů e-knih vás calibre nenutí prohlížet knihy v režimu stránek. Můžete posouvat po množstvích menších než stránka pomocí posuvníku nebo různých přizpůsobitelných klávesových zkratek.
de: Sie können in einem Buch blättern, mit dem Sie die Schaltflächen :guilabel:`Nächste Seite` und :guilabel:`Vorherige Seite` |pni| oder die Tasten Bild-ab/Bild-hoch benutzen. Im Gegensatz zu vielen eBook-Betrachtern zwingt calibre sie nicht, Bücher im Seiten-Modus zu lesen. Sie können auch in kleineren Schritten als eine Seite mithilfe der Bildlaufleiste oder verschiedener frei wählbarer Tastaturkürzel blättern.
es: Puede "pasar las páginas" en un libro utilizando los botones :guilabel:`Próxima página` y :guilabel:` Página anterior` |PNI|, o pulsando las teclas Av Pág/Re Pág. A diferencia de la mayoría de los lectores de libros electrónicos, calibre no te obliga a ver libros en modo paginado. Puede desplazarse por cantidades inferiores a una página mediante el uso de la barra de desplazamiento o varios atajos de teclado personalizables.
fr: Vous pouvez "tourner les pages" du livre en utilisant les boutons |pni| :guilabel:`Page Suivante` et :guilabel:`Page Précédente`, ou en actionnant les touches Page prc/ Page suiv de votre clavier. Contrairement à la plupart des visionneuses de livre numérique calibre ne force pas la visualisation des livres en mode page. Vous pouvez faire défiler des contenus inférieurs à une page en utilisant la barre de défilement ou divers raccourcis clavier personnalisables.
ms: Anda boleh "kalih halaman" buku dengan menggunakan butang |pni| :guilabel:`Halaman Berikutnya` dan :guilabel:`Halaman Terdahulu` , atau dengan menekan kekunci Page Down/Page Up. Tidak seperti kebanyakan pelihat ebuku, calibre tidak memaksa anda membaca buku dalam mod berhalaman. Anda boleh tatal amaun teks kurang dari satu halaman dengan menggunakan palang tatal atau pintasan papan kekunci boleh suai.
sv: Du kan "bläddra sidor" i en bok genom att använda :guilabel:`Nästa sida` och :guilabel:`Föregående sida` knappar |pni|, eller genom att trycka på "Page Up/Page Down"-knapparna. Till skillnad mot de flesta e-bokläsare, kräver inte calibre dig att visa böcker i sidläge. Du kan rulla andelar som är mindre än en sida genom att använda rullisten eller diverse anpassbara tangentbordssnabbval.

source: Bookmarks
cs: Záložky
de: Lesezeichen
es: Marcadores
fr: Signets
ms: Tanda buku
sv: Bokmärken

source: When you are in the middle of a book and close the viewer, it will remember where you stopped reading and return there the next time you open the book. You can also set bookmarks in the book by using the Bookmark button |bookmi|. When viewing EPUB format books, these bookmarks are actually saved in the EPUB file itself. You can add bookmarks, then send the file to a friend. When they open the file, they will be able to see your bookmarks.
cs: Když jste uprostřed knihy a zavřete prohlížeč, zapamatuje si, kde jste přestali číst, a vrátí se tam, když příště otevřete knihu. Můžete také nastavit záložky v knize pomocí tlačítka Záložka |bookmi|. Při prohlížení knih ve formátu EPUB jsou tyto záložky skutečně ukládány do samotného souboru EPUB. Můžete přidat záložky, a pak odeslat soubor přátelům. Když otevřou soubor, uvidí vaše záložky.
de: Wenn Sie sich im Buch befinden und den eBook-Betrachter schließen, merkt sich der Betrachter die letzte Leseposition und öffnet das Buch beim nächsten Mal genau an dieser Stelle. Sie können im Buch mithilfe der Lesezeichen-Schaltfläche |bookmi| auch Lesezeichen festlegen. Bei der Verwendung von Büchern im EPUB Format werden die Lesezeichen in der EPUB-Datei gespeichert. Sie können Lesezeichen hinzufügen und die Datei danach an Freunde senden. Wenn diese die Datei öffnen, können sie ebenfalls Ihre Lesezeichen im eBook-Betrachter sehen.
es: Cuando está en medio de un libro y cierra el visor, recordará donde se detuvo leyendo y retornará allí la próxima vez que abra el libro. También puede establecer marcadores en el libro mediante el botón Agregar a favoritos |bookmi|. Al ver libros en formato EPUB, estos marcadores se guardan realmente en el mismo archivo EPUB. Puedes agregar favoritos y a continuación, enviar el archivo a un amigo. Cuando abren el archivo, será capaz de ver sus marcadores.
fr: Lorsque vous êtes au milieu d'un livre et fermez la visionneuse, elle se souviendra où vous avez arrêté la lecture et y retournera la prochaine fois que vous ouvrirez le livre. Vous pouvez également définir des signets dans le livre en utilisant le bouton signet. Lors de l'affichage des livres au format EPUB, ces signets sont enregistrées dans le fichier EPUB lui-même. Vous pouvez ajouter des signets, puis envoyer le fichier à un ami. Quand il ouvrira le fichier, il sera en mesure de voir vos signets.
ms: Bila anda sedang membaca buku dan kemudian anda tutup pelihat tersebut, ia akan mengingati tempat terakhir anda berhenti membaca serta kembali ke tempat tersebut bila anda membuka buku tersebut. Anda juga boleh tetapkan tanda buku dalam buku dengan menggunakan butang Tanda Buku |bookmi|. Bila membaca buku berformat EPUB, tanda buku yang sebenar disimpan dalam fail EPUB tersebut. Anda boleh menambah tanda buku, kemudian hantar fail itu kepada rakan anda. Bila mereka membuka fail tersebut, mereka dapat melihat tanda buku anda.
sv: När du är mitt i en bok och stänger läsare, kommer den komma i håg var du slutade läsa och återvända dit nästa gång du öppnar boken. Du kan också sätt in bokmärken i boken genom att använda bokmärkes-knappen |bookmi|. När EPUB-formaterade böcker läses, sparas dessa bokmärken faktiskt i själva EPUB-filen. Du kan lägga till bokmärken, sedan skicka filen till en vän. När vännen sedan öppnar kommer hen se dina bokmärken.

source: Table of Contents
cs: Obsah
de: Inhaltsverzeichnis
es: Índice
fr: Table des matières
ms: Senarai Kandungan
sv: Innehållsförteckning

source: If the book you are reading defines a Table of Contents, you can access it by pressing the Table of Contents button |toci|. This will bring up a list of sections in the book. You can click on any of them to jump to that portion of the book.
cs: Pokud kniha, kterou čtete, definuje obsah, můžete k němu přistoupit stisknutím tlačítka Obsah |toci|. To zobrazí seznam oddílů v knize. Můžete kliknout na kterýkoliv z nich pro přejití na tuto část knihy.
de: Wenn das Buch, das Sie Lesen ein Inhaltsverzeichnis besitzt, können Sie es durch einen Klick auf die Schaltfläche |toci| auf das Inhaltsverzeichnis zugreifen. Dieses zeigt eine eine Liste der Abschnitte im Buch. Sobald Sie auf einen Eintrag klicken, springt der Betrachter zu diesem Teil des Buches.
es: Si el libro que está leyendo define un Índice, puede acceder a él pulsando el botón Índice |Toci|. Esto traerá una lista de secciones en el libro. Puede hacer clic en cualquiera de ellos para ir a dicha parte del libro.
fr: Si le livre que vous lisez a une Table des Matières définie, vous pouvez y accéder en appuyant sur le bouton |toci| Table des Matières. Cela fera apparaître une liste des sections du livre. Vous pouvez cliquer sur n'importe laquelle de celles-ci pour accéder à cette partie du livre.
ms: Jika buku yang anda baca mempunyai Senarai Kandungan, anda boleh capai ia dengan menekan butang Senarai Kandungan |toci|. Ia akan menyenaraikan seksyen di dalam buku. Anda boleh klik mana-mana seksyen tersebut untuk melompat ke bahagian buku yang dikehendaki.
sv: Om boken du läser har en innehållsförteckning, kan du nå den genom att trycka på innehållsförteckningsknappen |toci|. Detta kommer att ta fram en lista av sektioner i boken. Du kan klicka på valfri och hoppa till denna del av boken.

source: Navigating by location
cs: Navigace podle místa
de: Navigation nach Standortpositionen
es: Navegando por ubicación
fr: Navigation par emplacement
ms: Navigasi mengikut lokasi
sv: Navigering genom plats

source: Ebooks, unlike paper books, have no concept of pages. Instead, as you read through the book, you will notice that your position in the book is displayed in the upper left corner in a box like this |navposi|. This is both your current position and the total length of the book. These numbers are independent of the screen size and font size you are viewing the book at, and they play a similar role to page numbers in paper books. You can enter any number you like to go to the corresponding location in the book.
cs: E-knihy, na rozdíl od papírových knih, nemají žádný koncept stránek. Namísto toho když čtete knihu, všimnete si, že je vaše pozice v knize zobrazena v levém horním rohu v poli, jako je toto |navposi|. To je jak vaše aktuální pozice, tak celková délka knihy. Tato čísla jsou nezávislá na velikosti obrazovky a písma, ve kterých zobrazujete knihu, a hrají podobnou roli, jako čísla stránek v papírové knize. Můžete zadat, kterékoliv číslo chcete, abyste přešli na odpovídající místo v knize.
de: eBooks haben, anders als Papier-Bücher, kein Seitenkonzept. Stattdessen wird, wie Sie beim Lesen eines Buchs festellen können, die Position im Buch in der linken oberen Ecke in einer Box wie diese |navposi| angezeigt wird. Diese zeigt Ihre aktuelle Position und die gesamte Länge des Buches. Diese Nummern sind unabhängig von der Bildschirm- und die Schriftgröße, mit der Sie das Buch zu betrachten, und spielen eine ähnliche Rolle wie Seitenzahlen in Bücher aus Papier. Sie können eine beliebige Zahl eingeben, um an die entsprechende Stelle im Buch zu gelangen.
es: Los libros electrónicos, a diferencia de los de papel, no tienen el concepto de páginas. En cambio, a medida que lea el libro, se dará cuenta que su posición en el libro se muestra en la esquina superior izquierda en un cuadro como éste |navposi|. Esto es tanto su posición actual y la longitud total del libro. Estos números son independientes del tamaño de la pantalla y el tamaño de la fuente en que está viendo el libro, y desempeñan un papel similar al de los números de página en los libros de papel. Puede introducir cualquier número que desee para ir a la ubicación correspondiente en el libro.
fr: Les livres numériques, contrairement aux livres papier, n'ont pas de notion de pages. Au lieu de cela, lorsque vous lisez le livre, vous verrez que votre position dans le livre est affichée dans le coin supérieur gauche dans une case comme celle-ci |navposi|. Il indique à la fois votre position actuelle et la longueur totale de l'ouvrage. Ces chiffres sont indépendants de la taille de l'écran et la taille de police avec laquelle que vous lisez le livre. Ils jouent un rôle similaire aux numéros de page dans les livres papier. Vous pouvez entrer n'importe quel nombre dans le rectangle, vous serez dirigés vers l'emplacement correspondant dans le livre.
ms: Ebuku, tidak seperti buku sebenar, ia tiada konsep halaman. Bila anda membaca buku , anda dapati kedudukan bacaan anda dipapar bahagian kiri atas seperti ini |navposi|. Ia merupakan kedudukan semasa dan panjang bacaan anda. Nombor ini tidak dipengaruhi oleh saiz skrin dan saiz fon buku, dan ia berperanan sebagai nombor halaman dalam buku kertas sebenar. Anda boleh masukkan apa jua nombor muka surat untuk pergi ke lokasi kandungan buku tersebut.
sv: E-böcker till skillnad mot böcker, har inget sidkoncept. I stället, allt eftersom du läser genom boken, kommer du notera att din position i boken visas i övre vänstra hörnet i en ruta som denna |navposi|. Detta är både din nuvarande position och den totala längden av boken. Dessa nummer är oberoende av skärmstorlek och teckenstorlek som du visar boken i, och de spelar en liknande roll till sidnummer i pappersboken. Du kan skriva in valfritt nummer du vill gå till motsvarande plats i boken.

source: calibre also has a very handy reference mode. You can turn it on by clicking the Reference Mode button |refmi|. Once you do this, every time you move your mouse over a paragraph, calibre will display a unique number made up of the section and paragraph numbers.
cs: calibre má také velice šikovný režim odkazů. Můžete ho zapnout kliknutím na tlačítko Režim odkazů |refmi|. Jakmile to uděláte, pokaždé, když pohnete myší nad odstavcem, calibre zobrazí jedinečné číslo složené z čísel oddílu a odstavce.
de: calibre hat auch einen sehr praktischen Verweismodus. Dieser kann eingeschaltet werden, indem Sie auf die Schaltfläche Verweismodus |refmi| klicken. Sobald dieser aktiviert wurde, wird jedes Mal, wenn Sie die Maus über einen Absatz, calibre bewegen, eine eindeutige Nummer, bestehend aus Abschnitt und Absatz-Nummern angezeigt.
es: calibre también tiene un modo de referencia muy útil. Puede activarlo haciendo clic en el botón Modo de referencia |refmi|. Una vez hecho esto, cada vez que se mueve el ratón sobre un párrafo, calibre mostrará un número exclusivo formado por los números de sección y párrafo.
fr: calibre possède également un mode de référence très pratique. Vous pouvez l'activer en cliquant sur le bouton Mode référence |refmi|. Chaque fois que vous déplacerez votre souris sur un paragraphe, calibre affichera un numéro unique composé de la section et du numéro du paragraphe.
ms: calibre juga mempunyai mod rujukan yang sangat mudah. Anda boleh hidupkannya dengan mengklik butang Mod Rujukan |refmi|. Bila anda mengaktifkannya, setiap kali anda mengalih kursor tetikus di atas perenggan, calibre akan paparkan nombor unik seksyen dan juga nombor perenggannya.
sv: calibre har också en bekvämt referensläge. Du kan slå på detta genom att klicka på referenslägesknappen |refmi|. När du gör detta, kommer calibre varje gång du för musen över en paragraf visa ett unikt nummer bestående av sektion- och paragrafnummer

source: You can use this number to unambiguously refer to parts of the books when discussing it with friends or referring to it in other works. You can enter these numbers in the box marked Go to at the top of the window to go to a particular reference location.
cs: Toto číslo můžete použít pro jednoznačné odkazy na části knih, když o nich diskutujete s přáteli, nebo na ně odkazujete v jiných pracích. Tato čísla můžete zadat do pole označeného Přejít na... v horní části okna pro přejití na konkrétní místo odkazu.
de: Sie können diese Nummer verwenden, um auf eindeutige Teile im Buch zu verweisen, falls Sie diese Stellen mit Freunden diskutieren oder wenn Sie in anderen Werken auf diese Stellen verweisen wollen. Sie können diese Zahlen in das Kästchen "Gehe zu..." am oberen Rand des Fensters eingeben, um zu einer bestimmten Referenzposition zu gelangen.
es: Puede usar este número para hacer referencia sin ambigüedades a las partes de los libros cuando se habla con los amigos o se refieran a ella en otros trabajos. Puede introducir estos números en la casilla Ir a en la parte superior de la ventana para ir a un lugar de referencia particular.
fr: Vous pouvez utiliser ce numéro pour désigner sans ambiguïté une partie du livre quand vous en discutez avec des amis ou pour faire référence dans d'autres œuvres. Vous pouvez entrer ces chiffres dans la case marquée Aller vers le haut de la fenêtre pour vous rendre à un emplacement de référence particulier.
sv: Du kan använda detta nummer för att entydigt hänvisa till delar av böckerna när man diskuterar det med vänner eller hänvisa till den i andra verk. Du kan skriva in dessa nummer i rutan Gå till högst upp i fönstret för att gå till en särskild hänvisning plats.

source: If you click on links inside the ebook to take you to different parts of the book, such as an endnote, you can use the back and forward buttons in the top left corner to return to where you were. These buttons behave just like those in a web browser.
cs: Pokud kliknete na odkazy uvnitř e-knihy, aby vás přenesli na různé části knihy, jako je vysvětlivka, můžete použít tlačítka Zpět a Vpřed v levém horním rohu pro návrat tam, kde jste byli. Tato tlačítka se chovají stejně jako ta v internetovém prohlížeči.
de: Wenn Sie auf Links innerhalb des eBook klicken, um zu unterschiedlichen Teilen des Buches, wie etwa Fußnoten zu springen, können Sie die Schaltflächen in der linken oberen Ecke für Zurück und Vorwärts benutzen, um wieder zur letzten Position zurückzuspringen. Diese Schaltflächen verhalten sich ebenso, wie die in einem Webbrowser.
es: Si hace clic en los enlaces dentro del libro electrónico lo llevará a diferentes partes del libro, como una nota al final, puede utilizar los botones atrás y adelante en la esquina superior izquierda para volver adonde estaba. Estos botones se comportan igual que los de un navegador de internet.
fr: Si vous cliquez sur les liens à l'intérieur du livre numérique, vous serez amenés vers différentes parties du livre, vers les notes de fin, par exemple. Vous pouvez utiliser le boutons Précédent et Suivant dans le coin supérieur gauche pour revenir là où vous étiez. Ces boutons se comportent exactement comme ceux d'un navigateur internet.
sv: Om du klickar på länkar inne i e-boken kommer du kunna ta dig till olika delar av boken, som slutnotering, kan du använda dig av frammåt- och bakåtknappar i övre vänstra hörnet för att återvända var du var. Dessa knappar beter sig precis som dem i en webläsare.

source: Customizing the look and feel of your reading experience
cs: Přizpůsobení vzhledu a chování vašeho zážitku ze čtení
de: Anpassen des Erscheinungsbilds für ihr Lesevergnügen
es: Personalizar la apariencia de su experiencia de lectura
fr: Personnalisation de l'aspect et de la convivialité de votre expérience de lecture
sv: Anpassning av utseende av din läsupplevelse
