Repository: Easonqsp/calibre-translations
Catalog: manual/*/viewer.po
Languages: cs, de, es, fr, ms, sv

source: You can change font sizes on the fly by using the font size buttons |fontsizei|. You can also make the viewer full screen by pressing the Full Screen button |fsi|. By clicking the Preferences button |prefbi|, you can change the default fonts used by the viewer to ones you like as well as the default font size when the viewer starts up.
cs: Můžete změnit velikosti písem za chodu pomocí tlačítek velikosti písma |fontsizei|. Můžete také přepnout prohlížeč na celou obrazovku stisknutím tlačítka Přepnout na celou obrazovku |fsi|. Kliknutím na tlačítko Předvolby |prefbi| můžete změnit výchozí písma použitá prohlížečem na taková, která se vám líbí, stejně jako výchozí velikost písma po spuštění prohlížeče.
de: Sie können die Schriftgrößen im laufenden Betrieb mit den Schriftgröße-Schaltflächen |fontsizei| ändern. Darüber hinaus können Sie den Betrachter durch klicken auf die Vollbild Schaltfläche |fsi| im Vollbildmodus umstellen. Durch den Klick auf die Schaltfläche Einstellungen |prefbi|, können Sie die verwendeten Standardschriftarten und -größen auf ihre Präferenzen für den eBook-Betrachter ändern. Diese werden beim Start des Betrachters übernommen.
es: Puede cambiar los tamaños de fuente sobre la marcha mediante el uso de los botones de tamaño de letra |fontsizei|. También puede hacer que el visor esté a pantalla completa pulsando el botón Pantalla completa |fsi|. Al hacer clic en el botón Preferencias |prefbi|, puede cambiar las fuentes predeterminadas utilizadas por el visor por las que le guste, así como el tamaño de fuente por defecto cuando el visor se pone en marcha.
fr: Vous pouvez changer la taille des polices à la volée en utilisant les boutons taille de la police |fontsizei|. Vous pouvez également vous mettre en visualisation plein écran en appuyant sur le bouton plein écran |fsi|. En cliquant sur le bouton Préférences |prefbi|, vous pouvez modifier les polices par défaut utilisés par le visionneur et les remplacer par celles que vous aimez, ainsi que la taille de police par défaut utilisées par la visionneuse quand elle démarre.
sv: Du kan ändra typsnittsstorlek på direkten genom att typsnittsstorleksknapparna |fontsizei|. Du kan också få läsaren att visa helskärmsläge genom att trycka Helskärmsknappen |fsi|. Genom att klicka på inställningsknappen |prefbi|, kan du ändra grundinställningen av typsnitt som läsaren använder samt typsnittsstorlek till de du önskar ha när läsaren startar.

source: More advanced customization can be achieved by the User Stylesheet setting. This is a stylesheet you can set that will be applied to every book. Using it you can do things like have white text on a black background, change paragraph styles, text justification, etc. For examples of custom stylesheets used by calibre's users, see `the forums <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
cs: Pokročilejší přizpůsobení může být dosaženo nastavením uživatelské šablony stylů. To je šablona stylů, kterou můžete nastavit, aby se použila na každou knihu. Pomocí ní můžete dělat věci, jako jsou bílý text na černém pozadí, změna stylů odstavce, zarovnání textu do bloku atd. Pro příklady vlastních šablon stylů používaných uživateli calibre navštivte `fórum <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
de: Erweiterte Einstellungen können durch die Anpassung des Benutzer Stylesheet erreicht werden. Die in diesem Stylesheet festgelegten Einstellungen werden auf jedes Buch angewendet. Hiermit können Sie Dinge wie z. B. einen weißen Text auf schwarzem Hintergrund einstellen, Absatzformate, Textausrichtung, usw. ändern. Für Beispiele zur Verwendung von benutzerdefinierten Stylesheets von calibre's Benutzern finden Sie `im Forum <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
es: Más personalización avanzada se puede lograr mediante la configuración de estilos de usuario. Esta es una hoja de estilo que puede establecer que se aplicará a todos los libros. Usándola puede hacer cosas como tener texto en blanco sobre un fondo negro, cambiar estilos de párrafo, la justificación del texto, etc. Para ejemplos de hojas de estilo personalizadas utilizadas por los usuarios de calibre, véase `los foros <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
fr: Une personnalisation plus avancée peut être réalisée par le réglage de la Feuille de Style Utilisateur. Il s'agit d'une feuille de style que vous pouvez définir qui sera appliquée à chaque livre. En l'utilisant, vous pouvez faire des choses comme avoir un texte blanc sur fond noir, les styles de paragraphe, la justification du texte, etc. Pour avoir des exemples de feuilles de style personnalisées conçues par les utilisateurs de calibre, consultez `les forums <http://www.mobileread.com/forums/showthread.php?t=51500>`_.
sv: Mer avancerade anpassningar kan åstadkommas genom inställningar för användarformatmall. Detta är en formatmall som du kan välja att tillämpa på alla böcker. Genom att använda detta kan du göra saker som ha vit text på svart bakgrund, ändra paragrafstilar, textmarginaler, etc. TIll exempel av anpassad formatmal som används av calibre's användare, se `the forums <http://www.mobileread.com/forums/showthread.php?t=51500>`_.

source: Dictionary lookup
cs: Vyhledávání ve slovníku
de: Wörterbuchsuche
es: Diccionario de búsqueda
fr: Consultation du dictionnaire
sv: Ordlistsuppslag

source: You can look up the meaning of words in the current book by right clicking on a word. calibre uses the publicly available dictionary server at ``dict.org`` to look up words. The definition is displayed in a small box at the bottom of the screen.
cs: Význam slov v aktuální knize můžete vyhledat označením slova přetažením myší, pak kliknutím pravým tlačítkem myši a výběrem Vyhledat ve slovníku. calibre používá pro vyhledání slov veřejně dostupný server slovníku na ``dict.org``. Definice je zobrazena v malém poli ve spodní části obrazovky.
de: Sie können die Bedeutung von Wörter im aktuellen Buch durch den Rechtsklick auf ein Wort nachschlagen. calibre verwendet öffentlich zugängliche Wörterbuch-Server von ``dict.org``, um Wörter nachzuschlagen. Die Definition wird in einem kleinen Feld am unteren Rand des Bildschirms angezeigt.
es: Puede buscar el significado de las palabras en el libro actual haciendo clic derecho sobre una palabra. calibre utiliza el servidor de diccionario a disposición del público ``dict.org`` para buscar palabras. La definición se muestra en una pequeña caja en la parte inferior de la pantalla.
fr: Vous pouvez rechercher le sens des mots dans le livre ouvert par un clic droit sur un mot. calibre se connecte sur le dictionnaire public ``dict.org`` pour donner les définition des mots. La définition s'affiche dans une petite case en bas de l'écran.
ms: Anda boleh mencari maksud perkataan di dalam buku dengan mengklik kanan pada perkataan tersebut. Calibre menggunakan pelayan kamus awam di ``dict.org`` untuk mencari maksud perkataan tersebut. Takrifannya dipapar dalam satu kotak kecil di bahagian bawah skrin.
sv: Du kan slå upp betydelsen av ord i aktuell bok genom att högerklicka på ett ord. calibre använder allmänt tillgängliga ordboksserver ``dict.org`` för att slå upp ord. Definitionen visas i en liten ruta längst ner på skärmen.

source: Copying text and images
cs: Kopírování textu a obrázků
de: Kopieren von Text und Bildern
es: Copiando tezxto e imágenes
fr: Copier du texte et des images
sv: Kopiering av text och bilder

source: You can select text and images by dragging the content with your mouse and then right clicking to copy to the clipboard. The copied material can be pasted into another application as plain text and images.
cs: Text a obrázky můžete vybrat přetažením obsahu myší a potom kliknutím pravým tlačítkem myši na Kopírovat. Zkopírovaný materiál může být vložen do jiné aplikace jako prostý text a obrázky.
de: Sie können Text und Bilder auswählen, indem Sie den Inhalt mit der Maus markieren und ihn dann per Rechtsklick in die Zwischenablage kopieren. Das kopierte Material kann in einer anderen Anwendung als einfacher Text und Bilder eingefügt werden.
es: Puede seleccionar texto e imágenes arrastrando el contenido con el ratón y luego clic derecho para copiar en el portapapeles. El material copiado se puede pegar en otra aplicación como texto sin formato e imágenes.
fr: Vous pouvez sélectionner du texte et des images avec votre souris, puis faire clic droit pour copier dans le presse-papiers. Le matériel copié peut être collé dans une autre application sous forme de texte et d'images.
sv: Du kan välja text och bilder genom att dra innehållet med din mus och sedan högerklicka för att kopiera till klippbordet. Kopierat material kan sedan klistras in i en annan applikation som ren text och bilder.
