Repository: Easonqsp/calibre-translations
Catalog: manual/*/virtual_libraries.po
Languages: de, es, sv

source: Virtual Libraries
de: Virtuelle Bibliotheken
es: Bibliotecas virtuales
sv: Virtuella bibliotek

source: In calibre, a virtual library is a way to tell calibre to open only a subset of a normal library. For example, you might want to only work with books by a certain author, or books having only a certain tag. Using virtual libraries is the preferred way of partitioning your large book collection into smaller sub collections. It is superior to splitting up your library into multiple smaller libraries as, when you want to search through your entire collection, you can simply go back to the full library. There is no way to search through multiple separate libraries simultaneously in calibre.
de: Mit virtuellen Bibliotheken hat man in calibre die Möglichkeit, nur einen Teil der gesamten calibre-Bibliothek zu öffnen. So können sie beispielsweise mit Büchern nur eines bestimmten Autors oder mit Büchern, die ein bestimmtes Schlagwort haben, arbeiten. Virtuelle Bibliotheken sind die bevorzugte Methode zur Partitionierung großer Büchersammlung in kleinere Untersammlungen. Sie ist der Aufspaltung einer Bibliothek in kleinere Einzelbibliotheken überlegen, da Sie jederzeit einfach in die gesamte Bibliothek zurückspringen können, falls Sie die gesamte Sammlung durchsuchen möchten. Es gibt keine Möglichkeit in calibre, über mehrere separate Bibliotheken gleichzeitig zu suchen.
es: En calibre, una biblioteca virtual es una manera de ordenar a calibre abrir sólo un subconjunto de una biblioteca normal. Por ejemplo, es posible que desee sólo trabajar con los libros de un determinado autor, o libros que tienen sólo una cierta etiqueta. El uso de las bibliotecas virtuales es la mejor forma de dividir su gran colección de libros en sub-colecciones más pequeñas. Es mejor dividir su biblioteca en múltiples bibliotecas más pequeñas, en tanto cuando quiera buscar en toda su biblioteca, puede simplemente volver a la biblioteca completa. No hay manera de buscar a través de múltiples bibliotecas separadas simultáneamente en calibre.
sv: I calibre, är ett virtuellt bibliotek ett sätt att tala om för calibre att öppna en delmängd av det normala biblioteket. Till exempel, du vill bara arbeta med böcker av en viss författare, eller böcker som har en viss etikett. Användning av virtuella bibliotek är en föredraget sätt att dela upp en stor boksamling i mindre delsamlingar. Det är överlägset att dela upp ditt bibliotek i flera mindre bibliotek som, när du vill söka igenom hela samlingen, du kan enkelt återvända till det fulla biblioteket. Det finns inget sätt att söka igenom flera separata bibliotek samtidigt i calibre.

source: A virtual library is different from a simple search. A search will only restrict the list of books shown in the book list. A virtual library does that, and in addition it also restricts the entries shown in the :guilabel:`Tag Browser` to the left. The Tag Browser will only show tags, authors, series, publishers, etc. that come from the books in the virtual library. A virtual library thus behaves as though the actual library contains only the restricted set of books.
de: Eine virtuelle Bibliothek unterscheidet sich von einer einfachen Suche. Eine Suche beschränkt nur die angezeigten Bücher innerhalb einer Buchliste. Eine virtuelle Bibliothek macht dies ebenfalls und darüber hinaus werden die Einträge im :guilabel:`Schlagwort-Browser` auf der linken Seite eingeschränkt. Der Schlagwort-Browser zeigt nur Schlagworte, Autoren, Verlage, Serien etc., die von den Büchern aus der virtuellen Bibliothek kommen. Eine virtuelle Bibliothek verhält sich so, als ob die eigentliche Bibliothek nur einen eingeschränkten Satz von Büchern enthält.
es: Una biblioteca virtual es diferente desde una simple búsqueda. Una búsqueda sólo restringirá la lista de los libros que aparecen en la lista de libros. Una biblioteca virtual hace eso, y además también restringe las entradas incluidas en :guilabel: `Navegador de etiquetas` a la izquierda. El Navegador de etiquetas sólo mostrará las etiquetas, autores, series, editores, etc, que provienen de los libros en la biblioteca virtual. Por tanto, una biblioteca virtual se comporta como la biblioteca real, sólo que contiene un conjunto restringido de libros.
sv: Ett virtuellt bibliotek skiljer sig från en enkel sökning. En sökning kommer bara begränsa listan av visade böcker i boklistan. Ett virtuellt bibliotek kommer göra detta och i tillägg också begränsa antalet element som visas i :guilabel:`Etikettbläddrare` till vänster. Etikettbläddraren kommer bara visa etiketter, författare, serier, utgivare, etc. som kommer från böcker i virtuella biblioteket. Ett virtuellt bibliotek beter sig sålunda som ett faktiskt bibliotek som bara innehåller den begränsade uppsättningen böcker.

source: Creating Virtual Libraries
de: Virtuelle Bibliotheken erstellen
es: Creando Bibliotecas Virtuales
sv: Skapar virtuella bibliotek

source: |vlb| To use a virtual library click the :guilabel:`Virtual Library` button located to the left of the search bar and select the :guilabel:`Create Virtual Library` option. As a first example, let's create a virtual library that shows us only the books by a particular author. Click the :guilabel:`Authors` link as shown in the image below and choose the author you want to use and click OK.
de: |vlb| Um eine virtuelle Bibliothek zu verwenden, klickt man auf die Taste :guilabel:`Virtuelle Bibliothek`, welche sich links neben der Suchleiste befindet und wählt dort die Option :guilabel:`Virtuelle Bibliothek erstellen` aus. Als ein erstes Beispiel erstellen wir eine virtuelle Bibliothek, die uns nur Bücher eines einzelnen Autors zeigen. Klicken Sie, wie im Bild unten gezeigt, auf die schon vordefinierte Verknüpfung :guilabel:`Autoren`. Danach wählen Sie den gewünschten Autor aus der Liste aus und beenden die Definition ihrer virtuellen Bibliothek mit dem Klick auf OK.
es: |vlb| Para utilizar una biblioteca virtual, haga clic en el botón :guilabel:`Biblioteca Virtual` situado a la izquierda de la barra de búsqueda y seleccionar la opción :guilabel:`Crear Biblioteca Virtual`. Como primer ejemplo, vamos a crear una biblioteca virtual que nos muestra sólo los libros de un autor concreto. Haga clic en el enlace :guilabel:`Autores` como se muestra en la imagen de abajo y elija el autor que desee utilizar y haga clic en Aceptar.
sv: |vlb| För att använda ett virtuellt bibliotek klicka på :guilabel:`Virtuellt bibliotek` knappen som finns till vänster om sökverktygslisten och välj :guilabel:`Skapa virtuellt bibliotek` alternativet. Som ett första exempel, låt oss skapa ett virtuellt bibliotek som visar oss bara böcker av en viss författare. Klicka på :guilabel:`Authors` länken som visas i bilden nedan och välj författare som du vill använda och klicka OK.

source: The Create Virtual Library dialog has been filled in for you. Click OK and you will see that a new Virtual Library has been created, and automatically switched to, that displays only the books by the selected author. As far as calibre is concerned, it is as if your library contains only the books by the selected author.
de: Der Dialog :guilabel:`Virtuelle Bibliothek erstellen` hat die Eingaben für Sie ausgefüllt. Klicken Sie auf OK. Sie werden feststellen, dass eine neue virtuelle Bibliothek erstellt wurde und automatisch auf diese umgeschaltet wird. Nun werden nur noch die Bücher des ausgewählten Autors angezeigt. Soweit es calibre betrifft, verhält sich die Bibliothek so, als würde diese nur Bücher des ausgewählten Autors enthalten.
es: El cuadro de diálogo Crear Biblioteca Virtual ha sido rellenado por usted. Haga clic en Aceptar y verá que una nueva Biblioteca Virtual ha sido creada y ha sido redirigido automáticamente, y sólo se muestran los libros del autor seleccionado. En lo que se refiere a calibre, es como si la biblioteca contiene sólo los libros del autor seleccionado.
sv: Skapa virtuellt bibliotek-dialogen har fyllts i av dig. Klicka OK och du kommer se att ett nytt virtuellt bibliotek har skapats och automatiskt växlats över och visar bara böcker av den valda författaren. Så långt som det rör calibre, är det som om ditt bibliotek bara innehåller böcker av vald författare.

source: You can switch back to the full library at any time by once again clicking the :guilabel:`Virtual Library` and selecting the entry named :guilabel:`<None>`.
de: Sie können jederzeit zur vollständigen Bibliothek zurückkehren, indem Sie erneut auf :guilabel:`Virtuelle Bibliothek` klicken und den Eintrag mit der Bezeichnung :guilabel:`<Nichts>` auswählen.
es: Puede volver a la biblioteca completa en cualquier momento, haciendo clic en :guilabel:`Biblioteca Virtual` y seleccionando la entrada denominada :guilabel:` <Ninguno>`.
sv: Du kan växla tillbaka till fullt bibliotek när som helt genom att än en gång klicka :guilabel:`Virtuellt bibliotek` och välja valet namngivet :guilabel:`<Ingen>`.

source: Virtual Libraries are based on *searches*. You can use any search as the basis of a virtual library. The virtual library will contain only the books matched by that search. First, type in the search you want to use in the search bar or build a search using the :guilabel:`Tag Browser`. When you are happy with the returned results, click the Virtual Library button, choose Create Library and enter a name for the new virtual library. The virtual library will then be created based on the search you just typed in. Searches are very powerful, for examples of the kinds of things you can do with them, see :ref:`search_interface`.
de: Virtuelle Bibliotheken basieren auf *Suchen*. Jede Suche kann Grundlage für eine virtuelle Bibliothek sein. Eine virtuelle Bibliothek enthält nur die Bücher, die durch diese Suche ausgewählt werden. Geben Sie zunächst die gewünschte Suche in der Suchleiste ein oder erstellen Sie diese mit dem :guilabel:`Schlagwort-Browser`. Wenn die zurückgegebenen Ergebnisse zufriedenstellend sind, klicken Sie auf Virtuelle Bibliothek, wählen Virtuelle Bibliothek erstellen aus und geben der neuen virtuelle Bibliothek einen Namen. Die virtuelle Bibliothek wird dann basierend auf der zuvor eingegebenen Suche erstellt. Suchen sind sehr mächtig. Umfangreiche Beispiele der Anwendung finden Sie unter :ref:`search_interface`.
es: Bibliotecas Virtuales se basan en *búsquedas*. Puede utilizar cualquier búsqueda como la base de una biblioteca virtual. La biblioteca virtual contendrá sólo los libros coincidentes con esa búsqueda. En primer lugar, tipee en el buscador lo que desea utilizar en la barra de búsqueda o construir una búsqueda utilizando :guilabel: `Navegador de etiquetas`. Cuando esté satisfecho con los resultados devueltos, haga clic en el botón Biblioteca Virtual, seleccione Crear Biblioteca y escriba un nombre para la nueva biblioteca virtual. La biblioteca virtual se creará basada en la búsqueda que acaba de escribir. Estas búsquedas son muy poderosas, para más ejemplos de los tipos de cosas que puedes hacer, vea :ref:`search_interface`.
sv: Virtuella bibliotek baseras på *sökningar*. Du kan använda godtycklig sökning som grund av ett virtuellt bibliotek. Det virtuella biblioteket kommer att innehålla bara böcker som passar mot denna sökning. Först, skriv sökningen som du vill använda i sökraden eller bygg en sökning genom att använda :guilabel:`Etikettbläddare`. När du är nöjd med resultatet, klicka på virtuellt biblioteks-knappen, välj skapa bibliotek och mata in namn på det nya virtuella biblioteket. Det virtuella biblioteket kommer då skapas baserat på sökbegreppet du just matat in. Sökningen är mycket kraftfull, till exempel några saker du kan göra med dem se, :ref:`search_interface`.

source: Examples of useful Virtual Libraries
de: Beispiele für nützliche virtuelle Bibliotheken
es: Ejemplos de Bibliotecas Virtuales útiles
sv: Exempel på användbara virtuella bibliotek

source: Books added to calibre in the last day::
de: Bücher am letzten Tag zu calibre hinzugefügt::
es: Libros agregados a calibre en el útlimo día::
sv: Böcker tillagda till calibre senaste dagen::

source: Books added to calibre in the last month::
de: Bücher im letzten Monat zu calibre hinzugefügt::
es: Libros agregados a calibre el último mes::
sv: Böcker tillagda till calibre den senaste månaden::

source: Books with a rating of 5 stars::
de: Bücher mit Bewertung von 5 Sternen::
es: Libros con una calificación de 5 estrellas::
sv: Böcker med betyget 5 stjärnor::

source: rating:5
es: Calificación:5

source: Books with a rating of at least 4 stars::
de: Bücher mit Bewertung von mindestens 4 Sternen::
es: Libros con una calificación de 4 estrellas::
sv: Böcker med betyget minst 4 stjärnor::

source: rating:>=4
es: calificación:>=4

source: Books with no rating::
de: Bücher ohne Bewertung::
es: Libros sin calificación::
sv: Böcker utan betyg::

source: Periodicals downloaded by the Fetch News function in calibre::
de: Heruntergeladene Zeitschriften über den Nachrichtenabruf von calibre::
es: Periódicos descargados por la función Recoger Noticias en calibre::
sv: Nyhetstidningar nerladdade med hämta nyhets funktionen i calibre::

source: tags:=News and author:=calibre
es: tags:=Noticias y autor:=calibre

source: Books with no tags::
de: Bücher ohne Schlagworte::
es: Libros sin etiquetas::
sv: Böcker utan etiketter::

source: Books with no covers::
de: Bücher ohne Cover::
es: Libros sin portadas::
sv: Böcker utan omslag::

source: Working with Virtual Libraries
de: Arbeiten mit virtuellen Bibliotheken
es: Trabajando con Bibliotecas Virtuales
sv: Arbetar med virtuella bibliotek

source: You can edit a previously created virtual library or remove it, by clicking the :guilabel:`Virtual Library` and choosing the appropriate action.
de: Sie können eine zuvor erstellte virtuelle Bibliothek bearbeiten oder entfernen, indem Sie auf :guilabel:`Virtuelle Bibliotheken` klicken und die entsprechende Aktion auswählen.
es: Puede modificar una biblioteca virtual ya creada o eliminarla, haciendo clic en :guilabel:`Biblioteca Virtual` y eligiendo la acción apropiada.
sv: Du kan redigera tidigare skapade virtuella bibliotek eller ta bort det, genom att klicka :guilabel:`Virtuellt bibliotek` och välja lämplig åtgärd.

source: You can tell calibre that you always want to apply a particular virtual library when the current library is opened, by going to :guilabel:`Preferences->Behavior`.
de: Sie können calibre veranlassen, immer nur eine bestimmte virtuelle Bibliothek anzuwenden, wenn die aktuelle Bibliothek geöffnet wird. Dies wird unter unter :guilabel:`Einstellungen ->Benutzeroberfläche ->Verhalten` eingestellt.
es: Puede señalar a calibre que siempre quiere aplicar a cierta biblioteca virtual cuando la actual biblioteca es abierta, yendo a :guilabel:`Preferencias->Comportamiento`.
sv: Du kan tala om för calibre att du alltid vill tillämpa ett visst virtuellt bibliotek när aktuellt bibliotek är öppet, genom att gå till :guilabel:`Inställningar->Beteende`.

source: If you use the calibre Content Server, you can have it share a virtual library instead of the full library by going to :guilabel:`Preferences->Sharing over the net`.
de: Wenn Sie den calibre Content Server verwenden, können Sie statt einer vollständigen Bibliothek eine virtuelle Bibliothek zur Verfügung stellen. Dies wird unter :guilabel:`Einstellungen ->Versand ->Netzwerk-Server` eingestellt.
es: Si utiliza el servidor de contenido calibre, puede compartir una determinada biblioteca virtual en lugar de toda la biblioteca, vaya a :guilabel: `Preferencias->Compartir sobre la red`.
sv: Om du använder calibre-innehållsserver kan du få det att dela ett virtuellt bibliotek i stället för det fulla biblioteket genom gå till :guilabel:`Inställningar->Dela->Dela på nät`.

source: You can quickly use the current search as a temporary virtual library by clicking the :guilabel:`Virtual Library` button and choosing the :guilabel:`*current search` entry.
de: Sie können eine aktuelle Suche schnell für eine temporäre virtuelle Bibliothek nutzen, indem Sie auf die Schaltfläche :guilabel:`Virtuelle Bibliothek` klicken und dort den Eintrag :guilabel:`*aktuelle Suche` auswählen.
es: Puede utilizar rápidamente la búsqueda actual como una biblioteca virtual temporal haciendo clic en el botón :guilabel:`Biblioteca Virtual` y eligiendo la entrada :guilabel:`*actual búsqueda`.
sv: Du kan snabbt använda nuvarande sökning som temporärt virtuellt bibliotek genom att klicka :guilabel:`Virtuellt bibliotek`-knappen och välja :guilabel:`*aktuell sökning`-valet.

source: You can display all available virtual libraries as tabs above the book list. This is particularly handy if you like switching between virtual libraries very often. Click the :guilabel:`Virtual Library` button and select :guilabel:`Show virtual libraries as tabs`. You can re-arrange the tabs by drag and drop and close ones you do not want to see. Closed tabs can be restored by right-clicking on the tab bar.
de: Alle verfügbare virtuelle Bibliotheken können als Registerkarten oberhalb der Buchliste anzeigt werden. Dies ist besonders hilfreich, wenn häufig zwischen virtuellen Bibliotheken gewechselt wird. Klicken Sie auf :guilabel:`Virtuelle Bibliothek` und anschließend auf :guilabel:`Virtuelle Bibliotheken als Tabs anzeigen`. Die Registerkarten können durch ziehen und loslassen mit der Maus neu angeordnet werden. Schließen Sie Registerkarten, die Sie nicht sehen möchten. Geschlossene Tabs können durch einen Rechtsklick auf die Register-Leiste wiederhergestellt werden.
es: Puede visualizar todas las bibliotecas virtuales disponibles como pestañas de arriba de la lista de libros. Esto es particularmente útil si le gusta intercambiar entre las bibliotecas virtuales muy a menudo. Haga clic en el botón :guilabel:`Biblioteca Virtual` y seleccione :guilabel:`Mostrar las bibliotecas virtuales como pestañas`. Puede reorganizar las pestañas simplemente arrastrándo y soltándolas y cerrando aquellas que no desea ver. Las pestañas cerradas se pueden restaurar con un clic derecho sobre la barra de pestañas.
sv: Du kan visa alla tillgängliga virtuella bibliotek som flikar ovanför boklistan. Det är speciellt användbart om du vill växla mellan virtuella bibliotek ofta. Klicka på :guilabel:`Virtuellt bibliotek`-knappen och välj :guilabel:`Visa virtuella bibliotek som flikar`. Du kan ordna om flikarna genom dra-och-släpp och stänga dem du inte vill se. Stängda flikar kan återställas genom högerklicka på flikraden.

source: Using additional restrictions
de: Zusätzliche Einschränkung benutzen
es: Usando restricciones adicionales
sv: Använder ytterligare begränsningar

source: You can further restrict the books shown in a Virtual Library by using :guilabel:`Additional restrictions`. An additional restriction is saved search you previously created that can be applied to the current Virtual Library to further restrict the books shown in a virtual library. For example, say you have a Virtual Library for books tagged as :guilabel:`Historical Fiction` and a saved search that shows you unread books, you can click the :guilabel:`Virtual Library` button and choose the :guilabel:`Additional restriction` option to show only unread Historical Fiction books. To learn about saved searches, see :ref:`saved_searches`.
de: Sie können die Menge angezeigten Bücher einer virtuellen Bibliothek durch :guilabel:`Zusätzliche Einschränkungen` weiter reduzieren. Zusätzliche Einschränkungen sind zuvor erstellte und gespeicherte Suchen, die den Umfang einer virtuellen Bibliothek weiter einschränken können. Angenommen, Sie haben eine virtuelle Bibliothek für Bücher, die als :guilabel:`Historische Romane` gekennzeichnet ist und eine gespeicherte Suche, welche ungelesene Bücher zeigen soll: Klicken Sie hierzu auf :guilabel:`Virtuelle Bibliothek`, wählen dort die Option :guilabel:`Zusätzliche Einschränkungen` aus und stellen dort Ihre gespeicherte Suche für ungelesene Bücher ein. Weiterführende Informationen über gespeicherte Suchen finden Sie unter :ref:`saved_searches`.
es: Puede restringir aún más los libros que se muestran en una biblioteca virtual usando :guilabel:`Restricciones adicionales`. Una restricción adicional es una búsqueda guardada que previamente creó y que puede ser aplicada a la actual Biblioteca Virtual para restringir los libros mostrado enla biblioteca virtual. Por ejemplo, posee una Biblioteca Virtual de libros etiquetados como :guilabel:`Ficción Histórica` y una búsqueda guardada que le muestra los libros no leídos, puede hacer clic en el botón :guilabel:`Biblioteca Virtual` y elegir la opción :guilabel:`Restricción adicional` para mostrar sólo los libros de ficción histórica no leídos. Para obtener información sobre búsquedas guardadas, vea :ref: `saved_searches`.
sv: Vidare kan du begränsa böcker som visas i ett virtuellt bibliotek genom att använda :guilabel:`Ytterligare begränsningar`. En ytterligare begränsning är sparad sökning du tidigare skapade som kan tillämpas till aktuellt virtuellt bibliotek för att vidare begränsa böcker som visas i ett virtuellt bibliotek. Till exempel, låt oss säga att du har ett virtuellt bibliotek som visar dina olästa böcker, du kan klicka på :guilabel:`Virtuellt bibliotek`-knappen och visa :guilabel:`Ytterligare begränsningar`-alternativet för att bara visa olästa historiska bokberätterlse. För att lära sig om sparade sökningar, se :ref:`saved_searches`.
