Repository: Easonqsp/calibre-translations
Catalog: manual/*/xpath.po
Languages: es, pt_br, sv

source: XPath Tutorial
es: Cursillo de XPath
pt_br: Tutorial do XPath
sv: XPath Handledning

source: In this tutorial, you will be given a gentle introduction to `XPath <http://en.wikipedia.org/wiki/XPath>`_, a query language that can be used to select arbitrary parts of `HTML <http://en.wikipedia.org/wiki/HTML>`_ documents in calibre. XPath is a widely used standard, and googling it will yield a ton of information. This tutorial, however, focuses on using XPath for ebook related tasks like finding chapter headings in an unstructured HTML document.
es: En este tutorial, se le dará una pequeña introducción a `XPath <http://en.wikipedia.org/wiki/XPath>`_, un lenguaje de consulta que se puede utilizar para seleccionar partes arbitrarias de documentos `HTML <http://en.wikipedia.org/wiki/HTML>`_ en calibre. XPath es un estándar ampliamente utilizado, y buscando a través de Google se producirá una tonelada de información. Este tutorial, sin embargo, se centra en el uso de XPath para tareas relacionados con libros electrónicos, como la búsqueda de encabezados de capítulos en un documento HTML sin estructura.
pt_br: Neste tutorial, você receberá uma sucinta introdução ao`XPath<http://en.wikipedia.org/wiki/XPath>`_uma linguagem de consulta que pode ser usada para selecionar partes aleatórias de documentos `HTML<http://en.wikipedia.org/wiki/HTML>`_de forma segmentada. O XPath é um padrão muito difundido e uma consulta ao google resultará em um grande volume de informações. Esse tutorial, entretanto, se concentra no uso de tarefas relacionadas ao ebook como encontrar cabeçalhos de capitulos em um documento HTML não estruturado.
sv: I den här handledning kommer du att få en mjuk introduktion till `XPath <http://en.wikipedia.org/wiki/XPath>` _, ett frågespråk som kan användas för att välja godtyckliga delar av `HTML <http://en.wikipedia.org/wiki/HTML> `_ dokument i | app |. XPath är en allmänt använd standard, och googling det kommer att ge en ton av information. Denna handledning, däremot fokuserar på att använda XPath för ebokrelaterade uppgifter som att hitta kapitelrubriker i ett ostrukturerad HTML-dokument.

source: Contents
es: Índice
pt_br: Conteúdo
sv: Innehåll

source: Selecting by tagname
es: Seleccionar por nombre de etiqueta
pt_br: Selecionar por nome de etiqueta
sv: Val baserat på etikettnamn

source: The simplest form of selection is to select tags by name. For example, suppose you want to select all the ``<h2>`` tags in a document. The XPath query for this is simply::
es: La forma más simple de selección es seleccionar las etiquetas por su nombre. Por ejemplo, suponga que desea seleccionar todas las etiquetas ``<h2>`` en un documento. La consulta XPath para esto es simplemente::
pt_br: A forma mais simples de seleção é selecionar tags pelo nome. Por exemplo, suponha que você deseja selecionar todas as '<h2>' tags em um documento. A consulta XPath para isso é simples::</h2>
sv: Den enklaste formen av val är att välja etikett efter namnet. Anta till exempel att du vill markera alla `` <h2> `` etiketter i ett dokument. XPath-fråga till detta är helt enkelt::

source: The prefix `//` means *search at any level of the document*. Now suppose you want to search for ``<span>`` tags that are inside ``<a>`` tags. That can be achieved with::
es: El prefijo ``//` significa *buscar en cualquier nivel del documento*. Ahora suponga que desea buscar las etiquetas ``<span>`` que están dentro de las etiquetas ``<a>``. Eso se puede lograr con::
pt_br: O prefixo ' / /' significa * pesquisa em qualquer nível do documento *. Agora suponha que você deseja pesquisar por '<span>' tags que estão dentro das tags '<a>'. Você pode conseguir isso com:
sv: Prefixet `//` betyder *söka på alla nivåer i dokumentet*. Anta nu att du vill söka efter ``<span>`` etiketter som är inne ``<a>`` etiketter. Detta kan uppnås med::

source: If you want to search for tags at a particular level in the document, change the prefix::
es: Si quiere buscar etiquetas en un nivel particular del documento, cambie el prefijo::
pt_br: Se você quiser buscar por etiquetas em um determinado nível do documento, mude o prefixo::
sv: Om du vill söka efter etiketter på en viss nivå i dokumentet, ändrar prefixet::

source: This will match only ``<p>A very short ebook to demonstrate the use of XPath.</p>`` in the :ref:`sample_ebook` but not any of the other ``<p>`` tags. The ``h:`` prefix in the above examples is needed to match XHTML tags. This is because internally, calibre represents all content as XHTML. In XHTML tags have a *namespace*, and ``h:`` is the namespace prefix for HTML tags.
es: Esto coincidirá con sólo ``<p>Un muy breve libro electrónico para demostrar el uso de XPath.</p>`` en :ref:`sample_ebook` pero no cualquiera de las otras etiquetas ``<p>``. El prefijo ``h:`` en los ejemplos anteriores se necesita para que coincida con las etiquetas XHTML. Esto se debe a que internamente, calibre representa todo el contenido como XHTML. En las etiquetas XHTML tienen un *nombre de espacio*, y ``h:`` es el prefijo de nombres de espacio para las etiquetas HTML.
pt_br: Isto irá corresponder apenas com '<p>Um ebook curto para demonstrar o uso da XPath.</p>' na: ref: 'sample_ebook' mas não em qualquer uma das outras '<p>' tags. O prefixo ' h ' nos exemplos acima é necessário para combinar tags XHTML. Isto é porque internamente, calibre representa todo o conteúdo XHTML. As tags XHTML têm um * namespace * e h ': ' é o prefixo de namespace para marcas HTML.
sv: Detta kommer bara passa ``<p>En mycket kort e-bok för att demonstrera användningen av XPath.</p>`` i :ref:`sample_ebook` men inte någon annan av de andra ``<p>`` etiketterna. ``h:`` prefix i ovan exempel behövs för att passa XHTML etiketter. Detta för att internt, calibre representerar allt innehåll som XHTML. I XHTML etiketter finns en *namnrymd*, och ``h:`` är namnrymdsprefix för HTML etiketter.

source: Now suppose you want to select both ``<h1>`` and ``<h2>`` tags. To do that, we need a XPath construct called *predicate*. A :dfn:`predicate` is simply a test that is used to select tags. Tests can be arbitrarily powerful and as this tutorial progresses, you will see more powerful examples. A predicate is created by enclosing the test expression in square brackets::
es: Ahora suponga que desea seleccionar ambas etiquetas``<h1>`` y ``<h2>``. Para hacer eso, necesitamos un constructo XPath llamado *predicado*. Un :dfn:`predicate` es simplemente una prueba que se utiliza para seleccionar las etiquetas. Las pruebas pueden ser arbitrariamente poderosas y en tanto avanza este tutorial, podrá ver ejemplos más potentes. Un predicado se crea encerrando la expresión de prueba entre corchetes::
sv: Anta nu att du vill välja både ``<h1>`` och ``<h2>`` etiketter. För att göra det behöver vi en XPath konstruktion som kallas *predikat*. En : dfn: 'predikat' är helt enkelt ett test som används för att välja etiketter. Tester kan vara godtyckligt kraftfullt och som denna handledning fortskrider, kommer du att se mer kraftfulla exempel. Ett predikat skapas genom att innesluta test uttryck inom hakparenteser::

source: There are several new features in this XPath expression. The first is the use of the wildcard ``*``. It means *match any tag*. Now look at the test expression ``name()='h1' or name()='h2'``. :term:`name()` is an example of a *built-in function*. It simply evaluates to the name of the tag. So by using it, we can select tags whose names are either `h1` or `h2`. Note that the :term:`name()` function ignores namespaces so that there is no need for the ``h:`` prefix. XPath has several useful built-in functions. A few more will be introduced in this tutorial.
es: Hay varias y nuevas características en esta expresión XPath. La primera es el uso del comodín ``*``. Significa *coincide con cualquier etiqueta*. Ahora observe la expresión de prueba ``nombre()='h1' o nombre()='h2'``. :term:`nombre()` es un ejemplo de una *función incorporada*. Simplemente evalúa el nombre de la etiqueta. Así mediante el uso de ella, podemos seleccionar etiquetas cuyos nombres son o bien `h1` o `h2`. Tenga en cuenta que la función :term:`name()` ignora los espacios de nombres de modo que no hay necesidad del prefijo ``h:``. XPath tiene varias funciones integradass. Unos pocos más serán presentadas en este tutorial.
pt_br: Existem vários novos recursos nesta expressão do XPath. A primeira é o uso do caractere universal ``*``. Significa *corresponder qualquer etiqueta*. Agora veja a expressão de teste``name()='h1' ou name()='h2'``. :term:`name()` é um exemplo de uma *função interna*. Ela simplesmente resulta no nome da etiqueta. Então, usando-a, podemos selecionar etiquetas cujos nomes são `h1` ou `h2`. Observe que a função :term:`name()` ignora espaços de nomes de modo a que não há necessidade para o prefixo ``h:``. O XPath tem várias funções internas úteis. Um pouco mais será apresentado neste tutorial.
sv: Det finns flera nya funktioner i detta XPath-uttryck. Den första är användningen av tecknet ``*``. Det betyder *passar alla etiketter*. Titta nu på prov uttrycket ``namn()="h1" eller namn()= 'h2'``. : term: `namn()` är ett exempel på en *inbyggd funktion*. Den utvärderar endast namnet på etiketten. Så genom att använda det, kan vi välja etiketter vars namn är antingen `h1` eller `h2`. Notera att: termen: 'name()'-funktionen ignoreras namnrymden, så att det inte finns något behov av att ``h`` prefix. XPath har flera användbara inbyggda funktioner. Några fler kommer att införas i den här guiden.

source: Selecting by attributes
es: Seleccionar por atributos
pt_br: Selecionar por atributos
sv: Väljer baserat på attribut

source: To select tags based on their attributes, the use of predicates is required::
es: Para seleccionar etiquetas en base a sus atributos, se requiere el uso de predicados::
pt_br: Para selecionar etiquetas com base em seu conteúdo, é necessário o uso de predicados:
sv: För att välja etiketter baserat på deras attribut, användning av predikat krävs::

source: Here, the ``@`` operator refers to the attributes of the tag. You can use some of the `XPath built-in functions`_ to perform more sophisticated matching on attribute values.
es: Aquí, el operador ``@`` se refiere a los atributos de la etiqueta. Puede utilizar algunas de las `funciones incorporadas XPath`_ para realizar coincidencias más sofisticadas en los valores de los atributos.
pt_br: Aqui, o operador \"@\" se refere aos atributos da tag. Você pode usar alguma das ' funções inerentes ao XPath' para executar correspondências mais sofisticadas para atribuir valores.
sv: Här hänvisar ``@`` operatören attributen för etiketten. Du kan använda en del av de `XPath inbyggda funktioner` _ att utföra mer avancerad ihoppassningar på attributvärden.

source: Selecting by tag content
es: Seleccionar por contenido de etiqueta
pt_br: Selecionar por conteúdo de etiqueta
sv: Väljer baserat på etikettinnehåll

source: Using XPath, you can even select tags based on the text they contain. The best way to do this is to use the power of *regular expressions* via the built-in function :term:`re:test()`::
es: Utilizando XPath, puede incluso seleccionar etiquetas basadas en el texto que contienen. La mejor manera para llevarlo a cabo es usar el poder de las *expresiones regulares* via la función interna :term:`re:test()`::
pt_br: Usando XPath, você também pode selecionar tags baseado nos textos que eles contêm. A melhor maneira para fazer isso é usar o poder das *expressões regulares* através da função interente :term:'re:test()'::
sv: Med hjälp av XPath kan du även välja etiketter som baseras på text de innehåller. Det bästa sättet att göra detta är att använda kraften i *reguljära uttryck* via den inbyggda funktionen: term:`re: test()`::

source: Here the ``.`` operator refers to the contents of the tag, just as the ``@`` operator referred to its attributes.
es: Aquí el operador ``.`` refiere a los contenidos de la etiqueta, tanto como el operador ``@`` se refiere a sus atributos.
pt_br: Aqui o operador \".\" se refere a conteúdos da tag, assim como o operador \"@\" se refere aos atributos.
sv: Här hänvisar ``.`` operatör till innehållet i etiketten, precis som ``@`` operatör avser dess attribut.

source: Sample ebook
es: Libro electrónico de muestra
pt_br: Exemplo de e-book
sv: e-boksprov

source: XPath built-in functions
es: Funciones XPath predefinidas
pt_br: Funções internas do XPath
sv: Inbyggda XPath-funktioner

source: The name of the current tag.
es: El nombre de la etiqueta actual.
pt_br: O nome da etiqueta atual.
sv: Namnet av nuvarande etikett.

source: ``contains(s1, s2)`` returns `true` if s1 contains s2.
es: ``contains(s1, s2)`` devuelve `true` si s1 contiene s2.
pt_br: ``contains(s1, s2)`` retorna `true` se s1 contém s2.
sv: ``contains(s1, s2)`` returnerar `sant` om s1 innehåller s2.

source: ``re:test(src, pattern, flags)`` returns `true` if the string `src` matches the regular expression `pattern`. A particularly useful flag is ``i``, it makes matching case insensitive. A good primer on the syntax for regular expressions can be found at `regexp syntax <http://docs.python.org/lib/re-syntax.html>`_
es: ``re:test(src, pattern, flags)`` devuelve `true` si la cadena `src` coincide con la expresión regular `pattern`. Una marca particularmente útil es ``i``, que hace que las coincidencias sean insensibles a las minúsculas y mayúsculas.. Una buena introducción en la sintaxis de las expresiones regular puede ser encontrada en `sintaxis de expresiones regulares <http://docs.python.org/lib/re-syntax.html>`_
sv: ``re:test(src, mönster, flaggor)`` returnerar `sant` om strängen `src` passar med det reguljära uttrycket `mönster`. En särskilt användbar flaggan är ``i``, det gör ihoppassningen teckenokänslig. En bra grund på syntaxen för reguljära uttryck finns på `regexp syntax <http://docs.python.org/lib/re-syntax.html>` _
