Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Kobo driver: Fix for detection of some devices, with SD card not working on macOS
es: Controlador de Kobo: correcciones en la detección de algunos dispositivos con tarjeta SD que no funcionaban en macOS
fr: Pilote Kobo : Solution pour la détection de certains périphériques, avec carte SD, qui ne fonctionnent pas sous macOS
pt_br: Driver do Kobo: Correção para a detecção de alguns dispositivos, com cartões de memória não funcionando no macOS
uk: Драйвер Kobo: виправлено виявлення деяких пристроїв, картка SD знову працює у macOS

source: Tag browser: Fix preservation of state when recounting and the visible categories have changed.
es: Pestaña del navegador: corregida la preservación del estado cuando al recontar las categorías visibles han cambiado.
fr: Navigateur d'étiquettes : Solutionne la préservation de l'état lors du recomptage et que des catégories visibles sont changées
pt_br: Navegador de etiquetas: Corrige preservação de estado ao recontar e as categorias visíveis são alteradas.
uk: Навігатор мітками: виправлено збереження стану після переобчислення та зміни видимих категорій.

source: CHM Input: Handle CHM files that have missing or empty root files.
es: Entrada CHM: gestionar archivos CHM a los que les faltan archivos raíces o están vacíos.
fr: Document CHM en entrée pour la conversion vers un autre format : Supporter les fichiers CHM qui ont des fichiers racine disparus ou vides
pt_br: Entrada CHM: Lida com arquivos CHM que possuem arquivos raiz ausentes ou vazios.
uk: Вхідні дані CHM: реалізовано обробку файлів CHM із пропущеними або порожніми кореневими файлами.

source: Fix Page flips options box in viewer preferences bot being laid out properly
es: Se corrige la distribución del cuadro de opciones de paso de página en las preferencias del visor
fr: Solutionne le fait que les options de la boîte de dialogue Rotation de page dans les préférences de la visionneuse ne sont pas présentées correctement
pt_br: Corrige caixa de opções de Virada de página nas preferências do visualizador não sendo dispostas corretamente.
uk: Виправлено компонування рамки параметрів гортання сторінок у налаштуваннях засобу перегляду

source: Fix initial down arrow in search box jumping two places
es: Se corrige el fallo por el que la primera pulsación de flecha abajo en el cuadro de búsqueda avanzaba dos posiciones
fr: Solutionne le fait que la flèche descendante de la boîte de recherche saute de deux places
pt_br: Corrige a seta para baixo na caixa de pesquisa saltando para dois lugares
uk: Виправлено початковий перехід після натискання стрілки вниз на панелі пошуку на дві позиції

source: Fix editing the authors via the book list not respecting the tweak to control author name splitting
es: Se corrige el fallo por el que al modificar autores en la lista de libros no se respetaba el ajuste para controlar la división del nombre de autor
fr: Solutionne le fait que l'édition des auteurs via la liste de livres ne respecte pas l'ajustement pour le contrôle de la scission des noms d'auteur
pt_br: Corrige edição de autores via lista de livros não respeitando o ajuste para controlar a separação do nome de autores.
uk: Виправлено помилку, пов’язану із тим, що редагування записів авторів за допомогою списку книг не враховувало коригування для поділу імені автора

source: E-book viewer: Fix external links not working in the footnote popup panel
es: Visor de libro electrónico: Corrección de enlaces externos que no funcionan en el panel emergente de la nota al pie
fr: Visionneuse de livres numériques ; Solutionne le fait que les liens externes ne fonctionnent pas dans le panneau contextuel de note de bas de page
pt_br: Visualizador de e-book: Corrige links externos não funcionando no painel pop-up da nota de rodapé
uk: Засіб перегляду електронних книг: виправлено непрацездатність зовнішніх посилань на контекстних панелях нотаток

source: Fix a regression that broke command line completion in bash
es: Corregida una regresión que estropeó el completado en línea de órdenes de bash
fr: Solutionne une régression qui endommage la complétion en ligne de commande
pt_br: Corrige uma regressão que danificou a conclusão da linha de comando em bash
uk: Виправлено регресію, яка заважала автоматичному доповненню команд у bash

source: Book details panel: Allow right click to search the internet for the current book
fr: Panneau Détails du livre : Permettre le clic droit pour rechercher le livre en cours sur internet

source: Book details panel: Allow right clicking on an author name to search the internet for works by that author
fr: Panneau Détails du livre : Permettre le clic droit sur le nom d'un auteur pour rechercher les travaux de cet auteur sur internet

source: Book details panel: Clicking an author name now searches Goodreads by default instead of Wikipedia. Can be changed in Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Book details
fr: Panneau Détails du livre : Cliquer sur un nom d'auteur fait maintenant la recherche par défaut sur Goodreads plutôt que sur Wikipedia. Peut être changé dans Préférences-&gt;Interface-&gt;Apparence et présentation-&gt;Détails du livre

source: Kobo driver: Add support for the Kobo Aura H2O Edition 2
fr: Pilote Kobo : Ajout de la prise en charge de la Kobo Aura H2O Edition 2

source: PDF output: Fix a regression in the previous release that broke conversion to PDF for some files
fr: Format PDF en sortie pour la conversion depuis un autre format : Solutionne une régression dans la version précédente qui endommage la conversion en PDF pour certains fichiers

source: DOCX output: Fix lengths specified in percentage of page size not being converted correctly
fr: Format DOCX en sortie pour la conversion depuis un autre format : Solutionne le fait que les longueurs spécifiées en pourcentage de la taille de la page ne sont pas converties correctement

source: DOCX output: Fix some hyperlinks not working in word because the bookmark name is longer than forty characters
fr: Format DOCX en sortie pour la conversion depuis un autre format : Solutionne le fait que certains hyperliens ne fonctionnent pas dans Word parce que le nom du signet est plus long que quarante caractères

source: DOCX output: Prevent images from being larger than the page size
fr: Format DOCX en sortie pour la conversion depuis un autre format : Empêche que les images ne soient plus larges que la taille de la page

source: Comic input: Fix the number of colors control not allowing values less than 8
fr: Format Comic en sortie pour la conversion depuis un autre format : Solutionne le fait que le contrôle du nombre de couleurs ne permet des valeurs plus petites que 8

source: Kobo driver: Fix main memory and Card A being swapped on some systems
fr: Pilote Kobo : Solutionne le fait que a mémoire principale et la Carte A soient permutées sur certains systèmes

source: Kobo driver: Fix the ignore collections option being accidentally case-insensitive
fr: Pilote Kobo : Solutionne le fait que l'option ignorer les collections soit accidentellement sensible à la casse

source: Preferences-&gt;Toolbars: Show an error message when the user tries to remove either the Preferences or Location Manager buttons instead of just silently adding them back
fr: Préférences-&gt;Barres d'outils : Affiche un message d'erreur quand l'utilisateur essaie de supprimer les boutons Préférences ou Gestionnaire de site plutôt que de juste les ajouter silencieusement derrière

source: version 2.85.1 contains a fix for a regression that cause the Open with action to go missing from the right click menu of the Book details panel
fr: La version 2.85.1 contient une solution pour une régression qui entraînait la disparition de l'action Ouvrir avec du menu contextuel du panneau Détails du livre

source: Kindle driver: Also delete book thumbnails from the system directory when deleting books
fr: Pilote Kindle : Supprime également les vignettes de livre du répertoire système lors de la suppression de livres

source: Conversion: Use the same regular expression engine as is used by the Edit book tool. The new engine has much better support for Unicode characters/character classes
fr: Conversion: Utilisation du même moteur d'expression régulière que l'outil Éditer le livre. Le nouveau moteur a une bien meilleure prise en charge des classes de caractères Unicode

source: Edit book: Add keyboard shortcuts to jump to opening and closing tags (Ctrl+{ and Ctrl+})
fr: Éditer le livre : Ajout de raccourcis clavier pour se déplacer vers l'ouverture et la fermeture des balises (Ctrl+{ and Ctrl+})

source: Add API to pre-process image data in recipes easily
fr: Ajout d'une API pour pré-traiter facilement les données image dans les recettes

source: fetch-ebook-metadata.exe: add option to use only a single metadata plugin
fr: fetch-ebook-metadata (script pour récupérer les métadonnées d'un livre) : ajout d'une option pour utiliser seulement une extension de métadonnées

source: E-book viewer: Fix a regression in the previous release that broke printing from inside the viewer
fr: Visionneuse de livre numérique : Solutionne une régression dans la version précédente qui endommage l'impression depuis la visionneuse

source: DOCX output: When the input document contains paragraphs inside a block with a background color preserve the background color in the resulting paragraphs in the DOCX document
fr: Format DOCX en sortie pour la conversion depuis un autre format : Lorsque le document d'entrée contient des paragraphes dans un bloc avec une couleur d'arrière plan, préserve la couleur d'arrière plan dans les paragraphes résultants dans le document DOCX

source: DOCX output: Fix links to empty inline tags not working
fr: Format DOCX en sortie pour la conversion depuis un autre format : Solutionne le fait que les liens vers des balises vides intégrées ne fonctionnent pas

source: DOCX input: Fix links that point to anchors placed in empty paragraphs not working
fr: Format DOCX en entrée pour la conversion vers un autre format : Solutionne le fait que les liens qui pointent vers des ancrages placés dans des paragraphes vides ne fonctionnent pas

source: PDF output: Do not crash when unable to find page for link destination, instead use previous page
fr: Format PDF en sortie pour la conversion depuis un autre format : Ne se plante pas lorsqu'il est incapable de trouver la page de destination d'un lien, à la place utilise la page précédente

source: Edit book: Fix sorting by language in Report-&gt;Words not working
fr: Éditer le livre : Solutionne le fait que le tri par langue ne fonctionne pas dans Rapports-&gt;Mots

source: Edit book: Fix drag and drop of multiple items in the File Browser causing item order to be reversed
fr: Éditer le livre : Solutionne le fait que le glisser/déposer de multiples éléments dans le Navigateur de Fichiers entraîne que l'ordre des éléments soit inversé

source: Get books: Update Baen store plugin for website changes
fr: Obtenir des livres : Mise à jour de l'extension de la boutique Baen suite à des changements sur le site web

source: Linux: When adding books from directories ignore files that have undecodable names
fr: Linux : Lors de l'ajout de livres à partir de répertoires, les fichiers qui ont des noms indécodables sont ignorés

source: AZW3: Preserve the primary-writing-mode EXTH header field when round-tripping AZW3 files. Should fix editing/conversion of RTL AZW3 files causing page turning to become left-to-right on the Kindle
fr: AZW3 : Préserver le champ d'en-tête primary-writing-mode EXTH lors du carrousel des fichiers AZW3. Devrait solutionner l'édition/conversion de fichiers RTL AZW3 causant le fait que le changement de page devienne de gauche à droite sur la Kindle

source: AZW3 output: Set the primary-writing-mode EXTH header when the input document has page-progression-direction set to RTL as this is apparently required on newer Kindle firmware for right-to-left page turning
fr: Format AZW3 en sortie pour la conversion : Paramétrer l'en-tête primary-writing-mode EXTH lorsque le document d'entrée a page-direction-progression paramétré à RTL tel que c'est apparemment requis dans le firmware Kindle récent pour tourner la page de droite à gauche

source: Fix a misbehaving wireless device connection can cause calibre to hang when opening the Connect/share menu
fr: Solutionne un mauvais comportement de connexion d'un périphérique sans fil causant le blocage de calibre lors de l'ouverture du menu Connecter/partager

source: PDF output: Default to generating PDFs with a page size of letter instead of taking the page size from the output profile
fr: Format PDF en sortie pour la conversion : Par défaut pour générer des PDFs avec une taille de page letter plutôt que de prendre la taille de page du profil de sortie

source: This avoids user confusion/bug reports about PDF output having "too large fonts". There is a new option "Use profile size" to have the conversion use the output profile page size instead
fr: Ceci évite la confusion de l'utilisateur/les rapports de bogue à propos du format PDF de sortie ayant de "trop grandes polices". Il y a une nouvelle option "Utiliser la taille du profil" pour que la conversion utilise la taille du profil de sortie à la place

source: PDF/DOCX output: Add separate, PDF/DOCX specific, page margin settings that override the common settings
fr: Formats PDF/DOCX en sortie pour la conversion depuis un autre format : Ajout de paramètres séparés de marge de page, spécifiques à PDF/DOCX, qui outrepassent les paramètres communs

source: Useful because page margin settings for page oriented formats, such as PDF and DOCX are usually different than those for reflowable formats such as EPUB
fr: Utile parce que les paramètres de marge de page pour les formats orientés page comme PDF et DOCX sont généralement différents de ceux pour les formats 'reformatables' tel que EPUB

source: Table of Contents tool: Add an undo button
fr: Outil Table des Matières : Ajout d'un bouton restaurer

source: Metadata jacket: Show custom rating columns using stars
fr: Jaquette de métadonnées : Affiche les colonnes personnalisées de notation utilisant des étoiles

source: Metadata jacket: Change formatting of series to match that used by the book details panel. Also allow access to the raw series name and number when customizing the jacket template
fr: Jaquette de métadonnées : Changement du formatage des séries pour correspondre à celui utilisé par le panneau détails du livre. Permettre également l'accès au nom et au numéro des séries en brut lors de la personnalisation du modèle de jaquette

source: calibredb check_library: Vacuum database when running the check
fr: calibredb check_library : Vider la base de données lors de l'exécution de la vérification

source: Check Book: Add a check for empty identifier elements
fr: Vérifier le livre : Ajout d'une vérification pour les éléments identifiants vides

source: Edit book/Book polishing: When adding a cover to an EPUB 3.0 file set the SVG property if a SVG cover wrapper is used
fr: Éditer le livre/Polir le livre : Lors de l'ajout d'une couverture à un fichier EPUB3 paramétrer la propriété SVG si une couverture SVG est utilisée

source: Refresh the book list when a User category is added/edited
fr: Rafraîchissement de la liste de livres lorsque une Catégorie utilisateur est ajoutée/éditée

source: EPUB metadata: Fix deleting ISBN from EPUB file could result in an EPUB file without a package identifier if the ISBN was used as the package identifier
fr: Métadonnées EPUB : Solutionne le fait que la supression du ISBN du fichier EPUB pourrait résulter en un EPUB sans package identifiant si le ISBN était utilisé comme package identifiant

source: Amazon metadata download: Fix title and author names being bold in the downloaded comments when using bing to get Amazon metadata
fr: Téléchargement des métadonnées Amazon : Solutionne le fait que le titre et les noms d'auteurs soient en gras dans les commentaires téléchargés lors de l'utilisation de bing pour obtenir les métadonnées Amazon

source: PDF output: Fix a regression that broke PDF output for documents containing mathematics
fr: Format PDF en sortie pour la conversion : Solutionne une régression qui endommage la sortie PDF pour les documents qui contiennent des mathématiques

source: E-book viewer: Fix a regression that broke the "Clear recently read books" action in the viewer
fr: Visionneuse de livre numérique : Solutionne une régression qui endommage l'action "Effacer la liste des livres ouverts récemment" dans la visionneuse

source: Edit book: Saved searches: Add keyboard shortcut (Alt+Up/Down Arrow) to move selected searches
fr: Éditer le livre : Recherches sauvegardées : Ajout d'un raccourci clavier (Alt + Flèche Haut/Bas) pour déplacer les recherches sélectionnées

source: Fix a typo in the previous release that caused dynamically updated metadata source plugins to stop working
fr: Solutionne une coquille dans la version précédente qui entraîne l'arrêt de la mise à jour dynamique des sources d'extensions

source: Catalog generation: Ignore tags with commas in them when generating genres
fr: Génération de catalogue : Ignorer les étiquettes contenant des virgules lors de la génération des genres

source: News download: Do not use Microsoft user agents as more and more websites are serving JPEG XR images to these browsers
fr: Téléchargement d'actualités : N'utilise pas les agents utilisateur Microsoft vu que de plus en plus de sites web offrent des images JPEG XR à ces navigateurs

source: Amazon metadata download: Fix spurious results when searching for books that are not present on Amazon using a search engine
fr: Téléchargement de métadonnées Amazon : Solutionne les résultats fallacieux lors de la recherche de livres qui ne sont pas présents sur Amazon en utilisant un moteur de recherche

source: Get books: Fix free samples being detected as independent books when searching OPDS based stores such as Feedbooks
fr: Obtenir des livres : Solutionne le fait que des exemples gratuits soient détectés comme des livres indépendants lors de la recherche sur des boutiques orientées OPDS tel que Feedbooks

source: Edit book: Saved searches: Preserve selection when using arrows to move multiple items
fr: Éditer le livre : Recherches sauvegardées : Préserver la sélection lors de l'utilisation des flèches pour déplacer de multiples éléments

source: Fix template formatter functions not being reloaded after a check library operation
fr: Solutionne le fait que les fonctions de formatage de modèle ne soient pas rechargées après une opération de vérification de la bibliothèque

source: Fix an error during shutdown caused by some library closed plugins
fr: Solutionne une erreur lors de la fermeture causée par certaines extensions de bibliothèques fermées

source: Amazon metadata download: Allow downloading Amazon metadata from multiple sources. You can now configure the Amazon plugin via Preferences-&gt;Metadata download to use either the Amazon servers, or various search engine caches to get the metadata. Should help with the recent CAPTCHA problems when downloading metadata from Amazon
fr: Téléchargement des métadonnées Amazon : Permettre le téléchargement des métadonnées Amazon à partir de multiples sources. Vous pouvez maintenant configurer l'extension Amazon via Préférences-&gt;Téléchargement de métadonnées pour utiliser soit les serveurs Amazon, ou divers caches de moteurs de recherche pour obtenir les métadonnées. Ceci devrait aider avec les problèmes récents de CAPTCHA lors du téléchargement de métadonnées depuis Amazon

source: Edit book: Spell check dialog: Always add the original word as one of the spelling corrections, so that small edits to the word can be made easily
fr: Éditer le livre : boîte de dialogue Vérifier l’orthographe : Toujours ajouter le mot original comme l'une des corrections orthographiques, de cette façon de petites modifications du mot peuvent être faites facilement

source: Edit book: Saved searched Dialog: Allow re-arranging the Saved searches using drag and drop
fr: Éditer le livre : Boîte de dialogue Recherche sauvegardée : Permettre la réorganisation des Recherches sauvegardées en utilisant le glisser et déposer

source: Implement auto update of built-in metadata download plugins, just as for recipes and Get books plugins. Needed as the websites they get data from often change
fr: Implémentation d'une mise à jour automatique des extensions de téléchargement de métadonnées, tout comme pour les extensions recettes et Obtenir les livres. Nécessaire vu que les sites d'où proviennent les données changent fréquemment

source: Edit book: When inserting full screen images, use the actual image dimensions in the generated SVG code, when available
fr: Éditer le livre : Lors de l'insertion d'images plein écran, utiliser les dimensions véritables de l'image dans le code SVG généré, quand elles sont disponibles

source: Linux installer: Check that the umask is suitable before running the installer. Should fix breakage on systems where users have changed the user umask but neglected to also alter it for sudo
fr: Installateur Linux : Vérifier que umask est compatible avant d'exécuter l'installateur. Devrait solutionner la rupture sur des systèmes où les utilisateurs ont changé le umask utilisateur mais ont négligé de le faire également après pour sudo

source: Bulk metadata edit: Remove the control to delete specific formats as it is redundant. This functionality is already present by right clicking the Remove books button
fr: Édition de métadonnées par lot : Suppression du contrôle pour supprimer des formats spécifiques vu qu'il est redondant. Cette fonctionnalité est déjà présente en faisant un clic droit sur le bouton Supprimer des livres

source: TXT input: When detecting the encoding of txt files only use the first four kilobytes of text. Fixes excessively slow conversion of very large text files
fr: Format TXT en entrée pour la conversion : Lors de la détection de l'encodage des fichiers txt, utilise seulement les quatre premiers kilo bytes de texte. Solutionne la conversion excessivement lente de très gros fichiers txt

source: Get books: Fix price not being displayed for books from Amazon dues to website changes
fr: Obtenir des livres : Solutionne le fait que le prix des livres provenant d'Amazon ne soient pas affichés en raison de changements au site web

source: Get books: Update Google Books plugin for website changes
fr: Obtenir des livres : Mise à jour de l'extension Google Books suite à des changements sur le site web

source: E-book viewer: Fix slow startup when recently opened files are on a slow/malfunctioning networked filesystem
fr: Visionneuse de livre numérique : Solutionne le démarrage lent lorsque les fichiers ouverts récemment sont stockés sur un système de fichier réseau lent/défaillant

source: Google metadata download: Fix metadata not being found when the title of the book includes a sub-title
fr: Téléchargement de métadonnées Google : Solutionne le fait que les métadonnées ne soient pas trouvées lorsque le titre d'un livre inclut un sous titre

source: Improve downloading of covers from the Google Books metadata source
fr: Améliore le téléchargement de couvertures depuis la source de métadonnées Google Books

source: News download: Fix a bug that could cause a crash when downloading an SVG image
fr: Téléchargement d'actualités : Solutionne un bogue qui causait un plantage lors du téléchargement d'une image SVG
