Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Tijmen Ruizendaal for the Be Book driver
es: Tijmen Ruizendaal por el controlador Be Book
fr: Tijmen Ruizendaal pour le pilote Be Book
pt_br: Tijmen Ruizendaal pelo driver do Be Book
uk: Tijmen Ruizendaal: драйвер Be Book

source: Igor Skochinsky (for various bits of reverse engineering without which calibre would never have gotten off the ground)
es: Igor Skochinsky (por varios elementos de ingeniería inversa sin los cuales calibre nunca habría tomado vuelo)
fr: Igor Skochinsky (pour divers morceaux d'ingénierie inversée sans lesquels calibre n'aurait jamais vu le jour)
pt_br: Igor Skochinsky (pelas várias partes de engenharia reversa, sem o qual o calibre nunca teria saído do chão)
uk: Igor Skochinsky (за різноманітні роботи із зворотної інженерії, без яких calibre ніколи б не працював як слід)

source: Darko Miletic: For a large number of news recipes
es: Darko Miletic: Por un gran número de fórmulas de noticias
fr: Darko Miletic : Pour un grand nombre de recettes d'actualités
pt_br: Darko Miletic: Pelo um grande número de receitas de notícias
uk: Darko Miletic: багато нових рецептів

source: Grant Drake: For various plugins including Open with, search the internet and goodreads integration
es: Grant Drake: Por varios complementos, incluidos Abrir con, búsqueda en internet y la integración con goodreads
fr: Grant Drake : Pour diverses extensions dont Ouvrir avec, rechercher sur internet et l'intégration à goodreads
pt_br: Grant Drake: Pelos vários plugins, incluindo "Open with", "Pesquisar na internet" e integração com Goodreads

source: Timothy Legge and David Forrester: For Kobo support in calibre
es: Timothy Legge y David Forrester: Por el soporte de Kobo en calibre
fr: Timothy Legge et David Forrester: Pour la prise en charge de Kobo dans calibre
pt_br: Timothy Legge e David Forrester: Pelo suporte ao Kobo no calibre
uk: Timothy Legge та David Forrester: підтримка Kobo у calibre

source: Graphics and design
es: Gráficos y diseño
fr: Le graphisme et le design
pt_br: Gráficos e design
uk: Графіка і дизайн

source: Nicholas Holland and the guys at <a target="new" href="%(cr)s">Centresource</a> for the website design
es: Nicholas Holland y los chicos de <a target="new" href="%(cr)s">Centresource</a> por el diseño de la página web
fr: Nicholas Holland et les gars de <a target="new" href="%(cr)s">Centresource</a> pour le design du site web
pt_br: Nicholas Holland e os caras do <a target="new" href="%(cr)s">Centresource</a> pelo design do website
uk: Nicholas Holland та хлопці з <a target="new" href="%(cr)s">Centresource</a> — дизайн сайта

source: diaboNL for the reader icon
es: diaboNL por el icono del lector
fr: diaboNL pour l'icône de liseuse
pt_br: diaboNL pelo ícone do leitor
uk: diaboNL — піктограма засобу для читання

source: Caleb Avery and Kamil Tatara for the calibre logo
es: Caleb Avery y Kamil Tatara por el logo de calibre
fr: Caleb Avery et Kamil Tatara pour le logo calibre
pt_br: Caleb Avery e Kamil Tatara pelo logo do calibre
uk: Caleb Avery і Kamil Tatara — логотип calibre

source: Jonatan Nyberg for lots of polishing of the UI
es: Jonatan Nyberg por numerosos retoques en la interfaz de usuario
fr: Jonatan Nyberg pour de nombreux embellissements de l'interface utilisateur
pt_br: Jonatan Nyberg pelos vários aperfeiçoamentos da Interface do Usuário
uk: Jonatan Nyberg за значні зусилля із поліпшення інтерфейсу програми

source: subtlepatterns.com for various textures
es: subtlepatterns.com por varias texturas
fr: subtlepatterns.com pour différentes textures
pt_br: subtlepatterns.com pelas várias texturas
uk: subtlepatterns.com — різноманітні текстури

source: Recipe writers
es: Elaboradores de fórmulas
fr: Les rédacteurs de recettes
pt_br: Criadores de Receitas
uk: Автори рецептів

source: Too many people have contributed recipes to list here, but their contributions are a big part of calibre.
es: Demasiadas personas han proporcionado fórmulas como para listarlas aquí, pero sus contribuciones son una gran parte de calibre.
fr: Trop de gens ont contribué aux recettes pour les lister ici, mais leurs contributions sont une grande part de calibre
pt_br: Pessoas demais contribuíram com receitas para listar aqui, mas suas contribuições são uma grande parte do calibre.
uk: У цьому списку замало місця, щоб навести перелік усіх, хто надсилав рецепти. Втім, результати роботи цих людей є суттєвою частиною calibre.

source: Translators
es: Traductores
fr: Les traducteurs
pt_br: Tradutores
uk: Перекладачі

source: The list of translators is available <a target="new" href="%(tr)s">here</a>
es: La lista de traductores está disponible <a target="new" href="%(tr)s">aquí</a>
fr: La liste des traducteurs est disponible <a target="new" href="%(tr)s">ici</a>
pt_br: A lista de tradutores está disponível <a target="new" href="%(tr)s">aqui</a>
uk: Зі списком перекладачів можна ознайомитися <a target="new" href="%(tr)s">тут</a>

source: Other projects whose code/libraries calibre uses/links against
es: Otros proyectos cuyo código o librerías es usado o enlazado por calibre
fr: Autres projets desquels calibre utilise les liens pour le code/les librairies
pt_br: Outros projetos cujo código/bibliotecas são utilizados pelo calibre
uk: Інші проекти, код або бібліотеки яких використовуються у calibre

source: The Launchpad, Transifex, fosshub.com and github.com services for providing bug, file, translation and code hosting for calibre.
es: Los servicios de Launchpad, Transifex, fosshub.com y github.com proporcionan alojamiento de seguimiento de fallos, archivos, traducciones y código para calibre.
fr: Les services de Launchpad, Transifex, fosshub.com et github.com pour fournir bug, fichier, traduction et hébergement du code de calibre.
pt_br: Os serviços The Lauchpad, Transifex, fosshub.com e github.com por prover hospedagem de erros, arquivos, traduções e código do calibre.
uk: Службам Launchpad, Transifex, fosshub.com і github.com з надання майданчиків для звітування щодо вад, розміщення коду, перекладів та пакунків calibre.

source: Last, but not least I'd like to thank the folks at <a target="new" href="%(mr)s">mobileread.com</a> for creating a wonderful community for us e-book lovers to gather round.
es: Por último, pero no menos importante, me gustaría dar las gracias a la gente de <a target="new" href="%(mr)s">mobileread.com</a> por crear una comunidad fabulosa donde podemos reunirnos los amantes de los libros.
fr: Enfin et surtout j'aimerais remercier les gars de <a target="new" href="%(mr)s">mobileread.com</a> pour la création d'une merveilleuse communauté pour nous les amoureux des livres se rassembler.
pt_br: Por último, mas não menos importante, gostaria de agradecer ao pessoal do <a target="new" href="%(mr)s">mobileread.com</a> por criar uma comunidade maravilhosa para nós, amantes de livros, nos reunirmos.
uk: І нарешті, але не менше, ми маємо бути вдячні хлопцям з <a target="new" href="%(mr)s">mobileread.com</a> за створення чудової спільноти шанувальників електронних книг.

source: Awards
es: Premios
fr: Récompenses
pt_br: Prêmios
uk: Нагороди

source: 4.5 stars
es: 4,5 estrellas
fr: 4.5 étoiles
pt_br: 4.5 estrelas
uk: 4,5 зірки

source: (Apr, 2017)
fr: (Avr, 2017)
pt_br: (Abril de 2017)
uk: (кві 2017 року)

source: 5 stars
es: 5 estrellas
fr: 5 étoiles
pt_br: 5 estrelas
uk: 5 зірок

source: 100%% Safe (Jan, 2017)
fr: 100 %% Sûr (Jan, 2017)
pt_br: 100%% Seguro (Janeiro de 2017)
uk: 100%% безпечно (січ 2017 року)

source: Press mentions
es: Menciones en prensa
fr: Mentions presse
pt_br: Menções na imprensa
uk: Згадки у пресі

source: You can see usage statistics for calibre <a target="usage" href="%(href)s">here</a>.
es: Puede ver estadísticas de uso de calibre <a target="usage" href="%(href)s">aquí</a>.
fr: Vous pouvez consulter <a target="usage" href="%(href)s">ici</a> les statistiques d'utilisation de calibre.
pt_br: Você pode ver as estatísticas de utilização do calibre <a target="usage" href="%(href)s">aqui</a>.
uk: Зі статистичними даними щодо користування calibre можна ознайомитися <a target="usage" href="%(href)s">тут</a>.

source: You can see usage statistics for the various news sources in calibre <a target="usage" href="%(href)s">here</a>.
es: Puede ver estadísticas de uso de las distintas fuentes de noticias de calibre <a target="usage" href="%(href)s">aquí</a>.
fr: Vous pouvez consulter <a target="usage" href="%(href)s">ici</a> les statistiques d'utilisation des différentes sources d'actualités dans calibre.
pt_br: Você pode ver as estatísticas de utilização para as várias fontes de notícias do calibre <a target="usage" href="%(href)s">aqui</a>.
uk: Зі статистичними даними щодо використання різноманітних джерел новин у calibre можна ознайомитися <a target="usage" href="%(href)s">тут</a>.

source: Donate to calibre
es: Donar a calibre
fr: Faire un don à calibre
pt_br: Doar ao calibre
uk: Фінансова підтримка calibre

source: Thank you for supporting calibre development. Please send your bitcoins to the following bitcoin address:
fr: Merci de supporter le développement de calibre. Merci d'envoyer vos bitcoins à l'adresse bitcoins suivante :

source: Thank you. The above address belongs to Kovid Goyal, the creator of calibre.
fr: Merci. L'adresse ci-dessus appartient à Kovid Goyal, le créateur de calibre.

source: New to calibre?
es: ¿Eres nuevo usando calibre?
fr: Nouveau dans calibre ?
pt_br: Novato com o calibre?
uk: Не маєте досвіду роботи у calibre?

source: calibre is intuitive, but also very powerful. To quickly start using it, get the most out of it or get assistance and tips, you can check out:
es: calibre es intuitivo, pero también muy potente. Para empezar a usarlo rápidamente, sacarle el mayor partido u obtener ayuda y consejos, puede visitar:
fr: calibre est intuitif, mais également très puissant. Pour rapidement commencer à l'utiliser, en tirer le maximum ou obtenir de l'assistance et des conseils, vous pouvez consultez :
pt_br: O calibre é intuitivo, mas também muito poderoso. Para começar a usá-lo rapidamente, extrair o máximo dele ou conseguir ajuda e dicas, você pode verificar:
uk: calibre — інтуїтивно зрозуміла або потужна програма. Щоб якомога швидше засвоїти усі навички з роботи у ній, оволодіти усіма інструментами або отримати допомогу і підказки, ви можете скористатися такими ресурсами:

source: The <a href="%(href)s">Grand Tour</a> introductory <b>video</b> that will show you how to <b>set up calibre</b> and what its <b>main features</b> are.
es: El <b>vídeo</b> del <a href="%(href)s">Recorrido por calibre</a> introductorio, que le mostrará como <b>configurar calibre</b> y cuáles son sus <b>principales características</b>.
fr: La <b>video</b> d'introduction <a href="%(href)s">Grand Tour</a> qui vous montrera comment <b>paramétrer calibre</b> et quelles sont ses <b>fonctionnalités principales</b>.
pt_br: O <a href="%(href)s">Grand Tour</a>, <b>vídeo</b> introdutório que irá mostrar como <b>configurar o calibre</b> e quais são seus <b>principais recursos</b>.
uk: Вступне <a href="%(href)s">велике відеотурне</a>, яке продемонструє <b>вам</b>, як <b>налаштувати calibre</b> і якими є <b>основні можливості</b> програми.

source: <a href="%(faq)s">Frequently Asked Questions</a> (FAQ) list that will help you <b>resolve common issues</b>.
es: Lista de <a href="%(faq)s">Preguntas frecuentes</a> (FAQ) que le ayudará a <b>resolver problemas comunes</b>.
fr: La liste des <a href="%(faq)s">Questions Fréquemment Posées</a> (FAQ) qui vous aidera à <b>résoudre les problèmes communs</b>.
pt_br: <a href="%(faq)s">Questões Frenquentemente Perguntadas</a> (FAQ, na sigla em inglês). Lista que irá ajudá-lo a <b>resolver problemas comuns</b>.
uk: <a href="%(faq)s">Список поширених питань</a> (FAQ), який допоможе вам <b>вирішити розповсюджені проблеми</b>.

source: The <a href="%(blog)s">Blog</a> that has some easy to follow walk troughs from a layman’s perspective.
es: El <a href="%(blog)s">Blog</a> que tiene algunos guías sencillas de seguir, desde la perspectiva del no iniciado.
fr: Le <a href="%(blog)s">Blog</a> qui a des descriptions faciles à suivre de la perspective d'un profane.
pt_br: O <a href="%(blog)s">Blog</a> que possui algumas dicas fáceis de seguir da perspectiva de um leigo.
uk: У <a href="%(blog)s">блозі</a> можна знайти прості поради з точки зору неспеціаліста.

source: The comprehensive <a href="%(um)s">User Manual</a> that will show you how to do <b>almost anything</b> in calibre.
es: El completo <a href="%(um)s">Manual de usuario</a> que le mostrará cómo hacer <b>casi cualquier cosa</b> en calibre.
fr: Le <a href="%(um)s">Manuel Utilisateur</a> complet qui vous affichera comment faire <b>pratiquement tout</b> dans calibre
pt_br: O abrangente <a href="%(um)s">Manual do Usuário</a> que irá mostrar como fazer <b>praticamente tudo</b> no calibre.
uk: Повний <a href="%(um)s">Підручник користувача</a>, де наведено настанови щодо <b>майже усього</b> у calibre.

source: And finally, a <a href="%(forum)s">forum</a> where you can <b>ask any question</b> you might have and get answers.
es: Y por último, un <a href="%(forum)s">foro</a> donde puede <b>hacer cualquier pregunta</b> que pueda plantearse y obtener respuestas.
fr: Et finalement, un <a href="%(forum)s">forum</a> où vous pouvez <b>poser toutes les questions</b> que vous pouvez avoir et obtenir des réponses.
pt_br: E finalmente, um <a href="%(forum)s">fórum</a> onde você pode <b>fazer qualquer pergunta</b> que você tenha e obter respostas.
uk: І нарешті, <a href="%(forum)s">форум</a>, на якому ви можете <b>задати будь-які питання</b> і отримати на них відповіді.

source: You can also check out calibre’s <a href="%(fb)s">Facebook</a> and <a href="%(tw)s">twitter</a> pages to connect with other users.
es: También puede visitar las páginas de <a href="%(fb)s">Facebook</a> y <a href="%(tw)s">twitter</a> de calibre para contactar con otros usuarios.
fr: Vous pouvez aussi parcourir les pages <a href="%(fb)s">Facebook</a> et <a href="%(tw)s">Twitter</a> de calibre pour vous connecter avec d'autres utilisateurs.

source: Tutorials
es: Cursillos
fr: Tutoriels
pt_br: Tutoriais
uk: Навчальні посібники

source: If you didn’t find what you were looking for, you can also check out some of the calibre tutorials:
es: Si no ha encontrado lo que buscaba, también puede visitar algunos de los cursillos de calibre:
fr: Si vous ne trouvez pas ce que vous cherchez, vous pouvez également parcourir certains des tutoriels calibre :
pt_br: Se você não encontrou o que estava procurando, você também pode dar uma olhada em alguns dos tutoriais do calibre:
uk: Якщо вам не вдалося отримати бажаних відомостей, ви можете спробувати ознайомитися із декількома покроковими підручниками:

source: <a href="%(href)s">Basic video tutorials</a> that will show you how to use calibre’s e-book editor and tweak the interface.
es: <a href="%(href)s">Cursillos básicos en vídeo</a> que le mostrarán cómo usar el editor de libros de calibre y ajustar la interfaz.
fr: <a href="%(href)s">Les tutoriels vidéos basiques</a> qui vous montrerons comment utiliser l'éditeur de livre numérique de calibre et ajuster l'interface.
pt_br: <a href="%(href)s">Tutoriais básicos de vídeo</a> que irão mostrar como utilizar o editor do calibre e ajustar a interface.
uk: <a href="%(href)s">Базові відеопідручники</a>, у яких показано, як користуватися редактором електронних книг calibre та налаштовувати інтерфейс програми.

source: <a href="%(abc)s" title="ABCs of e-book conversion">ABCs of e-book format conversion</a>, by John Schember.
es: <a href="%(abc)s" title="ABCs of e-book conversion">El abecé de la conversión de formatos de libros electrónicos</a>, por John Schember.
fr: <a href="%(abc)s" title="ABCs of e-book conversion">L'ABC de la conversion du format livre numérique</a>, par John Schember.
pt_br: <a href="%(abc)s" title="ABCs of e-book conversion">ABC da conversão de e-books</a>, por John Schember.
uk: <a href="%(abc)s" title="ABCs of e-book conversion">Абетка перетворення форматів електронних книг</a> — автор Джон Шембер (John Schember).

source: A <a href="%(sbs)s" title="Step-by-step">step-by-step guide</a> on converting HTML and Microsoft Word formats using calibre.
es: Una <a href="%(sbs)s" title="Step-by-step">guía paso a paso</a> sobre la conversión de formatos HTML y Microsoft Word usando calibre.
fr: Un <a href="%(sbs)s" title="Step-by-step">guide pas à pas </a> sur la conversion des formats HTML et Microsoft Word en utilisant calibre.
pt_br: Um <a href="%(sbs)s" title="Step-by-step">guia passo a passo</a> sobre como converter HTML e documentos do Microsoft Word usando o calibre.
uk: <a href="%(sbs)s" title="Step-by-step">Покрокові настанови</a> щодо перетворення даних у форматах HTML та Microsoft Word за допомогою calibre.

source: Another <a href="%(uol)s">step-by-step guide</a> on creating ePub files starting from OpenOffice and Word, by the University of Leicester.
es: Otra <a href="%(uol)s">guía paso a paso</a> sobre la creación de archivos ePub a partir de OpenOffice y Word, por la Universidad de Leicester.
fr: Un autre <a href="%(uol)s">guide pas à pas</a> sur la création de fichiers EPUB en partant de Open Office et Word, par l'Université de Leicester.

source: Resources in languages other than English
es: Recursos en idiomas distintos del inglés
fr: Ressources dans des langues autres que l'anglais
pt_br: Recursos em outras línguas além do Inglês
uk: Ресурси мовами, відмінними від англійської

source: First, and most importantly, the <a href="%(man)s">calibre User Manual</a> is available in many different languages. Just click the <i>Languages</i> link in the sidebar to view it in a different language.
es: Primero, y lo más importante, el <a href="%(man)s">Manual de usuario de calibre</a> está disponible en muchos idiomas. Pulse el enlace <i>Idiomas</i> (o <i>Languages</i>) en la barra lateral para verlo en un idioma distinto.
fr: Tout d'abord, et le plus important, le <a href="%(man)s">Manuel Utilisateur calibre</a> est disponible dans beaucoup de langues différentes. Il suffit de cliquer le lien <i>Changer la langue</i> dans la barre de côté pour le voir dans une langue différente.
pt_br: Primeiro, e mais importante, o <a href="%(man)s">Manual do Usuário do calibre</a> está disponível em muitos idiomas. Basta clicar no link <i>Languages (Idiomas)</i> na barra lateral para vê-lo em um idioma diferente.
uk: По-перше, і найважливіше, можна скористатися <a href="%(man)s">Підручником користувача calibre</a>, який перекладено багатьма мовами. Просто натисніть посилання <i>Languages</i> на бічній панелі, щоб переглянути підручник рідною мовою.

source: <a href="%(de)s">A Beginner's Guide</a> in <b>German</b>
es: Una <a href="%(de)s">Guía del principiante</a> en <b>alemán</b>
fr: <a href="%(de)s">Un Guide du Débutant</a> en <b>Allemand</b>
pt_br: <a href="%(de)s">Um Guia do Iniciante</a> em <b>Alemão</b>
uk: <a href="%(de)s">Підручник для початківців</a> <b>німецькою</b>

source: calibre is a result of the efforts of many volunteers from all over the world. If you find it useful, please consider contributing to support its development. Your contribution helps keep calibre development alive. You can pay using credit cards, PayPal or Bitcoins.
fr: calibre est le résultat des efforts d'énormément de volontaires partout dans le monde. Si vous le trouvez utile, merci de considérer de faire une contribution pour aider à son développement. Votre contribution aide à garder le développement de calibre en vie. Vous pouvez payer en utilisant des cartes de crédit, Paypal ou des Bitcoins.

source: Thank you.
es: Gracias.
fr: Merci.
pt_br: Obrigado.
uk: Дякую.

source: Become a calibre patron
es: Patrocine calibre
fr: Devenir un bienfaiteur de calibre
pt_br: Torne-se um patrono do calibre
uk: Станьте спонсором calibre

source: If you would like to contribute regularly to calibre, you can become a calibre patron, by using the <a href="%(pat)s">Patreon service</a>.
fr: Si vous souhaitez contribuer régulièrement à calibre, vous pouvez devenir un bienfaiteur de calibre, en utilisant le <a href="%(pat)s">service Patreon</a>.

source: What's new in calibre 3.0
es: Qué hay nuevo en calibre 3.0
fr: Les nouveautés dans calibre 3.0
pt_br: Novidades do calibre 3.0
uk: Що нового у calibre 3.0

source: See what's new in calibre 3.0
es: Ver las novedades en calibre 3.0
fr: Voir les nouveautés dans calibre 3.0
pt_br: Veja as novidades do calibre 3.0
uk: Ознайомтеся із новим у calibre 3.0

source: Changelog
es: Registro de cambios
fr: Journal des modifications
pt_br: Registro de alterações
uk: Журнал змін

source: Major new features
es: Principales nuevas características
fr: Principales nouvelles fonctionnalités
pt_br: Principais novas funcionalidades
uk: Основні нові можливості

source: The full list of changes to calibre is available <a href="%(master)s">here</a>.
es: La lista completa de cambios en calibre está disponible <a href="%(master)s">aquí</a>.
fr: La liste complète des modifications apportées à calibre est disponible <a href="%(master)s">ici</a>.
pt_br: A lista completa das alterações do calibre está disponível <a href="%(master)s">aqui</a>.
uk: Із повним списком змін у calibre можна ознайомитися <a href="%(master)s">тут</a>.

source: Watch it in action
es: Verlo en acción
fr: Le voir en action
pt_br: Assista-o em ação
uk: Подивіться на усе у дії

source: A video tour of calibre
es: Un recorrido en vídeo por calibre
fr: Une visite vidéo de calibre
pt_br: Um tour em vídeo do calibre
uk: Відеопутівник calibre

source: Grand Tour Video
es: Vídeo del Recorrido por calibre
fr: Vidéo Grand Tour
pt_br: Vídeo do Grand Tour
uk: Відео із повним оглядом

source: In-depth video tutorials
es: Cursillos en vídeo en profundidad
fr: Tutoriels vidéos approfondis
pt_br: Tutoriais aprofundados em vídeo
uk: Докладні відеопідручники

source: Video tutorials
es: Cursillos en vídeo
fr: Tutoriels vidéo
pt_br: Tutoriais em vídeo
uk: Відеопідручники

source: Screenshots showing various calibre functions
es: Capturas de pantalla que muestran varias funciones de calibre
fr: Captures d'écran montrant différentes fonctions de calibre
pt_br: Imagens das telas mostrando várias funções do calibre
uk: Знімки вікон із різноманітними інструментами calibre

source: Screenshots
es: Capturas de pantalla
fr: Captures d'écran
pt_br: Imagens das telas
uk: Знімки вікон

source: Gives an overview of the major calibre features and how to get started using them.
es: Da una visión general de las principales características de calibre y cómo empezar a usarlas.
fr: Donne une vue générale des fonctionnalités importantes de calibre et comment commencer à les utiliser.
pt_br: Dá uma visão geral dos principais recursos do calibre e como começar a utilizá-los.
uk: Огляд основних можливостей calibre та початкові зауваження щодо їхнього використання.

source: Based on calibre version 0.8.0. Also available on <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
fr: Basée sur calibre version 0.8.0. Également disponible sur <a href="%(yt)s" title="YouTube video of calibre">Youtube</a>.
pt_br: Baseado na versão 0.8.0 do calibre. Também disponível no <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.
uk: Засновано на calibre версії 0.8.0. Також доступне у <a href="%(yt)s" title="YouTube video of calibre">YouTube</a>.

source: Click to play
es: Pulsar para ver
fr: Cliquez pour la lecture
pt_br: Clique para reproduzir
uk: Натисніть, щоб відтворити
