Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: This is an appropriate time to throw out a big thank you to all the calibre developers who have contributed many of the major new features listed above. An incomplete list of contributors is available <a href="%(href)s" title="Contributors">here</a>.
fr: C'est un moment approprié pour exprimer un grand merci à tous les développeurs calibre qui ont contribué aux nombreuses nouvelles fonctionnalités majeures listées ci-dessus. Une liste incomplète des contributeurs est disponible <a href="%(href)s" title="Contributors">ici</a>.
pt_br: Este é o momento apropriado para agradecer a todos os desenvolvedores do calibre que contribuíram com muitas das novas funções listadas acima. Um lista incompleta dos contribuidores está disponível <a href="%(href)s" title="Contributors">aqui</a>.
uk: Саме час сказати велике «дякую!» усім розробникам calibre, які зробили свій внесок у реалізацію більшої частини основних можливостей, список яких наведено вище. Із неповним списком учасників розробки можна ознайомитися <a href="%(href)s" title="Contributors">тут</a>.

source: Note that many of these features were actually introduced during the lifetime of the 0.9.x series. This document describes new features as compared to 0.9.0
fr: Notez qu'un grand nombre de ces fonctionnalités ont été en fait introduites tout au long de la série de version 0.9x. Ce document décrit les nouvelles fonctionnalités comparativement à la version 0.9.0
pt_br: Note que muitas dessa funções foram de fato introduzidas durante o ciclo de vida da série 0.9.x. Este documento descreve novas funções comparadas à versão 0.9.0
uk: Зауважте, що багато з цих можливостей було насправді впроваджено під час створення послідовності випусків 0.9.x. У цьому ж документі описано нові можливості, які з'явилися з часу випуску 0.9.0.

source: New in calibre 0.9
es: Nuevo en calibre 0.9
fr: Nouveautés dans la version 0.9 de calibre
pt_br: Novidades no calibre 0.9
uk: Нове у calibre 0.9

source: Lots has changed in calibre-land in the last year and a half. A beefed up e-book viewer. Support for Android phones and tablets. A new modern look for the calibre user interface. A portable version of calibre that you can carry around on a USB stick.
fr: Beaucoup de choses ont changé au pays de calibre dans la dernière année et demi. Une visionneuse de livre numérique musclée. La prise en charge des téléphones et tablettes Android. Un nouveau look moderne pour l'interface utilisateur calibre. Une version portable de calibre que vous pouvez emportez sur une clé USB.
pt_br: Muito mudou na calibre-lândia no último ano e meio. Um visualizador de e-books mais parrudo. Suporte a telefones e tablets Android. Um novo visual moderno para a interface do usuário. Uma versão portátil do calibre que você pode carregar em um pendrive.
uk: Протягом останніх півтора років у царині calibre багато чого змінилося. Перероблено засіб перегляду електронних книг. Реалізовано підтримку телефонів та планшетів під керуванням Android. Осучаснено інтерфейс користувача calibre. Створено портативну версію calibre, яку можна використовувати безпосередньо із флешки USB.

source: These and many more new features are described in detail below.
es: Estas y otras nuevas características se describen con detalle más adelante.
fr: Celles-ci et beaucoup d'autres nouvelles fonctionnalités sont décrites ci-dessous.
pt_br: Esta e muitas outras novas funções são descritas em detalhe abaixo.
uk: Ці і деякі інші нові можливості докладно описано нижче.

source: Enhanced E-book viewer
es: Visor de libros mejorado
fr: Visionneuse de livres numériques améliorée
pt_br: Visualizador de e-books melhorado
uk: Поліпшений переглядач електронних книг

source: The E-book viewer has a new "paged" mode, where the text is split up into pages. This means that you can have more than one page on the screen at a time. It also fixes some long standing limitations of the viewer: The top and bottom margins now work and the last line of text is never partially cut off.
fr: La visionneuse de livre numérique a un nouveau mode "paginé", où le texte est divisé en pages. Ceci signifie que vous pouvez avoir plus d'une page l'écran au même moment. Il corrige également certaines vieilles limitations de la visionneuse : les marges hautes et basses fonctionnent maintenant et le dernière ligne du texte n'est plus jamais partiellement coupée.
pt_br: O visualizador de e-books possui um novo modo "paginado", onde o texto é dividido em páginas. Isto significa que você pode ter mais de uma página na tela ao mesmo tempo. Isso também corrige algumas limitações existentes no visualizador: as margens de topo e rodapé agora funcionam e a última linha do texto nunca é parcialmente cortada.
uk: У засобі перегляду електронних книг передбачено новий «сторінковий» режим, коли текст поділяється на сторінки. Це означає, що ви зможете одночасно переглядати декілька сторінок на екрані. Це також виправляє давнє обмеження засобу перегляду: тепер працюють параметри верхнього і нижнього полів, а останній рядок тексту на сторінці ніколи частково не обрізається.

source: The viewer also has a new full screen mode that has no "chrome" (toolbars/menubars/etc.) to distract from the reading experience.
fr: La visionneuse a également un nouveau mode plein écran qui n'a pas de "chrome" (barres d'outils/barres de menu/etc.) pour distraire de l'expérience de lecture.
pt_br: O visualizador também tem um novo modo de tela cheia sem nada do "chrome" (barra de ferramentas/barra de menus/etc.) para distrair da experiência de leitura.
uk: Також у засобі перегляду передбачено новий повноекранний режим, у якому програма не показує обрамлення (панелі інструментів, смужку меню тощо) вікна, яке відволікає від читання.

source: The viewer can now display mathematics in e-books input in either TeX or MathML. See <a href="%(math)s">this tutorial</a> for details.
es: El visor ahora puede mostrar fórmulas matemáticas en los libros, introducidas en formato TeX o MathML. Ver <a href="%(math)s">este cursillo</a> para más detalles.
fr: La visionneuse peut maintenant afficher les mathématiques introduites dans les livres numériques en TeX ou MathML. Voir <a href="%(math)s">ce tutoriel</a> pour plus de détails.
pt_br: O visualizador pode agora exibir símbolos matemáticos em e-books tanto em TeX ou MathML. Veja <a href="%(math)s">este tutorial</a> para detalhes.
uk: У новій версії засіб перегляду здатен показувати формули у електронних книгах у форматі TeX або MathML. Докладніше про це у <a href="%(math)s">відповідному підручнику</a>.

source: Finally, the viewer now supports "themes". You can save the current configuration as a "theme" and quickly switch back and forth between them. Useful if you use a "night" mode with dark background and light text, for example.
fr: Pour finir, la visionneuse prend maintenant en charge les "thèmes". Vous pouvez enregistrer la configuration en tant que "thème" et rapidement basculer en arrière et en avant entre eux. Utile si vous utilisez un mode "nuit" avec un arrière plan foncé et un texte clair, par exemple.
pt_br: Finalmente, o visualizador agora suporta "temas". Você pode salvar a configuração atual como um "tema" e rapidamente trocar entre eles. Útil se você usa um modo "noturno" com um fundo escuro e texto claro, por exemplo.
uk: Нарешті, у засобі перегляду передбачено підтримку «тем». Ви можете зберегти поточні налаштування як «тему» і швидко перемикатися між такими наборами налаштувань. Це, наприклад, корисно для визначення «нічного» режиму із темним тлом і світлим текстом.

source: You can setup the calibre viewer to look like it does in the screenshots below by clicking the Preferences button in the viewer.
fr: Vous pouvez configurer la visionneuse de calibre pour qu'elle apparaisse comme elle l'est dans les captures d'écran ci-dessous en cliquant le bouton Préférences dans la visionneuse.
pt_br: Você pode configurar o visualizador do calibre para parecer como nas imagens abaixo clicando no botão de preferências no visualizador.
uk: Ви можете налаштувати засіб перегляду calibre так, щоб він виглядав аналогічно до показаного на наведених нижче знімках вікон, натиснувши кнопку «Налаштування» у вікні засобу перегляду.

source: The new paged mode, showing top and bottom margins
es: Nuevo modo paginado, con márgenes superior e inferior
fr: Le nouveau mode page, affiche les marges hautes et basses
pt_br: O novo modo paginado, mostrando margens superiores e inferiores
uk: Новий режим поділу на сторінки із показом верхнього і нижнього полів

source: Full screen mode with two pages on the screen
es: Modo de pantalla completa con dos páginas en pantalla
fr: Mode plein écran avec affichage double page
pt_br: Modo de tela inteira com duas páginas na tela
uk: Повноекранний режим із двома сторінками на екрані

source: Night mode in the viewer
es: Modo nocturno en el visor
fr: Mode nuit dans la visionneuse
pt_br: Modo noturno no visualizador
uk: Нічний режим у переглядачі

source: Mathematics in the viewer
es: Fórmulas matemáticas en el visor
fr: Mathématiques dans la visionneuse
pt_br: Matemática no visualizador
uk: Формули у переглядачі

source: Full support for connecting to Android phones/tablets
es: Soporte completo para conectar con teléfonos y tabletas Android
fr: Support complet pour la connexion aux téléphones/tablettes Android
pt_br: Suporte completo para conexão de telefones/tablets Android
uk: Повна підтримка з’єднання із телефонами та планшетами під керуванням Android

source: calibre can now connect both wirelessly and over USB to Android devices. Modern Android devices often use a special "MTP" protocol when connecting by USB. calibre now supports this protocol in Windows (Vista and newer) and Linux.
fr: calibre peut maintenant se connecter sans fil ou par USB aux périphériques Android. Les périphériques Android modernes utilisent un protocole "MTP" spécial lors de la connexion par USB. calibre prend maintenant en charge ce protocole dans Windows (Vista et plus récent) et Linux.
pt_br: O calibre pode agora conectar tanto via wifi como via USB a dispositivos Android. Dispositivos Android modernos costumam usar um protocolo especial "MTP" ao conectar via USB. O calibre agora suporta este protocolo no Windows (Vista e mais novo) e Linux.
uk: Нова версія calibre може встановлювати з'єднання із пристроями під керуванням Android за допомогою бездротового зв'язку та USB. У сучасних пристроях під керуванням Android для з'єднань за допомогою USB часто використовується особливий протокол «MTP». У новій версії calibre передбачено підтримку цього протоколу у Windows (Vista та новіші версії) і Linux.

source: calibre also has a new "Wireless device driver" that allows connecting to your android device wirelessly, in exactly the same was as if it was plugged in via USB. To use it with an Android device, you need the <a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android app.
fr: calibre a également un nouveau "pilote de périphérique sans fil" qui permet la connexion sans fil à votre périphérique Android, exactement de la même manière que s'il était branché en USB. Pour l'utiliser avec un périphérique Android, vous avez besoin de l'application Android <a href="%(cc)s" alt="%(cn)s">%(cn)s</a>.
pt_br: O calibre também tem um novo "Driver de dispositivo sem fio" que permite conectar ao seu dispositivo android sem fio, exatamente como se estivesse plugado via USB. Para usá-lo com um dispositivo Android, você precisa do <a href="%(cc)s" alt="%(cn)s">%(cn)s</a> Android app.
uk: Крім того, у calibre з'явився новий «драйвер бездротових пристроїв», за допомогою якого програма може з'єднуватися у бездротовому режимі із вашим пристроєм під керуванням android у той самий спосіб, у який би вона з'єднувалася із ним за допомогою USB. Щоб скористатися драйвером для пристрою під керуванням Android, вам слід встановити на ньому програму <a href="%(cc)s" alt="%(cn)s">%(cn)s</a>.

source: For details see <a href="%(man)s">here</a>.
es: Para detalles ver <a href="%(man)s">aquí</a>.
fr: Pour plus de détails voir <a href="%(man)s">ici</a>.
pt_br: Para detalhes veja <a href="%(man)s">aqui</a>.
uk: З докладним описом можна ознайомитися <a href="%(man)s">тут</a>.

source: calibre connected to a Nexus 7 tablet over USB
es: calibre conectado por USB a una tableta Nexus 7
fr: calibre connecté par USB à une tablette Nexus 7
pt_br: O calibre conectado a um tablet Nexus 7 via USB
uk: calibre з’єднано із планшетом Nexus 7 за допомогою USB

source: The Calibre Companion application running on an Android Phone
fr: L'application Calibre Companion en fonctionnement sur un Téléphone Android
pt_br: O programa Calibre Companion rodando em um Telefone Android
uk: Супутня програма Calibre, яка працює на телефоні з Android

source: New "modern" look
es: Nuevo aspecto «moderno»
fr: Nouveau look "moderne"
pt_br: Novo visual "moderno"
uk: Новий «сучасний» вигляд

source: The calibre user interface has a new "modern" look. This change gives a more 'modern' feel to the interface with focus highlighting, gradients, rounded corners, etc.
fr: L'interface utilisateur de calibre à maintenant un nouveau look "moderne". Ce changement donne une apparence plus moderne à l'interface avec un accent sur la mise en évidence, les inclinaisons, les coins arrondis, etc.
pt_br: A interface do usuário do calibre tem um novo visual "moderno". Esta alteração dá uma aparência mais 'moderna' para a interface com destaque de foco, gradientes, cantos arredondados, etc.
uk: Інтерфейс користувача calibre набув нового «сучасного» вигляду. Ця зміна надає програмі сучаснішого вигляду із акцентом на підсвічуванні, градієнтах, заокруглених кутах тощо.

source: The main calibre window with the new look
es: Nuevo aspecto de la ventana principal de calibre
fr: L'interface utilisateur principale de calibre avec la nouvelle apparence
pt_br: A janela principal do calibre com o novo visual
uk: Новий вигляд головного вікна calibre

source: The Edit metadata dialog with the new look
es: Nuevo aspecto del diálogo de modificación de metadatos
fr: La Boîte de dialogue d'édition des métadonnées avec la nouvelle apparence
pt_br: O diálogo de edição de metadados com o novo visual
uk: Новий вигляд діалогового вікна редагування метаданих

source: calibre Portable is a new type of calibre install that keeps the calibre library and settings together with the calibre program. This means that you can put the entire thing on a USB stick and carry it around with you. Or give the USB stick as a gift to someone special. Just plug the USB stick into any windows computer and you have a fully functional calibre, with all your books and settings in place. See the <a href="%(portable)s">Download portable</a> page for details.
fr: calibre Portable est un nouveau type d'installation de calibre qui garde ensemble la bibliothèque calibre et les paramètres avec le programme calibre. Cela signifie que vous pouvez tout mettre sur une clé USB et l'emporter avec vous. Ou donner la clé USB comme cadeau à quelqu'un. Brancher simplement la clé USB dans n'importe quel ordinateur sous Windows et vous avec un calibre complètement fonctionnel, avec tous vos livres et paramètres en place. Voir la page <a href="%(portable)s">Télécharger Portable</a> pour plus de détails.
pt_br: O calibre Portátil é um novo tipo de instalação do calibre que mantém a biblioteca do calibre e configurações juntos com o programa principal. Isto significa que você pode colocar a coisa toda em um pendrive e carregá-lo por aí com você. Ou dar o pendrive como um presente para alguém especial. Apenas conecte o pendrive em um computador com o Windows e você terá um calibre completamente funcional, com todos o seus livros e configurações em lugar. Veja a página <a href="%(portable)s">Baixar Portátil</a> para detalhes.
uk: Портативна версія calibre є новим типом пакунка calibre, у якому бібліотека calibre і параметри програми зберігаються разом із самою програмою calibre. Це означає, що ви можете записати увесь комплект на флеш-носій USB і носити його із собою. Або подарувати флешку USB із бібліотекою комусь особливому. Достатньо з'єднати таку флешку USB із будь-яким комп'ютером під керуванням windows, і ви матимете повнофункціональну версію calibre із усіма вашими книгами та параметрами. Докладніше про це на <a href="%(portable)s">сторінці отримання портативної версії</a>.

source: Conversion engine improvements
es: Mejoras en el motor de conversión
fr: Améliorations du moteur de conversion
pt_br: Melhorias no mecanismo de conversão
uk: Поліпшення у рушії перетворення

source: calibre's conversion engine now has full support for Amazon's new KF8 format. It can convert KF8 books to other formats and convert other formats to KF8. To convert to KF8 set the output format in the calibre conversion dialog to AZW3.
fr: Le moteur de conversion de calibre supporte maintenant pleinement le nouveau format KF8 d'Amazon. Il peut convertir des livres KF8 aux autres formats et convertir les autres formats en KF8. Pour convertir en KF8 définissez le format de sortie dans la boite de dialogue de conversion à AZW3.
pt_br: O mecanismo de conversão do calibre agora tem suporte completo para o novo formato KF8 da Amazon. Ele pode converter livros KF8 para outros formatos e converter outros formatos para KF8. Para converter para KF8, escolha o formato de saída no diálogo de conversão para AZW3.
uk: У новій версії рушія перетворення calibre передбачено повну підтримку нового формату Amazon KF8. Рушій здатен перетворювати книги KF8 до інших форматів і перетворювати книги у інших форматах на книги у форматі KF8. Щоб перетворити книгу до формату KF8, встановіть у діалоговому вікні перетворення calibre формат виведення даних AZW3.

source: The PDF output produced by calibre has been greatly improved. There are no more cut off lines of text/images at the bottom of the page. Top and bottom margins are set correctly. The metadat Table of Contents is converted to PDF Bookmarks in the output file.
fr: Les PDF produits par calibre ont été grandement améliorés. Il n'y a plus de coupures de ligne ou de texte/image au bas de la page. Les marges hautes et basses sont définies correctement. La métadonnée Table des Matières est converties en favoris PDF sans le fichier de sortie

source: Library management improvements
es: Mejoras en la gestión de las bibliotecas
fr: Amélioration de la gestion de la bibliothèque
pt_br: Melhorias no gerenciamento da biblioteca
uk: Поліпшення у керуванні бібліотекою

source: 0.9 brings lots of goodies to make managing your ever growing e-book collection easier:
es: 0.9 trae muchas opciones para hacer más fácil la gestión de su creciente colección de libros electrónicos:
fr: La version 0.9 apporte beaucoup de possibilités pour faciliter le gestion de votre collection de livres numériques toujours grandissante
pt_br: A versão 0.9 traz várias novidades para tornar mais fácil o gerenciamento da sua sempre crescente coleção de e-books:
uk: У 0.9 багато інструментів, які спрощують керування вашою збіркою електронних книг:

source: Automatic adding of books from a specified folder: calibre can now monitor a specified folder on your computer and automatically add any files it fonds in that folder. Set it up via Preferences-&gt;Adding books-&gt;Automatic Adding
fr: Ajouter automatiquement des livres à partir d'un répertoire spécifié : calibre peut maintenant surveiller un répertoire spécifique sur votre ordinateur et ajouter automatiquement n'importe quel fichier qu'il trouve dans celui-ci. Paramétrez-le via Préférences-&gt;Ajouter des livres-&gt;Ajout Automatique

source: Allow the coloring of columns in the book list based on the book's metadata. See Preferences-&gt;Look &amp; Feel-&gt;Column Coloring
fr: Permettre la coloration des colonnes dans la liste de livres basée sur les métadonnées du livre. Voir Préférences-&gt;Apparence &amp; présentation-&gt;Coloration de colonne
pt_br: Permite a colorização de colunas na lista de livros baseada nos metadados do livro. Veja Preferências-&gt;Aparência-&gt;Colorização de Colunas
uk: Уможливлено розфарбовування стовпчиків у списку книг на основі метаданих книг. Див. «Налаштування -&gt; Вигляд та поведінка -&gt; Розфарбовування стовпчиків»

source: When searching, allow use of un-accented characters to match accented characters. The rules for matching un-accented characters are done in a language dependent way. So if your calibre interface language is set to English, n will match both n and ñ, but if it is set to Spanish, it will match only n, as in Spanish ñ is a separate alphabet in Spanish.
fr: Lors de la recherche, permettre l'utilisation de caractères non accentués pour correspondre aux caractères accentués. Les règles pour faire correspondre les caractères non accentués sont faites d'une manoère dépendante de la langue. Ainsi, si la langue de l'interface de calibre est paramétrée à Anglais, n correspondra à n et ñ, mais si elle est paramétrée à Espagnol, elle correspondra uniquement à n, vu qu'en Espagnol ñ est un alphabet séparé.
pt_br: Ao pesquisar, permite o uso de caracteres não acentuados para corresponder a caracteres acentuados. As regras para correspondência de caracteres não acentuados são feitas de uma maneira dependente do idioma. Assim, se o idioma de sua interface do calibre está em Inglês, n irá corresponder tanto a n como ñ, mas se estiver em Espanhol, irá corresponder apenas a n, uma vez que em Espanhol o ñ é uma letrada diferente do alfabeto.
uk: Під час пошуку уможливлено використання літер без діакритичних позначок для встановлення відповідності тексту із діакритичними позначками. Правила встановлення відповідності символів без діакритичних символів залежать від вибраної мови. Отже, якщо для інтерфейсу calibre встановлено англійську мову, n відповідатиме одразу n і ñ, але якщо встановлено іспанську мову, відповідність встановлюватиметься лише для n, оскільки у іспанській ñ є окремим символом абетки.

source: A new "Languages" column to keep track of the book's language
es: Una nueva columna «Idiomas» para realizar un seguimiento de los idiomas del libro
fr: Une nouvelle colonne "Langues" pour garder une trace de la langue des livres
pt_br: Uma nova coluna de "Idiomas" para manter o registro do idioma do livro
uk: Новий стовпчик «Мови» для визначення мови книги

source: Speed improvements for large libraries.
es: Mejoras de velocidad en bibliotecas grandes.
fr: Amélioration de la vitesse pour les grandes bibliothèques
pt_br: Melhorias de velocidade para grandes bibliotecas.
uk: Поліпшення у швидкодії для великих бібліотек.

source: Coloring of the test in the book list
es: Coloreado de las pruebas en la lista de libros
fr: Coloration du texte dans la liste de livres
pt_br: Teste de coloração de colunas na lista de livros
uk: Розфарбовування тесту у списку книг

source: Note that many of these features were actually introduced during the lifetime of the 0.8.x series. This document describes new features as compared to 0.8.0
fr: Notez qu'un grand nombre de ces fonctionnalités ont été en fait introduites tout au long de la série de version 0.8x. Ce document décrit les nouvelles fonctionnalités comparativement à la version 0.8.0
pt_br: Note que muitas dessa funções foram de fato introduzidas durante o ciclo de vida da série 0.8.x. Este documento descreve novas funções comparadas à versão 0.8.0
uk: Зауважте, що багато з цих можливостей було насправді впроваджено під час створення послідовності випусків 0.8.x. У цьому ж документі описано нові можливості, які з'явилися з часу випуску 0.8.0.

source: New in calibre 0.7
es: Nuevo en calibre 0.7
fr: Nouveautés dans la version 0.7 de calibre
pt_br: Novidades no calibre 0.7
uk: Нове у calibre 0.7
