Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: A new, faster database backend
fr: Une nouvelle, plus rapide base de données principale
pt_br: Um novo e mais rápido banco de dados
uk: Новий, швидший модуль бази даних

source: The database backend in calibre has been re-written from scratch. The new code is smaller, more robust and 2-3 times as fast as the old code. No pretty pictures for this, but those of you that have large book collections should appreciate the speed.
fr: La base de donnée principale de calibre a été ré écrite depuis zéro. Le nouveau code est plus petit, plus robuste et 2 à 3 fois plus rapide que l'ancien code. Pas de jolies images pour ceci, mais ceux d'entre vous qui avez de grandes collections de livre devraient apprécier la vitesse.
pt_br: A base de dados do calibre foi reescrita do zero. O novo código é menor, mais robusto e 2-3 mais rápido que o código antigo. Sem fotos bonitas para isso, mas aqueles que possuem um grande coleção de livros devem apreciar a velocidade.
uk: Було повністю переписано код модуля бази даних у calibre. Новий програмний код є меншим за розміром, надійнішим і у 2-3 рази швидшим за старий. Звичайно ж, тут не можна навести ніяких красивих картинок, але ті з вас, чия збірка книг є великою, мають оцінити швидкість роботи нової версії.

source: Virtual Libraries
es: Bibliotecas virtuales
fr: Bibliothèques Virtuelles
pt_br: Bibliotecas Virtuais
uk: Віртуальні бібліотеки

source: Virtual Libraries allow you to easily partition your large calibre library into smaller, "virtual" libraries. A virtual library is a way to tell calibre to open only a subset of a normal library. For example, you might want to only work with books by a certain author, or books having only a certain tag. To use this feature, click the button labeled <i>Virtual Library</i> to the left of the Search bar. For details, see <a href="%(vl)s">Virtual Libraries in the User Manual</a>. You can even have calibre display the Virtual Libraries as tabs above the book list, as shown in the screen shots below.
es: Las bibliotecas virtuales le permiten dividir una biblioteca de calibre extensa en bibliotecas «virtuales» más pequeñas. Una biblioteca virtual es una manera de decirle a calibre que abra sólo una parte de una biblioteca normal. Por ejemplo, puede querer trabajar sólo con libros de un determinado autor, o libros con cierta etiqueta. Para usar esta función, pulse el botón etiquetado <i>Biblioteca virtual</i> a la izquierda de la barra de búsqueda. Para más detalles vea <a href="%(vl)s">Bibliotecas virtuales en el Manual de usuario</a>. Puede incluso hacer que calibre muestre las bibliotecas virtuales como pestañas sobre la lista de libros, como se muestra en las siguientes capturas de pantalla.
fr: Les Bibliothèques virtuelles vous permettent de partitionner facilement votre grande bibliothèque calibre en plus petites, bibliothèques "virtuelles". Une bibliothèque virtuelle est une manière de dire à calibre d'ouvrir uniquement un sous ensemble d'une bibliothèque normale. Par exemple, vous voudriez travailler uniquement avec un certain auteur, ou des livres ayant une certaine étiquette. Pour utiliser cette fonctionnalité, cliquez le bouton étiqueté <i>Bibliothèque Virtuelle</i> à la gauche de la Barre de recherche. Pour plus de détails, voir <a href="%(vl)s">Bibliothèques Virtuelles dans le Manuel Utilisateur</a>. Vous pouvez même dire à calibre d'afficher les Bibliothèques Virtuelles sous forme d'onglets au dessus de la liste de livres, comme montré dans la capture d'écran ci-dessous.
pt_br: Bibliotecas Virtuais permitem você particionar facilmente sua grande biblioteca do calibre em bibliotecas menores, "virtuais". Uma biblioteca virtual é uma maneira de dizer ao calibre para abrir apenas um subconjunto de uma biblioteca normal. Por exemplo, apenas livros de um certo autor, ou livros tendo uma certa etiqueta. Para usar essa função, clique no botão <i>Biblioteca Virtual</i> à esquerda da barra de pesquisa. Para detalhes, veja <a href="%(vl)s">Bibliotecas Virtuais no Manual do Usuário</a>. O calibre pode até exibir as Bibliotecas Virtuais como abas acima da lista de livros, como mostrado nas capturas de tela abaixo.
uk: Віртуальні бібліотеки надають вам змогу дуже просто поділити вашу велику бібліотеку calibre на менші, «віртуальні», бібліотеки. Віртуальна бібліотека — спосіб повідомити calibre про те, що слід відкрити лише певну підмножину звичайної бібліотеки. Наприклад, у вас може виникнути потреба попрацювати лише з книгами певного автора або книгами, які позначено певною міткою. Щоб скористатися цією можливістю, натисніть кнопку із міткою <i>Віртуальна бібліотека</i>, розташовану ліворуч від панелі пошуку. Докладніший опис можна знайти у <a href="%(vl)s">розділі щодо віртуальних бібліотек підручника користувача</a>. Ви навіть можете наказати calibre показувати віртуальні бібліотеки як вкладки над списком книг, як це показано на знімках вікон, які наведено нижче.

source: Virtual Libraries: Easily work with subsets of the full collection
fr: Bibliothèques virtuelles : Travailler aisément avec des sous-ensembles de la collection complète
pt_br: Bibliotecas Virtuais: Funciona facilmente com subconjuntos da coleção completa
uk: Віртуальні бібліотеки: спрощення роботи із частинами великої збірки

source: Another Virtual Library, notice the tabs above the books
fr: Une autre Bibliothèque Virtuelle, notez les onglets au dessus des livres
pt_br: Outra Biblioteca Virtual. Note as abas acima dos livros
uk: Ще одна віртуальна бібліотека, зауважте, що вкладки розташовано над записами книг

source: Can be created from tags, authors, any search calibre is capable of
fr: Peuvent être créées à partir des étiquettes, auteurs, toute recherche que calibre est capable de faire
pt_br: Pode ser criada a partir de etiquetas, autores, e qualquer busca que o calibre seja capaz
uk: Можна створювати з міток, записів авторів, будь-яких пошуків, які здатна виконати програма calibre

source: Conversion of Microsoft Word documents
es: Conversión de documentos de Microsoft Word
fr: Conversion de documents Microsoft Word
pt_br: Conversão de documentos do Microsoft Word
uk: Перетворення документів Microsoft Word

source: calibre can now convert Microsoft Word documents (.docx files, generated by Word 2007 or newer). The converter is comprehensive, with support for lists, tables, images, all types of text formatting, footnotes, endnotes and even dropcaps. A sample docx file showing the capabilities of the converter is available: <a href="%(demo)s">demo.docx</a>. Just add it to calibre and convert it to EPUB or AZW3 and see what the conversion engine is capable of.
fr: calibre peut maintenant convertir des documents Microsoft Word (fichiers .docx, générés par Word 2007 ou plus récent). Le convertisseur des complet , avec la prise en charge des listes, tables, tous les types de formatage de texte, note de pied de page, notes de fin et même les lettrines. Un exemple de fichier docx montrant les capacités du convertisseur est disponible : <a href="%(demo)s">demo.docx</a>. Ajoutez-le simplement à calibre et convertissez le en EPUB ou AZW3 et voyez ce dont le moteur de conversion est capable.
pt_br: O calibre agora pode converter documentos do Word (arquivos .docx, gerados pelo Word 2007 ou mais novo). O conversor é abrangente, com suporte para listas, tabelas, imagens, todo tipo de formatação de texto, notas de rodapé, notas de fim e mesmo capitulares. Um arquivo docx mostrando as capacidades do conversor está disponível: <a href="%(demo)s">demo.docx</a>. Apenas adicione-o ao calibre e converta-o para EPUB ou AZW3 e veja o que o mecanismo de conversão é capaz.
uk: Нова версія calibre здатна перетворювати документи Microsoft Word (файли .docx, створені за допомогою Word 2007 і новіших версій). Засіб перетворення є доволі повним, із підтримкою списків, таблиць, зображень, усіх типів форматування тексту, підрядкових приміток, кінцевих приміток і навіть буквиці. Зразком docx, який демонструє можливості засобу перетворення є цей файл: <a href="%(demo)s">demo.docx</a>. Просто додайте його до бібліотеки calibre і перетворіть на EPUB або AZW3, щоб переконатися у можливостях рушія перетворення.

source: New metadata download sources
es: Nuevos orígenes de descarga de metadatos
fr: Nouvelles sources de téléchargement des métadonnées
pt_br: Novas fontes de download de metadados
uk: Нові джерела отримання метаданих

source: Many new metadata sources have been added, particularly for finding book covers. For example, calibre can now do a Google Image search to find covers. You can enable the new sources by going to <i>Preferences-&gt;Metadata download</i>. Other new sources include Edelweiss, a website maintained by book publishers and Big Book Search which collates cover images from Amazon. The new cover sources can return multiple covers for a single book, allowing you to pick and choose to select the image you like best.
fr: De nombreuses sources de métadonnées ont été ajoutées, particulièrement pour trouver des couvertures de livre. Par exemple, calibre peut maintenant faire une recherche Google Image pour trouver des couvertures. Vous pouvez activer les nouvelles sources en allant dans <i>Préférences-&gt;Télécharger les métadonnées</i>. Les autres nouvelles sources incluent Edelweiss, un site web maintenu par des éditeurs de livre et Big Book Search qui rassemble les images de couverture Amazon. Les nouvelles sources de couverture peuvent renvoyer de multiples couvertures pour un seul livre, vous permettant de ramasser et choisir pour sélectionner l'image que vous préférez le plus.
pt_br: Muitas novas fontes de metadados foram adicionadas, particularmente para encontrar capas de livros. Por exemplo, o calibre agora pode fazer uma busca por imagens no Google para buscar capas. Você pode habilitar as novas fontes em <i>Preferências-&gt;Download de Metadados</i>. Outras novas fontes incluem Edelweiss, site mantido por editoras, e Big Book Search, o qual coleta imagens de capa da Amazon. As novas fontes de capa podem retornar múltiplas capas para um único livro, permitindo que você escolha a imagem que mais te agrade.
uk: Було додано багато нових джерел метаданих, зокрема джерел для пошуку зображень обкладинок книг. Наприклад, нова версія calibre може виконувати пошук зображень обкладинок у Зображеннях Google. Увімкнути нові джерела даних можна за допомогою сторінки <i>Налаштування -&gt; Отримання метаданих</i>. Серед інших нових джерел, Edelweiss — сайт, який належить видавцям книг, та Big Book Search — сайт, який збирає зображення обкладинок з Amazon. Нові джерела зображень обкладинок можуть повертати декілька зображень для окремої книги, що надає вам можливість вибрати з них найкраще і найвідповідніше.

source: The new cover download sources in action
fr: Les nouvelles sources de couverture en action
pt_br: As novas fontes de download de capas em ação
uk: Джерела отримання нових обкладинок у дії

source: The metadata download configuration dialog
es: Diálogo de configuración de descarga de metadatos
fr: Boîte de dialogue pour la configuration du téléchargement des métadonnées

source: Full support for font embedding
es: Soporte total para la incrustación de tipos de letra
fr: Support complet de l'intégration de polices
pt_br: Suporte completo para incorporação de fontes
uk: Повна підтримка вбудовування шрифтів

source: calibre's conversion engine now has full support for font embedding. It can scan your computer for all TrueType and OpenType fonts referenced in the document being converted and automatically embed them (provided the output format supports embedded fonts, of course). This can be turned on via the <i>Look &amp; Feel</i> section of the conversion dialog.
fr: Le moteur de conversion de calibre supporte maintenant pleinement les polices embarquées. Il peut scanner votre ordinateur pour toutes les polices Truetype et Opentype référencées dans le document en cours de conversion et les intégrer automatiquement (sous réserve que le format de sortie prend en charge les polices embarquées, bien sûr). Ceci peut être activé dans la section <i>Apparence et présentation</i> de la boite de dialogue de conversion.
pt_br: O mecanismo de conversão do calibre agora possui suporte completo para incorporação de fontes. Ele pode escanear seu computador buscando todas as fontes TrueType e OpenType referenciadas no documento sendo convertido e automaticamente incorporá-las (desde que o formato de saída suporte fontes incorporadas, claro). Isto pode ser ativado através da seção <i>Aparência</i> do diálogo de conversão.
uk: У рушії перетворення нової версії calibre передбачено повну підтримку вбудовування шрифтів. Рушій здатен виконати пошук у вашій системі усіх шрифтів TrueType і OpenType, на які посилається документ, який ви перетворюєте, і автоматично вбудувати їх (якщо, звичайно ж, у форматі виведення передбачено вбудовування шрифтів). Увімкнути вбудовування можна за допомогою розділу <i>Вигляд та поведінка</i> діалогового вікна перетворення.

source: The conversion engine can also subset fonts, that is, reduce them to contain only the glyphs for characters actually present in the document being converted. This can greatly reduce the size of the font files.
fr: Le moteur de conversion peut aussi faire des sous ensembles de polices, ce qui réduit à contenir uniquement les glyphes et les caractères actuellement présents dans le document en cours de conversion. Ceci peu réduire grandement la taille des fichiers de police.
pt_br: O mecanismo de conversão também pode criar subconjuntos de fontes, ou seja, reduz-as para conter apenas os glifos para os caracteres presentes no documento sendo convertido. Isto pode reduzir muito o tamanho dos arquivos de fonte.
uk: У рушії перетворення також передбачено можливість обрізання шрифтів, тобто обмеження коду вбудованих шрифтів до лише тих символів, які використовуються у перетворюваному документі. Ця можливість надає змогу значно зменшити розміри файлів шрифтів.

source: An easy to use tool to edit the Table of Contents in e-books
es: Una herramienta fácil de usar para modificar el Índice en los libros electrónicos
fr: Un outil facile d'utilisation pour modifier la Table des Matières des livres numériques
pt_br: Uma ferramenta fácil e usar para editar o Sumário dos e-books
uk: Простий у користуванні інструмент для редагування таблиць змісту електронних книг

source: Using the new <i>Edit ToC</i> tool, you can easily re-arrange the entries in an existing Table of Contents, change their text and even change the location they point to by simply clicking the new location in the book. To use this tool, go to <i>Preferences-&gt;Toolbar</i> and add the Edit ToC tool to the main toolbar. Then simply select the books you want to be polished and click the <i>Edit ToC</i> button.
fr: En utilisant le nouvel outil <i>Éditer la TdM</i>, vous pouvez facilement réarranger les entrées dans une Table des Matières existante, changer leur texte et même changer l'endroit vers lequel elles pointent en cliquant simplement le nouvel emplacement dans le livre. Pour utiliser cette outil, allez dans <i>Préférences-&gt;Barres d'outils</i> et ajoutez l'outil Éditer la Tdm à la barre d'outils principale. Sélectionner alors simplement les livres que vous voulez embellir et cliquez sur le bouton <i>Éditer la TdM</i>.
pt_br: Usando a nova ferramenta <i>Editar Índice</i>, você pode facilmente rearranjar as entradas em um Índice existente, mudar seu texto ou mesmo alterar o destino para o qual apontam simplesmente clicando no novo destino no livro. Para usar esta ferramenta, vá em <i>Preferências-&gt;Barras de Ferramentas</i> e adicione a ferramenta à barra de ferramentas principal. Então selecione os livros que você deseja polir e clique no botão <i>Editar Índice</i>.
uk: За допомогою нового засобу <i>Редагування змісту</i> ви зможете без проблем переупорядкувати записи у наявному списку змісту, змінити текст і навіть змінити місце, на яке вони вказують, простим клацанням у відповідному місці книги. Щоб скористатися цим засобом, перейдіть на сторінку <i>Налаштування -&gt; Панелі інструментів</i> і додайте інструмент «Редагувати зміст» на головну панель інструментів. Далі, позначте книги, які ви хочете редагувати, і натисніть кнопку <i>Редагувати зміст</i>.

source: The Edit ToC tool
es: Herramienta de modificación del índice
fr: L'outil Éditer la TdM
pt_br: A ferramenta de edição do Sumário
uk: Інструмент редагування змісту

source: Editing individual entries
es: Modificar entradas individuales
fr: Édition d'entrées individuelles
pt_br: Editando entradas individuais
uk: Редагування окремих записів

source: Choosing a location inside the book
es: Elegir una ubicación dentro del libro
fr: Choisir un emplacement dans le livre
pt_br: Escolhendo um ponto dentro do livro
uk: Вибір місця у книзі

source: Rewritten PDF Output engine
es: Reescrito el motor de salida PDF
fr: Réécriture du moteur de conversion en PDF
pt_br: Mecanismo de saída PDF reescrito
uk: Переписано рушій виведення даних PDF

source: The PDF Output engine in calibre was completely re-written. The new engine supports proper pagination, inserting headers and footers with templates, auto-generation of a printable Table of Contents and many other features. See <a href="%(pdf)s">Converting to PDF</a> for details.
fr: Le moteur pour le PDF en sortie de calibre a été complètement ré écrit. Le nouveau moteur prend en charge une pagination correcte, l'insertion d'en-tête et de pieds de page avec des modèles, la génération automatique d'une Table des Matières imprimable et de nombreuses autres fonctionnalités. Voir <a href="%(pdf)s">Convertir en PDF</a> pour plus de détails.
pt_br: O mecanismo de saída PDF do calibre foi completamente reescrito. O novo mecanismo suporta paginação apropriada, inserção de cabeçalhos e rodapés com modelos, geração automatica do Índice imprimível e muitas outras funções. Veja <a href="%(pdf)s">Convertendo para PDF</a> para detalhes.
uk: Повністю переписано рушій виведення даних у форматі PDF. У новому рушії передбачено належний поділ на сторінки, вставлення верхніх та нижніх колонтитулів на основі шаблонів, автоматичне створення придатного до друку списку змісту та багато інших можливостей. Докладніше про це можна дізнатися на <a href="%(pdf)s">сторінці щодо перетворення на PDF</a>.

source: New tool: "Polish books" that allows you to perform various automated cleanup actions on e-books
es: Nueva herramienta: «Pulir libros», que le permite realizar varias tareas automatizadas para limpiar los libros electrónicos
fr: Nouvel outil : "Peaufiner les livres" qui vous permet d'effectuer différentes actions automatisées de nettoyage sur les livres numériques
pt_br: Nova ferramenta: "Polir livros" que permite que você realize várias ações de limpeza automatizada em e-books
uk: Новий інструмент «Удосконалення книг», за допомогою якого ви можете виконувати різноманітні дії із удосконалення коду електронних книг

source: Polishing books is all about putting the shine of perfection on your e-book files. You can use it to embed referenced fonts, subset embedded fonts, smarten punctuation, update the metadata in the book files from the metadata in the calibre library, manipulate the book jacket, etc. To use this tool, go to <i>Preferences-&gt;Toolbar</i> and add the Polish books tool to the main toolbar. Then simply select the books you want to be polished and click the Polish books button. Polishing, unlike conversion, does not change the internal structure/markup of your book, it performs only the minimal set of actions needed to achieve its goals. Note that book polishing only works in e-books in the EPUB and AZW3 formats.
es: Pulir libros le permite poner un toque de perfección en los archivos de libro electrónico. Puede usarlo para incrustar los tipos de letra referenciados, reducir tipos de letra incrustados, mejorar la puntuación, actualizar los metadatos en los archivos de libro electrónico según los metadatos en la biblioteca de calibre, manipular la sobrecubierta, etc. Para usar esta herramienta vaya a <i>Preferencias &gt; Barra de herramientas</i> y añada la herramienta Pulir libros a la barra de herramientas principal. Luego simplemente seleccione los libros que desee pulir y pulse el botón Pulir libros. El pulido, a diferencia de la conversión, no modifica la estructura interna o el marcado del libro, sólo realiza las mínimas acciones necesarias para obtener los resultados. Tenga en cuenta que el pulido sólo funciona con libros en formato EPUB o AZW3.
fr: Peaufiner les livres est tout ce qu'il s'agit à propos de mettre une touche de perfection sur vos fichiers de livres numériques. Vous pouvez l'utiliser pour embarquer des polices référencées, faire un sous ensemble de polices embarquées, ponctuation intelligente, mettre à jour les métadonnées dans le livre à partir des métadonnées dans la bibliothèque calibre, manipuler la jaquette de livre, etc. Pour utiliser cet outil allez dans <i>Préférences-&gt;Barre d'outils</i> et ajoutez l'outil Peaufinez les livres à la barre d'outil principale. Sélectionnez alors simplement les livre que vous voulez voir peaufinés et cliquez le bouton Peaufiner les livres. Peaufiner, contrairement à conversion, ne change pas la structure interne/le balisage de votre livre, il exécute seulement l'ensemble des actions minimales nécessaires à l'achèvement de son objectif. Notez que peaufiner un livre ne fonctionne uniquement avec des livres numériques aux formats EPUB et AZW3.
pt_br: Polir livros é sobre colocar o brilho da perfeição nos seus e-books. Você pode usá-lo para incorporar fontes referenciadas, criar subconjuntos de fontes, pontuação inteligente, atualizar metadados nos arquivos de livros a partir dos metadados na biblioteca do calibre, manipular a capa do livro, etc. Para usar esta ferramenta, vá em <i>Preferências-&gt;Barra de Ferramentas</i> e adicione a ferramenta Polir Livros à barra de ferramentas principal. Então selecione os livros que você deseja polir e clique no botão Polir Livros. Polir, diferente de converter, não altera a estrutura/marcação interna do seu livro, apenas realiza o menor conjunto de ações necessárias para atingir seus objetivos. Note que o polimento de livros somente funciona com e-books nos formatos EPUB e AZW3.
uk: Удосконалення книг полягає у виправленні найменших недоліків у ваших файлах електронних книг. Ви можете скористатися ним для вбудовування еталонних шрифтів або їхніх підмножин, нормалізації пунктуації, оновлення метаданих у файлах книг на основі метаданих з бібліотеки calibre, обробки суперобкладинки книги тощо. Щоб скористатися цим засобом, перейдіть на сторінку <i>Налаштування -&gt; Панелі інструментів</i> і додайте кнопку засобу «Удосконалення книг» на головну панель інструментів. Далі просто позначте книги, які слід удосконалити, і натисніть кнопку «Удосконалити книги». Удосконалення, на відміну від перетворення, не змінює внутрішньої структури або розмітки вашої книги, — воно лише виконує мінімальних набір дій, потрібних для досягнення мети. Зауважте, що удосконалення книг працює лише для електронних книг у форматах EPUB та AZW3.
