Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Edit book: Fix a regression that caused pasting copied text from programs that generate both HTML and plain text when copying to paste the HTML in preference to the plain text
fr: Éditer le livre : Solutionne une régression qui entraîne que le texte copié de programmes qui génèrent en même temps du HTML et du texte brut soit collé en HTML en préférence au texte brut

source: Add support for sideloading of KFX files created with the third-party KFX calibre plugin
fr: Ajout de la prise en charge des fichiers KFX latéraux créés par l'extension calibre tierce KFX

source: Edit book: Allow drag and drop of image files, stylesheets and HTML files into the editor to insert the appropriate &lt;img&gt; and &lt;link&gt; tags and add the files to the book automatically
fr: Éditer le livre : Permettre le glisser déposer de fichiers images, de feuilles de style, de fichiers HTML dans l'éditeur pour insérer les balises &lt;img&gt; et &lt;link&gt; appropriées et ajouter automatiquement les fichiers au livre

source: Kobo driver: Add support for updated firmware
fr: Pilote Kobo : Prise en charge du firmware mis à jour

source: Edit book: Spell check: If there are no suggestions fill the suggested word box with the original word
fr: Éditer le livre : Vérifier l'orthographe : S'il n'y a pas de suggestion remplir la case du mot suggéré avec le mot original

source: Viewer: add a shortcut (Ctrl+F11) to show/hide toolbars
fr: Visionneuse : ajout d'un raccourci (Ctrl+F11) pour afficher/cacher les barres d'outils

source: PDF output: Fix courier font not being rendered when converting on Windows
fr: Format PDF en sortie pour la conversion : Solutionne le fait que la police courier ne soit pas déclarée lors de la conversion sous Windows

source: E-mail delivery: Add a Message-ID header when sending emails. Reduces probability of mails sent from calibre being marked as spam
fr: Envoi de courriel : Ajout d'une en-tête Message-ID lors de l'envoi de courriels. Réduit la possibilité que les courriels envoyés par calibre soient marqués comme spam

source: Save to disk: Fix path shortening being applied to entire save template even when saving to singe directory
fr: Enregistrer sur le disque : Solutionne que le raccourcissement du chemin soit appliqué à l'entièreté du modèle sauvé même lors de la sauvegarde vers un seul répertoire

source: Get books: Update the Virualo and Publi store plugins for website changes
fr: Obtenir des livres : Mise à jour de l'extension de la boutique Virualo et Publi suite à des changements sur le site web

source: Viewer: Fix regression that caused slow opening of some books with missing font/CSS/image files
fr: Visionneuse : Solutionne une régression qui entraîne une ouverture lente de certains livres auxquels il manque des fichiers police/CSS/image

source: Viewer: Pressing Ctrl+F in fullscreen mode should show the controls
fr: Visionneuse : Appuyer sur Ctrl+F en mode plein écran affichera les contrôles

source: Edit book: Do not allow creating multiple new files whose names differ only by case
fr: Éditer le livre : Ne pas permettre la création de multiples nouveaux fichiers dont les noms diffèrent uniquement par la casse

source: Viewer: Use heuristics to try to detect comics encoded as fixed layout EPUBs to ensure they are displayed as intended
fr: Visionneuse : Utiliser l'heuristique pour essayer de détecter les bandes dessinées encodées comme des EPUBs à mise en page fixée pour assurer qu'elles s'affichent comme envisagé

source: Windows: Make recently opened books show up in the jump lists for the standalone viewer and editor programs
fr: Windows : Faire apparaître les livres récemment ouverts dans la les listes de raccourcis des programmes autonomes visionneuse et éditeur

source: macOS/Linux: Show an informational popup message when an Android device is plugged in that needs the user to tap Allow for the connection to work
fr: macOS/Linux : Faire apparaître un message d'information lorsqu'un périphérique Android est connecté qui nécessite que l'utilisateur appuie Permettre pour que la connexion fonctionne

source: Conversion: Log options that are different from the defaults separately, for easy reference
fr: Conversion : Options de consignation qui sont différentes de celles par défaut, pour une consultation plus facile

source: 2.79.1 fixes a regression in 2.79.0 that broke the file open dialogs on Windows Vista
fr: 2.79.1 solutionne une régression dans 2.79.0 qui endommage la boite de dialogue d'ouverture des fichiers sous Windows Vista

source: Conversion: Fix regression that broke conversion of some EPUB files when using the 'Remove first image' option
fr: Conversion : Solutionne une régression qui endommage la conversion de certains fichiers EPUB quand l'option 'Supprimer la première image' est utilisée

source: Get books: Update Kobo plugin for website changes
fr: Obtenir des livres : Mise à jour de l'extension Kobo en raison de changements sur le site web

source: Windows MTP driver: Fix error when enumerating device storage not being reported during debug device detection
fr: Pilote MTP Windows : Solutionne une erreur lors de l'énumération de la capacité de stockage qui n'est pas reportée pendant le débogage de la détection du périphérique

source: Tag browser: When dragging and dropping a book onto a series increment the series number
fr: Navigateur d'étiquettes : Le glisser et déposer d'un livre sur une série incrémente le numéro de série

source: Fix crash when generating covers with Qt 5.8 on Linux
fr: Solutionne un plantage lors de la génération d'une couverture sous Linux avec Qt 5.8

source: Fix Get books result list and jobs list not being populated on Qt 5.8
fr: Solutionne le fait que la liste des résultats Obtenir des livres et la liste de tâches ne soient pas peuplées sous Qt 5.8

source: Fix importing rules in the coloring/icon rules dialog not enabling the Apply button
fr: Solutionne le fait que l'importation de règles dans la boîte de dialogue des règles de coloration/icône n'active pas le bouton Appliquer

source: View button: Add an action to the right click menu that always opens the book with the calibre viewer, regardless of the preferences
fr: Bouton visionneuse : Ajout d'une action au menu contextuel qui ouvre toujours le livre dans la visionneuse calibre, indépendamment des préférences

source: Kobo driver: Update to support the newest firmware from Kobo
fr: Pilote Kobo : Mise à jour pour prendre en charge le tout nouveau firmware de Kobo

source: E-book viewer: Allow opening a specific item from the Table of Contents via the --open-at command line parameter
fr: Visionneuse de livre numérique : Permettre l'ouverture d'un élément spécifique de la Table des Matières via le paramètre --open-at en ligne de commande

source: Amazon metadata download: Add support for downloading from Amazon.ca
fr: Téléchargement de métadonnées Amazon : Ajout de la prise en charge du téléchargement depuis Amazon.ca

source: Edit book: Do not condense CSS rules when saving AZW3 files regardless of the value of Preferences-&gt;Common options-&gt;Look &amp; feel-&gt;Expand CSS
fr: Éditer le livre : Ne pas condenser les règles CSS lors de la sauvegarde des fichiers AZW3 indépendamment de la valeur de Préférences-&gt;Options communes-&gt;Apparence et présentation-&gt;Développer le CSS

source: EPUB output: Fix a duplicate id created in rare circumstances when splitting on page breaks
fr: Format EPUB en sortie pour la conversion : Solutionne le fait q'un double id est créé dans de rares circonstances lors de la division sur des sauts de page

source: DOCX input: Fix error when converting documents that have images pointing to web resources
fr: Format DOCX en entrée pour la conversion : Solutionne une erreur lors de la conversion de documents qui ont des images pointant vers des ressources web

source: E-book viewer: Fix a regression that caused an increase in load times when loading the individual HTML files inside an EPUB book
fr: Visionneuse de livres numériques : Solutionne une régression qui cause une augmentation des temps de charge lors du chargement de fichiers HTML individuels dans un livre EPUB

source: Fix setting a similar books search to use the formats field in Preferences-&gt;Searching resulting in an error
fr: Solutionne le fait que paramétrer la recherche groupée de livres similaires en utilisant le champ formats dans Préférences-&gt;Rechercher provoque une erreur

source: Kobo driver: Fix incorrect cover size being uploaded to the Glo HD
fr: Pilote Kobo : Solutionne le fait qu'une couverture de taille incorrecte soit envoyée à la GLO HD

source: E-book viewer: Fix 'View image' right click menu action not available for SVG files included via &lt;img&gt; tags
fr: Visionneuse de livre numérique : Corrige le fait que faire un clic droit sur 'Voir l'image' n'est pas disponible pour les fichiers SVG intégrés via les balises &lt;img&gt;

source: HTML input: Remove the # character from input filenames, for maximum compatibility
fr: Format HTML en entrée pour la conversion : Supprime le caractère # des noms de fichier d'entrée pour une compatibilité maximale

source: Edit book: Fix Spell check treating the unicode hyphen (U+2010) differently from the normal hyphen (U+002d)
fr: Édition du livre : Solutionne la différence de traitement par le correcteur d'orthographe du tiret unicode (U+2010) et du tiret normal (U+002d)

source: Conversion: Fix changing the cover image not updating references to the old cover image inside SVG wrappers
fr: Conversion : Corrige le fait que le changement de couverture ne met as à jour les références à l'ancienne image de couverture dans emballages SVG

source: E-book viewer: Fix a regression that caused clicking links in the footnote popup window to stop working
fr: Visionneuse de livre numérique : Répare une régression qui empêchait les liens de fonctionner quand on cliquait dessus, dans la fenêtre bondissante des notes de bas de page

source: Edit book: Fix importing DOCX file as new book not setting the version attribute in the OPF
fr: Édition du livre : Répare l'attribution de la version dans l'OPF quand on importait un DOCX comme nouveau livre

source: Kindle driver: Fix some newer KFX books not being recognized on e-ink Kindle devices, because of a change in how metadata is stored in the KFX format
fr: Pilote Kindle : Correction pour certains nouveaux livres au format KFX non reconnus sur les liseuses Kindle à cause d'un changement dans la méthode de stockage des métadonnées dans le format KFX.

source: DOCX output: Fix missing &lt;td&gt; tag causing conversion to fail
fr: Format DOCX en sortie : Solutionne le problème de conversion lié au tag &lt;td&gt; manquant

source: Edit book: Fix group references causing errors when used in replace string in the normal mode search and replace
fr: Éditer le livre : Corrige le fait que les références groupées entraînent des erreurs quand elles sont utilisées dans une chaîne de remplacement dans le mode normal rechercher et remplacer

source: Edit book: Fix Check Book reporting a spurious mime/type mismatch error after replacing a file with a file having a different mime type
fr: Éditer le livre : Corrige le fait que Vérifier le livre rapporte une erreur infondée d'inadéquation du mime/type après le remplacement d'un fichier avec un fichier ayant un mime type différent

source: Amazon metadata download: Fix detection of series not working for some books due to changes in the Amazon website
fr: Téléchargement de métadonnées depuis le site d'Amazon: Solutionne la détection du champ série qui ne fonctionnait pas pour certains livres suite à des changements du site web Amazon.

source: Fix Nook HD+ not being detected on Windows
fr: Solutionne le problème de la liseuse Nook HD+ non détecté sous Windows.

source: Edit book: Ensure keyboard focus stays with Files Browser when renaming files
fr: Éditer le livre : Assurer que le focus du clavier reste sur le Navigateur de Fichiers lors du renommage de fichiers

source: E-book viewer: Fix a regression in the previous release that broke the viewer on systems where the temporary directory is a symlink (common on macOS)
fr: Visionneuse de livre numérique : Solutionne une régression dans la version précédente qui endommage la visionneuse sur les systèmes où le répertoire temporaire est un lien symbolique (courant sous macOS)

source: EPUB input: Fix EPUB2 files that specify a cover image via a &lt;meta&gt; tag but not in the &lt;guide&gt; not getting a cover when converted to PDF
fr: Format EPUB en entrée pour la conversion : Corrige le fait que les fichiers EPUB2 qui spécifient une image de couverture vie la balise&lt;meta&gt; mais pas dans &lt;guide&gt; ne jouissent pas d'une couverture quand il sont convertis en PDF

source: PDF output: Fix conversion failure when input document contains first page with no renderable content
fr: Format PDF en sortie pour la conversion : Corrige une défaillance dans la conversion lorsque le document d'entrée contient une première page sans contenu présentable

source: Editor: Fix incorrect handling of some regular expressions in the Search tool
fr: Éditeur : Correction de la mauvaise gestion de certaines expressions régulières dans l'outil de Recherche

source: macOS: Fix dynamically generated context menus, such as the sort by menu not working
fr: macOS : Correction des menus contextuels générés dynamiquement, tel que le menu trier par qui ne fonctionnait pas

source: Fix a crash when running with assertions turned on in Qt
fr: Corrige un plantage lorsque le l'on exécute calibre avec les assertions activées dans Qt

source: Edit book: Reports tool: Fix an error when right clicking on items in the Links view
fr: Éditer le livre : Outil Rapports : Corrige une erreur lorsque l'on fait un clic droit sur des éléments dans la vue Liens

source: Happy Holidays everyone!
fr: Joyeuses Fêtes à tout le monde !

source: Add support for new Kobo firmware version 4.2
fr: Ajout du support de la version 4.2 du nouveau firmware pour la liseuse Kobo.

source: Allow using amazon_in, amazon_au, amazon_com identifiers in the Book details panel
fr: Permettre l'utilisation des identifiants amazon_in, amazon_au, amazon_com dans le panneau Détails du livre

source: Version 2.75.1 has fixes for a regression in 2.75.0 that broke the Live CSS feature in the editor and caused some minor problems in the viewer
fr: La version 2.75.1 corrige une régression introduite dans la version 2.75.0 qui cassait la fonctionnalité CSS en temps réel dans l'éditeur et causait des problèmes mineurs dans la visionneuse

source: Kobo driver: Fix incorrectly sized covers being sent to some Kobo devices
fr: Pilote Kobo : Solutionne le fait qu'une couverture de taille incorrecte soit envoyée à certaines liseuses Kobo

source: E-book viewer: Prevent javascript in the book from accessing files on the computer using XMLHttpRequest
fr: Visionneuse de livre numérique : Empêche le javascript présent dans le livre d'accéder aux fichiers sur l'ordinateur en utilisant XMLHttpRequest

source: Edit book: Fix the 'Search ignoring markup tool' not ignoring comments/processing instructions, etc
fr: Éditer le livre : Solutionne 'l'outil de recherche ignorant le balisage' qui n'ignorait pas les commentaires/instructions de traitement, etc.

source: CSS Transforms: Fix 'is'/'is not' rules not matching 'currentColor'
fr: Transformation du CSS : Solutionne les règles 'est'/'n'est pas' ne correspondant pas à 'currentColor'

source: E-book viewer: Make the swipe up gesture move to next section instead of previous section
fr: Visionneuse de livre numérique : Faire en sorte que le geste de balayage vers le haut déplace vers la section suivante plutôt que la section précédente

source: Edit book: Allow the Spell check dialog and the search panel to be made much narrower than before
fr: Éditer le livre : Permettre à la boîte de dialogue de Correction Orthographique et au panneau de recherche d'avoir un rendu plus étroit que précédemment

source: Edit book: Fix customize template window not freely resizable on Windows
fr: Éditer le livre : Solutionne le fait que la fenêtre de modèle personnalisé n'était pas librement redimensionnable sous Windows

source: Edit book: Fix newlines not being matched by the 'Search ignoring markup' tool
fr: Éditer le livre : Solutionne le fait que les sauts de ligne n'étaient pas pris en compte par l'outil 'Rechercher en ignorant le balisage'

source: EPUB input: Fix incorrect handling of HTML files that are in a folder above the OPF file
fr: Document EPUB en entrée pour la conversion vers un autre format : Solutionne une prise en charge incorrecte des fichiers HTML qui sont dans un répertoire en dessous du fichier OPF

source: Amazon metadata download: Allow downloading from Amazon.cn as well. To use go to Preferences-&gt;Metadata download and customize the Amazon plugin to download from Amazon.cn
fr: Téléchargement de métadonnées Amazon : Permettre également le téléchargement à partir de Amazon.cn. Pour l'utiliser allez dans Préférences->Télécharger les métadonnées et personnalisez l'extension Amazon pour télécharger à partir de Amazon.cn

source: Edit book: Allow disabling the 'Files already arranged into folders' message popup
fr: Éditer le Livre : Permettre la désactivation de la boîte de dialogue 'Les fichiers dans ce livre sont déjà organisés dans des dossiers'

source: Edit book: Fix selected text not being fully highlighted when using the solarized color schemes
fr: Éditer le Livre : Solutionne le fait que le texte sélectionné n'est pas entièrement mis en évidence lors de l'utilisation du schéma de couleur solarisé

source: calibredb: Fix CSV output for the check_library command not being properly escaped
fr: calibredb : Solutionne le fait que la sortie CSV de la commande check_library n'est pas proprement échappée

source: Fix subsetting of fonts whose names start with 'and' not working
fr: Solutionne le problème de création de sous-ensembles de polices dont le nom commence par 'and'.

source: Fix a regression in 2.72 that broke the --start-in-tray command line option
fr: Correction d'une régression dans la version 2.72 qui casse l'option --start-in-tray en ligne de commande.

source: Fix third party plugins that create dynamic context menus not working in Linux
fr: Solutionne une extension tierce qui crée des menus contextuels dynamiques ne fonctionnant pas sous Linux

source: DOCX input: Fix images wider than 50% of the page width being incorrectly right aligned even when anchored to the center of the page
fr: Document DOCX en entrée pour la conversion vers un autre format : Solutionne le fait que des images plus larges que 50% de la largeur de page soient incorrectement alignées à droite même lorsque elles ont été ancrées au centre de la page

source: Catalog generation: Ensure all citation keys in BiBTeX catalogs have only ASCII characters
fr: Génération de catalogue : Assurer que toutes les citations clés dans les catalogues BiBTeX aient uniquement des caractères ASCII

source: Get books: Update ebookpoint and legimi plugins for website changes
fr: Obtenir des Livres : Mise à jour des extensions ebookpoint et legimi en raison de changements sur le site web

source: EPUB3 metadata: Ensure updating metadata never produces empty dc:contributor elements
fr: Métadonnées EPUB3 : Assurer que la mise à jour des métadonnées ne produise jamais des éléments dc:contributor vides

source: DOCX output: Fix an error when converting tables with spanning cells
fr: Format DOCX en sortie : Correction d'une erreur dans la conversion des tableaux ayant des cellules fusionnées

source: Nicer error message if the user tries to import data while the Content server is running
fr: Meilleur message d'erreur apparaissant si l'utilisateur essaye d'importer des données alors que le serveur de contenu est activé.

source: Add a preference in Preferences-&gt;Look &amp; feel to hide the row numbers in the main book list
fr: Ajout d'une préférence dans Préférence-&gt;Apparence et Présentation pour cacher les numéros de ligne dans la liste de livres principale

source: Allow Export/import of column coloring and icon rules
fr: Permettre l'Exportation/importation des règles de coloration et d'icône de colonne

source: Edit book: Allow bulk changing of file extension for selected files by right clicking on the selected files in the file browser
fr: Éditer le Livre : Permettre le changement par lot de l'extension pour les fichiers sélectionnés en faisant un clic droit sur ceux-ci dans l'explorateur de fichiers

source: Edit book: Check Book: Add a check for new documents that contain no ToC in EPUB 3 books
fr: Éditer le Livre : Vérifier le Livre : Ajout d'une vérification pour les nouveaux documents qui ne contiennent pas de TdM dans les livres EPUB 3

source: Edit book: Check Book: Add a test to check if the embedded fonts in the book have their embedding permissions enabled
fr: Éditer le Livre : Vérifier le livre : Ajout d'un test pour vérifier que les polices intégrées dans le livre ont leurs permissions d'intégration activées

source: Pressing the up arrow in an date edit with undefined value should jump to the current date rather than Feb 101
fr: Appuyer sur la flèche vers le haut dans l'édition d'une date avec une valeur indéfinie doit sauter vers la date courante plutôt que Fev 101

source: EPUB input: When an invalid nav based ToC is used in an EPUB 3.0 document that also has a fallback NCX ToC, use the fallback ToC
fr: Document EPUB en entrée pour la conversion vers un autre format : Lorsqu'un nav invalide basé sur une TdM est utilisé dans un document EPUB 3 qui a également une TdM NCX en repli, utilise la TdM de repli

source: Fix a regression that broke the icon theme creation tool in the previous release
fr: Solutionne une régression qui endommage l'outil de création de thème d'icônes dans la version précédente

source: Fix insert character dialog not reflowing characters on resize. Also only allow the Search bar in the dialog to get input focus
fr: Solutionne la boîte de dialogue d'insertion de caractère qui n'impacte pas les caractères lors du redimensionnement. Permettre également que seule la boîte de recherche ait le champ de saisie

source: Font embedding: Implement automatic embedding for fonts with non-normal stretch and weight values such as Condensed/Light/Extra Bold fonts
fr: Intégration de police : Mise en œuvre de l'intégration automatique pour les polices avec des valeurs stretch et weight en dehors de la norme telles que les polices Condensed/Light/Extra Bold

source: Allow aborting an in-progress Copy-to-library action
fr: Permettre l'annulation en cours d'exécution d'une opération Copier vers la bibliothèque

source: Edit book: When adding a font file via File-&gt;New automatically generate the appropriate @font-face rule and copy it to the clipboard so that it can be easily inserted into the appropriate CSS files
fr: • Éditer le Livre : Lors de l'ajout d'une police via Fichier-&gt;Nouveau, la règle @font-face appropriée est automatiquement générée et copiée vers le presse-papier. De cette manière elle peut être insérée dans les fichiers CSS appropriés

source: Edit book: Check Book: Add a warning for links with the : character in them on Windows
fr: Éditer le livre : Vérifier le Livre : Ajout d'un message d'alerte pour les liens contenant le caractère ":" sous Windows

source: Conversion: When converting Markdown documents recognize basic metadata in the Markdown document formatted as per the Markdown metadata extension
fr: Conversion : Lors de la conversion de documents Markdown, reconnaissance basique des métadonnées dans le document Markdown telles que formatées par l'extension de métadonnées Markdown
