Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Browser viewer: Fix body font being forced to sans-serif, overriding in book and user stylesheet settings
es: Visor de navegador: Se corrige que el tipo de letra del cuerpo sea sans-serif, anulando la configuración del libro y de la hoja de estilo del usuario
fr: Visionneuse du navigateur : Solutionne le fait que la police du corps de texte soit forcée à sans-serif, outrepassant les paramètres du livre et de la feuille de style utilisateur
pt_br: Visualizador do navegador: Corrige a fonte do elemento 'body' sendo forçada a usar sans-serif, sobrescrevendo as definições do livro e folha de estilos do usuário
uk: Панель навігації файловою системою: виправлено примусове встановлення шрифту з засічками для основного тексту, яке перевизначало параметри книги і таблиці стилів користувача.

source: Fix sending email failing of the computer's FQDN is set to a single period.
es: Se corrige el error de envío de correo electrónico cuando el nombre de domino completamente cualificado del equipo es simplemente un punto.
fr: Correction de l'échec d'envoi de courriel si le NDCQ de l'ordinateur est paramétré à un seul point.
pt_br: Corrige enviar e-mail falhando se o FQDN do computador estiver definido como apenas um ponto.
uk: Усунено неможливість надсилання пошти, якщо повну доменну назву комп'ютера було встановлено на окремий період.

source: Kindle driver: Add support for the new Kindle Oasis
es: Dispositivo Kindle: Se añade soporte para el nuevo Kindle Oasis
fr: Pilote Kindle : Ajout de la prise en charge de la nouvelle Kindle Oasis
pt_br: Driver do Kindle: Adiciona support para o novo Kindle Oasis
uk: Драйвер Kindle: додано підтримку нової Kindle Oasis

source: Browser viewer: Allow the user to specify a CSS style sheet to control the look and feel of the text
es: Visor de navegador: Se permite al usuario especificar una hoja de estilo CSS para controlar la apariencia del texto
fr: Visionneuse du navigateur : Permettre à l'utilisateur de spécifier une feuille de style CSS pour contrôler l'apparence du texte
pt_br: Visualizador do navegador: Permite ao usuário especificar uma folha de estilo CSS para controlar a aparência do texto
uk: Перегляд у навігаторі: уможливлено визначення користувачем таблиці стилів CSS для керування виглядом і поведінкою тексту

source: Edit book spell check: In the list of suggestions show the original word in italics.
es: Corrector ortográfico del editor: En la lista de sugerencias, se muestra la palabra original en cursiva.
fr: Vérification orthographique de l'éditeur : Dans la liste des suggestions afficher le mot original en italique.
pt_br: Verificação ortográfica do Editor: Na lista de sugestões, mostrar a palavra original em itálico.
uk: Перевірка правопису у редакторі книг: у списку пропозицій початкове слово показано курсивом.

source: Edit Book: When adding a new HTML file, add it after the file being currently edited instead of at the end.
es: Modificar libro: Al añadir un nuevo archivo HTML, se añade después del archivo que se está modificando en lugar de al final.
fr: Éditer le livre : Lors de l'ajout d'un nouveau fichier HTML, l'ajouter après le fichier actuellement édité plutôt qu'à la fin.
pt_br: Editar livro: Ao adicionar um novo arquivo HTML, adiciona-o depois do arquivo sendo editado, em vez de no final.
uk: Редактор книг: при додаванні нового файла HTML, додавання тепер виконується після поточного редагованого файла, а не у кінець списку файлів.

source: Column coloring: Add a contains rule type.
es: Coloreado de columnas: Se añade un nuevo tipo regla «contiene».
fr: Coloration de colonne : Ajout d'une règle de type 'contient'.
pt_br: Cor das colunas: Adicionar uma regra do tipo 'contém'.
uk: Розфарбовування стовпчиків: додано тип правила вмісту.

source: Book details panel: Allow saving the displayed cover to disk via the right click context menu.
es: Panel de detalles del libro: Se permite guardar la portada mostrada en el disco a través del menú contextual del botón derecho.
fr: Panneau Détails du livre : Permettre d'enregistrer la couverture affichée sur le disque via le menu contextuel (clic droit).
pt_br: Painel de detalhes do livro: Permite salvar no disco a capa mostrada via menu de contexto com um clique do botão direito.
uk: Панель подробиць щодо книги: уможливлено збереження показаного зображення обкладинки на диск за допомогою контекстного меню.

source: Browser viewer: Fix font size and color scheme settings not being respected in the footnote popup
es: Visor de navegador: Se corrigen los ajustes de tamaño de tipo de letra y el esquema de colores que no se respetaban en la ventana emergente de notas
fr: Visionneuse du navigateur : Correction des paramètres de taille de police et de modèle de couleurs n'étant pas respectés dans la note de pied de page 'surgissante'
pt_br: Visualizador do navegador: Corrige a configuração de tamanho e cor da fonte não sendo respeitada no pop-up da nota de rodapé
uk: Засіб перегляду електронних книг: виправлено помилку, пов'язану із тим, що розмір шрифту та схема кольорів не застосовувалися на контекстній панелі виносок.

source: DOCX Output: Fix comments/XML processing instructions in the middle of text causing text to be skipped.
es: Salida DOCX: Se corrige un fallo por el que los comentarios e instrucciones de procesado XML en el medio del texto hacían que el texto se omitiera.
fr: Format DOCX en sortie : Correction des instructions de traitement des commentaires/XML au milieu du texte entraînant le fait que le texte soit ignoré.
pt_br: Saída DOCX: Corrige instruções de processamento dos comentários/XML no meio do texto fazendo com que o texto fosse ignorado.
uk: Виведення даних DOCX: виправлено інструкції обробки коментарів/XML всередині тексту — тепер вони не спричиняють зникнення частини тексту.

source: Book details panel: Fix metadata field titles not being top aligned
es: Panel de detalles del libro: Corregido el fallo por el que los títulos de campos de metadatos no estaban alineados en la parte superior
fr: Panneau Détails du livre : Correction des titres des champs de métadonnées n'étant pas alignés vers le haut.
pt_br: Painel de detalhes do livro: Corrige os títulos de campos de metadados não estando alinhados pelo topo
uk: Панель подробиць щодо книги: виправлено помилку, пов'язану із тим, що заголовки полів метаданих не вирівнювалися вгору.

source: Linux: Fix long startup delay on systems that do not have a desktop notification service running
es: Linux: Se corrige un largo retraso de inicio en los sistemas que no tienen un servicio de notificación de escritorio en ejecución
fr: Linux : Correction du long délai de démarrage sur des systèmes qui n'ont pas de service de notification du bureau en exécution
pt_br: Linux: Corrige o longo atraso na inicialização em sistemas que não possuem um serviço de notificação rodando
uk: Linux: пришвидшено запуск у системах, де не було запущено службу сповіщень стільниці.

source: 3.11.1 fixes a couple of regression in 3.11.0 that broke configuring Get books and creating catalogs
es: 3.11.1 corrige un par de regresiones en 3.11.0 que estropeaban la configuración de obtener libros y la creación de catálogos
fr: 3.11.1 corrige quelques régressions de la version 3.11.0 qui avaient endommagé les réglages de Obtenir des livres et de la création de catalogues
pt_br: A versão 3.11.1 corrige algumas regressões na versão 3.11.0 que danificaram a configuração de 'Obter livros' e da criação de catálogos
uk: У версії 3.11.1 виправлено пару регресій у 3.11.0, які призводили до неможливості налаштувати отримання книг та унеможливлювали створення каталогів

source: Browser viewer: Show footnotes in a popup window. Similar to the popup footnote functionality in the calibre viewer.
es: Visor del navegador: Se muestran las notas al pie de página en una ventana emergente, de manera similar a la función de nota emergente en el visor de calibre.
fr: Visionneuse du navigateur : Afficher les notes de bas de page dans une fenêtre surgissante. Similaire à la fonctionnalité note de bas de page surgissante dans la visionneuse calibre.
pt_br: Visualizador do navegador: Mostra notas de rodapé em uma janela pop-up. Similar à funcionalidade de notas de rodapé pop-up no visualizador do calibre.
uk: Панель навігації: показ виносок у контекстному вікні. Подібне до функціональних можливостей контекстних виносок у засобі перегляду книг calibre.

source: Content server: Add an option to control the timeout for making AJAX queries to the server.
es: Servidor de contenidos: Añadida una opción para controlar el tiempo de espera al hacer peticiones AJAX al servidor.
fr: Serveur de contenu : Ajout d'une option pour contrôler le délai pour effectuer les requêtes AJAX sur le serveur.
pt_br: Servidor de conteúdo: Adiciona uma opção para controlar o tempo limite para fazer consultas AJAX ao servidor.
uk: Сервер даних: додано параметр керування часом очікування для запитів AJAX до сервера.

source: Fix regression that broke Preferences-&gt;Conversion-&gt;Common options in version 3.9
es: Corregida una regresión que estropeaba Preferencias &gt; Conversión &gt; Opciones comunes en la versión 3.9
fr: Correction d'une régression qui a endommagé Préférences-&gt;Conversion-&gt;Options communes dans la version 3.9
pt_br: Corrige uma regressão que danificou o item 'Preferências-&gt;Conversão-&gt;Opções comuns' na versão 3.9
uk: Виправлено регресію, яка заважала користуватися параметрами «Налаштування -&gt; Перетворення -&gt; Загальне» у версії 3.9

source: Server: Fix adding expressions to the search always using AND instead of respecting the setting to use OR or AND.
es: Servidor: Se corrige el fallo por el que al añadir expresiones a la búsqueda siempre se usaba Y, en lugar de obedecer la configuración para usar O o Y.
fr: Serveur : Correction des expressions d'ajout pour la recherche utilisant toujours AND au lieu de respecter le paramètre pour utiliser OR ou AND.
pt_br: Servidor: Corrige a adição de expressões para pesquisa sempre utilizando o operador E, em vez de respeitar a configuração para usar OU ou E.
uk: Сервер: виправлено помилку, пов'язану із тим, що додавання виразів до пошуку завжди призводило до використання логічної дії «І» замість враховування параметра використання «АБО» чи «І».

source: Browser viewer: Fix a regression that caused loading more than one book in the same session or using the back/forward browser buttons to require refreshing the browser.
es: Visor del navegador: Corregida una regresión que hacía que al cargar más de un libro en la misma sesión o usar los botones adelante o atrás del navegador fuera necesario refrescar el navegador.
fr: Visionneuse du navigateur : Corrige une régression pour requérir un rafraîchissement du navigateur qui entraînait le chargement de plus d'un livre dans la même session ou en utilisant les boutons précédente/suivante.
pt_br: Visualizador do navegador: Corrige uma regressão que fazia com que o carregamento de mais de um livro na mesma sessão ou usar os botões de voltar/avançar do navegador requirissem que a página fosse recarregada.
uk: Панель навігації: виправлено регресію, яка спричиняла те, що завантаження декількох книг у один сеанс або використання кнопок «вперед-назад» на панелі навігації потребувало оновлення вмісту панелі навігації.

source: Jobs list: Fix killing of job killing the wrong job if other jobs are completed while waiting for kill confirmation.
es: Lista de tareas: Se corrige el fallo por el que al cancelar una tarea se cancelaba otra tarea si la primera se completaba mientras se esperaba confirmación.
fr: Liste des tâches : Correction de l'arrêt d'une tâche arrêtant la mauvaise tâche si d'autres tâches sont achevées pendant l'attente de la confirmation d'arrêt.
pt_br: Lista de tarefas: Corrige um erro ao parar tarefas causando a interrupção da tarefa errada se outras fossem concluídas enquanto era aguardada a confirmação de interrupção.
uk: Список завдань: виправлено помилку, пов'язану із тим, що кнопка вбиття завдання завершувала не те завдання, якщо під час очікування на підтвердження вбиття завершувалося виконання інших завдань.

source: DOCX Output: Fix preserve cover aspect ratio option still distorting the aspect ratio slightly.
es: Salida DOCX: Se corrige el fallo por el que la opción de mantener proporciones de la portada causa una ligera distorsión en las proporciones.
fr: Format DOCX en sortie : Solutionne le fait que la fonction de préservation du ratio d'aspect des couvertures continue à fausser légèrement le ratio d'aspect.
pt_br: Saída DOCX: Corrige a opção de preservar a proporção da capa ainda distorcendo a proporção levemente.
uk: Виведення до DOCX: виправлено помилку, пов'язану із тим, що пункт збереження співвідношення розмірів все ж дещо викривляв співвідношення розмірів.

source: Remove the Connect to iTunes function since Apple has removed that functionality from iTunes
es: Eliminada la función conectar a iTunes, ya que Apple ha eliminado esa funcionalidad de iTunes
fr: Suppression de la fonction Connecter à iTunes vu que Apple a retiré cette fonctionnalité de iTunes
pt_br: Remove a função 'Conectar ao iTunes', uma vez que a Apple removeu esta funcionalidade do iTunes
uk: Вилучено функціональну можливість з'єднання з iTunes, оскільки Apple вилучено цю можливість з iTunes

source: Now you have to use one of the wireless connection methods to connect to an iPad/iPhone, as described at: <a href="%(h0)s">%(h0)s</a>
es: Ahora debe utilizar uno de los métodos de conexión inalámbrica para conectarse a un iPad/iPhone, como se describe en: <a href="%(h0)s">%(h0)s</a>
fr: Dorénavant vous devez utiliser une des méthodes de connexion sans fil pour se connecter à un iPad/iPhone, comme décrit sur : <a href="%(h0)s">%(h0)s</a>
pt_br: Agora você precisa utilizar um dos métodos de conexão sem fio para se conectar a um iPad/iPhone, como descrito em: <a href="%(h0)s">%(h0)s</a>
uk: Тепер вам слід користуватися одним зі способів бездротового з'єднання для встановлення з'єднаня з iPad або iPhone, як це описано тут: <a href="%(h0)s">%(h0)s</a>

source: Kobo driver: Support for new firmware
es: Controlador Kobo: Soporte para nuevo firmware
fr: Pilote Kobo : Prise en charge du nouveau firmware
pt_br: Driver do Kobo: Suporte para o novo firmware
uk: Драйвер Kobo: реалізовано підтримку нової мікропрограми

source: Allow changing the icons in yes/no columns via column icon rules.
es: Se permite cambiar los iconos en las columnas sí/no mediante las reglas de icono de columna.
fr: Permettre le changement des icônes dans les colonnes oui/non via les règles d'icône de colonne.
pt_br: Permite alterar os ícones em colunas sim/não via regras de ícones de coluna.
uk: Уможливлено зміну піктограм у стовпчиках «так/ні» за допомогою правила піктограм стовпчика.

source: Quickview panel: Add a context menu with a "View" action to the book table.
es: Panel de vista rápida: Se añade un menú contextual con una acción «Mostrar» al cuadro de libros.
fr: Panneau Affichage rapide : Ajout d'un menu contextuel à la table de livres avec une action "Visualiser".
pt_br: Painel de visualização rápida: Adiciona um menu de contexto com a ação "Visualizar" na tabela de livros.
uk: Панель швидкого перегляду: до таблиці книг додано контекстне меню із дією «Переглянути».

source: Make the elapsed time display in the jobs dialog more human friendly.
es: El tiempo transcurrido mostrado en el cuadro de diálogo de tareas se hace más comprensible.
fr: Rendre l'affichage du temps écoulé, dans la boîte de dialogue des tâches, plus adapté à l'humain.
pt_br: Torna o tempo decorrido mostrado na janela de tarefas mais amigável.
uk: Реалізовано зручніший показ даних щодо часу, який лишився до завершення виконання завдання, у діалоговому вікні поступу.

source: EPUB Input: Fix styles in existing titlepage not being flattened when the titlepage is preserved during conversion.
es: Entrada EPUB: Se corrige el fallo por el que los estilos en una página de título no se simplificaban si se mantenía la página de título durante la conversión.
fr: Format EPUB en entrée : Solutionne le fait que les styles dans les pages de titre existantes ne soient pas aplaties lorsque la page de titre est conservée durant la conversion.
pt_br: Entrada EPUB: Corrige os estilos da página de capa existente não sendo nivelados quando a capa é preservada durante a conversão.
uk: Вхідні дані EPUB: виправлено помилку, пов'язану із тим, що стилі у наявній титульній сторінці не спрощувалися, якщо титульна сторінка зберігалася під час перетворення.

source: Fix conversion of grayscale JPEG-XR images not working
es: Corregido el fallo por el que no funcionaba la conversión de imágenes JPEG-XR en tonos de gris
fr: Solutionne le fait que la conversion des images en nuance de gris JPEG-XR ne fonctionne pas
pt_br: Corrige falha na conversão de imagens JPEG-XR com escala de cinza
uk: Виправлено помилку, пов'язану із тим, що зображення JPEG-XR у тонах сірого кольору не працювали.

source: Update the douban metadata download plugin to match changes to the website
es: Actualizado el complemento de descarga de metadatos de douban según los cambios en el sitio web
fr: Mise à jour de l'extension de téléchargement de métadonnées Douban pour correspondre aux changements du site web
pt_br: Atualiza o plugin de Download de Metadados do Douban Books para se adequar às alterações do site
uk: Оновлено додаток отримання метаданих douban відповідно до змін на сайті.

source: DOCX Output: Fix the preserve cover aspect ratio option not visible
es: Salida DOCX: Se corrige el fallo por el que la opción de mantener las proporciones de la portada no era visible
fr: Format DOCX en sortie : Solutionne le fait que la fonction de préservation du ratio d'aspect des couvertures n'est pas visible
pt_br: Saída DOCX: Corrige opção de preservar proporção da capa não estando visível
uk: Виведення до DOCX: виправлено помилку, пов'язану із тим, що пункт збереження співвідношення розмірів був невидимим.

source: Bulk metadata edit dialog: Add an action to set metadata from e-book files.
es: Diálogo de modificación de metadatos en masa: Añadida acción para establecer metadatos a partir de archivos.
fr: Boîte de dialogue d'édition des métadonnées par lot : Ajout d'une action pour définir les métadonnées à partir des fichiers de livre numérique.
pt_br: Edição de metadados em lote: Adiciona uma ação para definir metadados a partir dos arquivos dos livros.
uk: Діалогове вікно пакетного редагування метаданих: додано пункт встановлення метаданих на основі даних з файлів електронних книг.

source: Server: Add an option to control the number of books displayed per page in the browser (Preferences-&gt;Sharing over the net-&gt;Advanced).
es: Servidor: Añadida una opción para controlar el número de libros mostrados por página en el navegador (Preferencias &gt; Compartir por la red &gt; Avanzado)
fr: Serveur : Ajout d'une option pour contrôler les nombre de livres par page dans le navigateur (Préférences-&gt;Partager sur le net-&gt;Avancé).
pt_br: Servidor: Adiciona uma opção para controlar o número de livros exibidos por página no navegador (Preferências-&gt;Compartilhar pela rede-&gt;Avançado).
uk: Сервер: додано можливість керування кількістю книг, які може бути показано на одній сторінці панелі навігації (Налаштування-&gt;Обмін мережею-&gt;Додатково).

source: DOCX Output: Add an option to preserve the cover aspect ratio in the output document.
es: Salida DOCX: Añadida una opción para mantener las proporciones de la portada en el documento de salida.
fr: Format DOCX en sortie : Ajout d'une option pour préserver le ratio d'aspect de la couverture dans le document de sortie.
pt_br: Saída DOCX: Adiciona uma opção para preservar a proporção da capa no documento de saída.
uk: Виведення до DOCX: додано пункт збереження співвідношення розмірів зображення обкладинки у документі.

source: Book details panel: An option to control the layout of the panel in 'Narrow' mode (Preferences-&gt;Look &amp; feel-&gt;Book details)
es: Panel de detalles del libro: Una opción para controlar la disposición del panel en modo «estrecho» (Preferencias &gt; Apariencia &gt; Detalles del libro)
fr: Panneau Détails du livre : Une option pour contrôler la mise en page du panneau en mode "condensé" (Préférences-&gt;Apparence &amp; présentation-&gt;Détails du livre)
pt_br: Painel de detalhes do livro: Uma opção para controlar o layout do painel em modo 'Estreito' (Preferências-&gt;Aparência-&gt;Detalhes do livro)
uk: Панель параметрів книги: додано параметр керування компонуванням панелі у «Вузькому» режимі (Налаштування-&gt;Вигляд та поведінка-&gt;Подробиці щодо книги)

source: If the --start-in-tray option is specified, create a tray icon even if the configuration option to enable tray icons is off.
es: Si se especifica la opción --start-in-tray, se crea un icono en la bandeja incluso si la opción de configuración de iconos en la bandeja está desactivada.
fr: Si l'option --start-in-tray est spécifiée, crée une icône dans la barre d'état même si l'option de configuration pour activer les icônes de la barre d'état est arrêtée
pt_br: Se a opção --start-in-tray for especificada, cria um ícone de bandeja mesmo que a configuração para habilitar o ícone de bandeja esteja desativada.
uk: Якщо вказано параметр --start-in-tray, реалізовано створення піктограми у лотку, навіть якщо знято позначення з пункту вмикання піктограм у лотку у налаштуваннях програми.

source: Possible fix for issue with pinning calibre to taskbar on windows. Note that as an unfortunate side-effect, you will have to unpin and re-pin calibre to the taskbar after updating.
es: Posible corrección para un problema al fijar calibre en la barra de tareas de Windows. Tenga en cuenta que como efecto secundario desagradable, tendrá que desanclar y volver a fijar calibre en la barra de tareas después de actualizar.
fr: Correction possible pour le problème avec l'épinglage à la barre des tâches de Windows. Notez qu'elle à un regrettable effet secondaire, vous aurez à dé-épingler et ré-épingler calibre à la barre des tâches après la mise à jour.
pt_br: Possível correção para o problema de fixar o calibre na barra de tarefas do Windows. Note que como um efeito colateral infeliz, você terá que desafixar e reafixar o calibre na barra de tarefas após a atualização.
uk: Можливе виправлення вади зі пришпилюванням calibre до панелі задач у windows. Зауважте, що маємо небажаний ефект: ви не зможете відшпилити і знову пришпилити calibre до панелі задач після оновлення.

source: DOCX Output: Fix text immediately after a hidden tag not being included.
es: Salida DOCX: Corregido un error por el que el texto inmediatemente después de una etiqueta oculta no se incluía.
fr: Format DOCX en sortie : Corrige le fait que le texte placé immédiatement après une balise invisible ne soit pas inclus.
pt_br: Saída DOCX: Corrige o texto imediatamente após uma tag 'hidden' não sendo incluído.
uk: Виведення до DOCX: реалізовано негайне виправлення тексту після включення прихованого теґу.

source: Fix a regression that broke fetching of metadata from Douban
es: Corregida una regresión que estropeó la recolección de metadatos de Douban
fr: Corrige une régression qui endommage la récupération des métadonnées à partir de Douban
pt_br: Corrige uma regressão que danificou a obtenção de metadados do Douban Books
uk: Виправлено регресію, яка заважала отриманню метаданих з Douban
