Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: calibre can now set metadata in DRMed Topaz and MOBI files.
es: calibre ahora puede establecer metadatos en archivos Topaz y MOBI con DRM.
fr: calibre peut maintenant définir les métadonnées dans les fichiers DRMisés Topaz et MOBI.
pt_br: O calibre agora pode definir metadados em arquivos Topaz e MOBI com DRM.
uk: Нова версія calibre може встановлювати метадані у файлах DRMed Topaz і MOBI.

source: When generating EPUB files, calibre now creates SVG based covers, that automatically stretch to fill up the available screen real estate on the device used to read them.
fr: Lors de la génération de fichiers EPUB, calibre crée maintenant des couvertures basée SVG, qui s'étirent automatiquement remplir l'espace disponible de l'écran sur le périphérique utilisé pour le lire.
pt_br: Ao gerar arquivos EPUB, o calibre agora cria capas baseadas em SVG, que automaticamente se esticam para preencher toda a tela disponível do dispositivo usado para ler.
uk: При створенні файлів EPUB нова версія calibre створює засновані на SVG зображення обкладинок, які автоматично розтягуються для заповнення доступного на екрані пристрою для читання місця.

source: calibre can now convert CHM files.
es: calibre ahora puede convertir archivos CHM.
fr: calibre peut maintenant convertir les fichiers au format CHM.
pt_br: O calibre agora pode converter arquivos CHM.
uk: Нова версія calibre здатна перетворювати файли CHM.

source: Creation of catalogs
es: Creación de catálogos
fr: Création de catalogues
pt_br: Criação de catálogos
uk: Створення каталогів

source: You can now easily generate a catalog of all books in your calibre library by clicking the arrow next to the convert button. The catalog can be in one of several formats: XML, CSV, EPUB and MOBI, with scope for future formats via plugins. If you generate the catalog in an e-book format, it will be automatically sent to your e-book reader the next time you connect it, allowing you to easily browse your collection on the reader itself.
fr: Vous pouvez maintenant générer facilement un catalogue de tous les livres dans votre bibliothèque calibre en cliquant la flèche juste après le bouton convertir. Le catalogue peut être en un ou plusieurs formats : XML, CSV, EPUB et MOBI, avec un développement pour de futurs formats via des extensions. Si vous générer le catalogue dans un format de livre numérique, il sera automatiquement envoyé vers votre lecteur de livre numérique la prochaine fois que vous le connecter, vous permettant de facilement le parcourir votre collection sur le lecteur même.
pt_br: Você pode agora facilmente gerar um catálogo de todos os livros na sua biblioteca do calibre clicando na seta ao lado do botão de conversão. O catálogo pode ser criado em vários formatos: XML, CSV, EPUB e MOBI, com escopo para futuros formatos via plugins. Se você gerar o catálogo em um formato de e-book, ele será automaticamente enviado para o seu leitor de livros na próxima vez que conectar, permitindo que você facilmente possa navegar sua coleção no próprio leitor.
uk: У новій версії ви зможете дуже просто створити каталог усіх книг у вашій бібліотеці calibre — достатньо натиснути кнопку зі стрілкою, розташовану поруч із кнопкою перетворення. Каталог можна зберегти в одному декількох форматів: XML, CSV, EPUB і MOBI, із можливістю майбутнього розширення списку форматів за допомогою додатків. Якщо ви створите каталог у форматі електронної книги, його буде автоматично надіслано на ваш пристрій для читання електронних книг під час його наступного з'єднання з комп'ютером. Це надасть вам змогу дуже просто здійснювати навігацію вашою збіркою на самому пристрої для читання.

source: E-book viewer improvements
es: Mejoras del visor de libros
fr: Améliorations de la visionneuse de livre numérique
pt_br: Melhorias no visualizador de e-books
uk: Поліпшення у засобі перегляду електронних книг

source: The e-book viewer now has builtin dictionary lookup. Just select a aword and right click to look it up using the dictionary servers at dict.org
fr: La visionneuse de livre numérique à maintenant un dictionnaire de consultation intégré. Sélectionner simplement un mot et faites un clic droit pour le chercher en utilisant le serveur de dictionnaire sur dict.org

source: The viewer now supports SVG embedded in XHTML when viewing EPUB files.
es: El visor soporta ahora SVG incrustados en XHTML al mostrar archivos EPUB.
fr: La visionneuse supporte maintenant le SVG embarqué dans du XHTML lors de la visualisation de fichiers EPUB.
pt_br: O visualizador agora suporta SVG incorporado em XHTML ao visualizar arquivos EPUB.
uk: У новій версії засобу перегляду передбачено підтримку вбудованих SVG у XHTML для перегляду файлів EPUB.

source: USB syncing with the iPad
es: Sincronización USB con iPad
fr: Synchronisation USB avec l'iPad
pt_br: Sincronização USB com o iPad
uk: Синхронізація за USB з iPad

source: calibre now has an experimental driver for the iPad. If you connect the iPad to your computer with calibre running, it should be detected and you can send books directly to iBooks on the iPad with calibre. The driver works by using iTunes in the background, so you also need to have iTunes installed and your iPad setup in it. This works on Windows and macOS 10.5 and higher. And of course, you can browse you calibre collection wirelessly on the iPad with the calibre content server. For details see the <a href="%(ios)s">FAQ</a>.
fr: calibre à maintenant un pilote expérimental pour l'iPad, si vous connecter l'iPad à votre ordinateur avec calibre ne fonctionnement, il devrait être détecté et vous pouvez envoyer directement des livres sur iBooks sur l'iPad avec calibre. Le pilote fonctionne par l'utilisation de iTunes en arrière plan, donc vous avez également besoin d'avoir iTunes installé et votre iPad doit y être configuré. Ceci fonctionne sous Windows et masOS10.5 ou supérieur. Et bien sûr, vous pouvez parcourir votre collection calibre sur l'iPad , sans fil, avec le serveur de contenu calibre. Pour plus de détails voir la <a href="%(ios)s">FAQ</a>.

source: Incompatible changes
es: Cambios incompatibles
fr: Changements incompatibles
pt_br: Mudanças incompatíveis
uk: Несумісні зміни

source: 0.7 drops support for the un-upgraded SONY PRS 500. In addition all the SONY drivers have been combined into a single driver, so if you previously customized a SONY driver, you will have to redo the customization. Also note that, calibre turns tags into collections, so it will create new collections for existing books on your reader, if they have tags but don't already have collections on the device. You can turn off this behavior by going to Preferences-&gt;Plugins-&gt;Device Interface plugins and customizing the SONY plugin.
fr: 0.7 baisse sa prise en charge du SONY PRS 500 non mis à jour. En découle que tous les pilotes SONY ont été combinés en un seul pilote, aussi si vous avez antérieurement personnalisé un pilote SONY, vous aurez à refaire la personnalisation. Notez également que, calibre transforme les étiquettes en collections, aussi il créera de nouvelles collections pour les livres existants sur votre liseuse, s'ils ont des étiquettes mais n'ont pas déjà des collections sur le périphérique. Vous pouvez désactiver ce comportement en allant dans Préférences-&gt;Extensions-&gt;Extensions d'interface de périphérique et personnaliser l'extension SONY.
pt_br: A versão 0.7 deixa de suportar o não-atualizado SONY PRS 500. Além disso, todos os drivers SONY fora unificados em um único driver, então se você personalizou previamente um driver SONY, você terá que refazer a personalização. Note também que, o calibre transforma as etiquetas em coleções, então ele irá criar novas coleções para livros existentes no seu leitor, se eles possuem etiquetas mas já não estão em uma coleção no dispositivo. Você pode desabilitar este comportamento em Preferências-&gt;Plugins-&gt;Plugins de Interface de dispositivo e personalizar o plugin SONY.
uk: У версії 0.7 припинено підтримку неоновлених версій SONY PRS 500. Крім того, усі драйвери SONY було об'єднано до єдиного драйвера. Отже, якщо ви раніше налаштовували драйвер SONY, вам доведеться повторити процедуру налаштовування. Крім того, зауважте, що calibre перетворює мітки у збірки. Тому програма створить нові збірки для наявних книг на вашому пристрої для читання, якщо книги мають мітки, але не належать до збірок на пристрої. Ви можете вимкнути таку поведінку програми за допомогою сторінки «Налаштування -&gt; Додатки -&gt; Додатки інтерфейсів пристроїв» і налаштовування додатка SONY.

source: The database schema of the calibre library has changed to support custom columns. While effort has been spent to try to ensure backwards-compatibility, you may have problems going back to an 0.6.x release after upgrading to 0.7, so avoid this, if possible.
fr: Le schéma de la base de données de la bibliothèque calibre a changé pour supporter les colonnes personnalisées. Malgré les efforts qui ont été déployés pour essayer d'assurer une comptabilité inversée, vous pourriez avoir des problèmes en revenant vers une version 0.6.x après la mise à jour vers 0.7, évitez ça, si possible.
pt_br: O esquema da base de dados da biblioteca do calibre mudou para suporta colunas personalizadas. Apesar de ter sido feito um esforço para evitar problemas de compatibilidade, você pode ter problemas voltando para uma versão 0.6.x depois de atualizar para a 0.7, então evite isso, se possível.
uk: Схему бази даних бібліотеки calibre було змінено так, щоб забезпечити підтримку нетипових стовпчиків. Хоча ми намагалися зберегти зворотну сумісність, можуть виникнути проблеми із поверненням до версії 0.6.x після оновлення до 0.7. Тому, якщо можна, спробуйте уникнути повернення до попередніх версій.

source: This is an appropriate time to trow out a big thank you to all the calibre developers who have contributed most of the major new features listed above. An incomplete list of contributors is available <a href="%(href)s" title="Contributors">here</a>.
fr: C'est le moment adéquat pour remercier fortement tous les développeurs de calibre qui ont contribué à la plupart des nouvelles fonctionnalités majeures listées ci-dessus. Vous pouvez trouver <a href="%(href)s" title="Contributors">ici</a> une liste incomplète des contributeurs.
pt_br: Este é o momento adequado para agradecer a todos os desenvolvedores do calibre que mais contribuíram para as grandes funcionalidades listadas acima. Uma lista incompleta dos contribuidores está disponível <a href="%(href)s" title="Contributors">aqui</a>.
uk: Саме час сказати велике «дякую!» усім розробникам calibre, які зробили свій внесок у реалізацію більшої частини основних можливостей, список яких наведено вище. Із неповним списком учасників розробки можна ознайомитися <a href="%(href)s" title="Contributors">тут</a>.

source: Note that many of these features were actually introduced during the lifetime of the 0.6.x series. This document describes new features as compared to 0.6.0
fr: Notez qu'un grand nombre de ces fonctionnalités ont été en fait introduites tout au long de la série de version 0.6x. Ce document décrit les nouvelles fonctionnalités comparativement à la version 0.6.0
pt_br: Note que muitas dessas funções foram de fato introduzidas durante o ciclo de vida da série 0.6.x. Este documento descreve novas funções comparadas à versão 0.6.0
uk: Зауважте, що багато з цих можливостей було насправді впроваджено під час створення послідовності випусків 0.6.x. У цьому ж документі описано нові можливості, які з'явилися з часу випуску 0.6.0.

source: New in calibre 0.8
es: Nuevo en calibre 0.8
fr: Nouveautés dans la version 0.8 de calibre
pt_br: Novidades no calibre 0.8
uk: Нове у calibre 0.8

source: Lots has changed in calibre-land in the last year. A great feature is "Get Books" which allows you to search for a book by title and author and returns the list of web stores that sell it in e-book form, allowing you to easily find the lowest prices for popular books or search many different places for hard to find e-book editions.
es: Muchas cosas han cambiado en el entorno de calibre en el último año. Una función estupenda es «Obtener libros», que le permite buscar un libro por título o por autor y devuelve una lista de librerías en Internet que lo venden en formato electrónico, con lo que puede encontrar fácilmente los menores precios de los superventas o buscar en varios sitios ese libro tan difícil de encontrar.
fr: Beaucoup de choses ont changé au pays de calibre cette dernière année. Un grand fonctionnalité est "Obtenir des livres" qui vous permet de rechercher un livre par titre et auteur et de renvoyer une liste de boutiques en ligne qui le vendent au format livre numérique, vous permettant de trouver le prix le plus bas pour des livres populaires ou de chercher dans beaucoup d'endroits différents pour une édition de livre numérique difficile à trouver.
pt_br: Muito mudou na calibrelândia no último ano. Uma grande função é "Obter Livros", a qual permite que você busque livros pelo título e pelo autor e retornar a lista de lojas online onde são vendidos no forma de e-book, permitindo você facilmente encontrar o menor preço para livros populares ou buscar em muitos lugares para livros difíceis de encontrar em edição e-book.
uk: Протягом останнього року у царині calibre сталися значні зміни. Реалізовано чудову можливість «Отримати книги», за допомогою якої ви можете шукати книгу за назвою і автором, отримуючи список інтернет-крамниць, де продається книга. Так ви зможете знайти найдешевший варіант для популярної книги або знайти рідкісні видання електронних книг.

source: The last year has also seen the maturing of the calibre plugin infrastructure, which has led to a vibrant community of user developed plugins that extend calibre's functionality in many novel ways. See the <a href="%(mr)s">Index of plugins</a>.
fr: La dernière année a également vu la maturation de l'infrastructure d'extension de calibre, qui a été conduite par une communauté dynamique, des extensions développées par des utilisateurs qui étendent les fonctionnalités de calibre de beaucoup de nouvelles manières. Voir l'<a href="%(mr)s">Index des extensions</a>.
pt_br: O último ano viu o amadurecimento da infraestrutura de plugins do calibre, o que levou a uma comunidade vibrante de plugins desenvolvidos pelos usuários que estendem as funcionalidades do calibre em muitas novas maneiras. Veja o <a href="%(mr)s">Índice de plugins</a>.
uk: Останній рік також ознаменував черговий етап зрілості інфраструктури додатків calibre, який надав змогу створити чудову спільноту розробників додатків, які розширюють функціональні можливості calibre у багато новітніх способів. Див. <a href="%(mr)s">Список додатків</a>.

source: calibre has an all new metadata download system that allows you much more control over the process. For example, you can now choose a cover from many different online sources.
fr: calibre a un nouveau système de téléchargement des métadonnées qui vous donne un plus grand contrôle sur le processus. Par exemple, vous pouvez maintenant choisir une couverture parmi beaucoup de différentes sources en ligne.
pt_br: O calibre tem um novo sistema de download de metadados que permite que você tenha muito mais controle sobre o processo. Por exemplo, você pode agora escolher uma capa em uma das muitas fontes online.
uk: У calibre тепер зовсім нова система отримання метаданих, яка значно розширює можливості керування процесом. Наприклад, тепер ви можете вибрати обкладинку з багатьох різних інтернет-джерел.

source: As always, calibre has gained support for dozens of new devices, conversion of a few new formats, notably, SNB and the Plucker formats. The performance of calibre has been greatly improved, especially with large libraries of tens of thousands of books.
fr: Comme toujours, calibre a progressé dans la prise ne charge de douzaines de nouveaux périphériques, la conversion de nouveau formats, notablement, les formats SNB et Plucker. La performance de calibre a été grandement améliorée, spécialement avec de grandes bibliothèques de cent mille livres.
pt_br: Como sempre, o calibre ganhou suporte para dezenas de novos dispositivos, conversão de alguns novos formatos, notavelmente, os formatos SNB E Plucker. A performance do calibre aumentou drasticamente, especialmente com grandes bibliotecas de dezenas de milhares de livros.
uk: Як завжди, у новій версії calibre було додано підтримку десятків пристроїв, можливості перетворення для декількох нових форматів, найпомітнішими з яких є формати SNB та Plucker. Значно поліпшено швидкодію calibre, особливо під час роботи із великими бібліотеками, у яких тисячі книг.

source: While not directly calibre related, a new website that catalogues unrestricted access e-books for sale was started: <a href="%(ob)s">Open books</a>. All the books on this website are for sale, but they do not have DRM, which means you actually own them after paying for them. You can convert them to different formats, fix typos in them, view them on as many devices as you like. At calibre, we believe that DRM free is the future of digital information and Open Books is a small effort to help speed that future along.
es: Aunque no está relacionado directamente con calibre, se ha creado una nueva página web que recoge libros electrónicos a la venta sin restricción de acceso: <a href="%(ob)s">Open Books</a>. Todos los libros en esta página están a la venta, pero no tienen DRM, lo que significa que realmente son suyos una vez que pague por ellos. Puede convertirlos a distintos formatos, corregir erratas y leerlos en tantos dispositivos como quiera. En calibre creemos que la ausencia de DRM es el futuro de la información digital y Open Books es un pequeño esfuerzo para acelerar la llegada de ese futuro.
fr: Bien que non directement lié à calibre, un nouveau site web qui catalogue les livres numériques à vendre sans restriction d'accès à démarrer : <a href="%(ob)s">Open books</a>. Tous les livres sur ce site web sont à vendre, mais ils n'ont pas de DRM, ce qui signifie les posséder réellement après les avoirs payés. Vous pouvez les convertir en de différents formats, corriger les coquilles qu'ils contiennent, les voir sur autant de périphériques que vous le souhaitez. Chez calibre, nous croyons que le sans DRM est le futur de l'information digitale et Open Book est un petit effort pour aider à accélérer cette marche vers le futur.
pt_br: Apesar de não ser diretamente relacionado ao calibre, um novo site que cataloga e-books de acesso irrestrito para venda foi iniciado: <a href="%(ob)s">Open books</a>. Todos os livros neste site são para venda, mas eles não possuem DRM, o que significa que você realmente é dono deles após pagar. Você pode convertê-los para diferentes formatos, corrigir erros de ortografia, visualizá-los em tantos dispositivos quanto quiser. Nós do calibre acreditamos que livros sem DRM é o futuro da informação digital e o Open Books é um pequeno esforço para ajudar a acelerar esse processo.
uk: Хоча це напряму і не пов'язано із calibre, було започатковано новий сайт, який каталогізує продаж електронних книг без обмежень у користуванні: <a href="%(ob)s">Open books</a>. Усі книги на цьому сайті продаються, але не захищаються DRM, що означає, що після сплати за них ви стаєте їхнім справжнім власником. Ви зможете перетворювати придбані книги до бажаного формату, виправляти у них друкарські помилки, переглядати їх на довільних пристроях. У calibre, ми вважаємо, що майбутнє цифрової інформації є вільним від DRM, а Open Books є одним із кроків, який пришвидшить прогрес у цьому напрямку.

source: Some new features in 0.8
es: Algunas características nuevas de la versión 0.8
fr: Quelques nouvelles fonctionnalités dans la version 0.8
pt_br: Algumas novas funções na versão 0.8
uk: Деякі нові можливості у 0.8

source: Get Books
es: Obtener libros
fr: Obtenir des Livres
pt_br: Obter livros
uk: Отримання книг

source: calibre can now search over a dozen web stores like Amazon, Barnes &amp; Noble, Waterstones, etc. for e-book editions of the book you want. The results are displayed sorted by price, so you can easily find the lowest priced edition to add to your collection. This feature, like the rest of calibre is plugin based, so look forward to new stores being added in the future.
es: calibre puede ahora buscar en más de una docena de librerías en Internet, como Amazon, Barnes &amp; Noble, Waterstones, etc., ediciones electrónicas del libro que desee. Los resultados se muestran ordenados por precio, para que pueda localizar fácilmente la edición más barata para añadirla a su colección. Esta función, como el resto de calibre, está basada en complementos, así que cuente con que se añadirán nuevas librerías en el futuro.
fr: calibre peut maintenant rechercher sur une douzaine de boutiques en ligne comme Amazon, Barnes &amp; Noble, Waterstones, etc. pour une édition en livre numérique du livre que vous voulez. Les résultats sont affichés triés par prix, de cette manière vous pouvez facilement trouver l'édition au prix le plus bas pour l'ajouter à votre collection. Cette fonctionnalité, comme le reste de calibre est basée sur une extension, aussi il est attendu avec impatience que de nouvelles boutiques soient ajoutées dans le futur.
pt_br: O calibre agora pode buscar em mais de uma dezena de lojas online como Amazon, Barnes &amp; Noble, Waterstones, etc, por edições e-book do livro que você quer. O resultados são mostrados ordenados por preço, de forma que você possa facilmente encontrar a edição com menor preço para adicionar à sua. coleção. Esta função, como o resto do calibre é baseado em plugins, então espere encontrar novas lojas sendo adicionadas no futuro.
uk: Нова версія calibre може виконувати пошук у десятках інтернет-крамниць, зокрема Amazon, Barnes &amp; Noble, Waterstones, тощо, видань електронних книг потрібної вам книги. Результати пошуку буде упорядковано за ціною. Отже, вам буде просто знайти видання із найнижчою ціною для додавання його до вашої збірки. Роботу цієї можливості, подібно до решти можливостей calibre, засновано на додатках. Тому слід очікувати розширення діапазону крамниць у наступних версіях програми.

source: Note that if you have customized your the toolbar in calibre in the past, you may not see the Get Books button in the toolbar. You can go to Preferences-&gt;Toolbar and add it to the toolbar manually.
fr: Notez que si vous avez, dans le passé, personnalisé votre barre d'outils dans calibre, vous ne pouvez pas voir le bouton Obtenir des livres dans la barre d'outils. Vous pouvez aller dans Préférences-&gt;Barres d'outils

source: A search for 'Foundation asimov' with calibre's Get Books
fr: Une recherche de 'Fondation asimov' avec Obtenir le livre de calibre
pt_br: Uma busca por 'Foundation asimov' com o Obter Livros do calibre
uk: Пошук «Foundation asimov» за допомогою засобу отримання книг calibre

source: The store page for one of the Foundation books found previously
fr: La page de la boutique pour l'un des livres Fondation trouvé auparavant
pt_br: A página da loja para um dos livros Foundation encontrados previamente
uk: Сторінка крамниці для однієї із раніше знайдених книг циклу «Foundation»

source: Lots of new calibre plugins
es: Muchos nuevos complementos de calibre
fr: Beaucoup de nouvelles extensions pour calibre
pt_br: Vários novos plugins do calibre
uk: Багато нових додатків calibre
