Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: You can now create your own snippets and insert them into the text with only a few keystrokes. The snippets include support for placeholders that you can jump between. See <a href="%(h0)s">%(h0)s</a> for details
fr: Vous pouvez maintenant créer vos propres fragments et les insérer dans le texte avec seulement quelques touches de frappe. Les fragments incluent la prise en charge d'espaces réservés entre lesquels vous pouvez vous déplacer. Voir <a href="%(h0)s">%(h0)s</a> pour plus de détails

source: Edit book: Add auto-completion for links
fr: Éditer le livre : Ajout de la complétion automatique pour les liens

source: Now as you type the filename in href or src attributes, a popup with possible completions is displayed. See <a href="%(h0)s">%(h0)s</a> for details
fr: Maintenant, au fur et à mesure que vous tapez dans les attributs href ou src, une fenêtre avec les complétions possibles est affichée. Voir <a href="%(h0)s">%(h0)s</a> pour plus de détails

source: Driver for Papyre 624 ml
fr: Pilote pour la liseuse Papyre 624 ML

source: Driver for the new CYBOOK MUSE e-book reader
fr: Pilote pour la nouvelle liseuse CYBOOK MUSE

source: Kobo driver: Add support for new firmware version 3.12
fr: Pilote Kobo : Ajout du support de la version 3.12 du firmware

source: Driver for the Verso E71b e-book reader
fr: Pilote pour la liseuse Verso E71b

source: Edit book: Add a new 'function mode' for the Search and replace tool
fr: Éditer le livre : Ajout d'un nouveau 'mode fonction' pour l'outil Rechercher et remplacer

source: The function mode allows you to create python functions that run on the results of Search and Replace. This allows you to do arbitrarily powerful text processing. For example, you can automatically fix the case of text, automatically add section number to headings, and so on. For examples and documentation, see: <a href="%(h0)s">%(h0)s</a>
fr: Le mode fonction vous permet de créer des fonctions Python qui s'exécute sur les résultats de Rechercher et remplacer. Ceci vous permet de faire un puissant traitement d'un texte quelconque. Par exemple, vous pouvez corriger automatiquement la casse du texte, ajouter automatiquement un numéro de section aux en têtes, et ainsi de suite. Pour des exemples et de la documentation, voir : <a href="%(h0)s">%(h0)s</a>

source: Driver for the PocketBook Lux 2 with latest firmware
fr: Pilote pour la liseuse PocketBook Lux 2 avec la dernière version de firmware

source: E-book viewer: Show footnotes in a separate popup window
fr: Visionneuse de livre numérique : Montrer les notes de bas de page dans un fenêtre séparée

source: Now when you click on a link to a footnote/endnote, the corresponding note is shown in a separate popup window, for convenient reference. Footnote links are recognized using the EPUB 3 footnote markup as well as some heuristics. Any superscript or subscript links are assumed to be footnote links. Any link that links to another file which in turn links back to the original link, is assumed to be an endnote
fr: Maintenant quand vous cliquez sur un lien vers une note de bas de page/note de fin, la note correspondante est montrée dans une fenêtre séparée, pour une référence confortable. Les liens de note de bas de page sont reconnues en utilisant le balisage note de bas de page EPUB 3 ainsi que certaines heuristiques. Tout les liens en exposant ou en indice sont supposés être des liens de note de bas de page. Tout lien qui se dirige vers un autre fichier qui à son tour fait un lien de retour vers le lien original, est supposé comme étant une note de fin

source: Driver for Tolino Vision 2
fr: Pilote pour la liseuse Tolino Vision 2

source: Windows driver for Trekstor Pyrus 2 LED
fr: Pilote Windows pour la liseuse Trekstor Pyrus 2 LED

source: An all new random cover generation algorithm, which generates covers using many different color schemes and cover styles
fr: Un tout nouvel algorithme de génération aléatoire de couvertures, qui génère des couvertures en utilisant beaucoup de couleurs différentes et de styles de couverture

source: Now when you click the Generate cover button in the Edit Metadata dialog a cover based on the book metadata is generated using random colors and styles. You can customize the random cover generation by long clicking the Generate Cover button, which will popup a dialog where you can create new color schemes and customize other aspects of the generated cover as well
fr: Maintenant, lorsque vous cliquez sur le bouton Générer la couverture dans la boîte de dialogue Modifier les métadonnées, une couverture basée sur les métadonnées du livre est générée en utilisant des couleurs et des styles aléatoires. Vous pouvez personnaliser la génération aléatoire de couverture par un clic prolongé sur le bouton Générer la couverture, qui fera apparaître une boite de dialogue où vous pouvez créer de nouveaux schémas de couleurs et personnaliser également d'autres aspects de la couverture générée

source: Driver for SurfPad 3
fr: Pilote pour la tablette SurfPad 3

source: Kobo driver: Add support for new Kobo Aura H2O and firmware 3.8.0
fr: Pilote Kobo : Ajout du support pour la nouvelle liseuse Kobo Aura H2O et pour le firmware 3.8.0

source: Driver for HTC C
fr: Pilote pour HTC C

source: For a summary of the major changes in calibre between 1.0 and 2.0, see <a href="%(h0)s">%(h0)s</a>
fr: Pour un résumé des changements majeurs entre les versions 1.0 et 2.0, voir <a href="%(h0)s">%(h0)s</a>

source: Get Books: Update Mills & Boon, publio, empik, legimi, woblink and beam-ebooks.de plugins for website changes
fr: Obtenir des livres : Mise à jour des extensions Mills & Boon, publio, empik, legimi, woblink et beam-ebooks.de en raison de changements aux sites web

source: Add a button to easily clear server logs in Preferences->Sharing over the net->Show server logs.
fr: Ajout d'un bouton pour effacer facilement les journaux du serveur dans Préférences->Partager sur le net->Afficher les journaux du serveur.

source: Fix regression that broke Preferences->Conversion->Common options in version 3.9
fr: Correction d'une régression qui a endommagé Préférences->Conversion->Options communes dans la version 3.9

source: Server: Add an option to control the number of books displayed per page in the browser (Preferences->Sharing over the net->Advanced).
fr: Serveur : Ajout d'une option pour contrôler le nombre de livres affichés par page dans le navigateur (Préférences->Partager sur le net ->Avancé).

source: Book details panel: An option to control the layout of the panel in 'Narrow' mode (Preferences->Look & feel->Book details)
fr: Panneau Détails du livre : Une option pour contrôler la mise en page du panneau en mode "condensé" (Préférences->Apparence & présentation->Détails du livre)

source: Server: Add a new 'custom' mode for the book list, where you can specify exactly what metadata fields are displayed, via a template (see Preferences->Sharing over the net->Book list template)
fr: Serveur : Ajout d'un nouveau mode 'personnalisé' pour la liste de livres, où vous pouvez spécifier exactement quelles métadonnées sont affichées, via un modèle (voir Préférences-&gt;Partager sur le net-&gt;Modèle de la liste de livres)

source: E-book management
es: Gestión de libros electrónicos
fr: Gestion du livre numérique
pt_br: Gerenciamento de e-books
uk: Керування електронними книгами

source: calibre: The one stop solution for all your e-book needs. Comprehensive e-book software.
es: calibre: la solución integral para todo lo relacionado con libros electrónicos. Programa completo de libros electrónicos.
fr: calibre: la solution unique pour tous vos besoins liés aux livres numériques. Un logiciel de livre numérique complet.
pt_br: calibre: A solução única para todas as suas necessidades com e-books. Programa completo para e-books.
uk: calibre — програма, за допомогою якої ви зможете зробити з вашою книгою усе, що потрібно. Усебічне програмне забезпечення для електронних книг.

source: The features and history of calibre
es: Las características e historia de calibre
fr: Les caractéristiques et l'histoire de calibre
pt_br: As funções e histórico do calibre
uk: Можливості і історія розвитку calibre

source: About Calibre
es: Acerca de calibre
fr: À propos de calibre
pt_br: Sobre o Calibre
uk: Про calibre

source: See calibre in action
es: Ver calibre en acción
fr: Voir calibre en action
pt_br: Veja o calibre em ação
uk: Побачити calibre у дії

source: Demo
es: Demostración
fr: Démo
uk: Демонстрація

source: Download calibre for your operating system
es: Descargar calibre para su sistema operativo
fr: Télécharger calibre pour votre système d'exploitation
pt_br: Baixe o calibre para o seu sistema operacional
uk: Отримати calibre для вашої операційної системи

source: Download
es: Descargar
fr: Télécharger
pt_br: Baixar
uk: Отримання

source: Get help on using calibre
es: Obtener ayuda sobre el uso de calibre
fr: Obtenir de l'aide sur l'utilisation de calibre
pt_br: Obtenha ajuda para usar o calibre
uk: Отримати довідку щодо користування calibre

source: Help
es: Ayuda
fr: Aide
pt_br: Ajuda
uk: Довідка

source: What's new in calibre world
es: ¿Qué hay de nuevo en calibre?
fr: Les nouveautés dans le monde de calibre
pt_br: Novidades no mundo do calibre
uk: Що нового у світі calibre?

source: What's New
es: Novedades
fr: Nouveautés
pt_br: Novidades
uk: Що нового?

source: Contribute to calibre
es: Contribuir a calibre
fr: Contribuer à calibre
pt_br: Contribua com o calibre
uk: Взяти участь у розробці calibre

source: Get Involved
es: Implicarse
fr: S'impliquer
pt_br: Envolva-se
uk: Приєднатися до команди

source: Report bugs / enhancement requests
es: Informar de errores o solicitar mejoras
fr: Signaler des bogues / demandes d'amélioration
pt_br: Relatar erros / solicitação de melhorias
uk: Повідомити про вади та запити щодо удосконалення

source: Bugs
es: Fallos
fr: Bogues
pt_br: Erros
uk: Вади

source: Change the language of this website
es: Cambiar el idioma de este sitio web
fr: Changer la langue du site web
pt_br: Altere o idioma deste site
uk: Змінити мову цього сайта

source: Language
es: Idioma
fr: Langue
pt_br: Idioma
uk: Мова

source: Support calibre development
es: Ayudar al desarrollo de calibre
fr: Soutenir le développement de calibre
pt_br: Apoie o desenvolvimento do calibre
uk: Підтримати розробку calibre

source: Contribute to support calibre development
es: Ayudar a financiar el desarrollo de calibre
fr: Contribuer pour supporter le développement de calibre
pt_br: Contribua com o desenvolvimento do calibre
uk: Взяти участь у підтримці розробки calibre

source: RSS feed of the calibre changelog
es: Canal RSS de los cambios de calibre
fr: Flux RSS du changelog de calibre
pt_br: Feed RSS do registro de alterações do calibre
uk: Стрічка RSS із журналом змін у calibre

source: Feed of new releases
es: Canal de nuevas versiones
fr: Flux des nouvelles versions
pt_br: Feed dos novos lançamentos
uk: Інформація про випуски

source: Design by Centresource Interactive Agency
es: Diseño por Centresource Interactive Agency
fr: Conception par Centresource Interactive Agency
pt_br: Responsável pelo design: Centresource Interactive Agency
uk: Дизайн розроблено агенцією Centresource Interactive

source: Thank you!
es: ¡Gracias!
fr: Merci !
pt_br: Obrigado!
uk: Дякуємо!

source: Your support helps keep calibre development alive.
es: Su ayuda contribuye a mantener vivo el desarrollo de calibre.
fr: Votre soutien aide à maintenir le développement de calibre.
pt_br: Seu apoio ajuda a manter vivo o desenvolvimento do calibre.
uk: Ваша підтримка живить розробку calibre.

source: Contribute
es: Contribuir
fr: Contribuer
pt_br: Contribuir
uk: Участь у проекті

source: Amount:
es: Cantidad:
fr: Montant :
pt_br: Valor:
uk: Сума:

source: Contacting payment provider, please wait
es: Contactando con el suministrador de pagos, espere
fr: Connexion au fournisseur de paiement, veuillez patienter
pt_br: Contactando o serviço de pagamento. Por favor, espere
uk: Встановлюємо зв’язок із надавачем коштів, будь ласка, зачекайте

source: Pay with credit card or PayPal
es: Pagar con tarjeta de crédito o PayPal
fr: Payer par carte de crédit ou PayPal
pt_br: Pagar com cartão de crédito ou PayPal
uk: Скористатися кредитною карткою або PayPal

source: Pay with bitcoins instead
fr: Payer avec des bitcoins

source: Choose the language you want
es: Elija un idioma
fr: Choisissez la langue désirée
pt_br: Escolha o idioma que deseja
uk: Виберіть бажану мову

source: Download calibre portable
es: Descargar calibre portátil
fr: Télécharger calibre portable
pt_br: Baixe o calibre portátil
uk: Отримати портативну версію calibre

source: The calibre portable build can be run on any windows computer running at least Windows Vista. It is self contained, your calibre libraries and settings are all kept together in one place.
es: La variante portátil de calibre puede ejecutarse en cualquier equipo con Windows, al menos desde Windows Vista. Es autosuficiente, las bibliotecas de calibre y las configuraciones se almacenan en un mismo lugar.
fr: La version portable de calibre peut être exécutée sur n'importe quel ordinateur Windows exécutant au moins Windows Vista. Elle est autonome, vos bibliothèques calibre et les paramètres sont conservés ensemble dans un même endroit.
pt_br: A versão portátil do calibre pode ser executada em qualquer computador com Windows, rodando pelo menos o Windows Vista. Ela é auto-contida: suas bibliotecas do calibre e configurações são todas mantidas juntas em um único lugar.
uk: Портативну збірку calibre можна запускати на будь-якому комп’ютері під керуванням Windows, де працюватиме принаймні Windows Vista. У збірці є усі необхідні компоненти, ваші бібліотеки calibre і параметри усі зберігатимуться у одному місці.

source: To use, just run the portable installer and select the location where you would like the <em>Calibre Portable</em> folder. To launch calibre, double click the <em>"calibre-portable.exe"</em> program inside the <em>Calibre Portable folder.</em>
es: Para usarla, ejecute el instalador portátil y elija la ubicación donde desee la carpeta <em>Calibre Portable</em>. Para ejecutarlo, pulse dos veces sobre el programa «<em>calibre-portable.exe</em>» dentro de la carpeta <em>Calibre Portable</em>.
fr: Pour utiliser, exécutez simplement l'installateur portable et sélectionnez l'emplacement où vous souhaitez créer le dossier <em>Calibre Portable</em>. Pour lancer calibre, double-cliquez sur le programme <em>"calibre-portable.exe"</em> dans le dossier <em>Calibre Portable.</em>
pt_br: Para utilizar, apenas execute o instalador portátil e selecione a localização da pasta do <em>Calibre Portátil</em>. Para abrir o calibre, dê um clique duplo no programa <em>"calibre-portable.exe"</em> dentro da <em>Pasta do Calibre Portátil.</em>
uk: Щоб скористатися збіркою, просто запустіть програму для встановлення портативної версії і виберіть місце, де слід розташувати теку <em>Calibre Portable</em>. Щоб запустити calibre, двічі клацніть на пункті програми <em>"calibre-portable.exe"</em> у теці <em>Calibre Portable</em>.

source: What's new
es: Novedades
fr: Nouveautés
pt_br: Novidades
uk: Що нового?

source: Alternate download location #1
es: Ubicación de descarga alternativa 1
fr: Emplacement de téléchargement alternatif #1
pt_br: Local alternativo para download #1
uk: Альтернативне джерело пакунків 1

source: Alternate download location #2
es: Ubicación de descarga alternativa 2
fr: Emplacement de téléchargement alternatif #2
pt_br: Local alternativo para download #2
uk: Альтернативне джерело пакунків 2

source: While you wait for the download to complete, please consider contributing to support the development of calibre.
es: Mientras espera a que se complete la descarga, considere contribuir a financiar el desarrollo de calibre.
fr: En attendant que le téléchargement se termine, vous pouvez envisager, si vous le souhaitez, de contribuer pour soutenir le développement de calibre.
pt_br: Enquanto você espera a conclusão do download, por favor considere contribuir para apoiar o desenvolvimento do calibre.
uk: Доки чекаєте на завершення отримання пакунка з програмою, будь ласка, розгляньте можливість фінансової підтримки розробників calibre.

source: Previous releases of calibre are available <a href="%(previous_releases)s">here</a>.
es: Las versiones anteriores de calibre están disponibles <a href="%(previous_releases)s">aquí</a>.
fr: Les versions précédentes de calibre sont disponibles <a href="%(previous_releases)s">ici</a>.
pt_br: Versões anteriores do calibre disponíveis <a href="%(previous_releases)s">aqui</a>.
uk: Попередні випуски calibre можна отримати <a href="%(previous_releases)s">тут</a>.

source: Upgrading
es: Actualizar
fr: Mise à jour
pt_br: Atualizando
uk: Оновлення

source: If you want to upgrade a previous version of calibre portable, download the latest version of the installer from here and run it, choosing the location of your previous calibre portable install. The installer will automatically update calibre portable.
es: Si desea actualizar una versión anterior de calibre portátil, descargue la última versión del instalador en esta página y ejecútelo, eligiendo la ubicación de la instalación previa de calibre portátil. El instalador actualizará automáticamente calibre portátil.
fr: Si vous souhaitez mettre à niveau une version précédente de calibre portable, téléchargez la dernière version du programme d'installation à partir d'ici et exécutez-la en choisissant l'emplacement précédent de votre installation portable de calibre. Le programme d'installation mettra automatiquement à jour calibre portable.
pt_br: Se você deseja atualizar uma versão prévia do calibre portátil, baixe a última versão do instalador aqui e execute-o, escolhendo a localização de sua instalação prévia do calibre portátil. O instalador irá automaticamente atualizar o calibre portátil.
uk: Якщо ви хочете оновити раніше встановлену портативну версію calibre, отримайте найсвіжішу версію засобу встановлення і запустіть його, вибравши для встановлення каталог, до якого було встановлено попередню портативну версію calibre. Засіб для встановлення автоматично оновить встановлену версію.

source: Precaution
es: Precaución
fr: Mise en garde
pt_br: Precaução
uk: Попередження

source: Portable media can occasionally fail so you should make periodic backups of your Calibre library. This can be done by making a copy of the "Calibre Library" folder and all its contents.
es: A veces los dispositivos de almacenamiento portátiles pueden fallar, por lo que debe hacer periódicamente copias de seguridad de la biblioteca de calibre. Puede hacer esto copiando la carpeta «Calibre Library» y todo su contenido.
fr: Les stockages portables peuvent parfois tomber en panne, vous devriez donc effectuer des sauvegardes périodiques de votre bibliothèque calibre. Cela peut se faire en copiant le dossier «Calibre Library» et tout son contenu.
pt_br: Mídias portáteis podem ocasionalmente falhar. Portanto, você deve realizar backups periódicos da sua biblioteca do calibre. Isto pode ser feito através de uma cópia da pasta "Biblioteca do Calibre" e todo o seu conteúdo.
uk: Портативні носії даних поступово зношуються, тому варто робити періодичне резервне копіювання вашої бібліотеки Calibre. Створити резервну копію можна копіюванням на резервний носій даних теки «Calibre Library» та усього її вмісту.

source: Automated install
es: Instalación automática
fr: Installation automatisée
pt_br: Instalação automática
uk: Автоматичне встановлення

source: You can prevent the installer from asking for an install location by running it with a command line argument pointing to the directory for the install. For example:
es: Puede evitar que el instalador le pida una ubicación de instalación ejecutándolo con un argumento en la línea de órdenes que señale al directorio para la instalación. Por ejemplo:
fr: Vous pouvez empêcher le programme d'installation de demander un emplacement d'installation en l'exécutant avec un argument de ligne de commande indiquant le répertoire pour l'installation. Par exemple :
pt_br: Você pode evitar que o instalador pergunte por um local de instalação executando-o com um argumento de linha de comando apontando para o diretório de instalação. Por exemplo:
uk: Ви можете усунути із засобу встановлення запит щодо місця встановлення, якщо запустите його із параметром командного рядка, який вказуватиме каталог, до якого слід встановити програму. Приклад:

source: Multiple libraries
es: Varias bibliotecas
fr: Bibliothèques multiples
pt_br: Múltiplas bibliotecas
uk: Декілька бібліотек

source: calibre Portable only remembers libraries that are placed inside the portable folder. So while you can open any library located anywhere on your computer with calibre portable, it will not be remembered on restart unless it is located in the portable folder (i.e. in the same place as the "Calibre Library" folder).
es: calibre portátil sólo recuerda las bibliotecas que se colocan dentro de la carpeta portátil. Por lo tanto, puede abrir cualquier biblioteca en cualquier lugar del equipo con calibre portátil, no se recordará a no ser que esté situada en la carpeta portátil (es decir, en el mismo lugar que la carpeta «Calibre Library»).
fr: calibre Portable se souvient uniquement des bibliothèques placées dans le dossier portable. De ce fait, bien que vous puissiez ouvrir toute bibliothèque située n'importe où sur votre ordinateur avec calibre portable, calibre ne s'en souviendra pas après redémarrage à moins qu'elle ne se trouve dans le dossier portable (c'est-à-dire au même endroit que le dossier «Calibre Library»).
pt_br: O calibre portátil se lembra de apenas de bibliotecas localizadas dentro da pasta portátil. Então, apesar de você poder abrir qualquer biblioteca localizada em qualquer lugar do seu computador, ela não será lembrada ao reiniciar, a não ser que esteja localizada dentro da pasta portátil (ou seja, no mesmo lugar que a pasta "Biblioteca do Calibre").
uk: Портативна версія calibre пам’ятає лише бібліотеки, які було розташовано у теці портативного носія. Отже, хоча за допомогою портативної версії ви можете відкривати будь-яку бібліотеку, дані якої зберігаються будь-де на вашому комп’ютері, програма нічого не запам’ятає про відкриту бібліотеку, якщо її не буде збережено до портативної теки (тобто до якоїсь із тек у теці «Calibre Library»).

source: Download for linux
es: Descargar para linux
fr: Télécharger pour linux
pt_br: Download para o Linux
uk: Отримання пакунків для Linux

source: Download for Linux
es: Descargar para Linux
fr: Télécharger pour Linux
pt_br: Download para o Linux
uk: Отримання пакунків для Linux

source: The latest release of calibre is %(version)s. <a href="%(href)s">What&apos;s new</a>.
es: La última versión de calibre es %(version)s. <a href="%(href)s">Novedades</a>.
fr: La dernière version de calibre est la %(version)s. <a href="%(href)s">Quoi de neuf</a>.
pt_br: A última versão do calibre é %(version)s. <a href="%(href)s">Novidades</a>.
uk: Найновішим випуском calibre є випуск %(version)s. <a href="%(href)s">Нові можливості цього випуску</a>.
