Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Release
es: Versión
fr: Version
pt_br: Lançamento
uk: Випуск

source: New features
es: Nuevas características
fr: Nouvelles fonctionnalités
pt_br: Novas funcionalidades
uk: Нові можливості

source: User manual: A new quick reference primer for regular expression syntax <a href="%(h0)s">%(h0)s</a>
es: Manual de usuario: Una nueva referencia rápida para la sintaxis de expresiones regulares <a href="%(h0)s">%(h0)s</a>
fr: Manuel utilisateur : Une nouvelle ébauche de référence rapide pour la syntaxe d'expression régulière <a href="%(h0)s">%(h0)s</a>
pt_br: Manual do usuário: Uma novo tutorial simples para referência rápida sobre a sintaxe de expressões regulares <a href="%(h0)s">%(h0)s</a>
uk: Підручник користувача: новий короткий довідник із синтаксису формальних виразів <a href="%(h0)s">%(h0)s</a>

source: Content server: Allow viewing the book metadata while reading a book. In the viewer controls, tap Goto and then Metadata to see the metadata.
es: Servidor de contenidos: Se permite ver los metadatos de un libro mientras se lee. En los controles del visor, toque en Ir a y luego en Metadatos para ver los metadatos.
fr: Serveur de contenu : Permettre de voir les métadonnées d'un livre pendant sa lecture. Dans les contrôles de la visionneuse, appuyer sur Aller à et puis sur Métadonnées pour voir les métadonnées.
pt_br: Servidor de conteúdo: Permite visualizar os metadados ao ler o livro. Nos controles do visualizador, clique em "Ir Para" e depois "Metadados" para ver os metadados.
uk: Сервер даних: уможливлено перегляд метаданих книги під час читання. Щоб переглянути метадані, у засобах керування переглядачем натисніть «Перехід», потім «Метадані».

source: Closes tickets
es: Cierra las incidencias
fr: Ferme le ticket
pt_br: Encerra o chamado
uk: Закриті квитки

source: Kobo driver: Add support for new firmware
es: Controlador Kobo: Añadido soporte para el nuevo firmware
fr: Pilote Kobo : Ajout de la prise en charge d'un nouveau firmware
pt_br: Driver do Kobo: Adiciona suporte para o novo firmware
uk: Драйвер Kobo: додано підтримку нової мікропрограми

source: Bulk metadata edit: Allow choosing the algorithm used for changing the case of titles
es: Edición de metadatos en masa: Se permite elegir el algoritmo usado para modificar las mayúsculas y minúsculas en los títulos
fr: Édition des métadonnées par lot : Permettre de choisir l'algorithme utilisé pour changé la casse des titres
pt_br: Edição de metadados em lote: Permite escolher o algorítimo usado para alterar o padrão maiúsculo/minúsculo dos títulos
uk: Пакетне редагування метаданих: уможливлено вибір алгоритму для зміни регістру заголовків

source: Get books: The koobe.pl store plugin has now become the Swiat Ebookow store plugin
es: Obtener libros: El complemento de librería koobe.pl ahora es el complemento de librería Swiat Ebookow
fr: Obtenir des livres : L'extension de la boutique koobe.pl est devenue l'extension de la boutique Swiat Ebookow
pt_br: Obter livros: O plugin da loja koobe.pl agora se tornou o plugin da loja Swiat Ebookow
uk: Отримання книг: додаток книжкової крамниці koobe.pl перейменовано на додаток крамниці Swiat Ebookow

source: Allow Copy/paste of book metadata from the main book list. Right click the Edit metadata button to access these actions.
es: Se permite copiar y pegar metadatos de libros desde la lista de libros principal. Pulse con el botón derecho sobre el botón de modificar metadatos para acceder a estas acciones.
fr: Permettre le copier/coller des métadonnées d'un livre à partir de la liste principale des livres. Faire un clic droit sur le bouton Éditer les métadonnées pour accéder à ces actions.
pt_br: Permite copiar e colar metadados a partir da lista principal de livros. Clique com o botão direito na opção "Editar metadados" para acessar essas ações.
uk: Уможливлено копіювання і вставлення метаданих книги із основного списку книг. Для цього достатньо навести вказівник на кномку «Редагувати метадані», клацнути правою кнопкою миші і вибрати відповідну дію.

source: Allow disabling the confirmation popup when opening the containing folder of many books at once.
es: Se permite desactivar el cuadro emergente de confirmación al abrir la carpeta contenedora de varios libros a la vez.
fr: Permettre la désactivation de la boîte "surgissante" de confirmation quand on ouvre le dossier contenant de beaucoup de livres en une fois.
pt_br: Permite desabilitar o pop-up de confirmação ao abrir a pasta de vários livros de uma vez.
uk: Уможливлено вимикання контекстного вікна підтвердження під час відкриття теки із великою кількістю книг.

source: Bug fixes
es: Correcciones de errores
fr: Corrections de défauts
pt_br: Correção de bugs
uk: Виправлення вад

source: Nook driver: Fix books sent via calibre not appearing under My Files on the Glowlight 3 Plus
es: Controlador Nook: Se corrige el fallo por el que los libros enviados a través de calibre no aparecían en Mis archivos en el Glowlight 3 Plus
fr: Pilote Nook : Solutionne le fait que les livres envoyés via calibre n'apparaissent pas sous My Files sur le Glowlight 3 Plus
pt_br: Driver do Nook: Corrige livros enviados via calibre não aparecendo sob Meus Arquivos no Glowlight 3 Plus
uk: Драйвер Nook: виправлено помилку, пов'язану із тим, що книги, надіслані за допомогою calibre, не з'являлися у теці «Мої файли» на Glowlight 3 Plus

source: Get Books: Update Mills &amp; Boon, publio, empik, legimi, woblink and beam-ebooks.de plugins for website changes
es: Obtener libros: Actualizados los complementos Mills &amp; Boon, publio, empik, legimi, woblink y beam-ebooks.de por cambios en el sitio web
fr: Obtenir des livres : Mise à jour des extensions Mills &amp; Boon, publio, empik, legimi, woblink et beam-ebooks.de en raison de changements aux sites web
pt_br: Obter Livros: Atualiza os plugins de Mills &amp; Boon, publio, empik, legimi, woblink e beam-ebooks.de para as mudanças nos sites
uk: Отримання книг: відповідно до змін на сайтах оновлено додатки Mills &amp; Boon, publio, empik, legimi, woblink і beam-ebooks.de

source: Book polishing: Do not scan book for font usage when subsetting if no embedded fonts are available.
es: Pulir libros: No se examina el uso de tipos de letras en el libro al reducirlos si no hay tipos de letra incrustados.
fr: Polir le livre : Ne pas analyser le livre sur l'utilisation de sous ensemble de polices s'il n'y a pas de polices intégrées disponibles.
pt_br: Polir livros: Não escaneia o livro por uso de fontes ao criar subconjunto se nenhuma fonte incorporada está disponível.
uk: Удосконалення книг: вимкнено сканування книг щодо використання підмножин шрифтів, якщо у книгах немає вбудованих шрифтів.

source: Content server: Open links in the comments section from the book details page in new windows.
es: Servidor de contenidos: Los enlaces en la sección de comentarios de la página de detalles del libro se abren en una ventana nueva.
fr: Serveur de contenu : Ouvrir les liens dans une nouvelle fenêtre dans la section Commentaires de la page détails du livre.
pt_br: Servidor de conteúdo: Abre links na seção de comentários da página de detalhes do livro em novas janelas.
uk: Сервер даних: реалізовано відкриття посилань у розділі коментарів зі сторінки подробиць щодо книги у нових вікнах

source: Choose English as the User interface language when a locale related environment variable is set to the C locale
es: Se elige el inglés como idioma de interfaz de usuaro cuando la variable de entorno de localización correspondiente está establecida en la localización C
fr: Choisir Anglais comme langue de l'Interface utilisateur quand une variable locale reliée à l'environnement est paramétrée à la locale C
pt_br: Escolhe Inglês como o idioma de Interface do Usuário quando uma variável de ambiente relacionada ao código de idioma estiver definida como o código de idioma de C
uk: Реалізовано вибір англійської мови інтерфейсу користувача, якщо пов'язану із локаллю змінну середовища встановлено у значення локалі C

source: Linux installer: A nicer error message if the user tries to run the installer on an ARM machine
es: Instalador de Linux: Se muestra un mensaje de error más útil si el usuario intenta ejecutar el instalador en una máquina ARM
fr: Installateur Linux : Meilleur message d'erreur apparaissant si l'utilisateur essaye d'exécuter l'installateur sur une machine ARM.
pt_br: Instalador Linux: Uma mensagem de erro mais agradável se o usuário tentar executar o instalador em uma máquina com arquitetura ARM
uk: Засіб встановлення у Linux: поліпшено повідомлення щодо помилки, якщо користувач намагається запустити засіб встановлення на комп'ютері із процесором ARM

source: New news sources
es: Nuevas fuentes de noticias
fr: Nouvelles sources d'informations
pt_br: Novas fontes de notícias
uk: Нові джерела новин

source: {0} by {1}
es: {0} por {1}
fr: {0} par {1}
pt_br: {0} por {1}

source: Improved news sources
es: Fuentes de noticias mejoradas
fr: Sources d'informations améliorées
pt_br: Fontes de notícias melhoradas
uk: Поліпшені джерела новин

source: Driver for the new Bq Cervantes 4
es: Controlador para el nuevo Bq Cervantes 4
fr: Pilote pour le nouveau Bq Cervantes 4
pt_br: Driver para o novo Bq Cervantes 4
uk: Драйвер для нової Bq Cervantes 4

source: Edit book: Auto-generate links to existing stylesheets when adding a new HTML file.
es: Modificar libro: Se generan automáticamente enlaces a las hojas de estilo existentes al añadir un nuevo archivo HTML.
fr: Éditer le livre : Auto-génération des liens aux feuilles de styles existantes lors de l'ajout d'un nouveau fichier HTML.
pt_br: Editar livro: Gera automaticamente links para folhas de estilo existentes ao adicionar um novo arquivo HTML.
uk: Редагування книги: автоматичне створення посилань на наявні таблиці стилів під час додавання нового файла HTML.

source: Add a button to easily clear server logs in Preferences-&gt;Sharing over the net-&gt;Show server logs.
es: Se añade un botón para borrar fácilmente los registros del servidor en Preferencias &gt; Compartir por la red &gt; Mostrar registros del servidor.
fr: Ajout d'un bouton pour effacer facilement les journaux du serveur dans Préférences-&gt;Partager sur le net-&gt;Afficher les journaux du serveur.
pt_br: Adiciona um botão para limpar facilmente os registros do servidor em Preferências-&gt;Compartilhar pela rede-&gt;Visualizar os registros do servidor.
uk: Додано кнопку очищення журналу сервера: Налаштування &gt; Обмін мережею -&gt; Показати журнал сервера.

source: Catalog generation: Store the list of fields to be used in generating CSV/XML catalogs per library.
es: Generación de catálogos: Se almacena la lista de campos usados para generar catálogos CSV o XML para cada biblioteca.
fr: Génération d'un catalogue : Stocker, par bibliothèque, la liste des champs à utiliser dans la génération des catalogues CSV/XML
pt_br: Geração de catálogo: Armazena a lista de campos para ser usada ao gerar catálogos CSV/XML por biblioteca.
uk: Створення каталогу: збереження списку полів, які буде використано під час створення каталогів CSV/XML, на рівні бібліотеки.

source: Bulk metadata edit: Make the custom series controls similar to the builtin series ones, with the same set of features
es: Modificación de metadatos en masa: Los controles de series personalizadas son similares a los de series predefinidas, con las mismas características
fr: Édition des métadonnées par lot : Rendre les contrôles des séries personnalisées similaires à ceux des séries intégrées, avec le même ensemble de fonctionnalités
pt_br: Edição de metadados em lote: Torna os controles de série personalizada similar aos do mecanismo nativo para séries, com o mesmo conjunto de recursos
uk: Пакетне редагування метаданих: нетипові засоби керування записами циклів зроблено подібними до вбудованих записів, набір можливостей для них тепер є рівноцінним.

source: Edit book: Pre-select existing cover image (if any) in add cover dialog
es: Modificar libro: Se preselecciona la imagen de portada existente, si hay alguna, en el diálogo de añadir portada
fr: Éditer le livre : Pré-sélectionner l'image de couverture existante (s'il y en a une) dans la boîte de dialogue d'ajout de couverture
pt_br: Editar livro: Pré-seleciona imagem de capa existente (se houver) na caixa de diálogo de adição de capa
uk: Редагування книг: реалізовано попереднє позначення наявного зображення обкладинки (якщо таке існує) у діалоговому вікні додавання зображень обкладинок.

source: Make the Manage saved searches dialog a little easier for new users.
es: El diálogo de administración de búsquedas guardadas se hace un poco más sencillos para nuevos usuarios.
fr: Rendre la boîte de dialogue Gérer les recherches sauvegardées un petit peu plus facile pour les nouveaux utilisateurs
pt_br: Torna a caixa de diálogo 'Gerenciar buscas salvas' um pouco mais fácil para novos usuários.
uk: Діалогове вікно керування збереженими записами пошуків зроблено простішими для початківців.

source: Add a tweak to control behavior of Enter on the book list
es: Se añade un ajuste para controlar el comportamiente de Intro en la lista de libros
fr: Ajout d'un ajustement pour contrôler le comportement de la touche Entrée sur la liste de livres
pt_br: Adiciona um ajuste para controlar a função da tecla 'Enter' na lista de livros
uk: Додано коригування для керування поведінкою клавіші Enter у списку книг.

source: Content server: Fix random book button on book details page multiplying.
es: Servidor de contenidos: Se corrige la multiplicación del botón de libro aleatorio en la página de detalles del libro.
fr: Serveur de contenu : Corrige le fait que le bouton Livre au hasard sur la page de détails du livre se multiplie
pt_br: Servidor de conteúdo: Corrige o botão de livro aleatório na página detalhes do livro multiplicando-se.
uk: Сервер даних: виправлено помилку, пов'язану із тим, що на сторінці параметрів книги з'являлися зайві кнопки книг.

source: Edit Book: Bulk file rename dialog: Remember last used prefix for renaming files
es: Modificar libro: Diálogo de cambio de nombre en masa: Se recuerda el último prefijo usado para cambiar el nombre de archivos
fr: Éditer le livre : Boîte de dialogue de renommage par lot : Se souvenir du dernier préfixe utilisé pour renommer les fichiers
pt_br: Editar livro: Caixa de diálogo 'renomear arquivos em massa': Lembrar o último prefixo utilizado para renomear arquivos
uk: Редагування книг: вікно пакетного перейменування книг: реалізовано збереження останнього використаного для перейменування файлів префікса.

source: Tag browser: Fix use of the tweak to control order of items in the Tag browser causing unexpected expansion of items after editing metadata.
es: Explorador de etiquetas: Se corrige el fallo por el que el uso del ajuste para controlar el orden de elementos en el explorador de etiquetas causaba una expansión no esperada de elementos tras modificar metadatos.
fr: Navigateur d'étiquettes : Corrige l'utilisation de l'ajustement pour contrôler l'ordre des éléments dans le Navigateur d'étiquettes qui entraîne une expansion inattendue des éléments après l'édition des métadonnées.
pt_br: Navegador de Etiquetas: Corrige o uso do ajuste para controlar a ordem dos itens no Navegador de Etiquetas causando expansão inesperada de itens após a edição de metadados.
uk: Навігація мітками: виправлено використання коригування для керування порядком записів на панелі навігації мітками: у попередній версії виконувалося зайве розгортання записів після редагування метаданих.

source: Content server: Improve rendering of tags/categories with long words on small screens.
es: Servidor de contenidos: Se mejora la visualización de etiquetas y categorías con palabras largas en pantallas pequeñas.
fr: Serveur de contenu : Améliorer le rendu sur les petits écrans des étiquettes/catégories avec de longs mots
pt_br: Servidor de conteúdo: Melhora a renderização de etiquetas/categorias com palavras longas em telas pequenas.
uk: Сервер даних: поліпшено засоби показу міток і категорій із довгими словами на малих екранах.

source: Fix first added saved search not appearing in Tag browser until calibre restart.
es: Se corrige el fallo por el que la primera búsqueda guardada añadida no aparecía en el explorador de etiquetas hasta que no se reiniciaba calibre.
fr: Corrige le fait que la première recherche sauvegardée ajoutée n’apparaît pas dans le Navigateur d'étiquettes jusqu'à ce que calibre redémarre.
pt_br: Corrige a primeira busca salva não aparecendo no Navegador de Etiquetas até que o calibre reinicie.
uk: Виправлено помилку, пов'язану із тим, що перший доданий збережений пошук не показувався на панелі навігації мітками до перезапуску calibre.

source: When checking added books for duplicates, also check on the language field. So books with the same title/authors but different languages are not considered duplicates.
es: Al buscar duplicados en los libros añadidos, comprobar también el campo de idioma, para que libros con el mismo título y autores pero en distintos idiomas no se consideren duplicados.
fr: Lors de la vérification des doublons sur les livres ajoutés, vérifie également le champ langue. De cette façon les livres avec le même titre/auteur mais avec une langue différente ne sont pas considérés comme des doublons.
pt_br: Ao verificar itens duplicados nos livros adicionados, também verifica o campo idioma. Assim, livros com os mesmos título/autor, mas idiomas diferentes, não serão considerados duplicados.
uk: Під час перевірки доданих книг на дублювання тепер також перевіряється поле мови. Отже, книги із однаковими параметрами назви і авторів, але написані різними мовами, не вважаються дублікатами.

source: Edit Book: Spell check should not fail if there are non-HTML files in the spine
es: Modificar libro: La comprobación de ortografía no debería fallar si hay archivos no HTML en el lomo
fr: Éditer le livre : La vérification orthographique ne devrait plus échouer s'il y a des fichiers non-HTML dans la structure organisationnelle
pt_br: Editar livro: Correção ortográfica não deve falhar se existirem arquivos que não sejam HTML no elemento 'spine'
uk: Редагувуання книг: усунено аварійне завершення засобу перевірки правопису, якщо у книзі є файли, відмінні від HTML.

source: Conversion: Fix an error when using the embed_all_fonts option with certain books
es: Conversión: Se corrige un error al usar la opción «embed_all_fonts» con algunos libros
fr: Conversion : Corrige une erreur lors de l'utilisation de embed_all_fonts avec certains livres
pt_br: Conversão: Corrige um erro ao utilizar a opção --embed-all-fonts em certos livros
uk: Перетворення: виправлено помилку, пов'язану із використанням параметра embed_all_fonts для деяких книг.

source: Save to disk: Dont error out if the user deletes all formats to be saved.
es: Guardar en disco: No se emite un error si el usuario elimina todos los formatos para guardar.
fr: Sauvegarder sur le disque : N'affiche pas d'erreur si l'utilisateur supprime tous les formats à sauvegarder.
pt_br: Salvar no disco: Não encerrar com erro se o usuário deletar todos os formatos a serem salvos.
uk: Збереження на диск: програма більше не показує повідомлення про помилку, якщо користувач вилучає усі формати, які слід зберегти.

source: Linux binary: Fix calibre not starting on systems where QT_QPA_PLATFORM is set to use wayland
es: Binario Linux: Se corrige el fallo por el que calibre no se iniciaba en sistemas donde QT_QPA_PLATFORM está configurado para usar wayland
fr: Binaire Linux : Corrige le fait que calibre ne démarre pas sur des systèmes où QT_QPA_PLATFORM est défini pour utiliser wayland
pt_br: Arquivo binário Linux: Corrige o calibre não iniciando em sistemas onde QT_QPA_PLATFORM está definido para usar 'wayland'
uk: Виконуваний файл для Linux: тепер calibre запускається на системах, де QT_QPA_PLATFORM налаштовано на використання wayland.

source: Driver for the new Nook Glowlight 3
es: Controlador para el nuevo Nook Glowlight 3
fr: Pilote pour le nouveau Nook Glowlight 3
pt_br: Driver para o novo Nook Glowlight 3
uk: Драйвер для нового Nook Glowlight 3

source: Allow configuring the metadata fields displayed in the pop-up Book details window. To configure, simply click the 'Configure' link at the bottom of the window.
es: Permitir configurar los campos de metadatos que se muestran en la ventana emergente de detalles del libro. Para configurar, simplemente pulse en el enlace «Configurar» en la parte inferior de la ventana.
fr: Permettre la configuration des champs de métadonnées affichés dans la fenêtre "surgissante" des Détails du livre . Pour configurer, cliquez simplement sur le lien 'Configurer' au bas de la fenêtre.
pt_br: Permite configurar os campos de metadados exibidos na janela de detalhes do livro. Para configurar, simplesmente clique no link 'Configurar' na parte inferior da janela.
uk: Уможливлено налаштовування полів метаданих, які показуються програмою на контекстній панелі подробиць щодо книги. Щоб налаштувати ці параметри, просто натисніть посилання «Налаштувати» у нижній частині вікна.

source: Wireless driver: Allow specifying extra file formats (unknown to calibre) to send
es: Controlador inalámbrico: Permitir especificar formatos de archivo adicionales (desconocidos para calibre) para enviar
fr: Pilote sans fil : Permettre de spécifier des formats de fichier supplémentaires (inconnus de calibre) à envoyer
pt_br: Driver da conexão sem fio: Permite especificar formatos de arquivo extra (desconhecidos para o calibre) para enviar
uk: Драйвер бездротових мереж: уможливлено визначення додаткових форматів файлів (які не відомі calibre) для надсилання на пристрої.

source: Fix a regression that caused clicking the clear button in the main search bar to not unapply the current search until enter is pressed.
es: Corregida una regresión por la que al pulsar el botón borrar en la barra de búsqueda principal no se desactivaba la búsqueda actual hasta que no se pulsaba intro.
fr: Solutionne une régression qui entraînait le fait que, cliquer sur le bouton effacer de la barre de recherche principale, ne supprimait pas la recherche en cours temps que la touche entrée n'était pas activée.
pt_br: Corrige uma regressão que fazia com que clicar no botão 'limpar' na barra de busca principal não desfizesse a busca atual até que a tecla 'enter' fosse pressionada.
uk: Виправлено регресію, яка призводила до того, що натискання кнопки спороження основного рядка пошуку не призводило до скасовування поточного пошуку, аж доки не було натиснуто клавішу Enter.

source: Linux: Fix a regression causing calibre to fail to start on systems with no DBUS session bus
es: Linux: Corrige una regresión que hace que calibre no se inicie en sistemas sin bus de sesión DBUS
fr: Linux : Correction d'une régression empêchant le démarrage de calibre sur des systèmes sans session bus DBUS
pt_br: Linux: Corrige uma regressão que faz com que o calibre falhe ao iniciar sistemas sem barramento de sessão DBUS
uk: Linux: виправлено регресію, яка призводила до того, що calibre не можна було запустити у системах без каналу сеансу DBUS.
