Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: calibre not only can <b>download all the metadata</b> for an e-book (things like title, author, publisher, ISBN, tags, cover or summary) but will also allow you to edit or create metadata in existing or new fields. That way you can track which books you’ve read and which ones you liked. You can also take advantage of the <b>advanced search and sorting</b> functions that use tags, authors, comments and more. You will find the book you were looking for in seconds!
fr: calibre n'est pas seulement capable de <b>télécharger toutes les métadonnées</b> pour un livre numérique (des choses comme le titre, l'auteur, l'éditeur, le ISBN, les étiquettes, la couverture ou le résumé) mais il vous permettra également de modifier ou de créer des métadonnées dans des champs existants ou nouveaux. De cette manière vous pouvez suivre quels livres vous avez lu et lesquels vous appréciez. Vous pouvez également prendre avantage des fonctions de <b>recherche avancée et de tri</b> qui utilisent les étiquettes, auteurs, commentaire et beaucoup plus. Vous trouverez le livre que vous cherchez en quelques secondes !
pt_br: O calibre não apenas pode <b>baixar todos os metadados</b> de um e-book (coisas como título, autor, editora, ISBN, etiquetas, capa ou descrição) mas também permite que você edite ou crie metadados em campos novos ou existentes. Dessa maneira você pode acompanhar quais livos você leu e quais você gostou. Você também pode tirar vantagem das funções de <b>pesquisa avançada e organização</b> que usam etiquetas, autores, comentários, e mais. Você encontrará o livro que estava procurando em segundos!
uk: calibre може не лише <b>отримувати усі метадані</b> щодо книги (дані щодо назви, автора, видавця, ISBN, міток, обкладинки або резюме), вона надає вам змогу редагувати або створювати метадані у наявних або нових полях. За допомогою метаданих ви зможете вказувати книги, які ви вже прочитали, та книги, які вам сподобалися. Ви також можете скористатися перевагами системи <b>розширеного пошуку та упорядковування</b>, яка використовує дані міток, імен авторів, коментарів та інші дані. Ви зможете знаходити потрібну вам книгу за лічені секунди!

source: Use it everywhere and with anything
es: Úselo en cualquier parte y con cualquier cosa
fr: Utilisez le partout et avec n'importe quoi
pt_br: Use-o em todo lugar e com tudo
uk: Читайте книги будь-де за допомогою будь-яких пристроїв

source: calibre supports almost <b>every single e-Reader</b> and is compatible with more devices with every update. You can transfer your e-books from one device to another in seconds, <b>wirelessly</b> or with a cable. And you don’t need any additional tools to do that. calibre will send the <b>best file format</b> for your device converting it if needed, automatically.
fr: calibre supporte presque <b>toutes les liseuses</b> et est compatible avec encore plus de périphériques à chaque mise à jour. Vous pouvez transférer vos livres numériques d'un périphérique à un autre en quelques secondes, <b>sans fil</b> ou avec un câble. Et vous n'avez besoin d'aucun outil additionnel pour cela. calibre enverra le <b>meilleur format de fichier</b> à votre périphérique en le convertissant automatiquement si nécessaire.
pt_br: O calibre suporta quase <b>todos os leitores digitais</b> e se torna compatível com mais dispositivos a cada atualização. Você pode transferir seus e-books de um dispositivo para outro em segundos, <b>sem fio</b> ou com um cabo. E você não precisa de nenhuma ferramenta adicional para isso. O calibre irá enviar o<b>melhor formato</b> para o seu dispositivo, convertendo se necessário, automaticamente.
uk: У calibre передбачено підтримку майже <b>усіх пристроїв для читання електронних книг</b>. Перелік пристроїв, з якими сумісна програма, зростає із кожним випуском. За допомогою програми ви зможете переносити ваші електронні книги з одного пристрою на інший за секунди за допомогою <b>бездротового зв'язку</b> або кабелю. Для цього вам не потрібні будуть ніякі додаткові програми. calibre надішле дані у <b>найвідповіднішому форматі</b> для вашого пристрою, автоматично перетворивши їх, якщо у цьому виникне потреба.

source: No matter what PC, laptop or tablet you use, calibre’s got you covered. And if you’re traveling and don’t have your device with you – you can take calibre on a USB stick and <b>use it wherever you are</b>.
fr: Peu importe que vous utilisiez un PC, un portable ou une tablette, calibre couvre vos besoins. Et si vous voyagez et n'avez pas votre appareil avec vous – vous pouvez prendre calibre sur une clé USB et <b>l'utiliser où que vous soyez</b>.
pt_br: Não importa qual PC, notebook ou tablet você usa, o calibre oferece cobertura. E se você está viajando e não está com o seu dispositivo – você pode levar o calibre em pendrive e <b>usá-lo onde quer que esteja</b>.
uk: Байдуже чим, комп'ютером, ноутбуком чи планшетом, ви користуєтеся, calibre буде корисним для вас. Якщо ви подорожуєте і не маєте звичного пристрою для читання з собою, ви можете взяти із собою флешку USB з calibre і <b>читати книги будь-де</b>.

source: calibre can convert dozens of file types. No matter where you got your e-book from, it’ll be ready for your device in no time. When converting, you can also automatically change the book’s style, create a table of contents or improve punctuation and margins. calibre will also detect the format that’s best suited for your device on its own, so you don’t have to bother.
fr: calibre peu convertir des douzaines de types de fichier. Peu importe d'où vous avez obtenu votre livre numérique, il sera prêt pour votre périphérique en peu de temps. Lors de la conversion, vous pouvez aussi automatiquement changer le style du livre, créer une table des matière ou améliorer la ponctuation et les marges. calibre détectera aussi quel format est le plus approprié pour votre périphérique de lui-même, donc vous n'avez pas à vous inquiéter.
pt_br: O calibre pode converter dezenas de tipos de arquivos. Não importa onde conseguiu seu e-book, ele estará pronto para o seu dispositivo rapidamente. Ao converter, você também pode alterar automaticamente o estilo do livro, criar um índice ou melhorar pontuação e margens. O calibre também irá detectar o melhor formato para o seu dispositivo por conta própria, de maneira que você não precise se preocupar.
uk: calibre може перетворювати дані у десятках типів файлів. Байдуже, звідки ви взяли вашу електронну книгу, програма приготує її для читання на вашому пристрою за лічені секунди. Під час перетворення ви можете наказати програмі автоматично змінити стиль, створити таблицю змісту або поліпшити пунктуацію тексту та розмір полів. Крім того, calibre автоматично визначить формат, який є найпридатнішим для вашого пристрою, отже вам не доведеться самим його визначати.

source: calibre can also turn your personal documents to e-books or create them from scratch. It can also take all the mundane things that go with it off your plate. It has automatic style helpers and scripts generating the book’s structure. You focus on the content, calibre will take care of the rest.
fr: calibre peut aussi transformer vos documents personnels en livres numériques ou les créer à partir de zéro. Il peut aussi retirer toutes les choses ennuyeuses qui vont avec. Il a des assistants automatiques de style et des scripts générant la structure du livre. Vous vous concentrez sur le contenu, calibre prendra soin du reste.
pt_br: O calibre também pode converter o seus documentos pessoais em e-books ou criá-lo do zero. Ele também pode tomar para si todas as coisas mundanas do processo. Ele possui ajudantes de estilo automáticos e scripts que geram a estrutura dos livros. Você foca no conteúdo, e o calibre toma conta do resto.
uk: Крім того, calibre може перетворювати ваші особисті документи на електронні книги або створювати електронні книги «з нуля». Також у програмі ви знайдете усі засоби для побудови власної книги. У ній передбачено засоби автоматичної допомоги у створенні стилів і скрипти для обробки структури книги. Вам достатньо зосередитися на вмісті книги, про решту подбає calibre.

source: Comprehensive e-book viewer
es: VIsor de libros electrónicos completo
fr: Visionneuse de livre numérique complète
pt_br: Visualizador de e-book completo
uk: Всебічний засіб для читання книг

source: calibre has a built-in e-book viewer that can display <b>all the major e-book formats</b>. It has full support for Table of Contents, bookmarks, CSS, a reference mode, printing, searching, copying, multi-page view, embedded fonts, and on and on…
fr: calibre à une visionneuse intégrée de livre numérique qui peut afficher <b>tous les formats de livre numérique principaux</b>. Il prend complètement en charge les Tables des Matières, les favoris, le CCS, un mode de référence, l'impression, la recherche, la copie, la vue multi pages, les polices embarquées, et bien plus...
pt_br: O calibre possui um visualizador de e-books integrado que pode exibir<b>todos os principais formatos de e-books</b>. Ele possui suporte complete para Índice, marcadores, CSS, mode de referência, impressão, busca, cópia, visualização multi-página, fontes incorporadas, e por aí vai…
uk: У calibre є вбудований засіб для перегляду електронних книг, який здатен показувати <b>дані у більшості форматів електронних книг</b>. Передбачено повну підтримку таблиці змісту, закладок, CSS, режиму посилань, друку, пошуку, копіювання, одночасного перегляду декількох сторінок, вбудованих шрифтів тощо…

source: Download news/magazines from the web
es: Descargue noticias y revistas desde la web
fr: Télécharger des actualités/magazines depuis le web
pt_br: Baixe notícias/revistas da web
uk: Отримання новин та журналів з інтернету

source: calibre can make sure you know what’s happening and <b>automatically deliver stories</b> to your device from hundreds of news sources like The Economist, New York Times, New Yorker Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…
fr: calibre peut assurer que vous sachiez ce qui se passe et <b>délivre automatiquement des récits</b> sur votre périphérique à partir de centaines de sources d'actualités comme Le Monde, Le Monde diplomatique, La Libre Belgique, le Journal de Montréal, Le Point, Les Échos, le New York Times, National Geographic, BBC News, Le Soir et tant d'autres...
pt_br: O calibre pode garantir que você saiba o que está acontecendo e <b>automaticamente entregar histórias</b> no seu dispositivo a partir de centenas de fontes de notícias, como The Economist, New York Times, New Yorker, Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…
uk: calibre може тримати вас у курсі подій і <b>автоматично отримувати новини</b> на ваш пристрій для читання з сотень джерел новин, зокрема з The Economist, New York Times, New Yorker Magazine, The Guardian, BBC News, National Geographic, CNN, The Wall Street Journal, The Washington Post, The Atlantic, Scientific American, Wired Magazine, The Telegraph, Forbes, Ars Technica…

source: You can also teach calibre to deliver news from completely different sites or take advantage of any <b>RSS feed</b>. No searching, no waiting, no hassle.
fr: Vous pouvez aussi apprendre à calibre de délivrer des actualités à partir de sites complètement différents ou tirer avantage de n'importe quel <b>Flux RSS</b>. Pas de recherche, pas d'attente, pas d'embêtements.
pt_br: Você pode também ensinar ao calibre entregar notícias de sites completamente diferentes ou tirar vantagem de qualquer <b>feed RSS</b>. Sem pesquisa, sem espera, sem dificuldade.
uk: Ви також можете навчити calibre отримувати новини із будь-яких сайтів або видобувати дані із будь-якої <b>подачі RSS</b>. Без зайвого пошуку, без марного очікування, без проблем.

source: Share and backup your library easily
es: Comparta y salvaguarde su biblioteca con facilidad
fr: Partager et sauvegarder facilement votre bibliothèque
pt_br: Compartilhe e faça backup da sua biblioteca facilmente
uk: Просте оприлюднення вашої бібліотеки і створення її резервних копій

source: calibre comes with a <b>handy web server</b> to host your library. In just a few moments you can <b>safely share</b> all (or just some) of your e-books with anyone you choose or access them yourself from anywhere, using any device you like. With the server, you can read the books in your calibre library on any phone/tablet using just a browser. It even works offline.
fr: calibre est accompagné d'un <b>serveur web pratique</b> pour héberger votre bibliothèque. En seulement quelques instants vous pouvez <b>partager en toute sécurité</b> tous (ou juste certains de) vos livres numériques avec quiconque de votre choix ou y accéder vous même de n'importe où, en utilisant n'importe quel périphérique de votre préférence. Avec le serveur, vous pouvez lire les livres de votre bibliothèque calibre sur tout téléphone/tablette en utilisant juste un navigateur. Il peut même fonctionner hors ligne.
pt_br: O calibre vem com um <b>prático servidor</b> para hospedar sua biblioteca. Em apenas alguns instantes você pode <b>facilmente compartilhar</b> todos (ou alguns) dos seus livros com qualquer um ou acessá-los você mesmo de de qualquer lugar, usando qualquer dispositivo. Com o servidor, você pode ler os livros da sua biblioteca em qualquer celular/tablet apenas utilizando um navegador. Funciona até mesmo offline.
uk: До складу пакунка з calibre включено <b>зручний вебсервер</b> для зберігання даних вашої бібліотеки. Для того, щоб <b>безпечно поділитися</b> усіма (або лише частиною) ваших книг із будь-ким або отримати доступ до ваших книг з будь-якого місця та будь-якого пристрою, достатньо декількох секунд. За допомогою сервера ви зможете читати книги з вашої бібліотеки calibre на телефоні або планшеті, користуючись лише програмою для перегляду сторінок інтернету. Даними з сервера можна користуватися навіть без доступу до інтернету.

source: calibre has also some useful backup and import/export features that will guarantee the safety and portability of your book collection with minimal fuss.
fr: calibre a également d'utiles fonctionnalités de sauvegarde et d'import/export qui garantiront la sécurité et la portabilité de votre collection de livres sans se compliquer la vie.
pt_br: O calibre também possui algumas funções úteis de backup e importar/exportar que irão garantir a segurança e a portabilidade da sua coleção com o mínimo de trabalho.
uk: У calibre також передбачено корисні можливості зі створення резервних копій, імпортування та експортування дадних, які гарантують безпеку та можливості перенесення вашої збірки книг із мінімальними зусиллями.

source: Edit the books in your collection
es: Modifique los libros de su colección
fr: Éditer les livres de votre collection
pt_br: Edite os livros da sua coleção
uk: Редагування книг у вашій збірці

source: For the e-book nerds amongst you, calibre has a built-in editor that allows you to <b>edit e-books</b> in the most popular e-book formats, EPUB and Kindle. The editor has many sophisticated features to make editing the innards of e-books as easy and efficient as possible.
fr: Pour les acharnés du livre numérique parmi vous, calibre a un éditeur intégré qui vous permet d'<b>éditer des livres numériques</b> dans les formats les plus populaires, EPUB et Kindle. L'éditeur possède de nombreuses fonctionnalités pour rendre l'édition des entrailles des livres numériques aussi simple et efficiente que possible.
pt_br: Para os nerds de e-books entre vocês, o calibre possui um editor integrado que permite que você <b>edite e-books</b> nos formatos mais populares, EPUB e Kindle. O editor possui inúmeras funções sofisticadas para tornar a edição das entranhas dos e-books tão fácil e eficiente quanto possível.
uk: Для ентузіастів у calibre передбачено редактор, за допомогою якого ви зможете <b>редагувати електронні книги</b> у більшості найпопулярніших форматів, зокрема форматах EPUB та Kindle. У редакторі передбачено багато складні можливості, які спрощують і роблять якомога ефективнішим редагування електронних книг.

source: Satisfy every e-book need and get support
es: Cumpla todas sus necesidades de libros electrónicos y reciba ayuda
fr: Satisfaire tous les besoins en matière de livre numérique et donner du support
pt_br: Satisfaça todas as suas necessidades de e-books e obtenha suporte
uk: Виконання будь-яких операцій із книгами та отримання підтримки

source: It’s unlikely, but if you find out there’s a feature you need but calibre lacks it, you can use the <b>built-in plugin explorer</b>. Many users develop plugins to enhance and expand calibre’s features. You can browse through <b>hundreds of plugins</b> directly from calibre and install them with just one click.
fr: C'est peu probable, mais si vous trouvez qu'il y a une fonctionnalité dont vous avez besoin mais que calibre a oubliée, vous pouvez utiliser <b>l'explorateur intégré d'extensions</b>. Beaucoup d'utilisateurs développent des extensions pour améliorer ou étendre les fonctionnalités de calibre. Vous pouvez parcourir <b>des centaines d'extensions</b> directement à partir de calibre et les installer en un seul clic.
pt_br: É pouco provável, mas se você encontrar por aí uma função que você necessita, mas falta no calibre, você pode utilizar o <b>explorador de plugins integrado</b>. Muitos usuários desenvolvem plugins para melhorar e expandir as funções do calibre. Você pode navegar pelas <b>centenas de plugins</b> diretamente no calibre e instalá-los com apenas um clique.
uk: Малоймовірна ситуація, але якщо вам потрібна буде якась можливість, якої немає у стандартному комплекті calibre, ви можете скористатися <b>вбудованим навігатором додатками</b>. Багато користувачів створюють додатки, які розширюють можливості calibre. Ви можете вибрати якийсь із <b>сотень додатків</b> безпосередньо з calibre і встановити його одним клацанням кнопкою миші.

source: calibre has more than 3 million active installs and has <b>lots of fans</b>! You will never have to wait to solve any issue you might encounter: you can use the <a href="%(help)s">extensive help resources</a> just ask members of the <a href="%(mr)s">calibre forum</a>.
fr: calibre à plus de 3 millions d'installations actives et a <b>de nombreux fans</b> ! Vous ne devrez jamais attendre pour résoudre un problème quelconque que vous pourriez rencontrer : vous pouvez utiliser <a href="%(help)s">de considérables ressources d'aide</a> en interrogeant les membres du <a href="%(mr)s">forum calibre</a>.
pt_br: O calibre possui mais de 3 milhões de instalações ativas e tem <b>muitos fãs</b>! Você nunca terá que esperar para resolver qualquer problema que possa encontrar: você pode utilizar os <a href="%(help)s">extensivos recursos de ajuda</a>. Apenas pergunte aos membros do <a href="%(mr)s">fórum do calibre</a>.
uk: Встановлено понад 3 мільйонів екземплярів calibre, у програми <b>дуже багато прихильників</b>! Вам не доведеться довго чекати на вирішення будь-яких проблем, із якими ви можете зіткнутися: ви можете скористатися <a href="%(help)s">широкими довідковими ресурсами</a> — достатньо спитати учасників <a href="%(mr)s">форуму calibre</a>.

source: calibre is created by <b>book lovers</b>, for book lovers. Hundreds of motivated <b>volunteers develop</b> calibre and deliver updates on a regular basis. Most issues are <b>resolved in a week</b>. With every update, we fix bugs, add new features and make calibre more compatible, faster and easier.
fr: calibre est créé par <b>des amoureux du livre</b>, pour des amoureux du livre. Des centaines de <b>volontaires motivés développent</b> calibre et délivrent des mises à jour sur une base régulière. La plupart des problèmes sont <b>résolus dans la semaine</b>. Avec chaque mise à jour, nous corrigeons des bogues, ajoutons de nouvelles fonctionnalités et rendons calibre plus compatible, rapide et facile.
pt_br: O calibre foi criado por <b>amantes dos livros</b>, para os amantes dos livros. Centenas de motivados <b>voluntários desenvolvem</b> o calibre e entregam atualizações de forma regular. A maioria dos problemas são <b>resolvidos em uma semana</b>. Com cada atualização, nós corrigimos erros, adicionamos novos recursos e tornamos o calibre mais compatível, rápido e fácil.
uk: calibre створено <b>книголюбами</b> для книголюбів. Сотні мотивованих <b>добровольців розробляють</b> calibre та створюють регулярні оновлення програми. Більшість проблем <b>вирішуються протягом тижня</b>. З кожним оновленням ми виправляємо вади, додаємо нові можливості та робимо calibre суміснішою, швидшою та простішою у користуванні.

source: Celebrate 10 years of excellence with us and <a href="%(href)s">download</a> calibre today!</b>
es: ¡Celebre con nosotros 10 años de excelencia y <a href="%(href)s">descargue</a> calibre hoy mismo!</b>
fr: Célébrez 10 ans d'excellence avec nous et <a href="%(href)s">téléchargez</a> calibre aujourd'hui !</b>
pt_br: Celebre 10 anos de excelência conosco e <a href="%(href)s">baixe</a> o calibre hoje!</b>
uk: Відзначте разом із нами 10 років цієї чудової програми — <a href="%(href)s">встановіть</a> calibre вже зараз!</b>
