Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Cover grid: Fix Shift+arrow keys to manipulate selection not working.
es: Cuadro de portadas: Corregidas las teclas Mayús+flechas para manipular la selección, que no funcionaban.
fr: Grille de couvertures : Solutionne le fait que les touches Shift+flèche ne fonctionnent pas pour manipuler la sélection.
pt_br: Grade de capas: Corrige falha no atalho 'Shift+setas' para manipular seleções.
uk: Таблиця обкладинок: виправлено роботу комбінацій клавіш Shift+стрілка для керування позначенням.

source: Editor snippets: Dont lose the last selected word when the user triggers a non-existent snippet.
es: Fragmentos del editor: No perder la última palabra seleccionada cuando el usuario activa un fragmento inexistente.
fr: Éditeur de fragments : Ne perd pas le dernier mot sélectionné lorsque l'utilisateur déclenche un fragment inexistant.
pt_br: Trechos do Editor: Não perde a última palavra selecionada quando o usuário aciona um trecho não existente.
uk: Фрагменти для редагування: усунено втрату останнього позначеного слова, якщо користувачем використано неіснуючий фрагмент.

source: Book details popup window: Show the cover size in the bottom right corner if the option to show cover size in the Book details panel is set.
es: Ventana emergente de detalles del libro: Mostrar el tamaño de portada en la esquina inferior derecha si la opción para mostrar el tamaño de portada en el panel de detalles del libro está activada.
fr: Fenêtre popup des détails du livre : Affiche la taille de couverture dans le coin inférieur droit si l'option pour afficher la taille de couverture est définie dans le panneau Détails du livre.
pt_br: Janela pop-up de detalhes do livro: Exibe o tamanho da capa no canto direito inferior se a opção de mostrar tamanho da capa no painel de detalhes de livro estiver definida.
uk: Контекстне вікно подробиць щодо книги: реалізовано показ розмірів зображення обкладинки у нижньому правому куті, якщо позначено відповідний пункт на панелі подробиць щодо книги.

source: Linux: Fix regression that broke using calibre on some older VNC servers
es: Linux: Corregida regresión que estropeó el uso de calibre en algunos servidores VNC antiguos
fr: Linux : Corrige une régression qui empêche l'utilisation de calibre sur certains anciens serveurs VNC.
pt_br: Linux: Corrige uma regressão que danificou a utilização do calibre em alguns servidores VNC antigos
uk: Linux: виправлено регресію, яка заважала використанню calibre на деяких застарілих серверах VNC

source: Browser viewer: Do not fail if the book contains javascript that has errors.
es: Visor de navegador: No fallar si el libro contiene javascript con errores.
fr: Visionneuse du navigateur : N'échoue pas si le le livre contient du javascript qui a des erreurs.
pt_br: Visualizador do navegador: Não falha se o livro contém javascript que possui erros.
uk: Перегладач на панелі навігації: реалізовано належну обробку книг із javascript з помилками.

source: Linux: Fix file open dialog on older KDE desktops not working correctly.
es: Linux: Corregido el diálogo de abrir archivo, que no funcionaba correctamente en escritorios KDE antiguos.
fr: Linux : Corrige la boîte de dialogue d'ouverture de de fichier ne fonctionnant pas correctement sur d'anciens bureaux KDE.
pt_br: Linux: Corrige falha na tela de abertura de arquivos em desktops KDE antigos.
uk: Linux: виправлено роботу діалогового вікна відкриття файлів у KDE.

source: Update Ozon.ru metadata plugin for website changes.
es: Actualizado el complemento de metadatos Ozon.ru por cambios en el sitio web.
fr: Mise à jour de l'extension Ozon.ru en raison de changements au site web.
pt_br: Atualiza o plugin de metadados do Ozon.ru por conta de alterações no site.
uk: Оновлено додаток метаданих Ozon.ru відповідно до змін на сайті.

source: LIT Input: Fix a buffer overflow caused by malformed LIT files.
es: Entrada LIT: Corregido un desbordamiento de búfer causado por archivos LIT erróneos.
fr: Format LIT en entrée : Corrige un débordement de tampon causé par les des fichier LIT mal formés.
pt_br: Entrada LIT: Corrige um estouro de buffer causado por arquivos LIT malformados.
uk: Вхідні дані LIT: усунено переповнення буфера, спричинене помилковим форматуванням у файлах LIT.

source: Conversion: Expand -epub-writing-mode to -webkit-writing-mode and writing-mode properties for maximum compatibility.
es: Conversión: Extender -epub-writing-mode a -webkit-writing-mode y propiedades de modo de escritura para máxima compatibilidad.
fr: Conversion: Élargir les propriétés de -epub-writing-mode à -webkit-writing-mode et writing-mode pour un maximum de compatibilité.
pt_br: Conversão: Expande '-epub-writing-mode' para as propriedades '-webkit-writing-mode' e 'writing-mode', para máxima compatibilidade.
uk: Перетворення: розширено -epub-writing-mode на властивості -webkit-writing-mode і writing-mode для максимальної сумісності.

source: Linux: Fix SONY PRS-650 not being detected
es: Linux: Corregida la detección de SONI PRS-650
fr: Linux : Correction du fait que le SONY PRS-650 ne soit pas détecté
pt_br: Linux: Corrige o SONY PRS-650 não sendo detectado
uk: Linux: виправлено виявлення SONY PRS-650

source: Allow searching for books in a virtual library using a new 'vl:' prefix
es: Se permite buscar libros en una biblioteca virtual usando el nuevo prefijo «vl:»
fr: Permettre la recherche de livres dans une bibliothèque virtuelle en utilisant le nouveau préfixe 'vl:'
pt_br: Permite buscar por livros em uma biblioteca virtual usando um novo prefixo 'vl:'
uk: Реалізовано пошук книг у віртуальні бібліотеці за допомогою префікса «vl:»

source: Server: Show file sizes in the tooltips for the download buttons.
es: Servidor: Se muestran los tamaños de archivo en la ayuda emergente de los botones de descarga.
fr: Serveur : Afficher les tailles de fichiers dans l'infobulle des boutons de téléchargement.
pt_br: Servidor: Exibe o tamanho de arquivos na dica de contexto para os botões de download.
uk: Сервер: реалізовано показ розмірів файлів на панелях підказок кнопок для отримання даних.

source: Server: Reduce the grid view minimum cover thumbnail size from 150px to 105px
es: Servidor: Se reduce el tamaño mínimo de las miniaturas en la vista de cuadro de portadas de 150px a 105px
fr: Serveur : Réduire la taille minimale des vignettes dans la vue grille de 150px à 105px
pt_br: Servidor: Reduz o tamanho mínimo da miniatura na exibição em grade de 150px para 105px
uk: Сервер: мінімальний розмір мініатюри обкладинки зменшено з 150 пікселів до 105 пікселів

source: Narrow layout: Fix wasted space to the left of the comments in the Book details panel
es: Distribución estrecha: Corregido el desperdicio de espacio a la izquierda de los comentarios en el panel de detalles del libro
fr: Mise en page condensée : Correction de l'espace gaspillé à la gauche des commentaires dans le panneau Détails du livre
pt_br: Layout estreito: Corrige espaço desperdiçado à esquerda dos comentários no painel de Detalhes do Livro
uk: Вузьке компонування: усунено порожні місця ліворуч від коментарів на панелі параметрів книги

source: Server: Fix downloading files via the list of formats not working when launching calibre from the home screen on iOS
es: Servidor: Corregida la descarga de archivos desde la lista de formatos, que no funcionaba al ejecutar calibre desde la pantalla principal en iOS
fr: Serveur : Correction du téléchargement de fichiers via la liste des formats ne fonctionnant pas lors du démarrage de calibre depuis l'écran d'accueil sous IOS.
pt_br: Servidor: Corrige o não funcionamento do download de arquivos via lista de formatos ao abrir o calibre a partir da tela de principal no iOS
uk: Сервер: виправлено отримання файлів за списком форматів, якщо calibre запущено з початкового екрана на iOS

source: Browser viewer: Fix controls help overlay not being displayed the first time the viewer is used
es: Visor de navegador: Corregida la capa de ayuda de controles, que no se mostraba la primera vez que se usaba el visor
fr: Visionneuse du navigateur : Correction de la superposition des contrôles d'aide qui ne sont pas affichés la première fois que la visionneuse est utilisée
pt_br: Visualizador do navegador: Corrige a sobreposição da ajuda de controles não sendo exibida na primeira vez que o visualizador é utilizado
uk: Панель навігації: тепер накладні довідкові панелі елементів керування показуються і під час першого запуску переглядача

source: MOBI Output: Fix a regression causing a crash for some input documents that specify text-transform or font-variant CSS properties.
es: Salida MOBI: Corregida una regresión que causaba el cierre del programa para algunos documentos que usan las propiedades CSS «text-transform» o «font-variant»
fr: Format MOBI en sortie pour la conversion : Correction d'une régression qui cause le plantage de certains documents d'entrée qui spécifient des propriétés CSS text-transform ou font-variant.
pt_br: Saída MOBI: Corrige uma regressão causando um travamento para alguns documentos de entrada que especificam as propriedades CSS text-transform ou font-variant.
uk: Виведення даних у форматі MOBI: виправлено регресію, пов'язану із аварійним завершенням роботи для деяких документів, у яких визначаються властивості CSS text-transform або font-variant.

source: DOCX Input: Fix framed lists being rendered with the frame inside the bullets instead of outside it.
es: Entrada DOCX: Corregidas las listas recuadradas, en las que el recuadro se mostraba dentro de las viñetas y no fuera.
fr: Format DOCX en entrée pour la conversion : Correction des listes encadrées pour qu'elles soient rendues avec le cadre dans les puces plutôt qu'en dehors de celles-ci.
pt_br: Entrada DOCX: Corrige listas enquadradas sendo mostradas com o quadro dentro dos símbolos de lista, em vez de estar do lado de fora.
uk: Вхідні дані у форматі DOCX: виправлено помилку, пов'язану із тим щодо програма показувала позначки у невпорядкованих списках у рамці поза рамкою.

source: Fix a regression that could cause conversion to crash when using the first-letter CSS pseudo selector and outputting to MOBI or DOCX.
es: Corregida una regresión que podía causar un fallo en la conversión al usar el seudoselector CSS «first-letter» y generar un archivo MOBI o DOCX.
fr: Correction d'une régression qui pourrait entraîner un plantage de la conversion lors de l'utilisation du pseudo sélecteur CSS first-letter lors d'une sortie en MOBI ou DOCX.
pt_br: Corrige uma regressão que poderia causar o travamento da conversão ao usar o pseudo seletor CSS first-letter e escolher a saída como MOBI ou DOCX.
uk: Виправлено регресію, яка призводила до аварійного завершення процесу перетворення при використанні псевдоселектора за першою літерою у CSS і виведенні даних у форматі MOBI або DOCX.

source: Conversion: Fix remove first image option not working for comic input with the disable comic processing option.
es: Conversión: Corregida la opción de eliminar la primera imagen, que no funcionaba con entrada de cómic y la opción de procesado de cómics desactivada.
fr: Conversion : Correction de l'option de suppression de la première image ne fonctionnant pas pour le comic en entrée avec l'option désactivez le comic.
pt_br: Conversão: Corrige o não funcionamento da opção para remover a primeira imagem para entradas HQ com a opção de 'Desativar processamento de HQs'.
uk: Перетворення: усунено непрацездатність можливості вилучення першого зображення для вхідних даних коміксів із вимкненим параметром обробки коміксів.

source: Server: Fix tooltip not working in the cover grid view.
es: Servidor: Corregidas las ayudas emergentes en la vista de cuadro de portadas.
fr: Serveur : Correction de l'infobulle ne fonctionnant pas dans la vue grille de couvertures.
pt_br: Servidor: Corrige a dica de tela não funcionando na visualização de grade de capas.
uk: Сервер: усунено непрацездатність панелей підказок на панелі перегляду таблицею.

source: Workaround for Qt bug that prevented using the shift and ctrl keys with the touchscreen
es: Se evita un fallo de Qt que impide usar las teclas Mayús is Ctrl con pantalla táctil
fr: Solution pour un bug Qt qui empêche l'utilisation des touches shift et ctrl avec un écran tactile
pt_br: Solução alternativa para o bug do Qt que impedia a utilização das teclas shift e ctrl com o touchscreen
uk: Реалізовано обхідний код щодо вади Qt, яка не дозволяє використовувати клавіші shift і ctrl разом із сенсорною панеллю

source: Linux: fix native KDE file dialog not working on older systems
es: Linux: se corrige el diálogo de archivos nativo de KDE, que no funcionaba en algunos sistemas antiguos
fr: Linux : Corrige le fait que la boite de dialogue fichier KDE native ne fonctionne pas sur d'anciens systèmes
pt_br: Linux: corrige o diálogo de arquivos KDE nativo não funcionando em sistemas mais antigos
uk: Linux: усунено непрацездатність типового діалогового вікна для роботи з файлами у KDE на застарілих системах

source: Linux: Fix KDE dialogs not supporting multiple file name filter groups
es: Linux: Se corrigen los diálogos KDE, que no permitían varios grupos de filtros de nombres de archivo
fr: Linux : Correction des boîtes de dialogue KDE ne supportant pas les groupes de filtre multiples sur les noms de fichier
pt_br: Linux: Corrige diálogos KDE não suportando grupos de filtros com múltiplos nomes de arquivos
uk: Linux: виправлено непрацездатність використання декількох груп у фільтруванні списку файлів діалогових вікон KDE

source: Fix libraries being sorted alphabetically by full path rather than just library name
es: Se corrige la ordenación de bibliotecas por su ruta completa en lugar de sólo el nombre de la biblioteca
fr: Correction du fait que les bibliothèques soient triées alphabétiquement par chemin complet plutôt que juste le nom de la bibliothèque
pt_br: Corrige bibliotecas sendo ordenadas alfabeticamente pelo caminho completo em vez de apenas o nome da biblioteca
uk: Виправлено упорядковування бібліотек за повним шляхом замість упорядковування за назвами бібліотек

source: Server: Allow hyphens in user names
es: Servidor: Se permiten guiones en los nombres de usuario
fr: Serveur : Permettre les traits d'union dans les noms d'utilisateurs
pt_br: Servidor: Permite hifens em nomes de usuários
uk: Сервер: уможливлено використання дефісів у іменах користувачів

source: calibredb.exe: Fix misleading error message when connecting to a server with incorrect username or password
es: calibredb.exe: Se corrige un mensaje de error confuso al conectar a un servidor con nombre de usuario o contraseña incorrectos
fr: calibredb.exe : Correction du message d'erreur trompeur lors la connexion à un serveur avec un nom d'utilisateur ou mot de passe incorrect
pt_br: calibredb.exe: Corrige mensagem de erro enganosa ao conectar ao servidor com usuário ou senha incorretos
uk: calibredb.exe: виправлено неточне повідомлення щодо помилки під час спроби з'єднання із сервером із використанням помилкового імені користувача або пароля

source: Linux: Use native file dialogs via zenity or kdialog, if available
es: Linux: Se usan los diálogos de archivo nativos a traves de zenity o kdialog, si están disponibles
fr: Linux : Utiliser les boites de dialogue de fichier natives via zenity ou kdialog, si disponible
pt_br: Linux: Usa diálogo de arquivos nativo via zenity ou kdialog, se disponível
uk: Linux: реалізовано використання природних діалогових вікон для роботи з файлами на основі zenity або kdialog, якщо доступне

source: Copy to library: Add an action to show a dialog that allows for easy selection of libraries for copy/move. Useful when there are a large number of libraries to choose from.
es: Copiar a biblioteca: Se añade una acción para mostrar un cuadro de diálogo que permite seleccionar bibliotecas para copiar o mover. Es útil cuando hay muchas bibliotecas entre las que elegir.
fr: Copier dans la bibliothèque : Ajout d'une action pour afficher une boîte de dialogue qui permet une sélection facilitée des bibliothèques pour copier/déplacer. Utile lorsqu'il il y a un grand nombre de bibliothèques parmi lesquelles il faut choisir.
pt_br: Copiar para biblioteca: Adiciona uma ação para mostrar um diálogo que permite a seleção fácil de bibliotecas para copiar/mover. Útil quando existe um grande número de bibliotecas para se escolher.
uk: Копіювання до бібліотеки: додано пункт дії для показу діалогового вікна для спрощення вибору бібліотек для копіювання або пересування. Корисно, якщо у вас багато бібліотек.

source: Server: Allow deleting a downloaded book from the "Browse all downloaded books" screen
es: Servidor: Se permite borrar un libro descargado desde la pantalla «Explorar todos los libros descargados»
fr: Serveur : Permettre la suppression d'un livre téléchargé depuis l'écran "Parcourir tous les livres téléchargés"
pt_br: Servidor: Permite deletar um livro baixado na tela "Ver todos os livros baixados"
uk: Сервер: уможливлено вилучення отриманої книги зі сторінки «Навігація усіма отриманими книгами»

source: Hopefully fix an issue with the book list jumping around when using the mouse on some computers
es: Con suerte, se corrige un fallo por el que la lista de libros da saltos al usar el ratón en algunos equipos
fr: Corrige avec un peu de chance un problème avec la liste de livres sautillant en utilisant la souris sur certains ordinateurs
pt_br: Espera-se corrigir um problema com a lista de livros saltando ao utilizar o mouse em alguns computadores
uk: Сподіваємося, виправлено ваду, пов'язану із несподіваними рухами списку книг при використанні для керування миші на деяких комп'ютерах

source: E-book viewer: Change the default fonts on windows to the Liberation font family. This matches the other platforms and avoids rendering issues with Times New Roman.
es: Visor de libros electrónicos: Se cambian los tipos de letra predeterminados en Windows a la familia Liberation. Esto coincide con otras plataformas y evita problemas de visualización con Times New Roman.
fr: Visionneuse de livre numérique : Changement des polices par défaut sous Windows pour la famille de police Liberation. Ceci correspond aux autres plateformes et empêche des problèmes de rendu avec Times New Roman.
pt_br: Visualizador de e-book: Alterar as fontes padrões no Windows para a família de fontes Liberation. Isto combina com as outras plataformas e evita problemas de renderização com a Times New Roman.
uk: Засіб перегляду книг: змінено типовий шрифт у Windows на Liberation. Це уніфікує платформу з іншими платформами і надає змогу уникнути проблем із показом за допомогою Times New Roman.

source: DOCX Output: Convert images placed by themselves inside block tags as block images rather than inline images.
es: Salida DOCX: Se convierten las imágenes aisladas en etiquetas de bloque como imágenes en bloque en lugar de en línea.
fr: Format DOCX en sortie pour la conversion : Convertir les images placées dans des balises block en tant qu'images block plutôt que des images inline.
pt_br: Saída DOCX: Converte imagens posicionadas por elas mesmas dentro tags de bloco como blocos de imagens, em vez de imagens em linha.
uk: Виведення до DOCX: реалізовано перетворення зображень, які розташовуються у блоках на блокові зображення, а не звичайні вбудовані зображення.

source: Fix a typo that broke the download of a few news sources
es: Se corrige un error tipográfico que hacía que fallara la descarga de algunos orígenes de noticias
fr: Correction d'une coquille qui endommage le téléchargement de certaines sources d'actualités
pt_br: Corrige um erro de ortografia que danificou o download de algumas fontes de notícias
uk: Виправлено друкарську помилку, яка заважала отриманню деяких джерел новин

source: ebook-viewer.exe: Fix --continue-reading not working
es: eboo-viewer.exe: Se corrige el fallo por el que --continue-reading no funcionaba
fr: ebook-viewer.exe: Correction de -continue-reading ne fonctionnant pas
pt_br: ebook-viewer.exe: Corrige a opção --continue-reading não funcionando
uk: ebook-viewer.exe: відновлено роботу --continue-reading

source: Fix non XML safe characters in feed descriptions causing news download to fail.
es: Se corrige el fallo por el que los caracteres no seguros para XML en las descripciones de los canales hacían que fallaran las descargas de noticias.
fr: Correction du fait que des caractères sûrs non XML dans les descriptions de flux provoquent l'échec du téléchargement d'actualités.
pt_br: Corrige caracteres não seguros para XML nas descrições de feed causando falha no download de notícias.
uk: Виправлено помилку, пов'язану із тим, що неекрановані символи у XML у описах подач призводили до неможливості отримання новин.

source: Browser viewer: Fix books that contain broken links with unicode characters in their paths not working.
es: Visor de navegador: Se corrige el fallo por el que no funcionaban los libros que contienen enlaces rotos con caracteres Unicode en la ruta.
fr: Visionneuse du navigateur : Corrige le fait que des livres qui contiennent des liens endommagés avec des caractères unicode dans leurs chemins ne fonctionnent pas.
pt_br: Visualizador do navegador: Corrige livros que contêm links quebrados com caracteres unicodes no seu caminho não funcionando.
uk: Панель навігації: усунено непрацездатність посилань на книги із символами Unicode у шляхах.

source: Quickview: Fix regression in previous release that broke the 'Lock quickview' control
es: Vista rápida: Se corrige la regresión en la versión anterior que estropeaba el control «Bloquear vista rápida»
fr: Affichage rapide : Correction d'une régression dans la version précédente qui endommage le contrôle 'Verrouiller l'affichage"
pt_br: Visualização rápida: Corrige uma regressão na versão anterior que danificou o controle 'Bloquear conteúdo da visualização rápida'.
uk: Швидкий перегляд: виправлено регресію у попередньому випуску, яка призводила до непрацездатності кнопки «Заблокувати швидкий перегляд».

source: Server: Add a new 'custom' mode for the book list, where you can specify exactly what metadata fields are displayed, via a template (see Preferences-&gt;Sharing over the net-&gt;Book list template)
es: Servidor: Se añade un nuevo modo «personalizado» para la lista de libros, en el que puede especificar exactamente qué campos se muestran, por medio de una plantilla (véase Preferencias &gt; Compartir por la red &gt; Plantilla de lista de libros)
fr: Serveur : Ajout d'un nouveau mode 'personnalisé' pour la liste de livres, vous pouvez spécifier exactement quelles métadonnées sont affichées, via un modèle (voir Préférences-&gt;Partager sur le net-&gt;Modèle de la liste de livres)
pt_br: Servidor: Adiciona um novo modo 'personalizado' para a lista de livros, onde você pode especificar quais campos de metadados são exibidos, via modelo (veja Preferências-&gt;Compartilhar pela rede-&gt;Modelo de lista de livros)
uk: Сервер: додано новий «нетиповий» режим для списку книг, у якому ви можете визначити точно, які поля метаданих буде показано, за допомогою шаблона (див. «Налаштування -&gt Обмін мережею -&gt; Шаблон списку книг»)

source: Speed up HTML parsing by an order of magnitude, by switching from html5lib to html5-parser
es: El procesado HTML es un orden de magnitud más rápido por el cambio de html5lib a html5-parser
fr: Accélération de l'analyse HTML à un rythme soutenu, en passant de html5lib à html5-parser
pt_br: Acelera o processamento do HTML por uma ordem de magnitude, ao mudar de html5lib para html5-parser
uk: Пришвидшення обробки HTML на порядок унаслідок переходу з html5lib на html5-parser
