Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Please do not use your distribution provided calibre package, as those are often buggy/outdated. Instead use the Binary install described below.
es: Por favor, no use el paquete de calibre proporcionado por su distribución, ya que a menudo tiene fallos o está anticuado. En su lugar, use la instalación binaria como se describe a continuación.
fr: Merci de ne pas utiliser le paquet calibre fourni par votre distribution, ceux-ci sont souvent problématiques/obsolètes. Utilisez plutôt l'installation des binaires décrite ci-dessous.
pt_br: Por favor não utilize o seu pacote de distribuição do calibre fornecido, pois muitas vezes possuem erros e são desatualizados. Em vez disso, utilize os instaladores binários descritos abaixo.
uk: Будь ласка, не використовуйте пакунок calibre з вашого дистрибутива, оскільки часто такі пакунки містять вади або є застарілими. Замість типового пакунка скористайтеся бінарним засобом встановлення у спосіб, який описано нижче.

source: Binary install
es: Instalación binaria
fr: Installation des binaires
pt_br: Instaladores binários
uk: Встановлення бінарних пакунків

source: calibre has a binary install that includes private versions of all its dependencies. It runs on 32-bit and 64-bit Intel compatible machines. To install or upgrade, simply copy paste the following command into a terminal and press Enter:
es: calibre cuenta con una instalación binaria que incluye versiones privadas y todas sus dependencias. Puede ejecutarse en equipos compatibles con Intel de 32 o 64 bits. Para instalar o actualizar, copie y pegue la siguiente orden en una terminal y pulse intro:
fr: calibre a des binaires d'installation qui comprennent des versions privées de toutes ses dépendances. Il fonctionne avec des machines compatibles Intel 32 bits et 64 bits. Pour installer ou mettre à niveau, copiez simplement la commande suivante dans un terminal et appuyez sur Entrée:
pt_br: O calibre tem um instalador binário que inclui versões próprias de todas as suas dependências. Ele roda em máquinas Intel de 32-bit e 64-bit. Para instalar ou atualizar, simplesmente copie e cole o seguinte comando em um terminal e pressione Enter:
uk: Для calibre передбачено бінарну версію, що містить окремі версії всіх її залежностей. Ця версія працює на 32-бітових і 64-бітових Intel-сумісних комп’ютерах. Щоб встановити чи оновити таку версію просто скопіюйте і вставте наступну команду до термінала й натисніть Enter:

source: While you wait for the download to complete, please consider contributing to support the development of calibre.
es: Mientras espera a que termine la descarga, por favor considere contribuir a financiar el desarrollo de calibre.
fr: En attendant que le téléchargement se termine, vous pouvez envisager, si vous le souhaitez, de contribuer pour soutenir le développement de calibre.
pt_br: Enquanto você espera a conclusão do download, por favor considere contribuir para apoiar o desenvolvimento do calibre.
uk: Доки чекаєте на завершення отримання пакунка з програмою, будь ласка, розгляньте можливість фінансової підтримки розробників calibre.

source: If you get an error about an untrusted certificate, that means your computer does not have any root certificates installed and so cannot download the installer securely. If you still want to proceed, pass the --no-check-certificate option to wget, like this:
es: Si recibe un error sobre un certificado sin confianza, eso significa que su equipo no tiene ningún certificado raíz instalado y no puede descargar el instalador de manera segura. Si aún desea continuar, pase la opción «--no-check-certificate» a wget, así:
fr: Si vous obtenez une erreur concernant un certificat non approuvé, cela signifie que votre ordinateur n'a aucun certificat racine installé et ne peut donc pas télécharger le programme d'installation de manière sécurisée. Si vous voulez continuer, passez l'option --no-check-certificate à wget, comme ceci :
pt_br: Se você receber um erro sobre um certificado não confiável, isso significa que o seu computador não possui nenhum certificado raiz instalado e portanto não pode baixar o instalador de maneira segura. Se ainda assim você desejar prosseguir, passe a opção -no-check-certificate to wget, desta maneira:
uk: Якщо вам буде показано повідомлення про ненадійний сертифікат, це означає, що на вашому комп’ютері не встановлено кореневих сертифікатів, отже він не зможе безпечно отримати програму для встановлення. Якщо ви хочете продовжити попри це, передайте до wget параметр --no-check-certificate наступним чином:

source: You must have xdg-utils, wget and python &ge; 2.6 installed on your system before running the installer.
fr: Vous devez avoir installé xdg-utils, wget et python &ge; 2.6 sur votre système avant d'exécuter le programme d'installation.

source: You can uninstall calibre by running <code>%(uninst)s</code>. Alternately, simply deleting the installation directory will remove 99%% of installed files.
es: Puede desinstalar calibre ejecutando <code>%(uninst)s</code>. O puede simplemente borrar el directorio de instalación, lo que eliminará el 99%% de los archivos instalados.
fr: Vous pouvez désinstaller calibre en exécutant <code>%(uninst)s</code>. Alternativement, la suppression du répertoire d'installation supprime 99%% des fichiers installés.
pt_br: Você pode desinstalar o calibre executando o comando <code>%(uninst)s</code>. Alternativamente, simplesmente deletando o diretório de instalação irá remover 99%% dos arquivos instalados.
uk: Вилучити calibre можна за допомогою команди <code>%(uninst)s</code>. Крім того, просте вилучення каталогу встановлення призведе до вилучення 99%% встановлених файлів.

source: You need GLIBC 2.17 or higher and libstdc++.so.6.0.17 (from gcc 4.7.0) or higher to run calibre
es: Necesita GLIBC 2.17 o posterior y libstdc++.so.6.0.17 (de gcc 4.7.0) o posterior para ejecutar calibre
fr: Vous avez besoin de GLIBC 2.17 ou supérieur et llibstdc++.so.6.0.17 (à partir de gcc 4.7.0) ou supérieur pour exécuter calibre.
pt_br: Você precisa do GLIBC 2.17 ou superior e libstdc++.so.6.0.17 (do gcc 4.7.0) ou superior para executar o calibre
uk: Вам знадобляться бібліотеки GLIBC 2.17 або новіші і libstdc++.so.6.0.17 (з gcc 4.7.0) або новіша для роботи з calibre

source: You can change the directory calibre is installed into from the default (/opt) like this:
es: Puede cambiar el directorio donde se instala calibre (el predeterminado es /opt) así:
fr: Vous pouvez modifier le dossier d'installation de calibre par défaut (/opt) comme ceci :
pt_br: Você pode alterar o diretório no qual o calibre está instalado a partir do (/opt) padrão assim:
uk: Ви можете змінити каталог, до якого буде встановлено calibre замість типового (/opt), ось так:

source: Change /opt above to whatever directory you want calibre automatically installed to.
es: Cambie /opt al directorio donde quiera que se instale calibre automáticamente.
fr: Remplacez /opt ci-dessus par le dossier dans lequel vous souhaitez que calibre soit automatiquement installé.
pt_br: Altere o /opt acima para qualquer diretório no qual deseja que o calibre seja instalado.
uk: Замініть /opt на будь-який інший каталог, до якого слід автоматично встановити calibre.

source: You can also do an "isolated" install that only touches files inside the installation directory and does not need to be run as root, like this:
es: También puede realizar una instalación "aislada", que sólo modificará archivos en el directorio de instalación y no necesita ejecutarse como root, así:
fr: Vous pouvez également faire une installation "isolée", qui ne touche que les fichiers dans le répertoire d'installation et n'a pas besoin d'être exécutée en tant que root, comme ceci :
pt_br: Você também pode fazer uma instalação "isolada" que manipula somente arquivos dentro do diretório de instalação e não necessita de ser executado como root, assim:
uk: Крім того, ви можете встановити «ізольований» екземпляр програми, який працюватиме лише з файлами у каталозі встановлення, і який не потрібно буде запускати із правами доступу суперкористувача (root), ось так:

source: Manual binary install or reverting to a previous version
es: Instalación binaria manual o volver a una versión anterior
fr: Installation binaire manuelle ou retour à une version précédente
pt_br: Instalação binária manual ou reversão para uma versão anterior
uk: Встановлення бінарних пакунків вручну або повернення до попередньої версії

source: If you wish to revert to an earlier calibre release or download a calibre upgrade manually, download the tarball of that release from <a href="%(previous_releases)s">here</a> (choose the 32-bit or 64-bit version, as appropriate). Assuming you want calibre in /opt/calibre, run the following command, changing the path to <code>%(tarball)s</code> below as appropriate:
es: Si desea volver a una versión anterior de calibre o descargar manualmente una actualización, descargue el archivo tar de la versión <a href="%(previous_releases)s">aquí</a> (elija la versión de 32 o 64 bits, según su equipo). Suponiendo que quiera calibre en /opt/calibre, ejecute la siguiente orden, cambiando la ruta a <code>%(tarball)s</code> según sea necesario:
fr: Si vous souhaitez revenir à une version de calibre antérieure ou télécharger une mise à jour de calibre manuellement, téléchargez le tarball de cette version <a href="%(previous_releases)s">ici</a> (choisissez la version 32 bits ou 64 bits, selon le cas). En supposant que vous voulez calibre dans /opt/calibre, exécutez la commande suivante, en modifiant le chemin vers <code>%(tarball)s</code> ci-dessous le cas échéant :
pt_br: Se você deseja reverter para uma versão anterior do calibre ou baixar uma atualização do calibre manualmente, baixe uma tarball daquela versão <a href="%(previous_releases)s">daqui</a> (escolha a versão 32-bit ou 64-bit, como apropriado). Imaginando que você queria o calibre no /opt/calibre, execute o seguinte comando, alterando o caminho para o <code>%(tarball)s</code> abaixo como apropriado:
uk: Якщо ви хочете повернутися до якогось попереднього випуску calibre або отримати оновлення calibre вручну, отримайте архів випуску з <a href="%(previous_releases)s">цієї сторінки</a> (виберіть відповідну 32-бітову або 64-бітову версію). Якщо ви хочете встановити calibre до /opt/calibre, віддайте таку команду, замінивши у ній шлях до <code>%(tarball)s</code> на відповідний:

source: Source install
es: Instalación a partir de fuentes
fr: Installation depuis la source
pt_br: Instalação da fonte
uk: Встановлення з початкових кодів

source: WARNING: calibre is a highly complex piece of software with lots of very finicky dependencies. If you install from source, you are on your own. Please do not open bug reports or expect any form of support. You have been warned.
es: ADVERTENCIA: calibre es un programa muy complicado, con muchas dependencias delicadas. Si instala a partir de fuentes, lo hará por su cuenta. Por favor no abra informes de fallos ni espera ningún tipo de ayuda. Está sobre aviso.
fr: AVERTISSEMENT : calibre est un logiciel très complexe avec beaucoup de dépendances très précises. Si vous installez à partir de la source, vous devez vous débrouiller seul. N'ouvrez pas de rapports de bogues et n'attendez aucune forme de support. Vous avez été averti.
pt_br: AVISO: o calibre é um software altamente complexo com muitas dependências complicadas. Se você deseja instalar a partir da fonte, você está por conta própria. Por favor não crie relatórios de erro esperando qualquer forma de suporte. Você foi avisado.
uk: ПОПЕРЕДЖЕННЯ: calibre є доволі складним програмним забезпеченням із багатьма доволі примхливими залежностями. Якщо ви хочете встановити програму із початкових кодів, ви можете це зробити, але, будь ласка, не сповіщайте про вади у версії, зібраній власноруч. Ми вас попереджали.

source: If you're still determined to install from source, read on:
es: Si sigue decidido a instalar a partir de fuentes, siga leyendo:
fr: Si vous êtes toujours déterminé à installer à partir de la source, continuez à lire :
pt_br: Se você ainda está determinado a instalar a partir da fonte, continue lendo:
uk: Якщо ви все ж хочете встановити програму з початкових кодів:

source: Make sure your system has python 2 installed.
es: Asegúrese de que el sistema tiene python 2 instalado.
fr: Assurez-vous que Python 2 est installé sur votre système.
pt_br: Certifique-se de que o seu sistema tem o python 2 instalado.
uk: Переконайтеся, що у системі встановлено python 2.

source: Install the various dependencies listed below
es: Instale las dependencias que se detallan a continuación
fr: Installez les différentes dépendances listées ci-dessous.
pt_br: Instale a vária dependências listadas abaixo
uk: Встановіть залежності програми із наведеного нижче списку

source: Run the following commands in a terminal:
es: Ejectue las siguientes órdenes en una terminal:
fr: Exécutez les commandes suivantes dans un terminal :
pt_br: Execute os seguintes comandos em um terminal:
uk: Віддайте такі команди у терміналі:

source: Dependencies
es: Dependencias
fr: Dépendances
pt_br: Dependências
uk: Залежності

source: The up-to-date list of dependencies that the official calibre binaries are bundled with, can be seen in <a href="%(href)s">%(sj)s</a>. While calibre <i>might</i> work with versions of dependencies other than those listed there, it is not tested/supported. In addition to those dependencies various build time requirements such as pkg-config, a C/C++ compiler, etc are needed. You can also speed up the "Compiling RapydScript" part of the build process considerably by installing <a href="%(href2)s">%(rng)s</a>.
es: La lista actualizada de dependencias que se incluyen en los binarios de calibre puede verse en <a href="%(href)s">%(sj)s</a>. Aunque <i>es posible</i> que calibre se ejecute con versiones distintas de las dependencias, no está probado ni soportado. Además de estas dependencias son necesarios varios requisitos como pkg-config, un compilador de C/C++, etc. También puede acelerar considerablemente la sección "Compiling RapydScript" del proceso instalando <a href="%(href2)s">%(rng)s</a>.
fr: La liste mise à jour des dépendances inclues dans les binaires officiels de calibre est dans <a href="%(href)s">%(sj)s</a>. Bien que l'installation de calibre <i>puisse</i> fonctionner avec d'autres versions des dépendances que celles répertoriées ici, elle n'est pas testée/prise en charge. En plus de ces dépendances, plusieurs autres outils sont nécessaires, tel que pkg-config, un compilateur C/C++, etc. Vous pouvez également accélérer considérablement la partie "Compilation RapydScript" du processus de construction en installant <a href="%(href2)s">%(rng)s</a>.
pt_br: A lista atualizada de dependências que são enviadas junto com os binários oficiais do calibre, pode ser visualizada em <a href="%(href)s">%(sj)s</a>. Embora o calibre <i>possa</i> funcionar com outras versões de dependências além das listadas aqui, isto não é testado/suportado. Além dessas dependências, vários requisitos do momento de construção, como pkg-config, um compilador C/C++, etc, são necessários. Você também pode acelerar a parte do "Compilando RapydScript" consideravelmente instalando o <a href="%(href2)s">%(rng)s</a>.
uk: Поточний список залежностей, з якими пов'язано роботу офіційних виконуваних файлів calibre наведено тут: <a href="%(href)s">%(sj)s</a>. Хоча calibre <i>може</i> працювати із версіями залежностей, які не збігаються із наведеними у цьому списку, перевірки цього факту не виконувалося. Окрім вказаних залежностей, для збирання програми потрібні ще деякі пакунки, зокрема pkg-config, компілятор C/C++ тощо. Крім того, ви можете значно пришвидшити виконання частини«Compiling RapydScript» процесу збирання, якщо встановите <a href="%(href2)s">%(rng)s</a>.

source: Download for %(which)s
es: Descargar para %(which)s
fr: Téléchargement pour %(which)s
pt_br: Download para %(which)s
uk: Отримання пакунків для %(which)s

source: calibre works on Windows Vista, 7, 8 and 10.
es: calibre funciona en Windows Vista, 7, 8 y 10.
fr: calibre fonctionne sous Windows Vista, 7, 8 et 10.
pt_br: O calibre funciona no Windows Vista, 7, 8 e 10.
uk: calibre працює у Windows Vista, 7, 8 та 10.

source: calibre works on macOS 10.9 (Mavericks) and higher.
es: calibre funciona en macOS 10.9 (Mavericks) y posterior.
fr: calibre fonctionne sous macOS 10.9 (Mavericks) et supérieur.
pt_br: O calibre funciona no macOS 10.9 (Mavericks) e superior.
uk: calibre працює у macOS 10.9 (Mavericks) та новіших версіях.

source: Download calibre %(installer_suffix)s
es: Descargar calibre %(installer_suffix)s
fr: Télécharger calibre %(installer_suffix)s
pt_br: Baixe o calibre %(installer_suffix)s
uk: Отримати calibre %(installer_suffix)s

source: 64bit calibre can be installed at the same time as 32bit calibre. The two calibre installs will use the same book library, plugins and settings.
es: La versión de 64 bits de calibre puede instalarse a la vez que la de 32 bits. Las dos instalaciones usarán la misma biblioteca, complementos y configuraciones.
fr: calibre 64bit peut être installé en même temps que calibre 32bit. Les deux installations de calibre utilisent la même bibliothèque, extensions et paramètres
pt_br: O calibre 64bit pode ser instalado simultaneamente ao calibre 32bit. As duas instalações do calibre usarão a mesma biblioteca, plugins e configurações.
uk: 64-бітову версію calibre можна встановити паралельно із 32-бітову версію calibre. Дві версії calibre використовуватимуть ту саму бібліотеку книг, додатки і параметри.

source: If you are using Windows XP please, use calibre 1.48, which works with all Windows XP machines, <a href="%(previous_releases)s/1.48.0">from here</a>. Simply un-install calibre and install 1.48, doing so will not affect your books/settings.
es: Si está usando Windows XP, por favor use calibre 1.48, que funciona en todos los equipos Windows XP, <a href="%(previous_releases)s/1.48.0">de aquí</a>. Desinstale calibre e instale 1.48, lo que no afectará a sus libros o configuraciones.
fr: Si vous utilisez Windows XP utilisez, s'il vous plait, calibre 1.48 qui fonctionne avec toute les machines Windows XP. <a href="%(previous_releases)s/1.48.0">d'ici</a>. Désinstallez simplement calibre et installez 1.48, faire cela n'affectera pas vos livres/paramètres.
pt_br: Se você está usando o Windows XP, por favor use o calibre 1.48, o qual funciona em todas as máquinas com Windows XP, <a href="%(previous_releases)s/1.48.0">aqui</a>. Simplesmente desinstale o calibre e instale o 1.48. Fazer isso não irá afetar seus livros e configurações.
uk: Якщо ви користуєтеся Windows XP, будь ласка, скористайтеся calibre 1.48, версією, яка працює на усіх комп’ютерах під керуванням Windows XP, <a href="%(previous_releases)s/1.48.0">звідсти</a>. Просто вилучіть встановлену версію calibre і встановіть 1.48. Ця дія не зашкодить вашим книгам та параметрам.

source: The application cannot be run from within the dmg. You must drag it to a folder on your filesystem (The Desktop, Applications, wherever).
es: La aplicación no puede ejecutarse en el dmg. Debe arrastrarla a una carpeta en el sistema de archivos (Escritorio, Aplicaciones, lo que sea).
fr: L'application ne peut pas être exécutée à partir du dmg. Vous devez la glisser sur un répertoire de votre système de fichier (Le Bureau, Applications...)
pt_br: O aplicativo não pode ser executado de dentro do dmg. Você deve arrastá-lo para uma pasta no seu sistema de arquivos (Área de Trabalho, Aplicativos, etc).
uk: Програму не можна запускати з образу dmg. Вам слід перетягти її позначку до теки у вашій файловій системі (Desktop, Applications тощо).

source: In order to show calibre in a different language, open the preferences (by pressing ⌘+P) and select your language.
es: Para mostrar calibre en otro idioma, abra las preferencias (pulsando ⌘+P) y seleccione el idioma.
fr: Pour afficher calibre dans une autre langue, ouvrir les préférences (en appuyant ⌘+P) et sélectionner votre langue.
pt_br: Para exibir o calibre em outro idioma, abra as preferências (pressionando ⌘+P) e selecionando seu idioma.
uk: Щоб перемкнути мову інтерфейсу програми, відкрийте налаштування (натисканням комбінації клавіш ⌘+P) і виберіть бажану для вас мову.

source: If you are using macOS 10.8 (Mountain Lion), the last version of calibre that will work on your machine is 2.85.1, available
es: Si está usando macOS 10.8 (Mountain Lion), la última versión de calibre que funcionará en su equipo es 2.85.1, disponible
fr: Si vous utilisez macOS 10.8 (Mountain Lion), la dernière version de calibre qui fonctionne sur votre machine est la 2.85.1
pt_br: Se você está usando o macOS 10.8 (Mountain Lion), a última versão do calibre que funcionará na sua máquina é a 2.85.1, disponível
uk: Якщо ви користуєтеся macOS 10.8 (Mountain Lion), останньою версією calibre, яка працюватиме у вашій системі є 2.85.1, доступна з

source: If you are using macOS older than 10.8 (Mountain Lion), the last version of calibre that will work on your machine is 1.48, available
es: Si está usando macOS anterior a 10.8 (Mountain Lion), la última versión de calibre que funcionará en su equipo es 1.48, disponible
fr: Si vous utilisez une version de macOS plus ancienne que 10.8 (Mountain Lion), la dernière version de calibre qui fonctionne sur votre machine est la 1.48
pt_br: Se você está usando uma versão do macOS anterior à 10.8 (Mountain Lion), a última versão do calibre que irá funcionar na sua máquina é a 1.48, disponível
uk: Якщо ви користуєтеся macOS, старішою за 10.8 (Mountain Lion), останньою версією calibre, яка працюватиме у вашій системі є 1.48, доступна з

source: Watch calibre in action
es: Ver calibre en acción
fr: Regarder calibre en action
pt_br: Observe o calibre em ação
uk: Переглянути calibre у дії

source: Click to watch calibre demo
es: Pulse para ver una demostración de calibre
fr: Cliquez pour regarder la démo calibre
pt_br: Clique para assistir a demonstração do calibre
uk: Натисніть, щоб переглянути демонстрацію calibre

source: calibre is the one stop solution to all your e-book needs
es: calibre es la solución integral para todo lo relacionado con libros electrónicos
fr: calibre est la solution complète à tout vos besoins en livre numérique
pt_br: O calibre é a solução completa para todas as suas necessidades com e-books
uk: Calibre — програма, за допомогою якої можна робити з книгою усе, що потрібно

source: Download calibre
es: Descargar calibre
fr: Télécharger calibre
pt_br: Baixe o calibre
uk: Отримати calibre

source: Get involved
es: Participe
fr: S'impliquer
pt_br: Envolva-se
uk: Приєднатися

source: Browse a collection of recently published books without DRM, that you can use on any device
es: Explorar una colección de libros publicados recientemente sin DRM, que puede usar en cualquier dispositivo.
fr: Parcourir une collection de livres sans DRM récemment publiés que vous pouvez utiliser sur n'importe quel périphérique
pt_br: Procure em uma coleção de livros sem DRM recentemente publicados, que você pode usar em qualquer dispositivo
uk: Перегляньте збірку нещодавно опублікованих криг без DRM, книг, якими ви можете користуватися на будь-якому пристрої

source: Grand tour of calibre
es: Recorrido por calibre
fr: Grand tour de calibre
pt_br: Grand tour do calibre
uk: Повний огляд calibre

source: Get calibre
es: Obtener calibre
fr: Obtenir calibre
pt_br: Obtenha o calibre
uk: Отримати calibre

source: Choose the type of computer on which you plan to use calibre, below:
es: Elija el tipo de ordenador o computadora donde piensa ejecutar calibre:
fr: Choisissez, ci-dessous, le type d'ordinateur sur lequel vous voulez utiliser calibre :
pt_br: Escolha abaixo o tipo de computador no qual você planeja utilizar o calibre:
uk: Виберіть тип системи, на якій ви плануєте використовувати calibre:
