Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: MOBI output: Try to autofix corrupted PNG images in the input document
fr: Format MOBI en sortie : Essai de corriger automatiquement les images PNG corrompues du document d'entrée

source: Nook Glowlight Plus: Send files by default to the NOOK/My Files folder
fr: Nook Glowlight Plus : Envoi par défaut des fichiers vers le répertoire NOOK/My Files

source: E-book viewer: Fix failure to view comic files that contain non-ASCII characters int heir internal filenames
fr: Visionneuse de livre numérique : Corrige une défaillance à voir les fichiers bande dessinée qui contiennent des caractères non-ASCII dans leurs noms de fichier internes

source: Driver for Energy Ereader Screenlight
fr: Pilote pour la liseuse Energy eReader Screenlight

source: DOCX input: Add option to have superscripts/subscripts converted so that they do not affect the line height of the line containing them
fr: Format DOCX en entrée pour la conversion : Ajout d'une option pour la conversion des exposants/indices de manière à ne pas affecter la hauteur de la ligne qui les contient

source: New option to hide empty categories in Tag browser (Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Tag browser)
fr: Nouvelle option pour masquer les catégories vides dans le Navigateur d'étiquettes (Préférences-&gt;Interface-&gt;Apparence &amp; présentation-&gt;Navigateur d'étiquettes)

source: Image compression: Fix spurious zero byte .bak files being created when compressing PNG images inside EPUB files
fr: Compression d'image : Corrige le fait que des fichiers zero byte .bak soient créés lors de la compression d'images PNG dans les fichiers EPUB

source: Image compression: Fix bug that could cause zero byte images files/or file in use errors when compressing images
fr: Compression d'image : Corrige un bug qui pourrait amener des fichiers image zéro byte/ou des erreurs dans le fichier utilisé lors de la compression d'images

source: Fix some icons not being themeable
fr: Corrige le fait que certaines icônes ne puissent être intégrées dans un thème

source: E-book viewer: When using heuristics to detect footnote links check for vertical-align set to top and bottom as well as sub and super
fr: Visionneuse de livre numérique : Lors de l'utilisation d'heuristique pour détecter les liens note de bas de page vérifier vertical-align défini à top et bottom aussi bien qu'a sub et super

source: Book details panel: Display data in right-to-left format when the calibre interface language is set to a right-to-left language such as Hebrew or Arabic
fr: Panneau de détail du livre : Afficher les données dans un format aligné de droite à gauche lorsque la langue de l'interface calibre est définie sur une langue alignée de droite à gauche tel que l'Hébreu ou l'Arabe

source: A new tool to easily export and import all calibre data -- books, settings and plugins
fr: Un nouvel outil pour facilement exporter et importer toutes les données calibre -- livres, paramètres et extensions

source: Right click the calibre icon in the main calibre toolbar and choose "Export/import all calibre data" to run this tool. It is useful if you want to move to a new computer or duplicate your calibre setup on a second computer, with minimal effort. This tool is very new, so if you run into problems, please report bugs. You can always use the old manual method of copying library folders as a fallback
fr: Faire un clic droit sur l'icône calibre dans la barre d'outil principale et choisissez "Exporter/importer toutes les données calibre" pour exécuter cet outil. ceci est utile si vous voulez bouger vers un nouvel ordinateur ou dupliquer votre configuration calibre sur un deuxième ordinateur, avec un minimum d'effort. Cet outil est très neuf, si vous rencontrer des problème, merci de les reporter. Vous pouvez toujours utiliser la vieille méthode manuelle de copie des répertoires de bibliothèque comme solution de repli

source: Get books: Add plugins for Amazon Australia and Amazon India. Also restore the Amazon EU plugins
fr: Obtenir des livres : Ajout d'extensions pour Amazon Australia et Amazon India. Restaure également les extensions Amazon EU

source: PDF input: Fix conversion of PDF documents that contain ASCII control codes in their outlines not working
fr: Format PDF en entrée pour la conversion : Corrige le fait que la conversion de documents PDF qui contiennent des codes de contrôle ASCII dans leurs caractéristiques ne fonctionne pas

source: Edit book: Fix image compression utilities opening a new console per invocation on Windows
fr: Éditer le livre : Solutionne le fait que l'utilitaire de compression d'image ouvre une nouvelle console par invocation sous Windows

source: Image compression: If the compression tools return a zero byte image ignore it and use the original image
fr: Compression d'image : Si l'outil de compression d'image renvoie une image zéro byte, l'ignore et utilise l'image originale à la place

source: Fix a regression that caused book titles in the Book details panel to become clickable
fr: Solutionne une régression qui rend les titres de livre cliquables dans le panneau Détails du livre

source: PDF input: Add support for PDF outlines (bookmarks), if present, they are used as the metadata Table of Contents
fr: Format PDF en entrée pour la conversion : Ajout de la prise en charge des favoris PDF, si présents, Ils sont utilisés comme les métadonnées Table des Matières

source: Book polishing: Add tool to losslessly compress images in the book in order to reduce its filesize, without affecting image quality
fr: Polir le livre : Ajout d'un outil pour compresser les images sans perte dans le livre dans le but de réduire sa taille de fichier sans affecter la qualité de l'image

source: Edit book: Add a new tool to compress images in the book losslessly, accessed from the Tools menu
fr: Éditer le livre : Ajout d'un nouvel outil pour compresser les image sans perte dans le livre, accessible depuis le menu Outils

source: Kobo driver: Add support for new Kobo firmware
fr: Pilote Kobo : Ajout du support du nouveau firmware Kobo

source: Bulk metadata edit dialog: Allow entering fractional numbers into the series number start with control
fr: Boîte de dialogue d'édition des métadonnées par lot : Permettre d'entrer des nombres décimaux dans les numéros de séries

source: Speed up moving libraries by using hardlinks instead of file copies when moving to a location on the same filesystem
fr: Accélération du déplacement de bibliothèques en utilisant des liens en dur plutôt que des copies de fichier lors du déplacement vers un emplacement sur le même système de fichiers

source: Get books: Disable the Amazon EU stores, at Amazon's request
fr: Obtenir des livres : Désactivation des boutiques Amazon EU, à la requête d'Amazon

source: Fix moving libraries via calibre leaving behind a copy of the metadata_db_prefs_backup.json file in the original library folder
fr: Corrige le déplacement de bibliothèque qui laisse derrière une copie du fichier metadata_db_prefs_backup.json dans le répertoire original de la bibliothèque

source: MOBI input: Warn about corrupted trailing data entries, instead of aborting. Getting some, even partially corrupted text is better than no text
fr: Format MOBI en entrée pour la conversion : Prévenir de la présence d'entrées de données corrompues, plutôt que d'annuler. Donner un peu, même partiellement corrompu, de texte est mieux que pas de texte

source: Book details: Fix single value custom text column not clickable
fr: Détails du livre : Corrige le fait que les colonnes personnalisées à une seule valeur ne soient pas cliquables

source: Saving to disk: Fix custom date column being rendered in GMT instead of the local time zone when used in a save to disk template
fr: Enregistrer sur le disque : Corrige le fait que la colonne date soit présentée en GMT plutôt que le fuseau horaire local lorsqu'elle est utilisée dans un modèle enregistrer sur le disque

source: Cover browser: Allow customizing the text that appears under the covers with a template in Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Cover browser
fr: Navigateur de couvertures : Permettre la personnalisation du texte qui apparaît en dessous des couvertures grâce à un un modèle dans Préférences-&gt;Interface-&gt;Apparence &amp; présentation-&gt;Navigateur de couvertures

source: When sending books without a cover to the device, generate a cover with book metadata instead of using the blank book icon
fr: Lors de l'envoi de livres sans couverture vers le périphérique, générer une couverture avec les métadonnées du livre au lieu d'utiliser une icône de livre vide

source: Preferences-&gt;Add your own columns: Show more information about existing columns
fr: Préférences-&gt;Ajouter vos propres colonnes : Afficher plus d'information à propos des colonnes existantes

source: PDF output: Handle input documents with fonts that do not have either postscript or full name information
fr: Format PDF en sortie : Gestion des documents en entrée avec des polices n'ayant pas d'information postscript ou du nom complet.

source: DOCX input: Handle numbering styles that use non-decimal number formats and custom templates
fr: Format DOCX en entrée pour la conversion : Prend en charge les styles numérotés qui utilisent des formats de nombre non décimaux et des modèles personalisés

source: Allow restoring of corrupted library to work even if the metadata.db file is missing from the library folder
fr: Permettre la restauration d'une bibliothèque corrompue même si le fichier metadata.db est manquant du répertoire de la bibliothèque

source: Bulk metadata dialog: Fix renaming a custom series via search and replace causing the series index to be reset to 1
fr: Boîte d'édition des métadonnées par lot : Corrige le renommage des séries personnalisées via rechercher et remplacer entraînant le fait que l'index des séries soit réinitialiser à 1

source: Bulk metadata dialog: Fix search and replace not working for text like custom columns if the column contains only a single value
fr: Boîte d'édition des métadonnées par lot : Corrige le fait que rechercher et remplacer ne fonctionne pas pour des colonnes personnalisées type texte si la colonne contient seulement une valeur

source: Content server: Fix next and previous links not working in the mobile view when using a search query that includes URL unsafe characters
fr: Serveur de contenu : Corrige le fait que les liens suivant et précédent ne fonctionnent pas dans la vue mobile lorsque l'on utilise une requête de recherche qui inclut des caractères URL peu sûrs

source: Update Amazon metadata download plugin to handle Amazon.com website change that was preventing any metadata from being downloaded
fr: Mise à jour de l’extension de téléchargement Amazon pour prendre en charge les changements du site Amazon.com qui empêchait toute métadonnée d'être téléchargée

source: Edit book: Fix error when trying to add words to user dictionary for a book with a language that has no dictionary available
fr: Éditer le livre : Corrige une erreur lorsqu'on essaye d'ajouter des mots au dictionnaire utilisateur pour un livre dont la langue n'a pas de dictionnaire disponible

source: Tag browser: Fix various bugs in how grouped search terms are displayed. Also fix counts and average rating for items in user categories
fr: Navigateur d'étiquettes : Corrige différents bugs dans la manière dont les termes de recherche groupés sont affichés. Corrige également les comptages et les moyennes de notation pour les éléments dans les catégories utilisateur.

source: When using copy to library also create missing composite columns in the destination library
fr: Lors de l'utilisation de copier vers la bibliothèque crée également les colonnes composites manquantes dans la bibliothèque de destination

source: Update the version of libpng bundled with calibre to fix a security vulnerability in libpng
fr: Mise à jour de la version de libpng intégrée avec calibre pour corriger une vulnérabilité de sécurité dans libpng

source: See <a href="%(h0)s">%(h0)s</a> for details on the vulnerability
fr: Voir <a href="%(h0)s">%(h0)s</a> pour des détails sur la vulnérabilité

source: Allow setting the cover for a book from one of the book's formats by right clicking on the format in the Book details panel
fr: Permettre de définir la couverture d'un livre à partir de l'un des formats de livre en faisant un clic droit sur le format dans le panneau Détails du livre

source: Allow drag and drop of all file types onto the book details panel and the format list in the edit metadata dialog
fr: Permettre le glisser/déposer de tous les types de fichier sur le panneau détails du livre et la liste des formats dans la boîte de dialogue d'édition des métadonnées

source: Edit book: When inserting an image into the current document, add a button to paste the image from the clipboard
fr: Éditer le livre : Lors de l'insertion d'une image dans le document ouvert, ajout d'un bouton pour coller l'image à partir du presse papier

source: Edit book: Change the suggested prefix for bulk renaming of files depending on the type of files being renamed
fr: Éditer le livre : Changer le préfixe suggérer pour le renommage par lot de fichiers en fonction du type de fichiers étant renommés

source: On Linux, use the system tray icon from the system theme, if available
fr: Sous Linux, utiliser l'icône de la zone de notification du thème du système, si disponible

source: Fix for error when connecting to some Android phones/tablets that have an SD card on macOS and Linux
fr: Sous macOS et Linux, corrige un erreur lors de la connexion de certains téléphones/tablettes Android qui ont un carte SD

source: Linux build: Fix problem with pointing hand mouse cursor not using the system theme on some Linux systems
fr: Distribution Linux : Corrige un problème avec le curseur de la souris n'utilisant le thème système sur certains systèmes Linux

source: Fix the device view state not being saved when a connected device is ejected/disconnected
fr: Corrige le statut vue de périphérique n'étant pas enregistré quand un périphérique relié est éjecté/déconnecté

source: Edit book: Fix saving fails if the original file is deleted during editing session
fr: Éditer le livre : Corrige le fait que la sauvegarde échoue si le fichier original est supprimé pendant l'édition

source: E-book viewer: When doing a search do not match text in comments, attributes and inappropriate tags, such as &lt;script&gt; and &lt;style&gt;
fr: Visionneuse de livre numérique : Lorsqu'une recherche est effectuée ne correspond pas au texte dans les commentaires, attributs et balises inappropriées telles que &lt;script&gt; et &lt;style&gt;

source: Edit book: Add a 'Smart Comment' tool to easily comment/uncomment text
fr: Éditer le livre : Ajout d'un outil "Commentaire Intelligent" pour aisément commenter/dé-commenter du texte

source: Press Ctrl+` to trigger the tool, or add the tool to your toolbar via Preferences-&gt;Toolbar-&gt;Tools for all editors. It will either insert comments around the selected text or uncomment an existing comment if the cursor is inside one
fr: Appuyez sur Ctrl+` pour déclencher l'outils, ou ajoutez l'outil à la barre d'outils via Préférences-&gt;Barre d'outils-&gt;Outils pour tous les éditeurs/ Cela insérera un commentaire pour le texte sélectionner ou dé-commentera un commentaire existant si le curseur se trouve sur celui-ci

source: Tag mapper: Add new rule types to upper-case, lower-case or capitalize tags
fr: Navigateur d'étiquettes : Ajout de nouveaux types de règles pour les tags majuscule, minuscule ou mettre en capitales

source: Markdown input: Allow the 'extra' convenience extension as a shortcut for enabling multiple other extensions. Also add the Attribute list and Admonition extensions. Finally, update the Markdown library used by calibre
fr: Format Markdown en entrée pour la conversion : Permettre la commode extension 'extra' comme raccourci pour activer de multiples autres extensions. Ajout également des extensions Attribute list et Admonition. Pour finir, lise à jour de la librairie Markdown utilisées par calibre

source: Amazon metadata download: Fix for website change at Amazon.com that prevented ratings from being downloaded
fr: Téléchargement de métadonnées Amazon : Correction en raison de changements sur le site web Amazon.com qui empêche les notations d'être téléchargées

source: Tag mapper: Prevent cycles in the replacement rules from causing the Tag mapper to hang
fr: Navigateur d'étiquettes : Empêche les cycles dans les règles de remplacement qui provoquent le blocage du Navigateur d'étiquettes

source: Do not fail on Windows systems where the system function to get the users home folder fails
fr: N'échoue pas sur des systèmes Windows où la fonction système pour obtenir les répertoires personnels échoue

source: DOCX output: Ignore corrupted images in the input instead of erroring out on them
fr: Format DOCX en sortie : Ignore les images corrompues dans le fichier d'entrée au lieu d'arrêter la conversion sur une erreur

source: Kindle driver: Detect books in Amazon's new KFX format present on e-ink Kindle devices
fr: Pilote Kindle : Détection sur les liseuses Kindle des livres dans le nouveau format KFX d'Amazon.

source: TXT output: Do not fail when input contains HTML comments with double hyphens in the comment text
fr: Format TXT en sortie : N'échoue pas si le fichier en entrée contient des commentaires en HTML avec des doubles traits d'union

source: ZIP output: Fix system encoding being used instead of UTF-8 for HTML files
fr: Format ZIP en sortie : Solutionne le problème d'encodage utilisé pour les fichiers HTML (encodage système à la place d'UTF-8)

source: Implement tag mapping to automatically filter/transform tags when adding books or downloading metadata
fr: Implémentation du mappage d'étiquette pour filtrer/transformer les étiquettes lors de l'ajout de livres ou du téléchargement de métadonnées

source: Now you can create simple rules that will filter/transform the tags when adding new books or downloading metadata for books. To setup the rules, go to Preferences-&gt;Adding books and Preferences-&gt;Downloading metadata
fr: Vous pouvez maintenant créer des règles simples qui filtreront/transformeront les étiquettes lors de l'ajout de nouveaux livres ou le téléchargement de de métadonnées pour des livres. Pour configurer les règles, allez dans Préférence-&gt;Ajouter des livres et Préférences-&Télécharger les métadonnées

source: Kobo driver: Support for newly firmware version 3.18
fr: Pilote Kobo : Ajout du support de la nouvelle version de firmware 3.18

source: Content server: Fix error in /mobile page if one of the books has metadata with ASCII control codes in it
fr: Serveur de contenu : Solutionne une erreur dans la page /mobile quand un des livres contient dans ses métadonnées des codes de contrôle ASCII

source: Driver for the Lark Freebook reader device
fr: Pilote pour la liseuse Lark Freebook

source: Icon themes: Change the calibre icons easily via icon themes
fr: Thèmes d'icônes : Changer facilement les icônes de calibre via les thèmes d'icônes

source: You can now change the icons calibre uses easily via Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Change icon theme. Several icon themes are already available for calibre
fr: Vous pouvez maintenant changer facilement les icônes que calibre utilise via Préférences-&gt;Apparence &amp; présentation-&gt;Changer le thème d'icônes. Plusieurs thèmes d'icônes sont déjà disponibles pour calibre

source: Driver for the Unusual Sapiens V2 and Adlibris Letto readers
fr: Pilote pour les liseuses Unusual Sapiens V2 et Adlibris Letto

source: Kobo driver: Add support for firmware 3.17.3
fr: Pilote Kobo : Ajout du support de la version de firmware 3.17.3.

source: Kobo driver: Add support for the new firmware version 3.17
fr: Pilote Kobo : Ajout du support de la nouvelle version de firmware 3.17.

source: Driver for SONY DPT-S1
fr: Pilote pour la liseuse SONY DPT-S1

source: There was a regression in 2.32.0 that caused conversion to PDF to fail, the fix for this was released in 2.32.1
fr: Il y a une régression dans la version 2.32.0 qui empêche la conversion en PDF, la correction de ce problème est faite dans la version 2.32.1

source: Kobo driver: Support for upcoming firmware version 3.16
fr: Pilote Kobo : Support de la prochaine version de firmware 3.16

source: Conversion of all e-book formats to Microsoft Word (DOCX) files
fr: Conversion de tous les formats de livre numérique vers des fichiers Microsoft Word (DOCX)

source: Supports conversion of text styles, images, lists, tables, embedded fonts, etc. Produces DOCX files compatible with Microsoft Word 2007 or newer. Note that this code is very new, so there will likely still be kinks that will be worked out in the coming weeks
fr: Prise en charge de la conversion des styles de texte, listes, tables, polices embarquées, etc. Produit des fichiers DOCX compatibles avec Microsoft Word 2007 ou plus récent. Notez que ce code est très récent, il y aura donc vraisemblablement des modifications qui sortiront dans les prochaines semaines

source: Driver for the soon to be released Kobo Glo HD
fr: Pilote pour la liseuse Kobo Glo HD qui sortira prochainement

source: Allow opening e-book files and covers in external applications by simply right clicking on them in the Book details panel
fr: Permettre l'ouverture de fichiers de livre numérique et de couvertures dans des applications externes par un simple clic droit sur ceux-ci dans le panneau Détails du livre

source: Now, you can right click on an e-book format or the cover in the Book details panel, and open it with any application installed on your computer. calibre will automatically present you with a list of application capable of opening the file. Simply choose one, or if your particular application is not auto-detected, you can browse for it manually
fr: Maintenant, vous pouvez faire un clic droit sur un format de livre numérique ou une couverture dans le panneau Détails du livre, et l'ouvrir avec n'importe quelle application sur votre ordinateur, calibre vous présentera automatiquement un liste d'applications capables d'ouvrir le fichier. Choisissez-en simplement une, ou si votre application particulière n'est pas détectée automatiquement, vous pouvez passer en revue manuellement.

source: Windows driver for Grammata Papyre 602
fr: Pilote Windows pour Grammata Papyre 602

source: Edit book: Add 'Style classes' and 'Links' report pages to the Reports tool
fr: Éditer le livre : Ajout de pages de rapport "Classes de style" et "Liens" à l'outil Rapports

source: Edit book: A new reports tool that shows a summary of files, images, words, characters and styles used in the book
fr: Éditer le livre : Un nouvel outil de rapports qui montre un sommaire des fichiers, images, mots, caractères et styles utilisés dans le livre

source: The reports tool is a great way to get an overview of the different parts of your book. Every line in the report is hot-linked, double clicking it jumps to the places in the book where that item is used
fr: L'outil de rapports est une bonne manière d'obtenir une vue d'ensemble des différentes parties de votre livre.. Chaque ligne dans le rapport est liée. Double cliquer une ligne envoie à l'endroit dans le livre où cet élément est utilisé

source: Edit book: Add support for snippets -- small pieces of text that are often re-used
fr: Éditer le livre : Ajout de la prise en charge des fragments -- petits morceaux de texte qui sont souvent réutilisés
