Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Add support for touch screens to the main calibre book list. You can now flick to scroll, tap to select and double-tap to view books.
es: Se añade soporte para pantallas táctiles en la lista de libros principal de calibre. Ahora puede deslizar para desplazar la lista, tocar para seleccionar y tocar dos veces para ver libros.
fr: Ajout de la prie en charge des écrans tactiles pour la liste de livres principale. Vous pouvez maintenant faire défiler du doigt, tap pour sélectionner et double-tap pour voir les livres.
pt_br: Adiciona suporte para telas sensíveis ao toque na lista principal de livros do calibre. Você pode agora deslizar para rolar a tela, tocar para selecionar e usar um toque duplo para ver os livros.
uk: Додано підтримку сенсорних екранів у основному списку книг calibre. Ви можете скористатися проведенням пальцем для гортання, і відкривати книги натисканням або подвійним натисканням.

source: Server: Add an option to ban IP addresses if there are too many failed login attempts
es: Servidor: Se añade una opción para bloquear direcciones IP si hay demasiados intentos fallidos de conexión
fr: Serveur : Ajout d'une option pour bannir une adresse IP s'il a trop d'échecs de tentatives de connexion
pt_br: Servidor: Adiciona uma opção para banir endereços de IP se ocorrerem muitas falhas na tentativa de login
uk: Сервер: додано пункт для блокування IP-адрес, якщо з них надходить надто багато помилкових спроб увійти

source: calibre-debug: Change the --explode-book action to only create the exploded directory and not rebuild the file. Add a new --implode-book action to rebuild the file, separately.
es: calibre-debug: Se modifica la acción --explode-book para sólo crear el directorio expandido y no reconstruir el archivo. Se añade una nueva acción --implode-book, separada, para regenerar el archivo.
fr: calibre-debug : Changement de l'action --explode-book pour seulement créer le répertoire explosé et ne pas reconstruire le fichier. Ajout d'une action --implode-book pour reconstruire le fichier, séparément.
pt_br: calibre-debug: Altera a ação --explode-book para criar apenas o diretório expandido e não recompor o arquivo. Adiciona uma nova ação --implode-book para recompor o livro, separadamente.
uk: calibre-debug: змінено дію --explode-book так, щоб вона створювала каталог розпаковування, а не перезбирала файл. Додано нову окрему дію --implode-book для перезбирання файла.

source: Book details panel: Add Manage authors/series/tags/etc. to the menu when right clicking on the item
es: Panel de detalles del libro. Se añade Administrar autores, series, etiquetas, etc. al menú al pulsar con el botón derecho sobre un elemento
fr: Panneau de détails du livre : Ajout de Gérer auteurs/séries/étiquettes/etc. au menu lorsque l'on fait un clic droit sur l'élément
pt_br: Painel de detalhes do livro: Adiciona 'Gerenciar autores/séries/etiquetas/etc' para o menu ao clicar com o botão direito no item
uk: Панель подробиць щодо книги: додано пункт креування записами авторів, циклів, міток тощо до контекстного меню записів книг

source: Kobo driver: Update for new firmware
es: Controlador Kobo: Actualización para nuevo firmware
fr: Pilote Kobo : Mise à jour pour un nouveau firmware
pt_br: Driver do Kobo: Atualização para o novo firmware
uk: Драйвер Kobo: оновлено для синхронізації з мікропрограмою

source: PDF Output: Fix a regression in 2.82 that caused conversion of comics to PDF files to have successive images become smaller and smaller in some circumstances.
es: Salida PDF: Se corrige una regresión en 2.82 que hacía que la conversión de cómics a archivos PDF tuviera las imágenes sucesivas cada vez más pequeñas en algunas circunstancias.
fr: PDF en sortie pour la conversion : Corrige une régression dans 2.82 qui entraîne le fait que la conversion de bandes dessinées en PDF crée des images devenant de plus en plus petites dans certaines circonstances.
pt_br: Saída PDF: Corrige uma regressão na versão 2.82 que fazia com que, na conversão de HQs para PDF, images sucessivas ficassem menores e menores em algumas circunstâncias.
uk: Виведення до PDF: виправлено регресію у 2.82, яка спричиняла перетворення коміксів у файли PDF з поступовим зменшенням зображень за певних обставин.

source: PDF Output: Fix a regression in 2.83 that caused occasional blank pages at the end of chapters when using headers/footers.
es: Salida PDF: Se corrige una regresión en 2.83 que a veces causaba páginas en blanco al final de los capítulos al usar cabeceras o pies de página.
fr: PDF en sortie pour la conversion : Corrige une régression dans 2.83 qui créait des pages blanches occasionnelle à la fin des chapitres lors de l'utilisation d'en-têtes/pieds de page.
pt_br: Saída PDF: Corrige uma regressão na versão 2.83 que causava páginas brancas ocasionais no final de capítulos que utilizavam cabeçalhos/rodapés.
uk: Виведення до PDF: виправлено регресію у 2.83, яка спричиняла іноді появу порожніх сторінок наприкінці глав при використанні верхніх або нижніх колонтитулів.

source: Get books: Update store plugins for ebook.nl and the various amazon websites
es: Obtener libros: Actualizados los complementos de tienda para ebook.nl y las distintas páginas de amazon
fr: Obtenir des livres : Mise à jour des extensions de boutique pour books.nl et les différents sites web Amazon
pt_br: Obter livros: Atualização dos plugins de loja para o ebook.nl e os vários sites da Amazon
uk: Отримання книг: оновлено додатки крамниць ebook.nl та різноманітних сайтів amazon

source: Edit book: Hide editor toolbars if they are empty.
es: Modificar libro: Se ocultan las barras de herramientas del editor si están vacías.
fr: Éditer le livre : Masquer les barres d'outil éditeur si elles sont vides.
pt_br: Editar livro: Esconde as barras de ferramentas do editor se estiverem vazias.
uk: Редагування книг: реалізовано приховування панелей інструментів редактора, якщо ці панелі порожні.

source: Server: Fix failed login attempts using digest auth not being logged to the main log
es: Servidor: Se corrige el fallo por el que los intentos de conexión usando digest auth no quedaban recogidos en el registro principal
fr: Serveur : Correction du fait que les échecs de tentative de connexion en utilisant digest auth ne soient pas consignées dans le journal principal
pt_br: Servidor: Corrige tentativa de login fracassada usando autenticação digest não sendo adicionadas ao log principal
uk: Сервер: виправлено помилку, пов'язану із тим, що невдалі спроби розпізнавання при використанні контрольних сум не записувалися до журналу

source: Quickview: for non-text fields, sort on native values instead of text.
es: Vista rápida: los campos que no son de texto se ordenan según sus valores nativos en lugar de por texto.
fr: Affichage rapide : pour les champs non-texte, trier sur la valeur native au lieu du texte.
pt_br: Visualização rápida: para campos que não são de texto, ordena conforme os valores nativos, em vez de texto.
uk: Швидкий перегляд: для нетекстових полів реалізовано упорядковування за природними значеннями замість тексту.

source: Fix hidden search bar state not being restored on calibre restart.
es: Se corrige el fallo por el que la barra de búsqueda oculta no se restauraba al reiniciar calibre.
fr: Corrige le fait que le statut masquer la barre de recherche ne soit pas maintenu au redémarrage de calibre.
pt_br: Corrige o estado da barra de pesquisa não sendo restaurada quando o calibre reinicia.
uk: Виправлено помилку, пов'язану із тим, що прихований стан панелі пошуку не відновлювався після перезапуску calibre.

source: Fix option to not save cover separately when using Save to disk not working.
es: Se corrige el fallo por el que la opción de no guardar la portada por separado al usar Guardar en el disco no funcionaba.
fr: Corrige une option pour ne pas sauvegarder la couverture lors de l'utilisation de Enregistrer sous... ne fonctionnant pas
pt_br: Corrige falha na opção de não salvar a capa separadamente ao usar a função 'Salvar no disco'.
uk: Відновлено працездатність параметра окремого збереження обкладинок при збереженні на диск.

source: Server: Fix an error on browsers that do not support blob storage in IndexedDB.
es: Servidor: Se corrige un error en los navegadores que soportan almacenamiento de «blobs» en IndexedDB.
fr: Serveur : Corrige une erreur pour les navigateurs qui ne prennent pas en charge le stockage blob dans IndexedDB.
pt_br: Servidor: Corrige um erro em navegadores que não suportam armazenamento de blobs no IndexedDB.
uk: Сервер: виправлено помилку, пов'язану з тим, що у браузерах не передбачено підтримки збереження бінарних даних у IndexedDB.

source: Comic input: Fix a bug in the normalize image filter that caused a crash when converting comics that contain a page with only a single color.
es: Entrada de cómics: Se corrige un fallo en el filtro de normalizar imagen que hacía que el programa se cerrara al convertir cómics que contienen una página con un solo color.
fr: Bande dessinée en entrée pour la conversion : Corrige un bug dans le filtre normaliser l'image qui entraîne un plantage lors de la conversion de bandes dessinées qui contiennent une page avec seulement une couleur.
pt_br: Entrada HQ: Corrige um erro no filtro de normalização de imagem que causava um travamento ao converter HQs que continham uma página com apenas uma única cor.
uk: Вхідні дані коміксів: виправлено ваду у фільтрі нормалізації зображень, яка спричиняла аварійне завершення під час перетворення коміксів, які містять сторінку заповнену лише одним кольором.

source: Edit Book: Handle non-normalized unicode characters in file names better
es: Modificar libro: Se gestionan mejor los caracteres Unicode no normalizados en los nombres de archivo
fr: Éditer le livre : Gère mieux les caractères unicode non-normalisés dans les noms de fichier
pt_br: Editar livro: Lida melhor com caracteres unicode não normalizados no nome de arquivos
uk: Редагування книг: поліпшено обробку ненормалізованих символів Unicode у назвах файлів

source: Edit book: Allow exporting all selected files to the computer from the 'File browser' by right clicking and choosing 'Export selected files'
es: Modificar libro: Se pueden exportar todos los archivos seleccionados al equipo desde el «explorador de archivos» pulsando con el botón derecho y seleccionando «Exportar archivos seleccionados»
fr: Éditer le livre : Permettre l'exportation de tous les fichiers sélectionnés vers l'ordinateur à partir de 'Explorateur de fichiers' en faisant un clic droit et en choisissant 'Exporter les fichiers sélectionés'
pt_br: Editar livro: Permite exportar todos os arquivos selecionados para o computador, a partir do 'Navegador de arquivos', ao clicar com o botão direito do mouse e escolher 'Exportar arquivos selecionados'.
uk: Редагування книг: уможливлено експортування усіх позначених файлів на комп’ютер із панелі «Навігація файлами»; достатньо клацнути на списку позначених записів правою кнопкою миші і вибрати у контекстному меню пункт «Експортувати позначені файли»

source: Server: When returning to the search page, remember the last used state of the Tag browser
es: Servidor: Al volver a la página de búsqueda, recordar el último estado del explorador de etiquetas
fr: Serveur : Lors du retour vers la page de recherche, se souvenir du dernier état utilisé par le Navigateur d'étiquettes
pt_br: Servidor: Ao retornar à página de pesquisa, se lembra do último estado do Navegador de Etiquetas.
uk: Сервер: реалізовано запам’ятовування останнього використаного стану переглядача міток при поверненні до сторінки пошуку

source: Template language: Allow the in_list() functions to return different values depending on what is found
es: Lenguaje de plantillas: Permitir que las funciones in_list() devuelvan valores diferentes según lo que se encuentre
fr: Modèle de langue : Permettre dans les fonctions in_list() de renvoyer différentes valeurs dépendant de ce qui est trouvé
pt_br: Linguagem de modelo: Permite que as funções in_list() retornem valores diferentes dependendo do que for encontrado.
uk: Мова шаблонів: уможливлено повертання функціями in_list() різних значень залежно від того, що було знайдено

source: Add a configurable shortcut to move the focus from Quickview to the book list
es: Añadido un atajo configurable para cambiar el foco de la vista rápida a la lista de libros
fr: Ajout d'un raccourci configurable pour déplacer le focus de l'Affichage rapide à la liste de livres
pt_br: Adiciona um atalho configurável para mover o foco da Visualização rápida para a lista de livros
uk: Додано придатне до налаштовування клавіатурне скорочення для пересування фокусу із панелі швидкого перегляду до списку книг

source: Conversion: When inserting the publication year in the metadata jacket, do so in the local time zone, so it matches what is displayed in the main calibre program.
es: Conversión: Al insertar el año de publicación en la sobrecubierta de metadatos, hacerlo en la zona horaria actual, para que coincida con lo que se muestra en el programa principal de calibre.
fr: Conversion : Lors de l'insertion d'une année de publication dans la jaquette de métadonnées, le faire dans le fuseau horaire local, de cette façon elle correspond à ce qui est affiché dans calibre
pt_br: Conversão: Ao inserir o ano da publicação na capa de metadados, utiliza o fuso horário local, de forma que combine com o que é mostrado com programa principal do calibre.
uk: Перетворення: реалізовано вставлення року видання у місцевому часовому поясі під час вставляння цього року у обгортку метаданих. Тепер цей рік зібгається із показаним у основній програмі calibre.

source: Server OPDS feeds: Fix incorrect counts in letter categories when there are lowercase names.
es: Canales OPDS del servidor: Corregidas cuentas incorrectas en las categorías por letra cuando hay nombres en minúscula.
fr: Flux du serveur OPDS : Solutionne un comptage incorrect dans les catégories quand il y a des noms en minuscules
pt_br: Feeds OPDS do Servidor: Corrige contagens incorretas em categoria de letras quando há nomes com todas as letras minúsculas.
uk: Подачі сервера OPDS: виправлено помилкове обчислення у категорії за літерами у випадках, коли існують імена, що складаються із літер нижнього регістру.

source: Edit book: Fix 'Show details' button not visible when doing 'Replace all' rather than 'Count all'
es: Modificar libro: Corregido el botón «Mostrar detalles» no visible al usar «Sustituir todo» en lugar de «Contar todo»
fr: Éditer le livre : Corrige le bouton 'Afficher les détails' qui n'est pas visible quand on fait 'Remplacer tout' plutôt que "Compter tout"
pt_br: Editar livro: Corrige botão 'Mostrar detalhes' não visível ao 'Substituir tudo', em vez de 'Contar tudo'
uk: Редагування книг: усунено зникнення кнопки «Показати подробиці», якщо виконується дія «Замінити усе» замість дії «Полічити усе».

source: Nook driver: Remove the % character from filenames sent to the Nook.
es: Controlador Nook: Eliminar el carácter «%» de los nombres de archivo enviados al Nook.
fr: Pilote Nook : Supprimer le caractère % des noms de fichier envoyés à la liseuse Nook
pt_br: Driver do Nook: Remove o caractere % de nomes de arquivos enviados para o Nook.
uk: Драйвер Nook: реалізовано вилучення символу % із назв файлів під час надсилання даних на Nook.

source: Fix calibre startup crash caused by Quickview when the applied virtual library is empty (has no books).
es: Corregido un error al iniciar calibre ocasionado por la vista rápida cuando la biblioteca virtual aplicada está vacía (no tiene libros).
fr: Corrige le plantage de calibre au démarrage causé par Affichage rapide quand la bibliothèque virtuelle est vide (n'a pas de livres).
pt_br: Corrige travamento na inicialização do calibre causado pela Visualização Rápida quando a Biblioteca Virtual escolhida está vazia (não contém nenhum livro).
uk: Усунено аварійне завершення роботи calibre під час запуску, яке було спричинено засобом швидкого перегляду, коли він застосовувався до порожньої віртуальної бібліотеки (бібліотеки без книг).

source: Quickview panel: Allow opening and closing the panel via the Layout button in the bottom right corner.
es: Panel de vista rápida: Se puede abrir y cerrar el panel por medio del botón de distribución en la esquina inferior derecha.
fr: Panneau Affichage rapide : Permettre d'ouvrir et de fermer le panneau via le bouton Mise en page dans le coin inférieur droit
pt_br: Painel de Visualização rápida: Permite abrir e fechar o painel via botão de Layout no canto inferior direito.
uk: Панель швидкого перегляду: уможливлено відкриття і закриття панелі за допомогою кнопки компонування у нижньому правому куті вікна.

source: Book details panel: Allow right clicking on author names to search for books by the author on Amazon.
es: Panel de detalles del libro: Se puede pulsar con el boton derecho sobre los nombres de autor para buscar libros del autor en Amazon.
fr: Panneau Détails du livre : Permettre le clic droit sur le nom d'un auteur pour rechercher les livres de cet auteur sur Amazon
pt_br: Painel de detalhes do livro: Permite clicar com o botão direito no nome do autor para pesquisar livros do autor na Amazon.
uk: Панель параметрів книги: уможливлено пошук книг за автором у відповідь на клацання правою кнопкою миші на пункті цього автора

source: Edit book: When doing a Replace/Count all with multiple searches add a 'Show details' button on the result dialog that shows the individual counts for each search.
es: Modificar libro: Al hacer «Sustituir todo» o «Contar todo» con varias búsquedas, se muestra un botón «Mostrar detalles» en el cuadro resultante que muestra las cuentas individuales por cada búsqueda.
fr: Éditer le livre : Lorsque l'on fait un Remplacer/Compter tout avec de multiples recherches ajoute un bouton "Afficher les détails" dans la boîte de dialogue de résultat qui affiche les comptages individuels pour chaque recherche.
pt_br: Editar livro: Ao fazer uma operação de Substituir/Contar tudo com múltiplas pesquisas, adiciona um botão de 'Mostrar detalhes' no diálogo de resultados para mostrar as contagens individuais para cada pesquisa.
uk: Редагування книг: для виконання заміни і обчислення параметрів із декількома пошуками додано кнопку «Показати подробиці» у діалогове вікно результатів для показу індивідуальних параметрів для кожного пошуку.

source: Comments editor: Add a button to easily insert separators (i.e. &lt;hr&gt; tags) when editing comments
es: Editor de comentarios: Se añade un botón para insertar separadores (etiquetas &lt;hr&gt;) al modificar comentarios
fr: Éditeur de commentaires : Ajout d'un bouton pour insérer facilement des séparateurs (par ex. des balises &lt;hr&gt;) lors de l'édition des commentaires
pt_br: Editor de Comentários: Adiciona um botão para facilmente inserir separadores (isto é, tags &lt;hr&gt;) ao editar comentários
uk: Редактор коментарів: додано кнопку для простого вставлення роздільників (тобто &lt;hr&gt; tags) під час редагування коментарів

source: Browser viewer: Fix back/forward buttons not working correctly when clicking on links that lead to different internal files in the book.
es: Navegador de contenido: Arreglado el funcionamiento incorrecto de los botones de avance y retroceso al pulsar sobre enlaces que conducen a diferentes archivos internos del libro.
fr: Visionneuse du navigateur : Solutionne le fait que les boutons revenir/avancer ne fonctionnent pas correctement lorsque l'on clique su des liens qui mènent vers différents liens internes du livre
pt_br: Visualizador do navegador: Corrige os botões de voltar/avançar não funcionando corretamente ao clicar em links que levam a diferentes arquivos internos do livro.
uk: Панель навігації: виправлено помилки у роботі кнопок назад/вперед у відповідь на натискання посилань, які ведуть до різних внутрішніх файлів у книзі.

source: Server: Fix using 'Show more books' button and then changing list mode setting causing resulting book list to be incomplete
es: Servidor: Arreglado el uso del botón «Mostrar más libros» y luego cambiar el modo de lista, que resultaba en una lista de libros incompleta
fr: Serveur : Solutionne le fait que l'utilisation du bouton "Afficher plus de livres" et ensuite le paramètre pour le changement en mode liste entraîne que la liste de livres soit incomplète
pt_br: Servidor: Corrige falha que gerava um lista de livros incompleta ao usar o botão de 'Mostrar mais livros' e depois mudar a configuração do modo de lista
uk: Сервер: виправлено роботу кнопки «Показати інші книги» — у попередній версії зміна параметрів режиму списку призводила до того, що список ставав неповним

source: Server: Fix changing sort/search in the /mobile view only working with the default library.
es: Servidor: Arreglado el cambio de orden y búsqueda en la vista /mobile, que sólo funcionaba en la biblioteca predeterminada.
fr: Serveur : Solutionne le fait que le changement trier/rechercher dans la vue /mobile ne fonctionne qu'avec la bibliothèque par défaut.
pt_br: Servidor: Corrige alteração de ordenação/busca na visualização móvel funcionando apenas com a biblioteca padrão.
uk: Сервер: виправлено роботу засобу упорядковування і пошуку у мобільному режимі перегляду — раніше він працював лише із типовою бібліотекою.

source: DOCX Input: Fix alt and title attributes for some images not being preserved
es: Entrada DOCX: Arreglado el fallo por el que los atributos «alt» y «title» para algunas imágenes no se mantenían
fr: Format DOCX en entrée pour la conversion : Solutionne le fait que les attributs alt et title ne soient pas préservés pour certaines images
pt_br: Entrada DOCX: Corrige atributos 'alt' e 'title' não sendo preservados para algumas imagens
uk: Вхідні дані DOCX: виправлено помилку, яка призводила до того, що атрибути alt і title для деяких зображень не зберігалися

source: Amazon metadata download: Change the default source from Bing to Google as the Bing cache seems to be having trouble at the moment
es: Descarga de metadatos de Amazon: Origien predeterminado cambiado de Bing a Google, pues el caché de Bing parece estar teniendo problemas
fr: Téléchargement de métadonnées Amaeon : Changement de la source pat défaut Bing vers Google vu que le cache Bing semble avoir des problèmes pour le moment
pt_br: Download de metadados da Amazon: Altera a fonte padrão do Bing para o Google, uma vez que o cache do Bing parece estar tendo problemas no momento
uk: Отримання метаданих Amazon: змінено типове джерело з Bing на Google, оскільки кеш Bing у поточній версії працює із проблемами

source: ISBNDB metadata download: Ignore SSL errors when contacting isbndb.com as they seem to have no intention of fixing their broken SSL certificate
es: Descarga de metadatos de ISBNDB: Se ignoran los errores SSL al conectar con isbndb.com, pues no parece que tengan intención de corregir el certificado SSL defectuoso
fr: Téléchargement de métadonnées ISBNDB : Ignorer les erreurs SSL en contactant isbndb.com vu qu'ils ne semblent pas avoir l'intention de corriger leur certificat SSL endommagé
pt_br: Download de metadados do ISBNDB: Ignora erros SSL ao contactar o isbndb.com, uma vez que eles parecem não ter intenção de corrigir seu certificado SSL danificado
uk: Отримання метаданих ISBNDB: реалізовано ігнорування помилок SSL під час встановлення зв’язку із isbndb.com, оскільки, здається, власники сайта не мають наміру виправляти помилковий сертифікат SSL
