Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Preferences-&gt;Keyboard: Fix unable to use Alt+A and Alt+S as custom shortcuts
fr: Préférences-&gt;Clavier: Solutionne l'incapacité d'utiliser Alt+A et Alt+S en tant que raccourcis personnalisés

source: Version 2.57.1 is a hotfix to fix a regression that broke conversion of ODT files in 2.57.0
fr: La version 2.57.1 est un correctif pour corriger une régression qui a endommagé la conversion des fichiers ODT en 2.57.0

source: Edit book: Add an option to show full file paths in the Files Browser instead of just the file name (in Preferences-&gt;Interface-&gt;Main window)
fr: Éditer le Livre: Ajout d'une option pour afficher les chemins complets des fichiers dans le navigateur de fichiers au lieu de simplement le nom du fichier (dans Éditer-&gt;Préférences-&gt;Fenêtre principale)

source: Allow creating a keyboard shortcut to minimize the calibre window (Preferences-&gt;Keyboard-&gt;Miscellaneous)
fr: Autoriser la création d'un raccourci clavier pour réduire la fenêtre de calibre (Préférences-&gt;Clavier-&gt;Divers)

source: Fix the Google Images based cover download plugin not working because of changes to Google's image search service
fr: Correction de l'extension de téléchargement de couverture Google Images ne fonctionnant pas en raison de modifications apportées au service de recherche d'images de Google

source: E-book viewer: Prevent the TAB key from causing partial scrolling in paged mode
fr: Visionneuse de livre numérique : Empêcher la touche TAB de provoquer le défilement partiel en mode paginé

source: Book details panel: Fix regression in previous release that broke URL:http|... style identifiers
fr: Panneau de détails du livre: Réparation de la régression dans la version précédente qui a cassé les identifiants de style url:http|...

source: macOS: Redirect stdout/stderr to /dev/null instead of ASL since ASL is flaky on some macOS machines. This should prevent errors in third party plugins that print a lot of debug messages even when not in debug mode
fr: macOS : Rediriger stdout/stderr vers /dev/null au lieu de l'ASL depuis que l'ASL est loufoque sur certaines machines OS X. Cela devrait éviter les erreurs dans les extensions tierces qui impriment beaucoup de messages de débogage, même lorsqu'elles ne sont pas en mode débogage

source: Fix for macOS upgrade 10.11.4 breaking detection of Kobo devices on some systems
fr: Solution pour la mise à jour macOS 10.11.4 rompant la détection des périphériques Kobo sur certains systèmes

source: Edit book: Fix filename being duplicated in the Files browser when multiple files with the same name are present
fr: Éditer le Livre: Solutionne que le nom de fichier soit dupliqué dans le navigateur de fichiers lorsque plusieurs fichiers avec le même nom sont présents

source: PDF output: Make fix for blank page at end of HTML file also work when headers/footers are specified
fr: Document PDF en sortie pour la conversion : création d'un correctif pour que la page vierge à la fin du fichier HTML fonctionne aussi quand les en-têtes/pieds de page sont spécifiés

source: Allow creation of rules to convert arbitrary identifiers into clickable links in the book details panel (Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Book details)
fr: Autoriser la création de règles pour convertir les identificateurs arbitraires en liens cliquables dans le panneau de détails du livre (Préférences-&gt;Apparence et Présentation-&gt;Détails du livre)

source: Tag mapper: A new rule type 'split' allows you to easily split tags on a character
fr: Navigateur d'étiquette : Un nouveau type de règle 'diviser' vous permettant de facilement diviser une étiquette sur un caractère

source: Make the shutting down message an overlay so it is less disruptive
fr: Effectue la superposition du message de fermeture afin qu'il soit moins perturbateur

source: Allow right clicking on Virtual library tabs to edit/delete the Virtual library
fr: Permettre un clic droit sur les onglets de la Bibliothèque Virtuelle pour modifier/supprimer la bibliothèque virtuelle

source: Tag mapper: Add a button to edit the list of tags in a Tag mapper rule using the Tag editor dialog
fr: Navigateur d'étiquette : Ajout d'un bouton pour modifier la liste des étiquettes dans une règle de mappage d'étiquette en utilisant la boîte de dialogue de l'Éditeur d'étiquette

source: Conversion: Fix the obsolete HTML align=center markup (produced by Microsoft Word) not working for tables
fr: Conversion : Solutionne le balisage HTML obsolète align=center (produit par Microsoft Word) ne fonctionnant pas pour les tables

source: Font subsetting: When font-variant: small-caps is used include the capital letters as well, in case either the font or the renderer do not support OpenType SMCP
fr: Sous-ensemble de police : Quand font-variant est présent : small-caps est utilisé en comprenant les lettres majuscules également, dans le cas où soit la police ou le rendu ne prend pas en charge Open Type smcp

source: Font subsetting: Implement support for text-transform
fr: Sous-ensemble de police : Met en œuvre le support de text-transform

source: Fix the target book entry in the book list not being refreshed after merging books. Only matters if you have a column based on book formats
fr: Solutionne le fait que l'entrée du livre cible dans la liste de livres ne soit pas rafraîchi après la fusion des livres. Importe seulement si vous avez une colonne basée sur les formats de livres

source: E-book viewer: Fix a link that has some text along with a superscript/subscript being incorrectly detected as a footnote link
fr: Visionneuse de livre numérique : Solutionne le fait qu'un lien qui a un texte avec un exposant/indice soit incorrectement détecté comme un lien de note de bas de page

source: Fix device detection on Windows failing if the registry entries for the device contain a very long item
fr: Solutionne l'échec de la détection d'appareils sous Windows si les entrées de registre pour l'appareil contiennent un très long article

source: Edit book: Fix an extra colon being added when setting the 'notes' semantic
fr: • Editer le livre: Correction d'un point supplémentaire étant ajouté lors du réglage des 'notes' sémantiques

source: Ensure that author folder names are never Windows reserved names
fr: Veiller à ce que les dossiers de noms d'auteur ne sont jamais des noms réservés Windows

source: E-book viewer: When displaying an EPUB 3 document that uses EPUB:switch to provide a fallback for MathML content, prevent both the MathML and fallback from being shown together
fr: • Visionneuse de livre numérique : Lors de l'affichage d'un document EPUB 3 qui utilise epub:switch pour fournir une solution de repli pour le contenu MathML, éviter qu'à la fois le MathML et le repli d'être montrés ensembles

source: PDF output: When displaying an EPUB 3 document that uses EPUB:switch to provide a fallback for MathML content, prevent both the MathML and fallback from being rendered together
fr: Document PDF en sortie pour la conversion : Lors de l'affichage d'un document EPUB 3 qui utilise epub:switch pour fournir une solution de repli pour le contenu MathML, éviter qu'à la fois le MathML et le repli d'être montrés ensemble

source: Fix exception in custom column preferences when the column lookup key is changed
fr: Solutionne une exception dans les préférences de colonnes personnalisées lorsque la clé de recherche de la colonne est modifiée

source: Catalog generation: Do not crash is a book in the library has no uuid
fr: Génération de catalogue : Ne plante plus lorsqu'un livre dans la bibliothèque n'a pas d'uuid

source: Edit metadata in bulk dialog: Allow configuring the types of generated covers
fr: Boite de dialogue d'édition des métadonnées par lot : Permettre la configuration des types de couvertures générées

source: E-book viewer: Make the detection of note boundaries for popup footnotes a little more robust
fr: Visionneuse de livre numérique : Rendre la détection des limites de note pour les notes de bas de page à affichage rapide un peu plus robuste

source: E-book viewer: Add options to control the amount the mouse wheel and arrow keys scroll by in flow mode
fr: Visionneuse de livre numérique : Ajout d'options pour contrôler la valeur du déplacement de la molette de la souris et des flèches de direction en mode continu

source: When running the Content server do not hide the main calibre window during shutdown until the Content server has stopped. Show a shutting down message in the window so that the user knows what is happening
fr: Lors de l'exécution du serveur de contenu ne pas masquer la fenêtre principale de calibre pendant l'extinction jusqu'au moment où le serveur s'est arrêté. Affiche un message de fermeture dans la fenêtre pour que l'utilisateur sache ce qui se passe

source: Edit book: Check Book: Add a check for empty links
fr: Éditer le livre : Vérifier le livre : Ajout d'une vérification pour les liens vides

source: DOCX input: When the document has a Table of Contents created using the Word Table of Contents tool, keep a reference to it in the metadata. This is useful when converting to old style MOBI and you want to precisely control placement of the ToC
fr: • Document DOCX en entrée pour la conversion : Quand le document à une Table des Matières créée en utilisant l'outil Table des Matières de Word, garde une référence à celle-ci dans les métadonnées. Ceci est utile lors de la conversion vers l'ancien style MOBI et que vous voulez contrôler précisément l'emplacement de la TdM

source: Fix auto-mounting of some types of devices not working on FreeBSD
fr: Solutionne l'auto-montage de certains types de périphériques qui ne fonctionne pas sous FreeBSD

source: calibredb add: Fix the --cover option not working if the book being added has its own cover
fr: calibredb add: Solutionne l'option --cover ne fonctionnant pas si le livre ajouté à sa propre couverture

source: E-book viewer: Fix mathematics being typeset at too small a font size on Windows
fr: Visionneuse de livre numérique : Solutionne les compositions mathématiques qui ont une trop petite police de caractère sous Windows

source: PDF output: Fix occasional blank pages erroneously inserted in the text (at the end of an internal HTML file)
fr: Format PDF en sortie : Corrige des pages blanches insérées à tort dans le texte (à la fin d'un fichier interne HTML)

source: Book details panel: Fix URL:file:// identifiers not becoming links
fr: Panneau des détails du livre : Solutionne les identifiants url:file:// ne devenant pas des liens

source: Fix fetch news dialog not rendering properly on HiDPI screens
fr: Solutionne le rendu de la boite de dialogue de récupération des actualités sur les écrans HiDPI

source: Fix a hard to trigger crash introduced in the previous release when using the conversion dialog
fr: Solutionne un plantage difficile à reproduire lors de l'utilisation de la boite de dialogue de conversion introduit dans la version précédente

source: Edit book: A new tool to transform book styling using easy to create rules
fr: Éditer le livre : Un nouvel outil pour transformer l'esthétique d'un livre en utilisant des règles faciles à créer

source: For example, you can create rules to change colors in the book or to double the font size of all text in the book, etc. For details, see <a href="%(h0)s">%(h0)s</a>
fr: Par exemple, vous pouvez créer des règles pour changer les couleurs dans un livre ou pour doubler la taille de police de tout le texte de celui-ci, etc. Pour plus d'informations, voir <a href="%(h0)s">%(h0)s</a>

source: Conversion: Allow creating rules to transform styles during conversion, as above. Available in the conversion dialog at 'Preferences-&gt;Common options-&gt;Look &amp; feel-&gt;Transform styles'
fr: Conversion : Permettre la création de règles pour transformer les styles durant la conversion, comme ci-dessus. Disponible dans la boîte de dialogue conversion sous 'Préférences-&gt;Options communes-&gt;Apparence &amp; présentation-&gt;Transformer les styles'

source: Edit metadata dialog: Make the hide toolbars right click menu action persistent. Also fix very large number of custom fields causing the basic metadata tab to not be aligned properly
fr: Boite de dialogue Éditer les métadonnées : Rendre persistant l'action cacher les barres d'outils du menu contextuel. Solutionne également un très grand nombre de colonnes personnalisées entraînant que des onglets de métadonnées de base ne sont pas alignés proprement

source: Portable installer: Do not ask to launch calibre when running an automated install. Automated installs will now never launch calibre
fr: Installateur de la version portable : Ne demande pas de lancer calibre lorsqu'il exécute une installation automatisée. Les installations automatisées ne lanceront jamais calibre

source: E-book viewer: Hide list numbers for popup footnotes when the footnotes are use &lt;ol&gt; as the number are likely to be incorrect
fr: Visionneuse de livre numérique : Cache les numéros de la liste pour les notes de bas de page dans des fenêtres bondissantes quand les notes de bas de page ayant utilisé &lt;ol&gt; comme numéro sont probablement incorrects

source: DOCX input: Ignore the hidden bookmark Word 2010 inserts to enable the go to last edit feature
fr: Document DOCX en entrée pour la conversion : Ignorer les favoris cachés de Word 2010 insérés pour activer la fonctionnalité aller à la dernière édition

source: Fix keyboard focus lost after merging book records
fr: Solutionne la perte de focus du clavier après l'enregistrement de livres fusionnés

source: E-book viewer: Handle &lt;![CDATA[ escapes correctly
fr: Visionneuse de livre numérique : Gère les échappements &lt;![CDATA[ correctement

source: Edit book: Fix spelling correction suggestions not being shown when using the context menu key with the cursor at the end of the word
fr: Éditer le livre : Solutionne le fait que les suggestions de correction orthographique ne sont pas affichées quand est utilisé le menu contextuel avec le curseur à la fin du mot

source: Allow creating rules to ignore files when adding books based on the filename
fr: Permettre la création de règles pour ignorer des fichiers lors de l'ajout de livres basé sur le nom de fichier

source: Useful when using the auto-add feature or when adding in bulk. Preferences-&gt;Adding Books-&gt;Rules to filter added files
fr: Utile lorsque l'on utilise la fonctionnalité d'ajout automatique ou lors d'un ajout par lot. Préférences-&gt;Ajouter des livres-&gt;Règles pour filtrer les fichiers ajoutés

source: calibredb add: Allow specifying filters to control adding of books from directories
fr: Ajouter à calibredb : Permettre à des filtres spécifiques de contrôler l'ajout de livres à partir de répertoires

source: E-book viewer: Allow copying the Table of Contents to the clipboard by right clicking on it
fr: Visionneuse de livres numériques : Permettre la copie de la Table des Matières vers le presse-papier en faisant un clic-droit sur celle-ci

source: FB2 metadata: Ignore invalid (unidentifiable) cover images
fr: Métadonnées FB2 : Ignorer les images de couverture invalides (non identifiables)

source: FB2 metadata: Fix error when adding books with non-numeric series numbers
fr: Métadonnées FB2 : Correction d'une erreur lors de l'ajout de livres avec des numéros de série non numériques

source: DOCX input: Fix handling of toggle properties such as bold/italic/strikethrough/etc. when specified as document defaults
fr: Document DOCX en entrée pour la conversion : solutionne la manipulation des propriétés basculantes tels que gras/italique/barré/etc. lorsque spécifiés comme des standards du document

source: Conversion pipeline: Add support for the q CSS length unit
fr: Pipeline de conversion ; Ajout du support de l'unité de longueur q CSS

source: Add an action to the context menu for the Search bar to paste and instantly execute the search
fr: Ajout d'une action au menu contextuel de la barre de recherche pour coller et lancer instantanément une recherche

source: When adding multiple books from a single directory, added the books in order of the last modified time of the book files
fr: Lors de l'ajout de multiples livres à partir d'un seul dossier, les livres ajoutés le sont dans l'ordre de la date de dernière modification des fichiers

source: Fix a regression in 2.50 that prevented a small number of devices from being detected on Windows
fr: Correction d'une régression de la version 2.50 qui empêchait un petit nombre d'appareils d'être détectés sous Windows

source: PDF metadata: Workaround for PDF files with corrupted XMP metadata packets, generated by Nitro PDF
fr: Métadonnées PDF : solution pour les fichiers PDF avec des paquets de métadonnées XMP corrompus, générés par Nitro PDF

source: Edit book Beautify: Do not beautify the insides of heading/p tags even when they are the only child of body
fr: Éditer le livre : Embellir : Ne pas embellir le contenu des balises heading/p même quand elles sont le seul enfant du body

source: Amazon metadata download: Fix published date not being downloaded from Amazon.it
fr: Téléchargement de métadonnées Amazon : Solutionne le fait que les dates de publication ne sont pas téléchargées à partir de amazon.it

source: Fix a regression in 2.50 that broke the user created device driver feature on Windows
fr: Correction d'une régression de la version 2.50 qui endommage la fonctionnalité de création de pilote par l'utilisateur sous Windows

source: EPUB input: Fix error when processing EPUB files that uses non-ASCII characters for their unique ids
fr: Format EPUB en entrée pour la conversion : solutionne une erreur lors du traitement de fichiers EPUB qui utilisent des caractères non-ascii pour leur identifiant unique

source: When reading the cover from comic files, ignore any image files inside __MACOSX/ directories
fr: • Lors de la lecture de la couverture de fichiers bande dessinée, ignore tous les fichiers image dans les répertoires __MACOSX

source: Fix calibre on macOS unable to connect to sites that support only TLS &gt;= 1.1. Also update the version of Qt bundled on macOS to 5.5.1
fr: Corrige calibre sous macOS incapable de se connecter à des sites qui supportent uniquement TLS &gt;= 1.1. Met également à jour la version de Qt intégrée à macOS à la version 5.5.1

source: Change the way that devices are detected on Windows. This fixes device detection problems on some Windows 10 computers
fr: Changement dans la manière dont les appareils sont détectés sous Windows. Ceci corrige des problèmes de détection d'appareils sur certains ordinateurs sous Windows 10

source: Edit book: When inserting images, add an option to insert the image as a full page image
fr: Éditer le livre : Lors de l'insertion d'images, ajout d'une option pour insérer l'image en tant qu'image pleine page

source: DOCX input: Add support for framed text created by setting the same border style on neighboring paragraphs
fr: Format DOCX en entrée pour la conversion : Ajout du support de texte encadré créé en paramétrant le même style de bordure sur les paragraphes avoisinants

source: Update PocketBook 650 driver for latest firmware revision
fr: Mise à jour du pilote pour la dernière révision du firmware de la liseuse PocketBook 650

source: DOCX input: Fix empty paragraphs with borders being rendered with an empty line inside the borders
fr: Format DOCX en entrée pour la conversion : Correction des paragraphes vides avec bordures étant présentés avec une ligne vide à l'intérieur des bordures

source: ODT input: Fix fallback PNG images generated by LibreOffice 4.x for SVG images not being ignored
fr: Format ODT en entrée pour la conversion : Correction pour que les images PNG de secours générées par LibreOffice 4.x pour les images SVG ne soient plus ignorées

source: Fix Restore library failing on some Windows systems with non-ASCII library paths
fr: Correction de l'échec de restauration d'une bibliothèque sur certains systèmes Windows avec des noms de chemin vers la bibliothèque qui sont en non-ASCII

source: Edit book: Fix error when merging an empty HTML document or one that contains only text and no tags
fr: Éditer le livre : Correction d'une erreur lors de la fusion d'un document HTML vide ou d'un document HTML contenant uniquement du texte et pas de balises

source: Fix failure to add FB2 files that contain published dates
fr: Corrige un problème empêchant l'ajout de fichiers au format FB2 qui contiennent des dates de publication

source: Use a private certificate when downloading plugins via HTTPS. This fixes errors on some windows machines that have missing root certificates
fr: Utilisation d'un certificat privé lors du téléchargement d'extensions via HTTPS. Ceci corrige les erreurs sur certaines machines Windows qui ont perdu les certificats racine

source: Fix Tag editor not working correctly for comma-separated custom columns
fr: Corrige l'Éditeur d'étiquette qui ne fonctionne pas correctement pour les colonnes personnalisées avec séparation par une virgule

source: Fix existing rating not being removed when using Polish books or Embed metadata tools on EPUB files
fr: Corrige que la note existante (étoiles) ne soit pas supprimée lors de l'utilisation de "Polir les livres" ou par des outils intégrés de Métadonnées sur les fichiers EPUB

source: E-book viewer: Add an option to allow only a single book to be viewed at a time. Trying to view a second book will cause it to replace the currently viewed book
fr: Visionneuse de livre numérique : Ajout d'une option pour permettre de voir un seul livre à la fois. Essayer de voir un deuxième livre provoquera la fermeture du premier

source: Kobo driver: Add support for the new firmware 3.19.5761
fr: Pilote Kobo : Ajout du support du nouveau firmware 3.19.5761

source: Linux build: Update bundled version of Qt to 5.5.1
fr: Distribution Linux : Mise à jour de la version intégrée de Qt vers 5.5.1

source: Fix splash screen getting stuck on macOS when restarting calibre in debug mode
fr: Corrige l'écran de démarrage qui se bloque sous macOS lors du redémarrage de calibre en mode débogage

source: Get books: Update plugins for various Polish language book stores to handle changes to the website
fr: Obtenir des livres : Mise à jour des extensions pour diverses boutiques en langue polonaise pour gérer les changements aux sites web

source: Amazon metadata download: Handle a change in the Amazon website that prevented review metadata from being downloaded
fr: Téléchargement de métadonnées Amazon : Gérer un changement sur le site web Amazon qui empêche les métadonnées examinées d'être téléchargées

source: Better algorithm for guessing the 'external' network interface that is displayed to the user
fr: Meilleur algorithme pour deviner l'interface réseau 'externe' qui est présentée à l'utilisateur

source: Tag mapper: Do not allow the user to create rules with invalid regular expressions
fr: Navigateur d'étiquettes : Ne pas permettre à l'utilisateur de créer des règles avec des expressions régulières invalides

source: E-book viewer: Disallow hyphenation in documents that use mathematical typesetting as the hyphenation breaks that typesetting
fr: Visionneuse de livre numérique : Refuser la césure dans les documents qui utilisent des compositions mathématiques vu que la césure vient briser ces compositions

source: E-book viewer: Fix some non-ASCII characters not display in embedded MathML
fr: Visionneuse de livre numérique : Corrige le fait que certains caractères non-ASCII ne soient pas affichés dans le MathML embarqué

source: Download calibre plugins securely using HTTPS
fr: Téléchargement des extensions calibre de façon sécurisée en utilisant HTTPS
