Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Virtual columns: These are custom columns you can add to calibre that display metadata from other fields. For example an ISBN column or a column to show the formats the book has.
es: Columnas virtuales: Son columnas personalizadas que puede añadir a calibre para mostrar metadatos de otros campos. Por ejemplo, una columna ISBN o una columna para mostrar los formatos en los que está disponible el libro.
pt_br: Colunas virtuais: Essas são colunas personalizadas que você pode adicionar ao calibre para exibir metadados de outros campos. Por exemplo, uma coluna com o ISBN ou uma coluna para mostrar os formatos que o livro tem.
uk: Віртуальні стовпчики: це нетипові стовпчики, які ви можете додати до calibre, щоб показувати метадані з інших полів. Наприклад, стовпчик ISBN або стовпчик для показу форматів, у яких зберігаються дані книги.

source: The Metadata download configuration dialog
pt_br: O diálogo de configuração de download de metadados
uk: Діалогове вікно налаштовування отримання даних

source: calibre has long supported connecting to Android phones and tablets on all operating systems, except macOS. This lacuna has now been remedied. You can just plugin any Android phone or tablet on macOS and calibre should automatically detect and connect to it, just as it already does on Windows and Linux.
pt_br: Há muito tempo o calibre suporta conexões a telefones Android e tablets com todos os sistemas operacionais, exceto macOS. Esta lacuna agora foi resolvida. Você pode apenas conectar qualquer telefone Android ou tablet com macOS e o calibre irá detectar automaticamente e conectar, assim como já faz no Windows e no Linux.
uk: У calibre вже давно передбачено підтримку телефонів та планшетів Android в усіх операційних системах, окрім macOS. Цю прогалину у можливостях нарешті заповнено. Вам достатньо з'єднати будь-який телефон або планшет під керуванням Android з macOS, calibre автоматично виявить і встановить з ним з'єднання, так само, як це відбувається у Windows та Linux.

source: Support for touchscreen Windows tablets
pt_br: Suporte para tablets touchscreen Windows
uk: Підтримка планшетів із сенсорним екраном з Windows

source: The calibre e-book viewer now supports touch screen Windows 8 tablets, such as the surface pro. You can use finger gestures to turn pages and navigate around the book in the viewer, allowing the viewer to be used effectively on these tablets.
pt_br: O visualizador de e-books do calibre agora suporta touchscreen em tablets com Windows 8, como o Surface Pro. Você pode usar gestos para virar páginas e navegar pelo livro no visualizador, permitindo que o visualizador possa ser utilizado eficientemente nestes tablets.
uk: У програмі для читання електронних книг calibre тепер передбачено підтримку планшетів із сенсорним керуванням на основі Windows 8. Ви можете скористатися рухами пальцем для гортання сторінок та навігації книгою у програмі для перегляду. Це робить програму для перегляду ефективним засобом читання на таких планшетах.

source: calibre Portable
pt_br: calibre Portátil
uk: Портативна версія calibre

source: The PDF output produced by calibre has been greatly improved. There are no more cut off lines of text/images at the bottom of the page. Top and bottom margins are set correctly. The metadata Table of Contents is converted to PDF Bookmarks in the output file.
es: La salida PDF generada por calibre se ha mejorado mucho. Ya no hay líneas de texto o imágenes cortadas al final de la página. Los márgenes superior e inferior se establecen corrctamente. El índice de metadatos se convierte a marcadores PDF en el archivo de salida.
pt_br: A saída PDF criada pelo calibre foi bastante aprimorada. Não há mais corte de linhas de texto/imagens na parte inferior da página. Margens superiores e inferiores são definidas corretamente. O Índice de metadados é convertido para Marcadores PDF no arquivo de saída.
uk: Виведення даних у форматі PDF за допомогою було значно поліпшено. Усунено обрізання рядків тексту та зображень у нижній частині сторінки. Реалізовано належне встановлення верхнього і нижнього полів. Таблиця змісту у метаданих перетворюється на закладки PDF у виведеному файлі.

source: Automatic adding of books from a specified folder: calibre can now monitor a specified folder on your computer and automatically add any files it finds in that folder. Set it up via Preferences-&gt;Adding books-&gt;Automatic Adding
es: Adición automática de libros de una carpeta específica: calibre puede vigilar una carpeta específica en el equipo y añadir automáticamente cualquier archivo que encuentre en ella. Configúrela en Preferencias &gt; Añadir libros &gt; Adición automática
pt_br: Adição automática de livros de uma pasta específica: o calibre pode agora monitorar uma pasta específica no seu computador e automaticamente adicionar qualquer arquivo encontrado nesta pasta. Configure via Preferências-&gt;Adicionar livros-&gt;Adicionar automaticamente
uk: Автоматичне додавання книг із вказаної теки: нова версія calibre може спостерігати за вказаною текою на вашому комп'ютері і автоматично додавати усі знайдені файли у цій теці. Налаштувати можливість можна за допомогою пункту «Налаштування -&gt; Додавання книг -&gt; Автоматичне додавання».

source: You can show/hide categories in the Tag browser by right clicking on them and add your own categories for quick access, by clicking the Manage user categories button. You can also edit entries in the Tag browser by right clicking on them. This will change their value for all books. For example, if you change the name of an author, this change will appear in the metadata of all the books by that author.
es: Puede mostrar u ocultar categorías en el explorador de etiquetas pulsando con el botón derecho sobre ellas y añadir sus propias categorías para un acceso rápido, pulsando en el botón «Administrar categorías de usuario». También puede modificar entradas en el explorador de etiquetas pulsando con el botón derecho sobre ellas. Esto cambiará su valor para todos los libros. Por ejemplo, si cambia el nombre de un autor, este cambio se aplicará a los metadatos de todos los libros de ese autor.
pt_br: Você pode mostrar/ocultar categorias no Navegador de Tags clicando nelas com o botão direito e adicionar suas próprias categorias para acesso rápido, clicando no botão Gerenciar categorias do usuário. Você pode editar entradas no Navegador de Etiquetas clicando com o botão direito nelas. Isto irá alterar seus valores para todos os livros. Por exemplo, se você alterar o nome de um autor, isto irá aparecer nos metadados de todos os livros desse autor..
uk: Ви можете наказати програмі показувати або приховувати категорії на панелі навігації мітками за допомогою контекстного меню категорії (викликається клацанням правою кнопкою миші). Також можна додати власні категорії для пришвидшення доступу. Для цього достатньо натиснути кнопку керування категоріями користувача. Крім того, ви можете редагувати записи на панелі навігації мітками — достатньо клацнути правою кнопкою миші на записі. Значення буде змінено для усіх книг. Наприклад, якщо ви зміните ім'я автора, його буде змінено у метаданих усіх книг цього автора.

source: You can Save you frequently used searches and bring them up with a single click in the Tag browser. You can also use the saved searches to restrict what is shown in calibre. This will restrict the book list as well as the Tag browser. In effect, you have temporarily reduced your calibre collection to only the books matching the search.
es: Puede guardar búsquedas frecuentes y recuperarlas con una sola pulsación en el explorador de etiquetas. También puede usar las búsquedas guardadas para restringir lo que se muestra en calibre. Esto afectará a la lista de libros así como al explorador de etiquetas. En la práctica, reducirá temporalmente la biblioteca de calibre a los libros que coincidan con la búsqueda.
pt_br: Você pode Salvar suas pesquisas frequentes e usá-las com um simples clique no Navegador de Etiquetas. Você também pode usar as pequisas salvas para restringir o que é mostrado no calibre. Isto irá restringir a lista de livros bem como o Navegador de Etiquetas. De fato, você terá reduzido temporariamente sua coleção para apenas aqueles livros correspondentes à pesquisa.
uk: Ви можете зберегти часто використовувані пошуки і використовувати їх в одне клацання на панелі навігації мітками. Ви також можете використовувати збережені пошуки для обмеження того, що показано у calibre. Пошуки обмежать вміст списку книг так само, як панелі навігації мітками. Таким чином, ви тимчасово обмежите вашу збірку calibre лише тими книгами, які відповідають критеріям пошуку.

source: The e-book viewer now has builtin dictionary lookup. Just select a word and right click to look it up using the dictionary servers at dict.org
es: El visor de libros ahora tiene una búsqueda de diccionario incorporada. Seleccione una palabra y pulse con el botón derecho para buscarla usando los servidores de diccionario de dict.org
pt_br: O visualizador de e-books agora possui busca no dicionário integrada. Apenas selecione uma palavra e clique com o botão direito para procurá-la nos servidores do dict.org
uk: У засобі перегляду електронних книг тепер є вбудований засіб пошуку слів у словнику. Достатньо позначити слово, клацнути правою кнопкою миші і виконати пошук на серверах словників dict.org

source: calibre now has an experimental driver for the iPad. If you connect the iPad to your computer with calibre running, it should be detected and you can send books directly to iBooks on the iPad with calibre. The driver works by using iTunes in the background, so you also need to have iTunes installed and your iPad setup in it. This works on Windows and macOS 10.5 and higher. And of course, you can browse your calibre collection wirelessly on the iPad with the calibre content server. For details see the <a href="%(ios)s">FAQ</a>.
es: calibre tiene ahora un controlador experimental para el iPad. Si conecta el iPad al equipo con calibre en ejecución, debería detectarlo y puede enviar libros directamente a iBooks en el iPad con calibre. El controlador funciona usando iTunes en segundo plano, por lo que también necesita tener iTunes instalado y el iPad configurado en él. Esto funciona en Windows y en macOS 10.5 y superior. Y por supuesto, puede explorar la colección de calibre en el iPad mediante conexión inalámbrica con el servidor de contenidos de calibre. Para más detalles vea las <a href="%(ios)s">preguntas frecuentes</a>.
pt_br: O calibre agora tem um driver experimental para o iPad. Se você conectar o iPad ao seu computador com o calibre rodando, ele deve ser detectado e você poderá enviar livros diretamente para o iBooks no iPad. O driver funciona usando o iTunes ao fundo, então você também precisa ter o iTunes instalado e o seu iPad configurado nele. Isto funciona no Windows e no macOS 10.5 e superior. E claro, você pode navegar sua coleção do calibre sem fio no iPad com Servidor de Conteúdo do calibre. Para detalhes veja o <a href="%(ios)s">FAQ</a>.
uk: До складу нової версії calibre включено експериментальний драйвер для iPad. Якщо ви з'єднаєте iPad з вашим комп'ютером, на якому запущено calibre, програма має виявити пристрій, і ви зможете надсилати книги безпосередньо до iBooks на iPad за допомогою calibre. Драйвер працює з використанням iTunes, тому вам також доведеться встановити у системі iTunes і налаштувати програму для роботи з вашим iPad. Усе це працює на Windows і macOS 10.5 та новіших версіях. І, звичайно ж, ви зможете здійснювати навігацією вашою збіркою calibre за допомогою бездротового зв'язку з iPad за допомогою сервера даних calibre. Докладніший опис наведено у <a href="%(ios)s">розділі поширених питань</a>.

source: Edit Book: Fix style attribute on <html> tags not being preserved when editing AZW3 files.
pt_br: Editar Livro: Corrige o atributo 'style' em tags <html> não sendo preservado ao editar arquivos AZW3.

source: Edit book: Show a popup after a fix all html/beautify all files so the user can easily see what was changed, if needed.
es: Modificar libro: Se muestra un cuadro emergente después de corregir o embellecer archivos, para que el usuario pueda ver fácilmente qué ha cambiado, si es necesario.

source: Amazon metadata download: Add support for Amazon Australia (can be configured via Preferences->Metadata download->customize the amazon metadata source)
es: Descarga de metadatos de Amazon: Se permite el uso de Amazon Australia (puede configurarse en Preferencias > Descarga de metadatos > personalizar el origen de metadatos Amazon)

source: Add a tweak (in Preferences->Tweaks) to allow skipping network check on news download
es: Se añade un ajuste (en Preferencias -> Ajustes) para omitir la comprobación de red al descargar noticias

source: Add a option to draw a grid in the main book list (Preferences->Look & feel)
es: Se añade una opción para dibujar una rejilla en la lista de libros principal (Preferencias > Apariencia)

source: Edit book: Allow removing the currently highlighted tag (while keeping its contents) by pressing Ctrl+>. You can also add a tool to do it via Preferences->Toolbars
es: Modificar libro: Se permite eliminar la etiqueta actualmente resaltada (manteniendo su contenido) pulsando Ctrl+>. También puede añadir una herramienta para hacerlo en Preferencias > Barras de herramientas

source: Allow creating rules to transform author names when adding books to calibre. Accessible via Preferences->Adding books->Adding actions
es: Se permite crear reglas para transformar nombres de autor al añadir libros a calibre. Accesible mediante Preferencias > Añadir libros > Acciones de adición

source: Add a similar author mapper tool to manipulate author names in the existing library. Accessible via Preferences->Toolbars
es: Se añade una herramienta de correspondencia de autores parecida para manipular nombrs de autor en la biblioteca existe. Accesible mediante Preferencias > Barras de herramientas

source: Add a similar author mapper tool for metadata downloading, accessible via Preferences->Metadata download
es: Se añade una herramienta de correspondencia de autores parecida para descarga de metadatos, accesible mediante Preferencias > Descarga de metadatos

source: Add an option in Preferences->Look & feel to disable the new 'drag and drop to merge books feature'
es: Se añade una opción en Preferencias > Apariencia para desactivar la nueva opción de arrastrar y soltar para unir libros

source: Add an option to use two lines for the text under the toolbar button in Preferences->Look & feel
es: Se añade una opción para usar dos líneas para el texto bajo los botones de la barra de herramientas en Preferencias > Apariencia

source: Improve formatting of help in Preferences->Tweaks
es: Se mejora el formato de la ayuda en Preferencias > Ajustes

source: DOCX Output: Fix <pre> tags not being converted correctly.
es: Salida DOCX: Se corrige el fallo por el que las etiquetas <pre> no se convertían correctamente.

source: Edit Book: Fix an error caused by a landmark entry in EPUB 3 files that has an <a> tag without an href attribute.
es: Modificar libro: Se corrige un error causado por una entrada de hito en archivos EPUB 3 que tiene una etiqueta <a> sin atributo href.
