Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Download video: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
es: Descargar vídeo: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
fr: Télécharger la vidéo : <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
pt_br: Baixe o vídeo: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
uk: Отримайте відео: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>

source: The e-book editor
es: El editor de libros
fr: L'éditeur de livre numérque
pt_br: O editor de e-books
uk: Редактор електронних книг

source: A tour of the calibre e-book editor.
es: Un recorrido por el editor de libros de calibre.
fr: Une visite de l'éditeur de livre numérique de calibre.
pt_br: Um tour pelo editor de e-books do calibre
uk: Огляд редактора електронних книг calibre.

source: Download video: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
es: Descargar vídeo <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
fr: Télécharger la vidéo : <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
pt_br: Baixe o vídeo: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>
uk: Отримайте відео: <a href="%(mp4)s">[MP4]</a>&nbsp;<a href="%(webm)s">[WEBM]</a>

source: UI Power tips
es: Consejos avanzados de interfaz
fr: Conseils pratiques pour l'Interface Utilisateur
pt_br: Dicas poderosas da Interface do Usuário
uk: Підказки щодо інтерфейсу

source: Power tips to optimize your usage of the calibre User Interface to manage your book collection. Available on <a href="%(yt)s">YouTube</a> as well.
es: Consejos avanzados para optimizar el uso de la interfaz de usuario de calibre para gestionar la colección de libros. Disponible también en <a href="%(yt)s">YouTube</a>.
fr: Conseils pratiques pour optimiser votre utilisation de l'Interface Utilisateur calibre pour gérer votre collection de livres. Disponible également sur <a href="%(yt)s">Youtube</a>.
pt_br: Dicas poderosas para otimizar o uso da Interface do Usuário do calibre para gerenciar sua coleção de livros. Disponível no <a href="%(yt)s">YouTube</a> também.
uk: Чудові підказки щодо використання інтерфейсу calibre для керування вашою збіркою книг. Також доступні на <a href="%(yt)s">YouTube</a>.

source: The main calibre interface, showing books in your library.
es: La interfaz principal de calibre, mostrando los libros en la biblioteca.
fr: L'interface principale de calibre, montrant les livres de votre bibliothèque.
pt_br: A interface principal do calibre, mostrando os livros na sua biblioteca.
uk: Основний інтерфейс calibre, показує книги у вашій бібліотеці.

source: E-book conversion dialog. calibre supports conversion from many formats to many other formats.
es: Diálogo de conversión de libros, calibre permite la conversión de muchos formatos a muchos otros formatos.
fr: Boîte de dialogue de conversion de livre numérique. calibre prend en charge la conversion de nombreux formats vers de nombreux autres formats.
pt_br: Diálogo de conversão de e-books. O calibre suporta a conversão de muitos formatos para vários outros.
uk: Діалогове вікно перетворення книг. У calibre передбачено підтримку перетворення даних у багатьох форматах на дані у багатьох інших форматах.

source: The builtin e-book viewer. Supports all major formats.
es: El visor de libros incorporado. Soporta todos los formatos principales.
fr: Visionneuse de livre numérique intégrée. Supporte la majorité des formats
pt_br: O visualizador de e-books integrado. Suporta todos os principais formatos.
uk: Вбудований засіб перегляду електронних книг. Передбачено підтримку усіх основних форматів книг.

source: Browsing your collection on the internet, using the calibre content server.
es: Explorar la colección en internet, usando el servidor de contenidos de calibre.
fr: Naviguer dans votre collection sur internet en utilisant le serveur de contenu de calibre.
pt_br: Navegando pela sua coleação na internet, usando o servidor de conteúdo do calibre.
uk: Можливість навігації вашою збіркою з інтернету за допомогою сервера даних calibre.

source: Browsing your calibre collection on the iPhone using Stanza.
es: Explorar la colección de calibre en el iPhone usando Stanza.
fr: Naviguer dans votre collection calibre sur un iPhone en utilisant Stanza.
pt_br: Navegando sua coleção do calibre no iPhone usando o Stanza.
uk: Навігація вашою збіркою calibre на iPhone за допомогою Stanza.

source: New in calibre 2.0
fr: Nouveautés dans la version 2.0 de calibre
pt_br: Novidades do calibre 2.0
uk: Нове у calibre 2.0

source: It has been a year since calibre 1.0 and lots has changed in calibre-land. The biggest new feature is an e-book editor, capable of editing e-books in both the EPUB and AZW3 (Kindle) formats. Click on the items in the list below to learn more about each new feature.
es: Ha pasado un año desde calibre 1.0 y han cambiado muchas cosas en el entorno de calibre. La principal novedad es un editor de libros electrónicos, capaz de modificar libros en formatos EPUB y AZW3 (Kindle). Pulse en los puntos de la siguiente lista para saber más sobre cada novedad.
fr: Il s'est passé un an depuis calibre 1.0 et beaucoup de choses ont changé au pays de calibre. Le nouvelle fonctionnalité principale est un éditeur de livre numérique, capable d'éditer des livres numériques aux formats EPUB et AW3 (Kindle). Cliquez sur les éléments dans la liste ci-dessous pour en apprendre plus sur chaque nouvelle fonctionnalité.
pt_br: Já faz um ano desde o calibre 1.0 e muita coisa mudou na calibre-lândia. A grande nova função é um editor de e-book, capaz de editar e-books tanto no formato EPUB como AZW3 (Kindle). Clique nos items da lista abaixo para aprender mais sobre cada nova função.
uk: З часу випуску calibre 1.0 минуло більше року і у царині calibre багато чого змінилося. Найбільшою новою можливістю є редактор електронних книг, придатний для редагування електронних книг у форматах EPUB і AZW3 (Kindle). Натисніть один з пунктів у наведеному нижче списку, щоб дізнатися більше про кожну з нових можливостей.

source: Note that because of the move to Qt 5, calibre no longer supports either Windows XP or versions of macOS older than 10.7 (Lion). If you are using either of these operating systems, you should stay with calibre 1.48.
fr: Notez qu'en raison du passage à Qt 5, calibre ne prend plus en charge Windows XP ou les versions de macOS antérieures à 10.7 (Lion). Si vous utilisez l'un de ces systèmes opérationnels, vous devrez rester avec calibre 1.48.
pt_br: Note que devido a mudança para o Qt 5, o calibre não mais suporta o Windows XP ou versões do macOS mais antigas que a 10.7 (Lion). Se você está utilizando qualquer um destes sistemas operacionais, deve permanecer com o calibre 1.48.
uk: Зауважте, що через перехід на Qt 5 нові версії calibre несумісні з Windows XP та версіями macOS, старішими за 10.7 (Lion). Якщо ви користуєтеся однією з цих операційних систем, вам слід скористатися версією calibre 1.48.

source: calibre now has an e-book editor capable of editing books in the EPUB and AZW3 (Kindle) formats, with many powerful tools and features, specially designed for making editing e-book easier.
fr: calibre à maintenant un éditeur de livre numérique capable d'éditer des livres aux formats EPUB et AZW3 (Kindle), avec de nombreuses outils et fonctionnalités puissants, spécialement conçus pour rendre l'édition de livres numériques plus aisée.
pt_br: o calibre agora tem um editor de e-book capaz de editar livros nos formatos EPUB e AZW3 (Kindle), com muitas ferramentas poderosas e funções, especialmente criadas para tornar a edição mais fácil.
uk: У calibre тепер є редактор електронних книг, за допомогою якого можна редагувати книги у форматах EPUB та AZW3 (Kindle). У редакторі передбачено багато потужних інструментів та можливостей, створених спеціально для полегшення редагування електронних книг.

source: Watch the video below for a tour of the new e-book editor. You can also read about the various features of the editor in detail in the <a href="%(edit)s">User Manual</a>.
fr: Regarder la vidéo ci-dessous pour une visite du nouvel éditeur de livre numérique. Vous pouvez également lire au sujet des différentes fonctionnalités de l'éditeur dans le <a href="%(edit)s">Manuel Utilisateur</a>.
pt_br: Assista o vídeo abaixo para um tour sobre o novo editor de e-book. Você também pode ler sobre as várias funções do editor em detalhes no <a href="%(edit)s">Manual do Usuário</a>.
uk: Перегляньте наведене нижче відео, щоб дізнатися більше про новий редактор електронних книг. Ви також можете почитати про різноманітні його можливості у <a href="%(edit)s">Підручнику користувача</a>.

source: Click to watch the new e-book editor
es: Pulse para ver el nuevo editor de libros electrónicos
fr: Cliquez pour regarder le nouvel éditeur de livre numérique
pt_br: Clique para assistir o novo editor de e-book
uk: Натисніть, щоб переглянути знімок нового редактора книг

source: The new e-book editor
es: El nuevo editor de libros electrónicos
fr: Le nouvel éditeur de livre numérique
pt_br: O novo editor de e-book
uk: Новий редактор електронних книг

source: Download video:
es: Descargar vídeo:
fr: Télécharger la vidéo :
pt_br: Baixar vídeo:
uk: Отримати відео:

source: Comparing books
es: Comparar libros
fr: Comparer des livres
pt_br: Comparar livros
uk: Порівняння книг

source: Now that we have the ability to edit books, it would be nice to also have the ability to compare them. Fortunately, calibre 2.0 also has a new "Compare Books" tool that you can use to see all the differences between two books, highlighted, side-by-side. To use it, open the first book in the calibre e-book editor and click <code>File-&gt;Compare to another book</code>.
fr: Maintenant que nous avons la capacité d'éditer d'éditer des livres, il serait bien d'avoir également la capacité de les comparer. Heuruesement, calibre 2.0 a également un nouvel outil "Comparer les livres" que vous pouvez utiliser pour voir toutes les différences entre deux livres, surlignées, côte à côte. Pour l'utiliser ouvrir le premier livre dans l'éditeur de livre calibre et cliquez <code>Fichier-&gt;Comparer à un autre livre</code>.
pt_br: Agora que temos a capacidade de editar livros, seria legal também ter a capacidade de compará-los. Felizmente, o calibre 2.0 também tem uma nova ferramenta "Comparar Livros" que você pode usar para ver todas a diferenças entre dois livros, realçadas, lado-a-lado. Para usar, abra o primeiro livro no editor do calibre e clieque em <code>Arquivo-&gt;Comparar com outro livro</code>.
uk: Тепер, коли у вас з'явилася можливість редагувати книги, чудово було б мати змогу порівнювати їх. На щастя, у calibre 2.0 реалізовано новий інструмент «Порівняти книги», за допомогою якого ви зможете переглянути усі відмінності між двома книгами, із підсвічуванням, один фрагмент проти одного. Щоб скористатися цим інструментом, відкрийте першу з книг, які хочете порівняти, у редакторі електронних книг calibre і скористайтеся пунктом меню <code>Файл-&gt;Порівняти з іншою книгою</code>.

source: The compare books tool: showing differences side-by-side
es: Herramienta para comparar libros: muestra diferencias lado a lado
fr: L'outil pour comparer des livres : affichage des différence côte à côte
pt_br: A ferramenta de comparação de livros: mostra as diferenças lado-a-lado
uk: Інструмент порівняння книг: паралельний показ відмінностей між книгами

source: First
es: Primero
fr: Premier
pt_br: Primeiro
uk: Перший

source: How to launch the compare books tool from within the editor
fr: Comment ouvrir l'outil de comparaison de livre depuis l'éditeur
pt_br: Como iniciar a ferramenta de comparação de livros dentro do editor
uk: Як запустити засіб порівнювання книг з редактора

source: Second
es: Segundo
fr: Deuxième
pt_br: Segundo
uk: Другий

source: Support for Android phones and tablets on macOS
fr: Prise en charge des téléphones et des tablettes Android sous macOS
pt_br: Suporte para telefones Android e tablets no macOS
uk: Підтримка телефонів та планшетів Android на macOS

source: calibre has long supported connecting to Android phones and tablets on all operating systems, except macOS. This lacuna has now been remedied. You can just plugin any Android phone or tablet on macOS and calibre should automatically detect and connect to it, just as it already does on windows and linux.
fr: calibre prend en charge depuis longtemps les téléphones et tablettes sous Android sur tous les systèmes d'exploitation, excepté sous macOS. Cette lacune a maintenant été rectifiée. Vous pouvez simplement brancher n'importe que téléphone ou tablette Android sous macOS et calibre doit automatiquement le détecter et s'y connecter; comme il le fait déjà sous Windows et Linux.

source: Now uses Qt 5
es: Ahora se usa Qt 5
fr: Utilise maintenant Qt 5
pt_br: Agora usa o Qt 5
uk: Тепер використовується Qt 5

source: calibre uses the <a href="https://qt-project.org/">Qt</a> graphical toolkit. In version 2.0, calibre has migrated to Qt 5. This brings with it several important bug fixes for the rendering of text in the e-book viewer. Fallback fonts now work, embedded fonts whose names inside the font file do not match the names in the @font-face rule work, hyphenation is greatly improved and so on. Qt 5 also allows the calibre command line tools to be run on linux without needing a running X server. This has led to significant memory usage and performance improvements when running some command line tools, such as the standalone content server and <code>ebook-convert</code>.
fr: calibre utilise la boite à outil graphique <a href="https://qt-project.org/">Qt</a> Dans sa version 2.0 calibre a migré vers Qt5. Celui-ci à amené avec lui plusieurs importantes corrections de bug pour le rendu du texte dans la visionneuse de livre numérique. Maintenant les polices de repli fonctionnent, la règle pour les polices embarquées dont les noms dans le fichier de police ne correspondent pas aux noms dans @font-face fonctionne, la césure est grandement améliorée et ainsi de suite. QT 5 permet également que les outils en ligne de commande de calibre fonctionnent sous Linux sans la nécessité d'un serveur X en exécution. Ceci a mené aux améliorations significatives de la performance et de l'utilisation de la mémoire lors de l'exécution de certaines commandes en ligne, comme le serveur de contenu autonome et <code>ebook-convert</code><
pt_br: O calibre usa o kit de ferramentas gráficas <a href="https://qt-project.org/">Qt</a> . Na versão 2.0, o calibre migrou para o Qt 5. Isto leva à correção de vários erros de renderização do texto no visualizador de e-books. Fontes de fallback agora funcionam, fontes incorporadas cujo nome dentro do arquivo não correspondem ao nome na regra @font-face funcionam, hifenização muito melhorada e assim por diante. O Qt 5 também permite que as ferramentas de de linha de comando do calibre sejam executadas no linux sem a a necessidade de rodar um servidor X. Isto levou a consideráveis melhorias de performance e uso de memória ao executar certas ferramentas de linha de comando, como o servidor de conteúdo individual e o <code>ebook-convert</code>.
uk: calibre використовує набір графічних засобів <a href="https://qt-project.org/">Qt</a>. У версії 2.0, calibre було перенесено на Qt 5. Це надало змогу виправити декілька суттєвих вад у показі тексту у програмі для перегляду електронних книг. Тепер працює використання резервних шрифтів, працює правило для шрифтів, назви яких у файлі шрифту не збігаються із назвами у @font-face, значно поліпшено роботу засобу перенесення слів тощо. Крім того, Qt 5 уможливлює запуск інструментів командного рядка calibre у linux без потреби у запуску графічного сервера. Це призвело до значних поліпшень у вживанні пам'яті та швидкодії при запуску деяких засобів командного рядка, зокрема окремого сервера даних та <code>ebook-convert</code>.

source: The move to Qt 5 meant that many calibre plugins needed to be updated to work with Qt 5. Thanks to the efforts of calibre's enthusiastic community, most plugins have already been ported. For a detailed list is maintained at the <a href="%(porting)s">porting page</a>.
fr: Le passage à QT 5 signifie que de nombreuses extensions nécessitent une mise à jour pour fonctionner avec Qt 5. Merci des efforts de la communauté enthousiaste de calibre, la plupart des extensions ont déjà été portées. Une liste détaillée est maintenue sur la <a href="%(porting)s">page de portage</a>.
pt_br: A mudança para o Qt 5 fez com que vários plugins do calibre tivessem que ser atualizados para funcionar com o Qt 5. Graças ao esforço da entusiasmada comunidade do calibre, a maioria dos plugins já foi atualizada. Para uma lista detalhada, verificar em <a href="%(porting)s">página de atualização</a>.
uk: Перехід на Qt 5 означає, що багато з додатків calibre потребують оновлення, щоб працювати з Qt 5. Завдяки зусиллям ентузіастів зі спільноти calibre більшість додатків вже портовано. Із докладним списком додатків можна ознайомитися на <a href="%(porting)s">сторінці портування</a>.

source: Support for touchscreen windows tablets
fr: Prise en charge des tablettes à écran tactile Windows

source: The calibre e-book viewer now supports touch screen windows 8 tablets, such as the surface pro. You can use finger gestures to turn pages and navigate around the book in the viewer, allowing the viewer to be used effectively on these tablets.
fr: La visionneuse de livre numérique prend maintenant en charge les tablettes à écran tactile Windows 8, telle que la Surface Pro. Vous pouvez utiliser les mouvements de doigt pour tourner les pages et parcourir le livre dans la visionneuse, permettant à la visionneuse d'être utilisée efficacement sur ces tablettes.

source: Improvements to library organisation
es: Mejoras para la organización de bibliotecas
fr: Améliorations dans l'organisation de la bibliothèque
pt_br: Melhorias na organização da biblioteca
uk: Поліпшення в упорядковуванні бібліотеки

source: You can now define simple rules to make emblems (little icons) appear next to book covers in the cover grid. For example, a heart next to books you have rated highly or a tick mark next to books you have read and so on. To setup emblems, go to <code>Preferences-&gt;Look &amp; Feel-&gt;Cover Grid-&gt;Emblems</code>.
fr: Vous pouvez maintenant définir des règles simples pour faire apparaître des emblèmes (petites icônes) près de la couverture d'un livre dans la grille de couvertures. Par exemple un cœur près des livres pour lesquels une notation haute ou une coche près des livres que vous avez lu et ainsi de suite. Pour paramétrer les emblèmes, allez dans <code>Préférences-&gt;Apparence et présentation-&gt;Grille de couvertures-&gt;Embièmes</code>.
pt_br: Você agora pode definir regras simples para mostrar emblemas (pequenos ícones) próximo às capas dos livros na grade de capas. Por exemplo, um coração próximo ao livros que você avaliou bem ou uma marca próxima a livros que você já leu, etc. Para configurar os emblemas, vá em <code>Preferências-&gt;Aparência-&gt;Grade de Capas-&gt;Emblemas</code>.
uk: Тепер ви можете визначити прості правила для того, щоб емблеми (невеличкі піктограми) з'являлися поряд із обкладинками книг у таблиці обкладинок. Наприклад, зображення серця поряд із книгами із високою оцінкою або позначка поряд із книгами, які ви вже прочитали, тощо. Щоб налаштувати емблеми, скористайтеся пунктом <code>Налаштування -&gt; Вигляд та поведінка -&gt; Таблиця обкладинок -&gt; Емблеми</code>.

source: There is a new tool <em>Mark Books</em> that can be used to mark books temporarily. The mark appears as a little pushpin icon next to the book and all marks are automatically cleared by restarting calibre. Go to <code>Preferences-&gt;Toolbars</code> and add the Mark Books tool to your main toolbar to begin using it.
fr: Il y a un nouvel outil <em>Marquer les livres</em> qui peut être utilisé pour marquer temporairement des livres. La marque apparaît comme une petite punaise près du livre et toutes les marques sont automatiquement effacées en redémarrant calibre. Aller dans <code>Préférences-&gt;Barre d'outils</code> et ajoutez l'outil Marquer les livres pour commencer à l'utiliser.
pt_br: Há uma nova ferramenta, <em>Marcar livros</em>, que pode ser usada para marcar livros temporariamente. A marca aparece como um pequeno ícone de alfinete próximo ao livro, e todas as marcas automaticamente limpas ao reiniciar o calibre. Vá em <code>Preferências-&gt;Barra de Ferramentas</code> e adicione a ferramenta Marcar Livros para sua barra de ferramentas principal para começar a usá-la.
uk: Створено новий інструмент, <em>Позначення книг</em>, яким можна скористатися для тимчасового позначення книг. Позначка з'являється як невеличка шпилька поряд із пунктом книги, а усі позначки автоматично вилучаються під час завершення роботи calibre. Скористайтеся сторінкою <code>Налаштування -&gt; Панелі інструментів</code> і додайте інструмент позначення книг на вашу головну панель, щоб користуватися ним.

source: Cover Grid emblems: you can adjust the icon size and position as well
fr: Emblèmes de la Grille de couvertures : vous pouvez ajuster aussi bien la taille de l'icône que sa position
pt_br: Emblemas da Grade de Capas: você também pode ajustar o tamanho e a posição do ícone
uk: Емблеми у таблиці обкладинок: ви можете скоригувати розмір піктограм та їхнє розташування

source: The actions you can perform with marked books
fr: Les actions que vous pouvez effectuer avec les livres marqués
pt_br: As ações que você pode executar com livros selecionados
uk: Дії, які ви можете виконувати із позначеними книгами

source: This is an appropriate time to throw out a big thank you to the calibre community who have contributed selflessly of their energy and enthusiasm — without which many of the features above would never have seen the light of day.
fr: C'est le moment approprié pour exprimer un grand merci à la communauté calibre qui a donné de son énergie et de son enthousiasme sans compter -- sans laquelle beaucoup des fonctionnalités susmentionnées n'auraient jamais vu la lumière du jour.
pt_br: Este é o momento apropriado para dizer um muitíssimo obrigado à comunidade do calibre, que contribuiu de maneira altruísta com sua energia e entusiasmo — sem os quais muitas das funções acima nunca teriam visto a luz do dia
uk: Саме час подякувати спільноті calibre, яка беззастережно віддавала свою енергію та ентузіазм — без них ми ніколи б не змогли скористатися багатьма тими можливостями, які описано вище.

source: Note that many of these features were actually introduced during the lifetime of the 1.x series. This document describes new features as compared to 1.0
fr: Notez qu'un grand nombre de ces fonctionnalités ont été en fait introduites tout au long de la série de version 1.x. Ce document décrit les nouvelles fonctionnalités comparativement à la version 1.0
pt_br: Note que muitas dessas funções foram de fato introduzidas durante o ciclo de vida da série 1.x. Este documento descreve novas funções comparadas à versão 1.0
uk: Зауважте, що багато з цих можливостей було насправді впроваджено під час створення послідовності випусків 1.x. У цьому ж документі описано нові можливості, які з'явилися з часу випуску 1.0.

source: See what was new in previous major calibre releases:
es: Ver los cambios en las versiones principales anteriores de calibre:
fr: Voir les nouveautés des précédentes versions majeures de calibre :
pt_br: Veja as principais novidades da versões anteriores do calibre:
uk: Перегляньте нові можливості у попередніх основних випусках calibre:

source: New in calibre 3.0
es: Nuevo en calibre 3.0
fr: Nouveautés dans la version 3.0 de calibre
pt_br: Novidades do calibre 3.0
uk: Нове у calibre 3.0
