Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Kobo driver: Recognize Kobo Aura 2 with new firmware (4.6.10188)
es: Controlador Kobo: Se reconoce el Kobo Aura 2 con nuevo firmware (4.6.10188)
pt_br: Driver do Kobo: Reconhece Kobo Aura 2 com o novo firmware (4.6.10188)
uk: Драйвер Kobo: реалізовано розпізнавання Kobo Aura 2 із новою мікропрограмою (4.6.10188)

source: When reading metadata from HTML also recognize &lt;meta name="dc.description"&gt; as being comments
es: Al leer metadatos de HTML se reconoce también &lt;meta name="dc.description"&gt; como comentarios
pt_br: Ao ler metadados do HTML também reconhece &lt;meta name="dc.description"&gt; como sendo comentários
uk: Під час читання метаданих з HTML &lt;meta name="dc.description"&gt; тепер розпізнаються як коментарі

source: 09 Mar, 2018
pt_br: 09 de Março de 2018
uk: 9 березня 2018 року

source: Driver for the new PocketBook 740
es: Controlador para el nuevo PocketBook 740
pt_br: Driver para o novo PocketBook 740
uk: Драйвер до нового PocketBook 740

source: Allow using relative URLs in comments type metadata. The relative URLs are interpreted relative to the book folder in the calibre library
es: Se permite usar URL relativos en metadatos de tipo comentario. Los URL relativos se interpretan con respecto a la carpeta del libro en la biblioteca de calibre
pt_br: Permite usar URLs relativos no tipo de metadados de comentários. Os URLs relativos são interpretados em relação à pasta do livro na biblioteca do calibre.
uk: Уможливлено використання відносних адрес у метаданих типу коментаря. Відносні адреси обробляються щодо теки книги у бібліотеці calibre.

source: Edit book: Reports: Do not show characters from the HTML markup in the characters report.
es: Modificar libro: Informes: No se muestran caracteres del marcado HTML en el informe de caracteres.
pt_br: Editar livro: Relatórios: Não mostrar caracteres da marcação HTML no relatório de caracteres.
uk: Редагування книг: звіти: усунено показ символів з розмітки HTML у звіті щодо кількості символів.

source: Allow adding the Virtual library button to any toolbar/menu via Preferences-&gt;Toolbars &amp; menus
es: Se permite añadir el botón de biblioteca virtual a cualquier barra de herramientas o menú mediante Preferencias &gt; Barras de herramientas y menús
pt_br: Permite adicionar o botão de Biblioteca Virtual a qualquer barra de ferramentas ou menu via Preferências-&gt;Barras de ferramentas &amp; menus
uk: Уможливлено додавання кнопки віртуальної бібліотеки на будь-яку панель інструментів чи до будь-якого меню за допомогою сторінки «Налаштування -&gt; Панелі і меню».

source: Server: Fix server becoming unresponsive if a client sends invalid SSL data at exactly the right moment
es: Servidor: Se corrige el fallo por el que el servidor no responde si un cliente envia datos SSL no validos en el momento preciso
pt_br: Servidor: Corrige o servidor parando de responder se um cliente envia dados SSL inválidos exatamente no momento certo
uk: Сервер: виправлено помилку, пов'язану із тим, що сервер припиняв працювати, якщо клієнт надсилав некоректні дані SSL у певний момент часу.

source: Conversion heuristics: Make unwrapping recognize Georgian letters as well.
es: Heurística de conversión: La unión de líneas reconoce letras georgianas también.
pt_br: Heurística de conversão: Faz com que a descompactação também reconheça letras do alfabeto georgiano.
uk: Евристика перетворення: реалізовано розпізнавання літер грузинської у засобі перенесення рядків.

source: Make de-serialization of stored conversion options safe against maliciously crafted input
es: Se asegura la deserialización de opciones de conversión almacenadas frente a entradas malintencionadas
pt_br: Torna a desserialização de opções de conversão armazenadas segura contra entradas maliciosas
uk: Реалізовано перетворення з послідовної форми параметрів у такий спосіб, який не загрожує системі, якщо збережені параметри перетворення містять код зловмисника.

source: E-book viewer: Change the file format used to import/export bookmarks to use JSON. This prevents malicious bookmarks files from causing code execution.
es: Visor de libros: Se cambia el formato de archivo usado para importar y exportar marcadores para usar JSON. Esto evita que los archivos de marcadores malintencionados puedan ejecutar código.
pt_br: Visualizador de e-books: Altera o formato de arquivo utilizado para importar/exportar marcadores para usar JSON. Isso evita que arquivos de marcadores maliciosos levem à execução de código.
uk: Засіб перегляду книг: змінено формат імпортування та експортування закладок на JSON. Таким чином, усунено можливість створення шкідливих файлів закладок із програмним кодом, створеним зловмисниками.

source: Make the history completion for the search and replace edit box case-sensitive.
es: Se distinguen mayúsculas y minúsculas en el completado de histórico del cuadro de búsqueda y sustitución.
pt_br: Ativa a diferenciação entre maiúsculas e minúsculas no autopreenchimento do recurso procurar e substituir.
uk: Реалізовано враховування регістру символів у журналі засобу доповнення пошуку і заміни.

source: PDF Output: When the input document contains multiple anchors with the same value, use the first anchor rather than the last. This follows browser behavior.
es: Salida PDF: Cuando el documento de entrada contiene varios puntos de anclaje con el mismo valor, se usa el primero en lugar del último. Esto imita el comportamiento del navegador.
pt_br: Saída PDF: Quando o documento de entrada contém múltiplas âncoras com o mesmo valor, usa a primeira âncora em vez da última. Isto segue o comportamento dos navegadores.
uk: Виведення у форматі PDF: якщо у вхідному документі є декілька прив'язок із однаковими значенням, реалізовано використання першої прив'язки, а не останньої. Це відповідає типовій поведінці програм для перегляду інтернету.

source: FB2 Input: Add &lt;div&gt; to &lt;blockquote&gt; content to silence the useless epubcheck
es: Entrada FB2: Se añade &lt;div&gt; al contenido de &lt;blockquote&gt; para contentar al inútil epubcheck
pt_br: Entrada FB2: Adiciona &lt;div&gt; ao conteúdo do &lt;blockquote&gt; para silenciar o inútil epubcheck
uk: Вхідні дані у форматі FB2: додано &lt;div&gt; до даних &lt;blockquote&gt;, щоб задовольнити перевірку epubcheck.

source: 23 Feb, 2018
pt_br: 23 de Fevereiro de 2018
uk: 23 лютого 2018 року

source: Browser viewer: Allow long tapping a word to look it up in a dictionary or search the internet for it.
es: Visor del navegador: Se permite pulsar en una palabra para buscarla en el diccionario o en Internet.
pt_br: Visualizador do Navegador: Permite pressionar e segurar em uma palavra para verificá-la em um dicionário ou pesquisar na internet.
uk: Панель навігації: уможливлено пошук у словнику або у інтернеті слова, на якому здійснено довге натискання.

source: Conversion: Handle the deprecated type attribute on &lt;ol&gt; tags.
es: Conversión: Se trata el atributo anticuado «type» en etiquetas &lt;ol&gt;.
pt_br: Conversão: Lida com atributo obsoleto 'type' em tags &lt;ol&gt;.
uk: Перетворення: реалізовано обробку застарілого атрибуту типу для теґів &lt;ol&gt;.

source: Fix metadata download from amazon stopped working because of a website change
es: Se corrige la descarga de metadatos de Amazon, que había dejado de funcionar por un cambio en el slitio web
pt_br: Corrige download de metadados da amazon que parou de funcionar por conta de uma mudança no site
uk: Виправлено отримання з amazon, яке припинило працювати через зміни на сайті.

source: Fix re-ordering of columns causing split book splitter state not being restored on restart
es: Se corrige el fallo por el que la reordenación de columnas hacía que el estado de la división no se restaurara al reiniciar
pt_br: Corrige a reordenação de colunas fazendo com que o estado do divisor da lista de livros não seja restaurado ao reiniciar
uk: Виправлено помилку, пов'язану із тим, що перевпорядковування стовпчиків призводило після поділу до того, що стан роздільника не відновлювався при перезапуску.

source: Fix errors when using strftime with unicode strings on non-utf-8 windows systems.
es: Se corrigen errores al usar strftime con textos unicode en sistemas Windows que no son utf-8.
pt_br: Corrige erros ao usar strftime com strings unicode em sistemas windows com codificação diferente de utf-8.
uk: Виправлено помилки при використанні strftime для рядків unicode у системах Windows, у яких не використовується utf-8.

source: Split book view: Fix vertical scroll position of the two views getting out of sync after doing some searches.
es: División de lista de libros: Se corrige la desincronización del desplazamiento de las dos vistas después de hacer algunas búsquedas.
pt_br: Dividir lista de livros: Corrige a posição de rolagem vertical das duas listas saindo de sincronia após fazer algumas pesquisas.
uk: Поділений перегляд книги: виправлено розсинхронізацію вертикального гортання після виконання пошуку.

source: Fix some edit widget appearing in the wrong place when editing in the right hand panel of the new split book list.
es: Se corrige la aparición de algunos widgets de edición en lugares incorrectos al modificar en el panel derecho de la nueva lista de libros dividida.
pt_br: Corrige algum widget de edição aparecendo no lugar errado ao editar no painel da direita da nova visualização dividida da lista de livros.
uk: Виправлено появу віджета редагування у помилковому місці під час редагування на правій панелі нового поділеного списку книг.

source: Portable build: Fix cache directory not always being auto-created
es: Versión portátil: Se corrige el fallo por el que el directorio de caché no siempre se creaba automáticamente
pt_br: Versão portátil: Corrige o diretório de cache nem sempre sendo criado automaticamente
uk: Портативна збірка: виправлено помилку із автоматичним створенням каталогу кешування.

source: Workaround for Qt 5.10 on Linux resetting the global font, preventing custom interface font settings from working
es: Solución temporal para Qt 5.10 en Linux, que restablece el tipo de letra global y evita que funcionen los tipos de letra de interfaz personalizados
pt_br: Solução alternativa para o Qt 5.10 no Linux redefinindo a fonte global, impedindo que as configurações de fonte da interface personalizada funcionem
uk: Реалізовано обхід помилки у Qt 5.10 на Linux, яка призводить до відновлення загальновстановленого шрифту і заважає роботі нетипових параметрів шрифту.

source: 09 Feb, 2018
pt_br: 09 de Fevereiro de 2018
uk: 9 лютого 2018 року

source: Allow splitting the book list, by right clicking on the column headers and choosing 'Split the book list'
es: Se permite dividir la lista de libros pulsando con el botón derecho en los encabezados de columna y seleccionando «Dividir la lista de libros»
pt_br: Permite a divisão da lista de livros, ao clicar com o botão direito nos cabeçalhos de colunas e escolhendo 'Dividir a lista de livros'
uk: Уможливлено поділ списку книг: достатньо клацнути правою кнопкою миші на заголовках стовпчиків і вибрати пункт «Поділити список книг»

source: This is useful to 'lock' one or more columns in place so that they are always visible even when scrolling through other columns. Also, the split list has a separate right click menu which you can configure via Preferences-&gt;Toolbars and menus
es: Esto es útil para «bloquear» una o varias columnas y que estén siempre visibles, incluso cuando desplace la vista otras columnas. Además, la lista dividida tiene un menú contextual diferente que puede configurarse en Preferencias &gt; Barras de herramientas y menús
pt_br: Isto é útil para 'travar' uma ou mais colunas no lugar, de tal forma que elas fiquem sempre visíveis ao rolar através das outras colunas. Além disso, a lista dividida tem um menu de contexto separado, o qual pode ser configurado via Preferências-&gt;Barra de ferramentas & menus
uk: Ця можливість є корисною для «блокування» одного або декількох стовпчиків так, щоб вони завжди були видимі, навіть під час гортання іншими стовпчиками. Крім того, поділений список має власне контекстне меню, налаштувати яке можна за допомогою сторінки «Налаштування -&gt; Панелі інструментів» та меню

source: Store temporary files used by the editor and viewer in the cache directory to try to prevent errors caused by 'file cleaner' programs deleting temporary files still in use
es: Se guardan los archivos temporales usados por el editor y el visor en el directorio de caché, para intentar evitar errores ocasionados por programas «limpiadores de archivos» al borrar archivos temporales que aún están en uso
pt_br: Armazena arquivos temporários usados pelo editor e visualizador no diretório de cache, para tentar impedir erros causados por programas de 'limpeza de arquivos' deletando os arquivos temporários ainda em uso
uk: Реалізовано збереження тимчасових файлів, які використовуються редактором та переглядачем у каталогах для кешування з метою запобігти помилкам, спричиненим програмами з «чищення файлів» і пов'язаних із вилученням тимчасових файлів, які все ще використовуються іншими програмами

source: EPUB3 Input: Fix HTML covers and titlepages that are marked using the deprecated &lt;guide&gt; element not being recognized.
es: Entrada EPUB3: Se corrige el fallo por el que portadas y páginas de título HTML marcadas con el elemento anticuado &lt;guide&gt; no se reconocían.
pt_br: Entrada EPUB3: Corrige capas HTML e folhas de rosto que são marcadas usando o elemento obsoleto &lt;guide&gt; não sendo reconhecidas.
uk: Виведення до EPUB3: усунено помилки у розпізнаванні зображень обкладинок та титульних сторінок у HTML, якщо їх позначено застарілим елементом &lt;guide&gt;.

source: Bulk metadata edit: Fix regression in 3.13 that made it impossible to use the Force numbering checkbox for custom series
es: Edición de metadatos en masa: Se corrige una regresión en 3.13 que hacía imposible usar la casilla de forzar numeración para series personalizadas
pt_br: Edição de metadados em lote: Corrige uma regressão na versão 3.13 que tornou impossível utilizar a caixa de seleção para forçar numeração para séries personalizadas
uk: Пакетне редагування метаданих: виправлено регресію у версії 3.13, яка робила неможливим використання пункту «Примусова нумерація» для нетипових циклів

source: Conversion: Fix the valign attribute on &lt;td&gt; tags not being honored
es: Conversión: Se corrige el fallo por el que el atributo «valign» no tenía efecto en etiquetas &lt;td&gt;
pt_br: Conversão: Corrige o atributo 'valign' nos elementos &lt;td&gt; não sendo honrados
uk: Перетворення: виправлено неврахування атрибуту valign у теґах &lt;td&gt;

source: E-book viewer: Fix the 'Copy' keyboard shortcut/context menu action not working on some Windows systems
es: Visor de libros: Se corrige el fallo por el que el atajo de teclado y la acción de menú contextual «Copiar» no funcionaban en algunos sistemas Windows
pt_br: Visualizador de e-books: Corrige o atalho de teclado / ação do menu de contexto para 'copiar' não funcionando em alguns sistemas Windows
uk: Засіб перегляду електронних книг: усунено помилку, пов'язану із тим, що клавіатурне скорочення і пункт контекстного меню для дії «Копіювати» не працювали у деяких системах Windows

source: E-book viewer: Make the semi-transparent background for viewing metadata a little more opaque.
es: Visor de libros: Se hace el fondo semitransparente para ver los metadatos un poco más opaco.
pt_br: Visualizador de e-books: Torna o fundo semitransparente para visualização de metadados um pouco mais opaco.
uk: Засіб перегляду електронних книг: напівпрозоре тло для перегляду метаданих зроблено трохи непрозорішим.

source: 26 Jan, 2018
es: 26 ene, 2018
pt_br: 26 de Janeiro de 2018
uk: 26 січня 2018 року

source: Content server: Allow adding and deleting of books using the web interface
es: Servidor de contenidos: Se permite añadir y eliminar libros con la interfaz web
pt_br: Servidor de conteúdo: Permite adicionar e apagar livros usando a interface da web
uk: Сервер даних: дозволено додавання і вилучення книг за допомогою вебінтерфейсу

source: Use the + icon in the top bar of the book list to add new books and the trash icon in the top bar of the book details page to a delete a book. Note that only authenticated users are allowed to perform these actions, so you have to setup user accounts for the server to use these features.
es: Use el icono + en la barra superior de la lista de libros para añadir nuevos libros y el icono de papelera in la barra superior de la página de detalles del libro para eliminar un libro. Tenga en cuenta que sólo los usuarios autenticados pueden realizar estas acciones, así que tendrá que configurar cuentas de usuario en el servidor para usar estas funciones.
pt_br: Usa o ícone + na barra superior da lista de livros para adicionar novos livros, e o ícone de lixeira na barra superior página de detalhes do livro para apagar um livro. Note que apenas usuários autenticados podem realizar essas ações. Então é preciso configurar contas de usuário para o servidor para utilizar esses recursos.
uk: Скористайтеся піктограмою «+» на панелі над списком книг, щоб додати книги, і піктограмою смітника на сторінці подробиць щодо книги, щоб вилучити книгу. Зауважте, що виконувати ці дії можуть лише розпізнані користувачі. Отже, вам слід налаштувати облікові записи користувачів, щоб скористатися цими можливостями на сервері.

source: Allow removing the close button from tabs in the Virtual library tab bar. Right click the tab bar and choose 'Lock tabs' to do that.
es: Se permine eliminar el botón de cerrar de las pestañas de la barra de bibliotecas virtuales. Pulse con el botón derecho sobre la barra de pestañas y seleccione «Bloquear pestañas» para hacerlo.
pt_br: Permite remover o botão fechar das abas na barra de abas da Biblioteca Virtual. Clique com o botão direito na barra de abas e escolha 'Bloquear abas de biblioteca virtual' para fazer isso.
uk: Уможливлено вилучення кнопки закриття з вкладок на панелі вкладок віртуальної бібліотеки. Для вилучення кнопки клацніть правою кнопкою миші на панелі вкладок і виберіть у контекстному меню пункт «Заблокувати вкладки».

source: calibredb export: Add --progress option
es: calibredb export: Se añade la opción --progress
pt_br: calibredb export: Adiciona a opção --progress
uk: Експортування calibredb: додано параметр --progress

source: Bulk metadata editing: Show progress bars to track progress of the operation
es: Edición de metadatos en masa: Se muestran barras de progreso para seguir el transcurso de la operación
pt_br: Edição de metadados em lote: Mostra barra de progresso para acompanhar o progresso da operação
uk: Пакетне редагування метаданих: реалізовано показ панелей поступу для стеження за поступом виконання дії

source: Content server: When downloading books from the server send both the ASCII and full Unicode file names. Browsers that support RFC 6266 can make use of the unicode file name.
es: Servidor de contenidos: Al descargar libros del servidor se envían nombres de archivo ASCII y Unicode. Los navegadores que admiten RFC 6266 pueden hacer uso del nombre de archivo Unicode.
pt_br: Servidor de conteúdo: Ao baixar livros do servidor, enviar os nomes do arquivo tanto em ASCII como em Unicode completo. Navegadores que suportam a RFC 6266 podem fazer uso do nome unicode do arquivo.
uk: Сервер даних: під час отримання книг з сервера реалізовано надсилання назв файлів як у ASCII, так і повних назв Unicode. Програми для перегляду інтернету, у яких передбачено підтримку RFC 6266, зможуть використовувати назви файлів у Unicode.

source: Content server: Show a warning popup on Apple devices when the user tries to search with an expression containing smart quotes, since Apple devices now automatically replace quotes with smart quotes when typing.
es: Servidor de contenidos: Se muestra una advertencia emergente en dispositivos Apple cuando el usuario intenta buscar una expresión que contiene comillas tipográficas, ya que los dispositivos Apple sustituyen automáticamente las comillas por comillas tipográficas al escribir.
pt_br: Servidor de conteúdo: Mostra um pop-up de advertência em dispositivos Apple quando o usuário tenta pesquisar uma expressão contendo aspas curvas, uma vez que dispositivos Apple agora substituem automaticamente aspas verticais por aspas curvas ao digitar.
uk: Сервер даних: реалізовано показ попередження на пристроях Apple, якщо користувач намагається шукати на основі виразу із використанням кмітливих лапок, оскільки пристрої Apple тепер автоматично заміняють звичайні лапки на кмітливі під час введення тексту.

source: DOCX Output: Fix links without anchors in the input document not being converted correctly.
es: Salida DOCX: Se corrige el fallo por el que los enlaces sin puntos de anclaje en el documento de entrada no se convertían correctamente.
pt_br: Saída DOCX: Corrige links sem âncoras no documento de entrada não sendo convertidos corretamente.
uk: Виведення до DOCX: виправлено помилку, пов'язану із тим, що посилання без прив'язок у початковому документі перетворювалися неправильно.

source: calibredb: Fix a regression that broke reading of passwords from stdin
es: calibredb: Se corrige una regresión que estropeaba la lectura de contraseñas de stdin
pt_br: calibredb: Corrige uma regressão que danificou a leitura de senhas de stdin
uk: calibredb: усунено регресію, яка заважає читанню паролів з stdin

source: Edit book: Fix an error when saving files with filenames that cannot be encoded using the system codepage on Windows
es: Modificar libro: Se corrige une error al guardar archivos con nombre que no puede codificarse usando la página de códigos del sistema en Windows
pt_br: Editar livro: Corrige um erro ao salvar arquivos com nomes que não podem ser codificados usando a página de código do sistema no Windows
uk: Редагування книг: виправлено помилку, пов'язану із тим, що назви файлів не могло бути закодовано із використанням системної кодової таблиці у Windows

source: Pasting metadata: Fix excluding title and authors not working
es: Pegar metadatos: Se corrige el fallo por el que no funcionaba la exclusión de título y autores
pt_br: Colar metadados: Corrige exclusão de títulos e autores que não estavam funcionando
uk: Вставлення метаданих: виправлено помилку, пов'язану із тим, що виключення назв і записів авторів не працювало

source: 05 Jan, 2018
es: 05 ene, 2018
pt_br: 05 de Janeiro de 2018
uk: 5 січня 2018 року

source: Browser viewer: Allow customizing what information is displayed in the header and footer areas. Access Preferences from the viewer controls to change.
es: Visor del navegador: Se permite personalizar la información que se muestra en las zonas de encabezado y pie de página. Acceda a Preferencias desde los controles del visor para configurarlo.
pt_br: Visualizador do navegador: Permite personalizar qual informação é mostrada nas áreas de cabeçalho e rodapé. Acesse Preferências nos controles do visualizador para alterar.
uk: Панель навігації: уможливлено налаштовування даних, які буде показано у областях верхніх і нижніх колонтитулів. Доступ до налаштувань можна отримати за допомогою засобів керування панеллю.

source: Add support for MTP devices on FreeBSD
es: Se añade soporte para dispositivos MTP en FreeBSD
pt_br: Adiciona suporte para dispositivos MTP no FreeBSD
uk: Додано підтримку пристроїв MTP на FreeBSD

source: ToC editor: Add more case changing operations to the right click menu
es: Editor de índice: Se añaden más operaciones de cambio de mayúsculas y minúsculas en el menú contextual
pt_br: Editor de índice: Adiciona mais operações de alteração de maiúsculas/minúsculas ao menu de contexto
uk: Редактор таблиці змісту: до контекстного меню додано більше дій зі зміни регістру символів.
