Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Content server: Disable offline access if application cache is not available, rather than failing.
es: Servidor de contenidos: Se desactiva el acceso fuera de línea si la caché de aplicación no está disponible, en lugar generar un fallo.
pt_br: Servidor de conteúdo: Desabilita acesso offline se o cache de aplicativos não estiver disponível, em vez de falhar.
uk: Сервер даних: замість повідомлення про помилку, просто вимкнено доступ до автономних даних, якщо недоступний кеш даних програм.

source: DOCX Output: Workaround for broken CSS that uses -o-pre-wrap for the white-space property
es: Salida DOCX: Se evita un fallo para CSS incorrecto que usa -o-pre-wrap para la propiedad white-space
pt_br: Saída DOCX: Solução alternativa para CSS danificados que usam -o-pre-wrap para a propriedade white-space
uk: Виведення даних у DOCX: уможливлено обробку помилкових CSS, де використовується значення -o-pre-wrap для властивості white-space.

source: Metadata download: Remove the option to lookup first edition dates as the service used to get the data no longer exists
es: Descarga de metadatos: Se elimina la opción para buscar fechas de primera edición, pues el servicio que se usaba para obtener los datos ya no existe
pt_br: Download de metadados: Remove a opção de procurar por datas de primeira edição, uma vez que o serviço utilizado para conseguir os dados não mais existe
uk: Отримання метаданих: вилучено пункт пошуку даних першого видання, оскільки служби, з якої отримувалися ці дані, більше не існує.

source: 24 Aug, 2018
es: 24 ago, 2018
pt_br: 24 de Agosto de 2018
uk: 24 серпня 2018 року

source: ToC Editor: When generating ToCs using headings/XPath ignore duplicate entries at the same level that have the same text.
es: Editor de índice: Al generar índices usando encabezados o XPath se ignoran entradas duplicadas del mismo nivel que tienen el mismo texto.
pt_br: Editor de Índice: Ao gerar o Índice utilizando títulos/XPath, ignora entradas duplicadas no mesmo nível que tenham o mesmo texto.
uk: Редактор змісту: при створенні змісту на основі заголовків/XPath реалізовано ігнорування дублікатів записів на одному рівні із тим самим текстом.

source: Windows: The default calibre library location is now not in My Documents but instead in the user home folder, to avoid issues with OneDrive auto-syncing calibre libraries
es: Windows: La ubicación predeterminada de la biblioteca de calibre ya no es Mis Documentos sino la carpeta personal del usuario, para evitar problemas con la sincronización automática con OverDrive de las bibliotecas de calibre
pt_br: Windows: O local padrão para a biblioteca do calibre não é mais em "Meus Documentos", mas na pasta do usuário, para evitar problemas com o OneDrive sincronizando automaticamente as bibliotecas do calibre
uk: Windows: типовим місцем зберігання бібліотек calibre тепер є не «Мої документи», а домашня тека користувача. Таким чином, ми уникаємо проблем із автоматичною синхронізацією бібліотек calibre за допомогою OneDrive.

source: Kobo driver: Support for new firmware version
es: Controlador Kobo: Soporte para nueva versión de firmware
pt_br: Driver do Kobo: Suporte para a nova versão do firmware
uk: Драйвер Kobo: реалізовано підтримку нової версії мікропрограми

source: Add a tweak (in Preferences-&gt;Tweaks) to allow skipping network check on news download
es: Se añade un ajuste (en Preferencias &gt; Ajustes) para omitir la comprobación de red al descargar noticias
pt_br: Adicionada um ajuste (em Preferências-&gt;Ajustes) para permitir ignorar a verificação de conexão ao baixar notícias
uk: Додано коригування (ним можна скористатися за допомогою пункту «Налаштування -&gt; Коригування») для пропускання перевірки з'єднання із інтернетом при отриманні новин

source: Edit metadata dialog: Show a confirmation dialog on cancel if some changes have been made.
es: Diálogo de modificación de metadatos: Se muestra un diálogo de confirmación al cancelar si se ha hecho algún cambio.
pt_br: Caixa de diálogo de edição de metadados: Mostra uma confirmação ao cancelar se alguma alteração foi feita.
uk: Діалогове вікно редагування метаданих: реалізовано показ вікна підтвердження або скасовування, якщо було внесено якісь зміни.

source: Downloaded metadata review dialog: Fix a regression in the last release that broke the revert buttons
es: Diálogo de revisión de metadatos descargados: Se corrige una regresión en la última versión que estropeó los botones para revertir
pt_br: Caixa de diálogo de revisão para metadados baixados: Corrige uma regressão na última versão que danificou o botão de reversão
uk: Вікно перегляду отриманих метаданих: виправлено регресію, внесену у останньому випуску і пов'язану із неможливістю скористатися кнопками скасовування змін.

source: E-book viewer: Fix clicking links in the footnote popup ignoring the anchor part of the link.
es: Visor de libros: Se corrige el fallo por el que los enlaces en cuadro emergente de notas ignoraban la parte de anclaje del enlace.
pt_br: Visualizador de e-books: Corrige links no pop-up de notas de rodapé, ignorando a parte da âncora do link.
uk: Засіб перегляду електронних книг: виправлено непрацездатність посилань на контекстних панелях нотаток, пов'язану із ігноруванням прив'язки у посиланні.

source: ToC editor: Fix generating toc entries from links not working for links that start with #
es: Editor de índice: Se corrige el fallo por el que la generación de entradas a partir de enlaces no funcionaba para enlaces que empiezan por #
pt_br: Editor de Índice: Corrige a geração de entradas para o índice a partir de links que não funcionam, que começam com o caractere #
uk: Редактор змісту: виправлено створення записів змісту на основі посилань, якщо посилання починається з #.

source: HTML Input: Collapse multiple spaces in filenames when sanitizing them.
es: Entrada HTML: Se eliminan espacios múltiples en los nombres de archivo al sanearlos.
pt_br: Entrada HTML: Colapse espaços múltiplos nos nomes dos arquivos ao limpá-los.
uk: Вхідні дані HTML: реалізовано усування кратних пробілів у назвах файлів під час процедури усування помилок у книзі.

source: Edit book: Remove matching tag: Fix incorrect removal if the remove matching function is triggered in rapid succession
es: Modificar libro: Eliminar etiqueta correspondiente: Se corrige la eliminación incorrecta si la función se repite rápidamente
pt_br: Editar livro: Remover tag correspondente: Corrige remoção incorreta se a função de remover correspondente é acionada em rápida sucessão
uk: Засіб редагування книг: усування відповідного теґу: виправлено некоректне усування, якщо функцію вилучення відповідника викликають декілька разів послідовно протягом невеликого проміжку часу.

source: Edit book: Fix some links in the file being split not being adjusted when splitting HTML files.
es: Modificar libro: Se corrige el fallo por el que al dividir archivos HTML algunos enlaces no se modificaban.
pt_br: Editar livro: Corrige alguns links no arquivo a ser dividido não sendo ajustados ao dividir arquivos HTML.
uk: Засіб редагування книг: виправлено помилку, пов'язану із тим, що деякі посилання на файл, поділ якого здійснює програма, не коригувалися під час поділу файлів HTML.

source: Fix a crash when using some third party plugins and enabling the "two lines for text under icons" option
es: Se corrige el cierre del programa al usar algunos complementos de terceros y activar la opción «usar dos líneas para el texto bajo los iconos»
pt_br: Corrige uma falha ao usar alguns plugins de terceiros e habilitar a opção "use duas linhas para o texto sob os ícones"
uk: Усунено аварійне завершення роботи при використанні деяких сторонніх додатків та вмиканні режиму «два рядки для тексту під піктограмами»

source: Make the create catalog dialog freely resizable
es: Se permite cambiar el tamaño del diálogo de creación de catálogos
pt_br: Torna a caixa de diálogo de criação de catálogo livremente redimensionável
uk: Уможливлено довільну зміну розмірів діалогового вікна створення каталогу.

source: DOCX Input: Fix an error when converting some DOCX files with inherited fonts.
es: Entrada DOCX: Se corrige un fallo al convertir algunos archivos DOCX con tipos de letra heredados.
pt_br: Entrada DOCX: Corrige um erro ao converter alguns arquivos DOCX com fontes herdadas.
uk: Вхідні дані DOCX: виправлено помилку при перетворенні деяких файлів DOCX із успадкованими шрифтами.

source: 10 Aug, 2018
es: 10 ago, 2018
pt_br: 10 de Agosto de 2018
uk: 10 серпня 2018 року

source: Add a option to draw a grid in the main book list (Preferences-&gt;Look &amp; feel)
es: Se añade una opción para dibujar una rejilla en la lista de libros principal (Preferencias &gt; Apariencia)
pt_br: Adicionada uma opção para desenhar uma grade na lista principal de livros (Preferências-&gt;Aparência)
uk: Додано пункт для малювання ґратки у основному списку книг (Налаштування -&gt Вигляд і поведінка)

source: Edit book: Allow removing the currently highlighted tag (while keeping its contents) by pressing Ctrl+&gt;. You can also add a tool to do it via Preferences-&gt;Toolbars
es: Modificar libro: Se permite eliminar la etiqueta actualmente resaltada (manteniendo su contenido) pulsando Ctrl+&gt;. También puede añadir una herramienta para hacerlo en Preferencias &gt; Barras de herramientas
pt_br: Editar livro: Permite remover a tag selecionada (mantendo seu conteúdo) ao pressionar Ctrl+&gt;. Você também pode adicionar uma ferramenta para fazê-lo via Opções-&gt;Barra de Ferramentas
uk: Редагування книг: уможливлено вилучення поточної позначеної мітки (зі збереженням її вмісту) натисканням комбінації клавіш Ctrl+&gt;. Ви можете додати відповідну кнопку на панель інструментів за допомогою пункту меню «Налаштування -&gt; Панелі інструментів».

source: Content server: When defining a color scheme for the in browser viewer allow specifying the link color as well as the foreground and background.
es: Servidor de contenidos: Al definir un esquema de colores para el visor del navegador se permite especificar el color de los enlaces, así como el primer plano y el fondo.
pt_br: Servidor de conteúdo: Ao definir um esquema de cor para o visualizador do navegador, permite especificar a cor dos links, bem como a cor primária e a de fundo.
uk: Сервер даних: уможливлено визначення кольору посилань, а також кольорів тексту і тла під час визначення схеми кольорів для перегляду вмісту панелі навігації.

source: Edit book: Show a popup after a fix all HTML/Beautify all files so the user can easily see what was changed, if needed.
pt_br: Editar livro: Mostra um pop-up após corrigir/embelezar todos o arquivos HTML, de forma que o usuário pode facilmente ver o que foi alterado, se necessário.
uk: Редагування книг: реалізовано показ контекстної підказки після виконання покращення HTML для усіх файлів книги. Тепер користувачеві буде простіше ознайомитися із результатами.

source: Kindle driver: Create cover thumbnails on the device when transferring KFX format books
es: Controlador Kindle: Se crean miniaturas de portada en el dispositivo al transferir libros en formato KFX
pt_br: Driver do Kindle: Cria miniaturas da capa no dispositivo ao transferir livros no formato KFX
uk: Драйвер Kindle: реалізовано створення мініатюр обкладинок на пристрої під час перенесення книг у форматі KFX.

source: Edit Book: Recognize numbers in image names in the 'Insert image' dialog
es: Modificar libro: Se reconocen números en los nombres de imagen el diálogo de insertar imagen.
pt_br: Editar livro: Reconhece números nos nomes de imagens na caixa de diálogo "Inserir imagem"
uk: Редагування книг: реалізовано розпізнавання чисел у назвах зображень у вікні «Вставити зображення».

source: Content server: Display custom comments field on the book details page in the same order as in the calibre GUI
es: Servidor de contenidos: Se muestra el campo personalizado de comentarios en la página de detalles del libro en el mismo orden que en la interfaz gráfica de calibre
pt_br: Servidor de conteúdo: Exibe campos personalizados de comentários na página de detalhes do livro na mesma ordem da interface gráfica do calibre
uk: Сервер даних: реалізовано показ поля нетипових коментарів на сторінці подробиць щодо книги у тому самому порядку, що і у графічному інтерфейсі calibre.

source: Edit book: Fix open image editors not being updated when image file is replaced
es: Modificar libro: Se corrige el fallo por el que los editores de imagen abiertos no se actualizaban cuando se sustituye un archivo de imagen
pt_br: Editar livro: Corrige editores de imagem que não estavam sendo atualizados ao substituir o arquivo de imagem
uk: Редагування книг: виправлено помилку, пов'язану із тим, що у відкритих вікнах редагування зображень не оновлювався вміст після заміни зображення.

source: Fix keyboard shortcuts for Edit book tools created from plugins not working
es: Se corrige el fallo por el que no funcionaban los atajos de teclado para las herramientas de modificar libro creados desde complementos
pt_br: Corrige atalhos de teclado para ferramentas de edição de livros criados por plugins que não funcionavam
uk: Виправлено помилку, пов'язану із тим, що не працювали комбінації клавіш засобів редагування книг, створених за допомогою додатків.

source: PDF Output: Fix error when trying to convert books that do not specify a language in their metadata.
es: Salida PDF: Se corrige un fallo al intentar convertir libros que no tienen especificado un idioma en los metadatos.
pt_br: Saída PDF: Corrige erro ao tentar converter livros que não especificam um idioma nos seus metadados.
uk: Виведення даних до PDF: виправлено помилку під час перетворення книг, у метаданих яких не вказано явним чином мову.

source: Browser viewer: Fix inability to open books that contain zero-byte stylesheets/images
es: Visor de navegador: Se corrige la imposibilidad de abrir libros que contienen imágenes u hojas de estilo de tamaño cero
pt_br: Visualizador do navegador: Corrige incapacidade de abrir livros que contêm folhas de estilo ou imagens com zero bytes
uk: Панель навігації: виправлено неможливість відкриття книг, які містять таблиці стилів і зображення нульового розміру у байтах.

source: 20 Jul, 2018
pt_br: 20 de Julho de 2018
uk: 20 липня 2018 року

source: Allow creating rules to transform author names when adding books to calibre. Accessible via Preferences-&gt;Adding books-&gt;Adding actions
es: Se permite crear reglas para transformar nombres de autor al añadir libros a calibre. Accesible mediante Preferencias &gt; Añadir libros &gt; Acciones de adición
pt_br: Permite criar regras para transformar o nome dos autores ao adicionar livros ao calibre. Acessível via Preferências-&gt;Adicionando livros-&gt;Ações de adição
uk: Уможливлено створення правил для перетворення імен авторів при додаванні книг до calibre. Доступ до засобу створення правил можна отримати за допомогою пункту «Налаштування -&gt; Додавання книг -&gt; Додавання дій».

source: Add a similar author mapper tool to manipulate author names in the existing library. Accessible via Preferences-&gt;Toolbars
es: Se añade una herramienta de correspondencia de autores parecida para manipular nombrs de autor en la biblioteca existe. Accesible mediante Preferencias &gt; Barras de herramientas
pt_br: Adiciona uma ferramenta de mapeamento de autor similar para manipular nomes de autores na biblioteca existente. Acessível via Preferências-&gt;Barra de Ferramentas
uk: Додано засіб прив'язки подібних авторів для керування іменами авторів у наявній бібліотеці. Доступ до засобу можна отримати за допомогою пункту «Налаштування -&gt; Панелі інструментів».

source: Add a similar author mapper tool for metadata downloading, accessible via Preferences-&gt;Metadata download
es: Se añade una herramienta de correspondencia de autores parecida para descarga de metadatos, accesible mediante Preferencias &gt; Descarga de metadatos
pt_br: Adiciona uma ferramenta de mapeamento de autor similar para o download de metadados, acessível via Preferências-&gt;Download de metadados
uk: Додано засіб прив'язки подібних авторів для отримання метаданих. Доступ до нього можна отримати за допомогою пункту «Налаштування -&gt; Отримання метаданих»,

source: Comments Editor: Add options to change the case of the selected text to the right click menu
es: Editor de comentarios: Se añaden opciones para cambiar las mayúsculas y minúsculas del texto seleccionado en el menú del botón derecho
pt_br: Editor de comentários: Adiciona opções para alterar o texto selecionado para maiúsculas/minúsculas no menu de contexto
uk: Редактор коментарів: до контекстного меню (можна викликати клацанням правою кнопкою миші) додано пункти для внесення змін до регістру символів позначено тексту

source: Edit book: When sorting non text files in the File list recognize numbers in the file names
es: Modificar libro: Al ordenar archivos que no son de texto en la lista de archivos, se reconocen los números en los nombres de archivo.
pt_br: Editar livro: Ao organizar arquivos que não sejam de texto na lista de arquivos, reconhece números no nome dos arquivos
uk: Засіб редагування книг: реалізовано розпізнавання чисел у назвах файлів при упорядковуванні нетекстових файлів у списку файлів

source: calibredb catalog: Recognize file extensions even when they are not lowercase
es: calibredb catalog: Se reconocen las extensiones de archivo incluso si no están en minúscula
pt_br: Catálogo calibredb: Reconhece extensões de arquivo mesmo quando eles não estão em minúsculo
uk: Каталог calibredb: реалізовано розпізнавання суфіксів назв файлів, навіть якщо їх вказано не малими літерами

source: 06 Jul, 2018
pt_br: 06 de Julho de 2018
uk: 6 липня 2018 року

source: Content server: Allow conversion of books
es: Servidor de contenidos: Se permite la conversión de libros
pt_br: Servidor de conteúdo: Permite conversão de livros
uk: Сервер даних: уможливлено перетворення книг

source: Click the convert icon in the top bar of the book details page to convert a book. Note that conversion only works for logged in users who have permission to make changes to the calibre library.
es: Pulse en el icono de conversión en la barra superior de la página de detalles del libro para convertir un libro. Tenga en cuenta que la conversión sólo funciona para los usuarios identificados que tengan permiso para hacer cambios en la biblioteca de calibre.
pt_br: Clique no ícone de conversão na barra superior da página de detalhes do livro para converter um livro. Note que esta conversão só funciona para usuários logados que tenham permissão para fazer alterações na biblioteca do calibre.
uk: Натисніть піктограму перетворення на верхній панелі сторінки подробиць щодо книги, щоб перетворити книгу до іншого формату. Зауважте, що перетворення працює лише для користувачів, які увійшли до сервера і мають право вносити зміни до бібліотеки calibre.

source: Bulk metadata edit dialog: Add an "edit tags" button for tags like custom columns.
es: Diálogo de modificación de metadatos en masa: Se añade un botón «modificar etiquetas» para etiquetas como columnas personalizadas.
pt_br: Caixa de diálogo de edição de metadados em massa: Adiciona um botão "editar etiquetas" para etiquetas como colunas personalizadas.
uk: Діалогове вікно пакетного редагування метаданих: додано кнопку редагування міток для міток, подібних до нетипових стовпчиків.

source: Add an option in Preferences-&gt;Look &amp; feel to disable the new 'drag and drop to merge books feature'
es: Se añade una opción en Preferencias &gt; Apariencia para desactivar la nueva opción de arrastrar y soltar para unir libros
pt_br: Adiciona uma opção em Preferências-&gt;Aparência para desabilitar a nova função "arrastar e soltar juntar livros"
uk: На сторінці «Налаштування -&gt; Вигляд та поведінка» додано пункт для вимикання нової можливості «об'єднання книг за допомогою перетягування зі скиданням»

source: E-book viewer: Add a shortcut (Ctrl+Alt+B) to toggle the bookmarks panel.
es: Visor de libros: Se añade un atajo (Ctrl+Alt+B) para conmutar el panel de marcadores
pt_br: Visualizador de e-book: Adiciona um atalho (Ctrl+Alt+B) para ativar o painel de marcadores.
uk: Засіб перегляду електронних книг: додано клавіатурне скорочення (Ctrl+Alt+B) для вмикання або вимикання панелі закладок.

source: Edit book: Add a copy to clipboard button on the various report dialogs
es: Modificar libro: Se añade un botón para copiar al portapapeles en los distintos diálogos de informes
pt_br: Editar livro: Adiciona um botão para copiar para a área de transferência nas várias caixas de diálogo de relatórios
uk: Засіб редагування книг: до різноманітних вікон звітування додано кнопку копіювання до буфера даних

source: Edit book: Add a shortcut (Ctrl+Alt+Down) to edit the next file in the book spine.
es: Modificar libro: Se añade un atajo (Ctrl+Alt+Abajo) para editar el siguiente archivo en el lomo del libro.
pt_br: Editar livro: Adiciona um atalho (Ctrl+Alt+Down) para editar o próximo arquivo na lombada.
uk: Засіб редагування книг: додано клавіатурне скорочення (Ctrl+Alt+стрілка вниз) для редагування наступного файла у вмісті книги.

source: calibre-smtp: Verify relay server TLS certificates by default. New option --dont-verify-server-certificate to restore old behavior.
es: calibre-smtp: Se comprueban los certificados TLS de los servidores intermedios de manera predeterminada. La nueva opción --dont-verify-server-certificate restaura el comportamiento anterior.
pt_br: calibre-smtp: Verifica os certificados TLS nos servidores de retransmissão por padrão. Nova opção --dont-verify-server-certificate para restaurar o comportamento anterior.
uk: calibre-smtp: реалізовано типову перевірку сертифікатів TLS трансляційного сервера. Додано новий параметр --dont-verify-server-certificate для вимикання цієї перевірки.

source: Version 3.27.1 fixes a build error in 3.27.0 that caused calibre not to start on macOS older than High Sierra
es: La versión 3.27.1 corrige un error en 3.27.0 que hacía que calibre no se iniciara en macOS anterior a High Sierra
pt_br: Versão 3.27.1 corrige um erro de compilação na versão 3.27.0 que fazia com que o calibre não iniciasse em versões do macOS anteriores à High Sierra
uk: У версії 3.27.1 виправлено помилку збирання 3.27.0, яка спричиняла неможливість зібрати calibre на версіях macOS, старіших за High Sierra

source: Conversion: Fix a regression in the previous release that caused conversion of EPUB 3 to EPUB 3 to fail.
es: Conversión: Se corrige una regresión en la versión anterior que hacía que la conversión de EPUB 3 a EPUB 3 fallara.
pt_br: Conversão: Corrige uma regressão na versão anterior que causava uma falha na conversão de EPUB 3 para EPUB 3.
uk: Перетворення: виправлено регресію у попередньому випуску, яка заважала перетворенню з EPUB 3 до EPUB 3.

source: Fix detection of the Bookeen NolimbookXL on macOS and Linux
es: Se corrige la detección del Bookeen NolimbookXL en macOS y Linux
pt_br: Corrige detecção do Bookeen NolimbookXL no macOS e Linux
uk: Виправлено виявлення Bookeen NolimbookXL у macOS і Linux

source: Fix a regression that broke the fetching of annotations from Kobo and Kindle devices.
es: Se corrige una regresión que a estropeó la obtención de anotaciones de dispositivos Kobo y Kindle.
pt_br: Corrige uma regressão que danificou a função de buscar anotações dos dispositivos Kobo e Kindle.
uk: Виправлено регресію, яка заважала отриманню анотацій з пристроїв Kobo і Kindle.
