Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: It has been nearly a year since calibre 0.6.0 was released and calibre has come a long way since then. calibre has always been amazingly flexible. 0.6 was all about bringing that flexibility to the conversion engine and device support. Today calibre supports conversion from/to dozens of formats and can connect to scores of devices. The focus of 0.7 is bringing that same flexibility to the calibre User interface.
fr: Il y a bientôt un an que calibre 0.6.0 a été publié et il a fait un long chemin depuis. calibre a toujours été incroyablement flexible. 0.6 apportait cette flexibilité au moteur de conversion et à la prise en charge de périphérique. Aujourd'hui calibre prend en charge la conversion de/et vers des douzaines de formats et peut se connecter à des périphériques qui comptent. L'attention de la version 0.7 est d'apporter la même flexibilité à l'Interface Utilisateur de calibre.
pt_br: Faz quase um ano desde o lançamento da versão 0.6.0 e o calibre mudou bastante nesse período. O calibre sempre foi extremamente flexível. A versão 0.6 focou em trazer essa flexibilidade para o mecanismo de conversão e suporte a dispositivos. Hoje o calibre consegue converter de/para dúzias de formatos e pode se conectar a vários dispositivos. O foco da versão 0.7 é trazer essa mesma flexibilidade para a Interface do Usuário do calibre.
uk: З часу випуску calibre 0.6.0 минув приблизно рік, а calibre з того часу вдалося пройти доволі великий шлях. calibre завжди була надзвичайно гнучкою. Випуск 0.6 було присвячено поширенню цієї гнучкості на рушій перетворення та підтримку пристроїв. У новому випуску calibre передбачено підтримку перетворення даних з десятків форматів на дані у десятках форматі та можливість встановлення з'єднання зі безліччю пристроїв. Акцент у 0.7 зроблено на підтримання такої самої гнучкості у інтерфейсі користувача calibre.

source: To that end, users now have the ability to freely resize all the major User interface elements, add their own custom metadata to the book list, and add their own categories to the Tag browser.
fr: A cette fin, les utilisateurs ont maintenant la capacité de redimensionner librement tous les éléments importants de l'Interface Utilisateur, d'ajouter leurs propres métadonnées personnalisées à la liste de livres et d'ajouter leurs propres catégories au Navigateur d'étiquettes
pt_br: Com este fim, usuários agora podem livremente redimensionar a maior parte dos elementos da interface do usuário, adicionar seus próprios metadados personalizados à lista de livros, e adicionar suas próprias categorias ao Navegador de Etiquetas.
uk: У новій версії користувачі зможуть довільним чином змінювати розмір усіх елементів інтерфейсу користувача, додавати власні нетипові метадані до списку книг та додавати власні категорії на панель навігації мітками.

source: Another major area of improvement is performance. Various parts of calibre have seen optimization and caching improvements. Startup times and large library performance have been dramatically improved. With a library of ten thousand books, you will see an improvement of between 10 and a 100 times in the speed of startup and common operations like editing metadata.
fr: Un autre domaine majeur d'améliorations est la performance. Différentes parties de calibre ont vu une optimisation et une mise en cache améliorée. Les temps de démarrage et les performances sur de grandes bibliothèques ont été considérablement augmntées. Avec une bibliothèque de dix mille livres, vous verrez une amélioration de la vitesse de démarrage entre 10 et 100 et des opérations habituelles comme l'édition de métadonnées.
pt_br: Outra área com grande melhoria foi a performance. Várias partes do calibre passaram por otimização e melhorias no cache. Tempos de inicialização e performance de grandes bibliotecas foram dramaticamente melhorados. Com uma biblioteca de dezenas de milhares de livros, você verá uma melhoria de 10 a 100 vezes na velocidade de inicialização e operações comuns como edição de metadados.
uk: Ще однією областю поліпшення є швидкодія. Оптимізації та поліпшень у кешуванні зазнали різні компоненти calibre. Значно зменшено час запуску та поліпшено швидкодію із великими бібліотеками. Якщо у вашій бібліотеці десять тисяч книг, ви станете свідком підвищення швидкості запуску та виконання типових дій, зокрема редагування метаданих, від 10 до 100 разів.

source: When connecting to devices, calibre now caches the metadata it reads from the files on the device. This means that on subsequent connects calibre will build the list of books on the device very fast. If you like to keep large collections of books on your device, you will find this feature a godsend.
fr: Lors de la connexion aux périphériques, calibre met maintenant en cache les métadonnées qu'il lit depuis les fichiers sur le périphérique. Cela signifie que sur une connexion ultérieure calibre construira très rapidement la liste de livres sur le périphérique, vous découvrirez cette fonctionnalité comme un cadeau du ciel.
pt_br: Ao conectar a dispositivos, o calibre agora armazena em cache os metadados lidos dos arquivos no dispositivo. Isto significa que em conexões subsequente o calibre irá criar a lista de livros rapidamente. Se você gosta de manter grandes coleções no seu dispositivo, você irá achar essa funcionalidade o máximo.
uk: При з'єднанні із пристроями нова версія calibre кешує метадані, які прочитано з файлів на пристрої. Це означає, що під час наступних з'єднань у calibre побудує список книг на пристрої дуже швидко. Якщо вам подобається зберігати дуже великі збірки книг на вашому пристрої, ця можливість значно спростить ваше життя.

source: The 0.7 User interface
es: Interfaz de usuario 0.7
fr: L'interface utilisateur de la version 0.7
pt_br: A interface do usuário na versão 0.7
uk: Інтерфейс користувача версії 0.7

source: Some of these improvements are described in more detail below.
es: Algunas de estas mejoras se describen más adelante con más detalle.
fr: Certaines de ces améliorations sont décrites plus en détail ci-dessous.
pt_br: Algumas destas melhorias são descritas abaixo em mais detalhes.
uk: Деякі з цих поліпшень докладніше описано нижче.

source: User interface improvements
es: Mejoras de la interfaz de usuario
fr: Améliorations de l'interface utilisateur
pt_br: Melhorias na interface do usuário
uk: Поліпшення у інтерфейсі користувача

source: The best way to see the user interface improvement is watch the video linked to above. For those of you that cannot, here's a short description.
fr: La meilleure manière de voir les améliorations de l'interface utilisateur est de regarder la vidéo liée ci-dessous. Pour ceux d'entre vous qui ne le peuvent, voici une courte description.
pt_br: A melhor maneira de ver a melhoria da interface do usuário é assistir o vídeo do link acima. Para aqueles de vocês que não podem, eis aqui uma breve descrição.
uk: Найкращим способом ознайомитися із поліпшеннями у інтерфейсі користувача є перегляд відео за наведеним вище посиланням. Для тих, хто не може переглянути відео, нижче наведено короткий опис.

source: You can now add your own columns to the book list, via Preferences-&gt;Interface (the plus button). You can add your own ratings, yes/no, tags, date, etc. columns and have them appear in the booklist. The contents of these columns can be edited just like a builtin column, by either double clicking on individual entries or using the Edit meta information button.
fr: Vous pouvez maintenant ajouter vos propres colonnes à la liste de livres via Préférences-&gt;Interface. Vous pouvez ajouter vos propres colonnes notations, oui/non, étiquettes, date, etc. et les voir apparaître dans la liste de livres. Le contenu de ces colonnes peut être édité comme les colonnes intégrées, en faisant un double clic sur une entrée individuelle ou en utilisant le bouton Éditer les métadonnées.
pt_br: Você pode agora adicionar suas próprias colunas para a lista de livros, via Preferências-&gt;Interface (o botão de mais). Você pode adicionar colunas com suas próprias avaliações, sim/não, etiquetas, data, etc e colocá-las na lista de livros. O conteúdo destas colunas pode ser editado como uma coluna normal, seja com um clique duplo em entradas individuais ou usando o botão de Edição de informação de metadados.
uk: У новій версії ви можете додавати власні стовпчики до списку книг за допомогою сторінки «Налаштування -&gt; Інтерфейс» (натисніть кнопку з плюсом). Ви можете додавати власні стовпчики оцінки, записів «так/ні», міток, дат тощо, так, щоб вони з'являлися у списку книг. Вміст цих стовпчиків можна редагувати так само, як вміст вбудованих стовпчиків: достатньо або двічі клацнути лівою кнопкою на позиції у таблиці або скористатися кнопкою редагування метаданих.

source: You can freely resize the Tag browser and Book details pane and easily show/hide columns by right clicking on their headers. You can also re-arrange columns by dragging their headers.
fr: Vous pouvez librement redimensionner le Navigateur d'étiquettes et le panneau Détails du livre et facilemment afficher/masquer des colonnes en faisant un clic droit sur leur en-tête. Vous pouvez aussi ré-arranger les colonnes en les glissant par leurs en-têtes.
pt_br: Você pode redimensionar o Navegador de Etiquetas e Painel de detalhe de livros e mostrar/ocultar colunas clicando com o botão direito nos seus cabeçalhos. Você também pode rearranjar as colunas arrastando seus cabeçalhos.
uk: Ви можете довільним чином змінювати розміри панелі навігації мітками та подробиць щодо книги і просто приховувати стовпчики або наказувати програмі їх показувати за допомогою меню, яке викликається клацанням правою кнопкою на їхніх заголовках. Ви також можете перевпорядковувати стовпчики перетягуванням їхніх заголовків.

source: You can show/hide categories in the Tag browser by right clicking on them and add your own categories for quick access, by clicking the Manage user categories button. You can also edit entries in the Tag browser by right clicking on them. This will change their value for all book. For example, if you change the name of an author, this change will appear in the metadata of all the books by that author.
fr: Vous pouvez afficher/masquer des catégories dans le Navigateur d'étiquettes en faisant un clic droit dessus et ajouter vos propres catégories pour un accès rapide, en cliquant le bouton Gérer les catégories utilisateur. Vous pouvez également éditer les entrées dans le Navigateur d'étiquettes en faisant un clic droit sur celles-ci. Cela changera leur valeur pour tous les livres. Par exemple, si vous changez le nom d'un auteur, ce changement apparaîtra dans les métadonnées de tous les livres de cet auteur.

source: You can Save you frequently used searches and bring them up with a single click in the Tag browser. You can also use the saved searches to restrict what is shown in calibre. This will restrict the book list as well as the Tag browser. In effect, you have temporarily reduced you calibre collection to only the books matching the search.
fr: Vous pouvez Sauvegarder vos recherches fréquemment utilisées et les faire remonter d'un simple clic dans le Navigateur d'Étiquettes. Vous pouvez également utiliser les recherches sauvegardées pour restreindre ce qui est affiché dans calibre. Ceci restreindra la liste de livres aussi bien que le Navigateur d'étiquettes. En fait, vous avez temporairement réduit votre collection calibre aux seuls livres correspondants à la recherche.

source: You can now merge book records and have calibre automatically merge the metadata and formats into a single entry for you. Accessed via the arrow next to the edit meta information button.
fr: Vous pouvez maintenant fusionner des enregistrements de livre et que calibre fusionne automatiquement les métadonnées et les formats en une seule entrée. Accessible via la flèche qui suit le bouton d'édition des métadonnées.
pt_br: Você pode agora mesclar os registros de livros e pedir ao calibre para automaticamente mesclar os metadados e formatos em uma entrada única para você. Acessível através da seta próxima ao botão de editar metadados.
uk: У новій версії ви можете об'єднати записи книг так, щоб calibre автоматично об'єднала метадані та формати у єдиний запис. Доступ до такого об'єднання можна отримати за допомогою кнопки зі стрілочкою, розташованої поруч і з кнопкою редагування метаданих.

source: You can now use regular expression when searching and also relational operators like <code>date:&gt;yesterday</code>.
fr: Vous pouvez maintenant utiliser une expression régulière lors de vos recherches et aussi des opérateurs relationnels comme <code>date:&gt;hier</code>.
pt_br: Você agora pode usar expressões regulares ao pesquisar e também operadores relacionais como <code>data:&gt;yesterday</code>.
uk: Тепер можна користуватися формальними виразами для пошуку, а також використовувати оператори порівняння. Приклад: <code>date:&gt;yesterday</code>.

source: calibre can now optionally download tags/reviews/rating from amazon.com
es: calibre ahora puede, de forma opcional, descargar etiquetas, reseñas y calificaciones de amazon.com
fr: calibre peut maintenant télécharger optionnellement des étiquettes/résumés/notations depuis amazon.com
pt_br: O calibre pode agora opcionalmente baixar etiquetas/resenhas/avaliações da amazon.com
uk: Нова версія calibre, якщо ви цього захочете, може отримувати мітки, рецензії та оцінки з amazon.com

source: Device driver improvements
es: Mejora de controladores de dispositivos
fr: Améliorations du pilote système
pt_br: Melhorias no driver de dispositivo
uk: Поліпшення у драйверах пристроів

source: calibre now shows a <code>"On Device"</code> column in the main Library view when you connect a supported device. This column can be used to see at a glance what books in your library are also on the device. There is a complementary <code>"In Library"</code> column in the device views that shows what books on the device are in your library. Since you can sort and search on these columns, it becomes very easy to quickly see what books are on the device. For example, the search <code>"not ondevice:main and not ondevice:card"</code> will show you all the books in your library that are not on the device. This feature works best with books you send to the device from calibre 0.7 onwards.
fr: calibre montre maintenant une colonne <code>"Sur le périphérique"</code> dans la vue Bibliothèque principale quand vous connectez un périphérique supporté. Cette colonne peut être utilisée pour voir du premier coup quels livres dans votre bibliothèque sont également dans votre périphérique. C'est une complémentarité à la colonne <code>"Dans la bibliothèque"</code> dans la vue périphérique qui montre quels livres sur le périphérique sont dans votre bibliothèque. Depuis que vous pouvez chercher et trier sur ces colonnes, il est devenu très facile de rapidement voir quels livres sont sur le périphérique. Par exemple, la recherche <code>"not ondevice:main and not ondevice:card"</code> vous affichera tous les livres dans votre bibliothèque qui ne sont pas sur votre périphérique. Cette fonctionnalité fonctionne mieux avec des livres envoyés à votre périphérique à partir de calibre 0.7 ou supérieur.
pt_br: O calibre agora mostra uma coluna <code>"No Dispositivo"</code> na tela principal da biblioteca quando conecta um dispositivo suportado. Esta coluna pode ser usada para ver quais livros na sua biblioteca também estão no dispositivo. Existe uma coluna complementar <code>"Na Biblioteca"</code> nas visualizações de dispositivos que mostram quais livros do dispositivo estão na sua biblioteca. Uma vez que você pode organizar e buscar nestas colunas, se torna muito fácil ver quais livros estão no dispositivo. Por exemplo, a busca <code>"not ondevice:main and not ondevice:card"</code> mostrará todos os livros da sua biblioteca que não estão no dispositivo. Isto funciona melhor com livros enviados para o dispositivo com o calibre 0.7 em diante.
uk: У новій версії calibre на основній панелі перегляду бібліотеки буде показано стовпчик <code>«На пристрої»</code>, якщо ви з'єднаєте із комп'ютером підтримуваний пристрій. Цим стовпчиком можна скористатися для пришвидшення визначення книг з вашої бібліотеки, які також зберігаються на пристрої. Доповнює цю можливість стовпчик <code>«У бібліотеці»</code>, який буде показано на панелі перегляду вмісту пристрою. Він вказуватиме на ті книги на вашому пристрої, які також є у вашій бібліотеці. Оскільки можна упорядковувати і шукати записи за цими стовпчиками, можна дуже швидко визначити ті з книг, які є на певному пристрої. Наприклад, за критерієм пошуку <code>"not ondevice:main and not ondevice:card"</code> буде знайдено усі книги у вашій бібліотеці, яких немає на пристрої. Ця можливість найкраще працює з книгами, які ви надсилатимете на пристрій за допомогою calibre 0.7 і наступних версій.

source: calibre caches the metadata of all books on the device. This means that when you re-connect the device creating the list of books on the device will be very fast. Especially if you have a number of large ODF files on your device, this will make a huge difference in the time that calibre takes to connect to the device and display the list of books.
fr: calibre met en cache les métadonnées de tous les livres sur le périphérique. Cela signifie que quand vous reconnecté le périphérique la création de la liste de livres sur celui-ci est très rapide. Spécialement si vous avez un certain nombre de grands fichiers ODF sur votre périphérique, ceci fera une énorme différence du temps que calibre prendra pour se connecter au périphérique et afficher la liste de livres.
pt_br: O calibre armazena em cache os metadados de todos os livros no dispositivo. Isto significa que quando você reconecta o dispositivo, a criação da lista de livros do dispositivo será bem rápida. Especialmente se você tem um número muito grande de arquivos PDF no seu dispositivo, isto irá fazer uma grande diferença no tempo que o calibre leva para conectar com o dispositivo e mostrar a lista de livros.
uk: calibre кешує метадані усіх книг на пристрої. Це означає, що коли ви повторно з'єднаєте пристрій, створення списку книг на пристрої буде дуже швидким. Різниця буде особливо помітною, якщо на пристрої багато великих файлів ODF, — calibre набагато швидше встановить з'єднання із пристроєм і покаже список книг.

source: Users can now specify the folder structure and file name of files placed on the device when using the Send to Device action. This is useful for those devices that allow browsing of the on device folder structure. Customization is available via Preferences-&gt;Add/Save-&gt;Sending to device and can also be overridden on a per device basis from Preferences-&gt;Plugins-&gt;Device Interface plugins.
fr: Les utilisateurs peuvent maintenant spécifier la structure de répertoire et le nom de fichier des fichiers placés sur le périphérique lors de l'utilisation de l'action Envoyé au périphérique. Ceci est utile pour ces périphériques qui permettent de parcourir leur structure de répertoire. La personnalisation est disponible via Préférences-&gt;Ajouter/Sauvegarder-&gt;Envoyer au périphérique et peut également être supplanté sur base du périphérique dans Préférences-&gt;Extensions-&gt;Extensions d'interface de périphérique.
pt_br: Os usuários agora podem especificar a estrutura de pastas nomes dos arquivos colocados no dispositivo usando a ação Enviar para Dispositivo. Isto é útil para aqueles dispositivos que permitem navegar nas pastas do dispositivo. Personalização está disponível via Preferências-&gt;Adicionar/Salvar-&gt;Enviar para dispositivo e também pode ser substituída para cada dispositivo em Preferências-&gt;Plugins-&gt;Plugins de Interface do Dispositivo.
uk: У новій версії користувачі можуть вказати структуру тек і назви файлів, які використовуватимуться при виконанні дії «Надіслати на пристрій». Це корисно для тих пристроїв, де передбачено можливість навігації структурою тек пристрою. Налаштування можна виконати за допомогою сторінки «Налаштування -&gt; Додавання/Збереження -&gt; Надсилання на пристрій», а також перевизначено для окремих пристроїв за допомогою сторінки «Налаштування -&gt; Додатки -&gt; Додатки інтерфейсу пристроїв».

source: Performance improvements
es: Mejoras de rendimiento
fr: Améliorations des performances
pt_br: Melhorias de performance
uk: Поліпшення у швидкодії

source: If you have a large library with thousand of books or more, you will notice significant performance gains in starting up calibre and doing common editing tasks like changing metadata, compared to 0.6.0. In addition, thanks to the device caching described above, connecting to devices should become much faster if you have large collections on your device.
fr: Si vous avez une grande bibliothèque avec des milliers de livres ou plus, vous remarquerez un gain significatif de performances au démarrage de calibre et en faisant des tâches habituelles d'édition comme changer les métadonnées, comparé à 0.6.0. En complément, merci à la mise en cache du périphérique décrite plus haut, la connexion aux périphériques doit devenir beaucoup plus rapide si vous avez de grandes collections sur votre périphérique.
pt_br: Caso não possua uma biblioteca grande com milhares de livros ou mais, você notará significantes ganhos de performance na inicialização e em tarefas comuns de edição como alterar metadados, comparado com a versão 0.6.0. Além disso, graças ao cache de dispositivo descrito acima, a conexão a dispositivos deve se tornar muito mais rápida se você tiver uma grande coleção no seu dispositivo.
uk: Якщо у вашій бібліотеці тисяча або більше книг, ви помітите значне пришвидшення під час запуску calibre та виконання звичайних дій з редагування, зокрема зміни метаданих, порівняно з версією 0.6.0. Крім того, завдяки кешуванню вмісту пристроїв, яке описано вище, з'єднання із пристроями має стати набагато швидшим, якщо на пристрої зберігається велика збірка.

source: The download of news has been speeded up as well (as of 0.6.27) by making it truly multi-threaded.
es: La descarga de noticias se ha acelerado también (en 0.6.27) haciéndola realmente multihilo.
fr: Le téléchargement des actualités a été accéléré également (dès 0.6.27) en le rendant réellement multitâches.
pt_br: O download de notícias foi acelerado também (a partir da versão 0.6.27) ao torná-lo realmente multi-tarefas.
uk: Швидкість отримання новин було збільшено (порівняно із 0.6.27) за рахунок роботи у декілька потоків.

source: Improvements in the conversion and metadata engines
es: Mejoras en la conversión y motores de metadatos
fr: Améliorations dans les moteurs de conversion et de métadonnées
pt_br: Melhorais nos mecanismos de conversão e metadados
uk: Поліпшення у рушіях перетворення та обробки метаданих

source: The conversion engine now supports unicode characters in RTF Input documents and auto-converts ligatures for PDF input documents.
es: El motor de conversión ahora soporta caracteres Unicode en documentos de entrada RTF y convierte automáticamente ligaduras para documentos de entrada PDF.
fr: Le moteur de conversion supporte maintenant les caractères unicode dans les documents RTF en entrée et convertit automatiquement les ligatures pour les documents PDF en entrée.
pt_br: O mecanismo de conversão agora suporta caracteres unicode em documentos de entrada RTF e converte automaticamente ligaduras para documentos de entrada PDF.
uk: У рушії перетворення нової версії передбачено підтримку символів unicode у вхідних документах RTF і автоматичне перетворення лігатур для вхідних документів PDF.
