Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Welcome back, calibre users. It has been almost three years since calibre 2.0. In that time lots has happened. The biggest new feature, which was in development for almost that entire period, is a completely re-written calibre <i>Content server</i>.
fr: Bienvenue, utilisateurs de calibre. Cela fait presque trois ans depuis calibre 2.0. Pendant ce temps beaucoup de choses sont arrivées. La nouvelle fonctionnalité la plus importante, qui a été en développement pendant presque toute cette période, est le <i>Serveur de contenu</i> complètement ré écrit.
pt_br: Bem-vindos de volta, usuários do calibre. Foram quase três anos desde o calibre 2.0. Nesse período muita coisa aconteceu. A maior novidade, a qual esteve em desenvolvimento durante quase todo esse período, é um <i>Servidor de Conteúdo</i> completamente reescrito.
uk: Знову вітаємо вас, користувачі calibre. З часу випуску calibre 2.0 минуло майже 3 роки. За чей час багато чого трапилося. Найбільшою новою можливістю, яку ми розробляли майже увесь трирічний період, є повністю новий <i>сервер даних</i> calibre.

source: The Content server allows you to wirelessly browse your calibre books on any modern phone/tablet and even read the books right in your phone browser. The books are stored in off-line storage on the phone so you do not have to keep calibre running or have an always on internet connection to read the books.
fr: Le Serveur de contenu vous permet de parcourir vos livres calibre sur n'importe quel téléphone/tablette moderne et même de lire les livres directement sur le navigateur de votre téléphone. Les livres sont stockés dans un emplacement hors ligne aussi vous n'avez pas à garder calibre en fonctionnement ou avoir une connexion internet toujours ouverte pour lire les livres.
pt_br: O Servidor de Conteúdo permite que você navegue sem fios a sua biblioteca do calibre em qualquer telefone/tablet moderno e até mesmo ler os livros diretamente no navegador. Os livros são armazenados de forma off-line no telefone, de forma que você não precise manter o calibre rodando ou ter uma conexão sempre on-line para ler os livros.
uk: За допомогою сервера даних ви можете, використовуючи бездротовий зв'язок, переглядати вашу збірку книг на будь-якому сучасному телефоні або планшеті і навіть читати книги за допомогою програми для перегляду сторінок інтернету вашого телефону. Книги зберігатимуться у автономному сховищі даних, отже вам не доведеться весь час тримати calibre запущеною або підтримувати інтернет-з'єднання для читання книг.

source: The new Content server
fr: Le nouveau Serveur de contenu
pt_br: O novo Servidor de Conteúdo
uk: Новий сервер даних

source: You can start the Content server by clicking the Connect/share button in calibre. Then just open up a browser and type <code>http://localhost:8080</code> in the address bar. You will see a list of calibre libraries. Click on one and browse the books. Click on a book and you will have the option to read or download it. To learn more about using the server to read on your devices, see the <a href="%(server)s">User Manual</a>.
fr: Vous pouvez démarrer le Serveur de contenu en cliquant sur le bouton Connecter/partager dans calibre. Ouvrez alors un navigateur et entrez <code>http://localhost:8080</code> dans la barre d'adresse. Vous verrez une liste de bibliothèques calibre. Cliquez-en une et parcourez les fichiers. Cliquez sur un livre et vous aurez l'option de le lire ou de le télécharger. Pour en connaître plus sur l'utilisation du serveur pour lire sur vos périphériques, voir le <a href="%(server)s">Manuel Utlisateur</a>.
pt_br: Você pode iniciar o Servidor de Conteúdo clicando no botão Conectar/compartilhar no calibre. Então apenas abra um navegador e digite <code>http://localhost:8080</code> na barra de endereços. Você verá uma lista de bibliotecas do calibre. Clique em uma e navegue pelos livros. Clique em um livro e você terá a opção de ler ou baixá-lo. Para aprender mais sobre a utilização do servidor para ler no seus dispositivos, veja o <a href="%(server)s">Manual do Usuário</a>.
uk: Запустити сервер даних можна натисканням кнопки «З'єднатись/Роздати» у вікні calibre. Далі відкрийте вікно програми для перегляду сторінок інтернету і вкажіть таку адресу у рядку адреси: <code>http://localhost:8080</code>. Ви маєте побачити список бібліотек calibre. Натисніть пункт однієї з них і перегляньте список книг. Натисніть пункт книги, і програма запропонує вам прочитати її або отримати файл книги. Щоб дізнатися більше про користування сервером для читання книг на іншому пристрої, ознайомтеся із <a href="%(server)s">Підручником користувача</a>.

source: The home screen: continue reading or choose a library
fr: L'écran d'accueil : continuer à lire ou choisir une bibliothèque
pt_br: A tela principal: continue lendo ou escolha uma biblioteca
uk: Домашня сторінка: продовження читання або вибір бібліотеки

source: The books in a calibre library
fr: Les livres dans la bibliothèque calibre
pt_br: Os livros em um biblioteca do calibre
uk: Книги у бібліотеці calibre

source: Another view of the books
es: Otra vista de los libros
fr: Une autre vue des livres
pt_br: Outra visualização dos livros
uk: Ще одна панель перегляду книг

source: Third
es: Tercero
fr: Troisième
pt_br: Terceiro
uk: Третій

source: Reading a book in the browser
es: Leer un libro en el navegador
fr: Lire un livre dans le navigateur
pt_br: Lendo um livro no navegador
uk: Читання книги у переглядачі

source: Fourth
es: Cuarto
fr: Quatrième
pt_br: Quarto
uk: Четвертий

source: Another page of the book
fr: Une autre page du livre
pt_br: Outra página do livro
uk: Ще одна сторінка книги

source: Fifth
es: Quinto
fr: Cinquième
pt_br: Quinto
uk: П’ятий

source: Support for High Resolution (Retina) screens
fr: Prise en charge des écrans Haute Résolution (Retina)
pt_br: Suporte para telas de Alta Resolução (Retina)
uk: Підтримка високої роздільної здатності екранів

source: A much requested feature. As of calibre 3, calibre now natively supports high resolution (Retina) screens. It should auto-detect when it is started up on such a screen and adjust itself accordingly. It can be controlled via <code>Preferences → Look &amp; feel → Adjust for high resolution screens</code>.
fr: Une fonctionnalité plus demandée. Dès calibre 3, calibre prend en charge nativement les écrans haute résolution (Retina). Il doit détecter automatiquement quand il est démarré sur un tel écran et s'ajuster de lui-même en conséquence. Il peut être contrôlé via <code>Préférence → Apparence et présentation → Ajuster pour des écrans haute résolution</code>.
pt_br: Uma função muito requisitada. O calibre 3 agora suporta nativamente telas de alta resolução (Retina). Ele detecta automaticamente ao ser iniciado em uma tela assim e se ajusta de acordo. Isso pode ser controlado via <code>Preferências → Aparência → Ajuste para telas de alta resolução</code>.
uk: Можливість, про яку багато хто просив. Починаючи з calibre 3, у calibre реалізовано підтримку екранів із високою роздільною здатністю (Retina). Програма автоматично визначає, чи запущено її на пристрої з таким екраном, і коригує параметри інтерфейсу. Щоб змінити параметри роботи програми, скористайтеся пунктом меню <code>Налаштування → Вигляд та поведінка → Скоригувати для екранів із високою роздільністю</code>.

source: Support for icon themes and a new default icon set
fr: Prise en charge des thèmes d'icônes et un nouveau set d'icônes par défaut
pt_br: Suporte para temas de ícones um novo conjunto de ícones
uk: Підтримка тем піктограм і новий типовий набір піктограм

source: calibre now has support for installing different icon themes (<code>Preferences → Look &amp; feel → Icon theme</code>). There are many different icon themes to suit different tastes.
fr: calibre prend maintenant en charge l’installation de différents thèmes d'icônes (<code>Préférences → Apparence &amp; présentation→ Thème d'icônes</code>). Il y a beaucoup de thèmes d'icône différents pour convenir aux différents goûts.
pt_br: O calibre agora tem suporte para instalar diferentes temas de ícones (<code>Preferências → Aparência → Tema de ícone</code>). Existem muitos temas de ícone diferentes para diferentes gostos.
uk: Тепер у calibre передбачено підтримку встановлення нетипових тем піктограм (<code>Налаштування → Вигляд і поведінка → Тема піктограм</code>). Створено багато різних тем піктограм для людей з різним смаком.

source: In addition, to celebrate calibre's tenth birthday, which was in October, 2016, the default calibre icons have been changed. Never, fear if you prefer the old icons they are also available, as an icon theme.
es: Además, para celebrar el décimo aniversario de calibre, que fue en octubre de 2016, los iconos predeterminados de calibre han cambiado. No tema, si prefiere los iconos antiguos también están disponibles como un tema de iconos.
fr: En complément, pour célébrer le dixième anniversaire de calibre, qui se célébrait en octobre 2016, les icônes par défaut de calibre ont été changées. N'ayez pas peur, si vous préférez l'ancien thème d'icônes elles son également disponibles en tant que thème d'icônes.
pt_br: Além disso, para celebrar o décimo aniversário do calibre, que foi em Outubro de 2016, os ícones padrões foram alterados. Não tema, se você preferir os velhos ícones eles também estão disponíveis, como um tema de ícone.
uk: Крім того, на відзначення десятого дня народження програми, який ми святкували у жовтні 2016 року, було змінено типову тему піктограм calibre. Втім, якщо ви надаєте перевагу старим піктограмам, ними також можна скористатися. Вони доступні як окрема тема піктограм.

source: Some new icon themes ({})
fr: Quelques nouveaux thèmes d'icônes ({})
pt_br: Alguns novos temas de ícones ({})
uk: Декілька нових тем піктограм ({})

source: Conversion to Microsoft Word (DOCX)
fr: Conversion vers Microsoft Word (DOCX)
pt_br: Conversão para Microsoft Word (DOCX)
uk: Перетворення даних у формат Microsoft Word (DOCX)

source: calibre can now convert all the book formats it supports to Microsoft Word (DOCX) files. Alongside the support for conversion <i>from</i> Word, you can now go back and forth between Word documents and e-book formats to your hearts desire.
fr: calibre peut maintenant convertir tous les formats de livre qu'il prend en charge vers des fichiers Microsoft Word (DOCX). Parallèlement à la prise en charge de la conversion <i>depuis</i> Word, vous pouvez maintenant alterner entre documents Word et formats de livre numérique comme vous le désirez.
pt_br: O calibre agora pode converter todos formatos suportados em arquivos do Microsoft Word (DOCX). Além do suporte para conversão <i>a partir</i> do Word, você pode agora ir e vir entre documentos Word e formatos de e-book de acordo com seu desejo.
uk: Тепер calibre може перетворювати дані в усіх підтримуваних програмою форматах на дані у форматі Microsoft Word (DOCX). Разом із підтримкою перетворення даних <i>з</i>, тепер ви можете користуватися документами Word або електронними книгами на рівних умовах.

source: Backwards incompatibilities
fr: Incompatibilités irréversibles
pt_br: Incompatibilidades com versões anteriores
uk: Несумісності із попередніми версіями

source: There are a few minor backwards incompatibilities to be aware of in calibre 3.
fr: Il y a quelques mineures incompatibilités irréversibles dont il faut être conscient dans calibre 3.
pt_br: Há algumas pequenas incompatibilidades com versões anteriores ao calibre 3.
uk: У calibre 3 є декілька незначних несумісних змін, про які слід знати.

source: The Content server was completely re-written. While we have tried hard to make sure the functionality used by third party programs that connect to calibre remains compatible, there is likely to be some breakage. Also, no changes you have made to any server options will be preserved. For example, if you changed the port from the default of 8080, it will be reset to 8080. You will have to redo the configuration.
fr: Le Serveur de contenu a été complètement ré écrit. Bien que nous ayons lourdement essayé de s'assurer que les fonctionnalités utilisées par des programmes tiers qui se connectent à calibre restent compatibles, il est possible d'avoir des ruptures. Ainsi, aucun des changements que vous avec fait à n'importe quelle option du serveur ne sera préservé. Par exemple, si vous avez changé le port par défaut 8080, il sera remis à 8080. Vous aurez à refaire la configuration.
pt_br: O Servidor de Conteúdo foi completamente reescrito. Apesar de nos esforçarmos para garantir que as funcionalidades usadas por programas de terceiros que se conectam ao calibre permaneçam compatíveis, é possível que haja algum dano. Além disso, nenhuma mudança que tenha feito nas opções do servidor será preservada. Por exemplo, se você alterou a porta do padrão 8080, ele será redefinido para 8080. Você terá que refazer a configuração.
uk: Було повністю переписано код сервера даних. Хоча ми намагалися зробити усе, щоб функціональні можливості, які використовують сторонні програми, що з'єднуються із calibre, лишилися сумісними із попередніми версіями, ймовірно, щось таки було порушено. Крім того, у новій версії не буде враховано жодних змін, які було внесено вами у налаштування сервера. Наприклад, якщо вами було змінено порт із типового 8080 на інший, буде відновлено зв'язок за допомогою порту 8080. Вам доведеться налаштовувати програму із початку.

source: Because the Content server can now make changes to calibre libraries, you can no longer run any of <code>calibredb.exe, calibre-server.exe</code> or <code>calibre.exe</code> together, as they are all capable of modifying calibre data. Instead of running calibre.exe and calibre-server.exe, use the embedded server inside the main calibre program. calibredb.exe can now connect directly to a running calibre server (either calibre-server.exe or the server running inside calibre). See the <a href="%(man)s"> User Manual</a> for details on how to do that.
fr: Vu que le Serveur de contenu peut maintenant faire des changements dans les bibliothèques calibre, vous ne pouvez plus dorénavant exécuter n'importe quelle instance de <code>calibredb.exe, calibre-server.exe</code> ou <code>calibre.exe</code> ensemble, car elles sont toutes capables de modifier les données calibre. Au lieu d'exécuter calibre.exe et et calibre-server.exe, utilisez le serveur intégré au programme principal de calibre. calibredb.exe peut maintenant se connecter directement au serveur calibre en cours d'exécution (soit calibre-server.exe soit le serveur exécuté dans calibre). Voir le <a href="%(man)s">Manuel Utilisateur</a> pour des détails sur comment faire cela.
pt_br: Uma vez que o Servidor de Conteúdo agora pode fazer alterações nas bibliotecas do calibre, não é mais possível executar qualquer instância de <code>calibredb.exe, calibre-server.exe</code> ou <code>calibre.exe</code> juntos, já que todos eles são capazes de modificar os dados do calibre. Em vez de executar o calibre.exe e o calibre-server.exe, use o servidor incorporado dentro do programa principal. O calibredb.exe pode agora se conectar diretamente a um servidor em execução (tanto o calibre-server.exe ou o servidor rodando dentro do calibre). Veja o <a href="%(man)s"> Manual do Usuário</a> para detalhes sobre como fazer isso.
uk: Оскільки у новій версії сервер даних може вносити зміни до бібліотек calibre, більше не можна запускати одночасно <code>calibredb.exe, calibre-server.exe</code> і <code>calibre.exe</code>, оскільки усі ці програми можуть вносити зміни до даних calibre. Замість одночасного використання calibre.exe і calibre-server.exe, скористайтеся вбудованим до основної програми calibre сервером. calibredb.exe у новій версії може з'єднуватися безпосередньо із запущеним сервером calibre (calibre-server.exe або сервером у самій calibre). Докладніше про це можна дізнатися із <a href="%(man)s">Підручника користувача</a>.

source: On Linux calibre can no longer use the system Qt theme/style plugins as they cause hangs/crashes on some systems. This means calibre might look a little different from other applications on your system. You can force the use of the system theme by setting the environment variable <code>CALIBRE_USE_SYSTEM_THEME</code>, but do so at your own risk.
fr: Sous Linux, calibre ne sais plus utiliser les extensions système Qt Thème/style car elles causent des ralentissements/ plantages sur certains systèmes. Cela signifie que calibre pourrait paraître un peu différent des autres applications sur votre système. Vous pouvez forcer l'utilisations des thèmes système en paramétrant la variable d’environnement <code>CALIBRE_USE_SYSTEM_THEME</code>, mais vous le faites à vos propres risques.
pt_br: No Linux, o calibre não pode mais usar os plugins de estilo / temas do Qt do sistema, já que causam travamentos em alguns sistemas. Isto significa que o calibre pode parecer um pouco diferente de outros programas no seus sistema. Você pode forçar o uso do tema do sistema definindo a variável de ambiente <code>CALIBRE_USE_SYSTEM_THEME</code>, por sua conta e risco.
uk: У Linux calibre більше не може використовувати загальносистемні додатки тем та стилів Qt, оскільки вони викликають повисання та аварійне завершення програми у деяких середовищах. Це означає, що вікно calibre може виглядати дещо не так, як вікна інших програм у вашій системі. Ви можете примусово наказати програмі використовувати загальносистемну тему, якщо встановите змінну середовища <code>CALIBRE_USE_SYSTEM_THEME</code>, але ми не можемо відповідати за наслідки такої зміни типової поведінки програми.

source: New in calibre 1.0
es: Nuevo en calibre 1.0
fr: Nouveautés dans la version 1.0 de calibre
pt_br: Novidades no calibre 1.0
uk: Нове у calibre 1.0

source: calibre has reached <b>1.0</b>, seven years after it was first released and a year since the last major release. Lots of new features have been added to calibre in the last year &mdash; a grid view of book covers, a new, faster database backend, the ability to convert Microsoft Word files, tools to make changes to e-books without needing to do a full conversion, full support for font embedding and subsetting, and many more, described in detail below.
es: calibre ha llegado a la versión <b>1.0</b>, siete años después de publicarse por primera vez y un año después de la última versión mayor. Se han añadido muchas nuevas funciones a calibre en el último año: una vista de cuadro de portadas, un motor de base de datos nuevo y más rápido, la posibilidad de convertir archivo de Microsoft Word, herramientas para hacer cambios en libros electrónicos sin tener que realizar una conversión completa, soporte completo para incrustación y reducción de tipos de letra y muchas más, que se describen con más detalle a continuación.
fr: calibre est parvenu à la version <b>1.0</b> sept ans après sa première publication et un an depuis la dernière version importante. Beaucoup des nouvelles fonctionnalités ont été ajoutées à calibre dans la dernière année &mdash; une vue grille des couvertures de livre, une nouvelle, plus rapide base de données principale, la capacité de convertir des fichiers Microsoft Word, des outils pour faire des changements aux livres numériques sans la nécessité de faire faire une conversion complète, prise en charge complète de l'intégration des polices et sous-ensemble, et beaucoup plus, décrit en détail ci-dessous.
pt_br: O calibre atingiu a versão <b>1.0</b>, sete anos após sua primeira versão e um ano depois do último grande lançamento. Muitas novas funções foram adicionadas ao calibre no último ano &mdash; um visualização de grade de capas, uma nova e mais rápida base de dados, a capacidade de converter arquivos do Word, ferramentas para fazer alterações nos e-books sem necessidade de uma conversão completa, suporte completo a incorporação de fontes e subconjuntos, e muito mais, descrito em detalhes abaixo.
uk: calibre досягла версії <b>1.0</b> за сім років після першого випуску і рік з часу останнього основного випуску. Протягом останнього року було додано багато нових можливостей &mdash; таблицю із зображеннями обкладинок книг, новий, швидший модуль бази даних, можливість перетворювати файли Microsoft Word, засоби для внесення змін до електронних книг без повного перетворення, повна підтримка вбудовування шрифтів та їхніх підмножин та багато інших можливостей, які описано нижче.

source: A grid view of book covers
fr: Une vue grille de couvertures de livres
pt_br: Uma visualização de grade de capas de livros
uk: Таблиця із обкладинками книг

source: calibre now has an optional "grid" view of covers, a convenient way to judge the books in your collection by their covers :) To turn it on, use the button with the icon of a grid on it in the bottom right corner of the main window.
fr: calibre a maintenant une vue "grille" des couvertures optionnelles, une manière pratique de juger les livres dans votre collection par leurs couvertures :) Pour l'activer, utilisez le bouton avec l'icône représentant une grille dans le coin inférieur droit de la fenêtre principale.
pt_br: O calibre agora possui uma visualização opcional de "grade" de capas, uma maneira conveniente de julgar os livros da sua coleção pela capa :) Para ativá-la, use o botão com o ícone de uma grade no canto direito inferior da janela principal.
uk: У новій версії calibre передбачено можливість режиму перегляду таблиці обкладинок — зручний спосіб оцінити книги у вашій збірці за обкладинками :) Щоб увімкнути цей режим, скористайтеся кнопкою з піктограмою ґратки у нижньому правому куті головного вікна програми.

source: In the finest calibre tradition the view is highly customizable, you can adjust the cover size, the space between covers, choose to display the book title below the covers and even change the background color! All the customization is available via <i>Preferences-&gt;Look &amp; Feel-&gt;Cover Grid</i>. See the screen shots below.
fr: Dans la pure tradition de calibre la vue est très personnalisable, vous pouvez ajuster la taille de la taille de la couverture, l'espace entre les couvertures, choisir d'afficher le titre en dessous des couvertures et même changer la couleur d'arrière plan ! Toutes les personnalisations sont disponibles via <i>Préférences-&gt;Apparence &amp; présentation-&gt;Grille de couvertures</i>. Voir les captures d'écran ci-dessous.
pt_br: Na melhor tradição do calibre, a visualização é altamente customizável, você pode ajustar o tamanho da capa, o espaço entre capas, optar por mostrar o título do livro abaixo das capas e até mesmo mudar a cor de fundo! Todas as opções estão disponíveis via <i>Preferências-&gt;Aparência-&gt;Grade de Capas</i>. Veja as capturas de tela abaixo.
uk: У найкращих традиціях calibre режим перегляду підлягає якнайтоншому налаштовуванню — ви можете скоригувати розмір обкладинки, інтервал між обкладинками, вибрати, чи слід показувати назву книги під обкладинкою, і навіть змінити колір тла! Усе налаштовування можна виконати за допомогою сторінки <i>Налаштування -&gt; Вигляд та поведінка -&gt; Таблиця обкладинок</i>. Знімки вікон наведено нижче.

source: The default cover grid, cover sizes are auto adjusted for screen size
fr: La grille de couverture par défaut, les tailles de couverture sont ajustées automatiquement pour votre taille d'écran
pt_br: A grade de capas padrão. O tamanho das capas são ajustados automaticamente para o tamanho da tela
uk: Типова таблиця обкладинок, розміри зображень автоматично скориговано відповідно до розмірів екрана

source: Larger covers and titles below the cover
fr: Grandes couvertures et titres en dessous de la couverture
pt_br: Capas grandes e títulos abaixo da capa
uk: Більші зображення обкладинок і назви під обкладинками

source: A different background color
fr: Une couleur arrière plan différente
pt_br: Uma cor de fundo diferente
uk: Інший колір тла
