Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: calibre has gained dozens of new, user-contributed, plugins to enhance its already extensive feature set. These range from things like finding duplicates in your calibre library to managing collections on your Kindle from within calibre.
fr: calibre a acquis des douzaines de nouvelles extensions, apportées par des utilisateurs, pour améliorer son ensemble déjà important de fonctionnalités. Cela va de choses comme trouver des doublons dans votre bibliothèque calibre à gérer vos collections sur votre Kinde depuis calibre.
pt_br: O calibre ganhou dezenas de novas contribuições de usuários com plugins para melhorar seu já grande conjunto de ferramentas. Estes variam de coisas como encontrar itens duplicados na sua biblioteca do calibre a gerenciar coleções no seu Kindle de dentro do calibre.
uk: Нова версія calibre отримала десятки нових створених користувачами додатків, які розширюють її й без того немалі можливості. Діапазон речей, які вміють ці додатки, коливається від пошуку дублікатів у вашій бібліотеці calibre до керування збірками на вашому пристрої Kindle з програми calibre.

source: Many of the plugins scratch an itch that affects only a subset of calibre users, for example, a plugin to set a cover from calibre as the screensaver on your SONY reader. If you have something that you always wanted to do in calibre, chances are, someone has written a plugin for it.
fr: Beaucoup d'extensions démangent et grattent qu'elles n'affectent qu'une partie des utilisateurs calibre, par exemple, une extension pour définir une couverture comme écran de veille sur votre SONY. Si il a quelque chose que vous avez toujours voulu faire dans calibre, il y a des chances que quelqu'un ait écrit une extension pour ça.
pt_br: Muitos destes plugins satisfazem apenas uma porção dos usuários do calibre. Por exemplo, um plugin para definir uma capa do calibre como a proteção de tela para o seu leitor SONY. Se existe algo que você sempre quis no calibre, há uma chance de alguém ter criado um plugin para isso.
uk: Багато додатків є відповіддю на запити лише частини користувачів calibre. Наприклад, створено додаток, який встановлює обкладинку з calibre як зберігач екрана на ваш пристрій для читання SONY. Якщо у вас є щось, що ви завжди хотіли зробити у calibre, ймовірно, додаток для реалізації цієї можливості вже було кимось написано.

source: There is an easy to browse <a href="%(mr)s">Index of plugins</a>. Before adding plugins willy-nilly to calibre, you should read the <a href="%(ip)s">Introduction to plugins</a>.
fr: Il y a un <a href="%(mr)s">Index des extensions</a> facile à parcourir. Avant d'ajouter des extensions bon gré, mal gré à calibre, vous devriez lire l'<a href="%(ip)s">Introduction aux extensions</a>.
pt_br: Há um <a href="%(mr)s">Índice de plugins</a> fácil de navegar. Antes de adicionar plugins a torto e à direita ao calibre, você deve ler a <a href="%(ip)s">Introdução a plugins</a>.
uk: Можете просто подивитися <a href="%(mr)s">список додатків</a>. Перш ніж додавати якийсь додаток до calibre, варто прочитати <a href="%(ip)s">Вступ до створення додатків</a>.

source: New metadata download system
es: Nuevo sistema de descarga de metadatos
fr: Nouveau système de téléchargement des métadonnées
pt_br: Novo sistema de download de metadados
uk: Нова система отримання метаданих

source: calibre now has a new metadata download system. This is designed to improve download performance and give you greater control over exactly what calibre downloads from where. You can tell calibre that you do not want ratings and tags from amazon or comments from google, for example.
fr: calibre à maintenant un nouveau système de téléchargement des métadonnées. celui-ci est conçu pour améliorer la performance de téléchargement et vous donne un plus grand contrôle sur ce que calibre télécharge exactement et d'où. Vous pouvez dire à calibre que vous ne voulez pas des notations et étiquettes d'Amazon ou les commentaires de Google, par exemple.
pt_br: O calibre agora possui um novo sistema de download de metadados. Isto foi pensado para melhorar a performance de download e dar a você maior controle sobre o que exatamente o calibre baixa de onde. Você pode dizer ao calibre que não quer avaliações e etiquetas da amazon ou comentários do google, por exemplo.
uk: У новій версії calibre реалізовано нову систему отримання метаданих. Систему створено для збільшення швидкодії отримання даних та надання користувачеві ширших можливостей із того, що саме calibre отримує з інтернету. Ви можете, наприклад, наказати calibre не отримувати оцінки і мітки з amazon або коментарі з google.

source: When downloading covers for a single book, calibre will now download covers from all the online sources and allow you to pick the one you like best, instead of choosing for you.
fr: Au moment de télécharger des couvertures pour un seul livre, calibre téléchargera dorénavant les couvertures de toutes les sources en ligne et vous laissera choisir celle que vous préférez, au lieu de choisir pour vous.
pt_br: Ao baixar capas para um único livro, o calibre agora irá baixar capas de todas as fontes online e permitir que você escolha aquela que você mais gosta, em vez de ele escolher para você.
uk: Під час отримання зображень обкладинки для певної книги нова версія calibre отримує обкладинки з усіх джерел у інтернеті і надає вам змогу вибрати те з зображень, яке ви вважаєте найкращим, не вибираючи його за вас.

source: When downloading metadata for multiple books, the download now happens in the background, allowing you to continue working while the download is happening.
fr: Quand vous téléchargez les métadonnées pour plusieurs livres à la fois, le téléchargement se fait en arrière-plan, vous permettant de continuer à travailler pendant que le téléchargement s'effectue.
pt_br: Ao baixar metadados para múltiplos livros, o download agora acontece ao fundo, permitindo que você continue trabalhando enquanto o download está acontecendo.
uk: Отримання метаданих для набору книг у новій версії відбувається у фоновому режимі, отже ви зможете продовжувати роботу з програмою, доки вона отримує дані.

source: Downloading book metadata
es: Descarga de metadatos de libros
fr: Téléchargement des métadonnées de livre
pt_br: Baixando metadados do livro
uk: Отримання метаданих книги

source: Downloading book covers
es: Descarga de portadas de libros
fr: Téléchargement des couvertures de livre
pt_br: Baixando capas do livro
uk: Отримання зображень обкладинок книги

source: Interface improvements
es: Mejoras de la interfaz
fr: Améliorations de l'interface
pt_br: Melhorias de interface
uk: Поліпшення у інтерфейсі

source: The main calibre user interface has had a makeover. It has multiple layouts, wide and narrow, selectable from Preferences-&gt;Look &amp; Feel. The Edit metadata dialog (one of the most frequently used dialogs in calibre) was also redesigned with multiple selectable layouts, this time from Preferences-&gt;Behavior. In the same vein the Book details panel is now fully user customizable from Preferences-&gt;Look &amp; Feel.
fr: L'interface utilisateur de calibre a subi une transformation. Elle a de multiples mises en pages, large et condensée, sélectionnables depuis Préférences-&gt;Apparence &amp; présentation. La boite de dialogue d'Édition des métadonnées (l'une des boites de dialogue la plus fréquentée de calibre) a aussi été redessinée avec des mises en page multiples sélectionnables, cette fois depuis Préférences-&gt;Comportement. Dans la même veine, le panneau de Détails du livre est maintenant complètement personnalisable depuis Préférences-&gt;Apparence &amp; présentation.
pt_br: A interface de usuário principal do calibre ganhou uma maquiagem. Ela tem múltiplos layouts, largo e estreito, selecionáveis via Preferências-&gt;Aparêncial. O diálogo de edição de metadados (um dos mais usados no calibre) também foi redesenhado com múltiplos layouts selecionáveis, desta vez via Preferências-&gt;Comportamento. Na mesma onda o Painel de detalhes do livro é agora totalmente customizável via Preferências-&gt;Aparência.
uk: Перероблено основний інтерфейс користувача calibre. Тепер у нього декілька компонувань, широке і вузьке. Вибрати компонування можна за допомогою сторінки «Налаштування -&gt; Вигляд та поведінка». Також змінено дизайн діалогового вікна редагування метаданих (одного із тих вікон у calibre, які використовуються найчастіше). Тепер можна вибрати одне із компонувань цього вікна, на цей раз за допомогою сторінки «Налаштування -&gt; Поведінка». Крім того, у такий самий спосіб можна налаштувати і панель подробиць щодо книги, — скористайтеся сторінкою «Налаштування -&gt; Вигляд та поведінка».

source: The old double toolbar in calibre were replaced by a new single "unified" toolbar, to save vertical space. You can now add a second toolbar or even a menubar and customize what icons appear in each.
fr: L'ancienne double barre d'outils dans calibre a été remplacée par une une seule nouvelle barre d'outils "unifiée", pour sauvegarder de l'espace vertical. Vous pouvez maintenant ajouterune seconde barre d'outils ou même une barre de menu et personnaliser quelles icônes apparaissent dans chaque.

source: Finally, the Preferences dialog, a normally neglected bit of real estate was redesigned making it easier to find just the setting you are looking for.
fr: Pour finir, la boîte de de dialogue des Préférences, un peu négligée, a été remodelée rendant plus facile de trouver le paramètre que vous cherchez.
pt_br: Finalmente, o diálogo de Preferências, uma área geralmente negligenciada, foi redesenhada, tornando mais fácil encontrar a configuração que está procurando.
uk: Нарешті, діалогове вікно налаштовування, у якому спостерігалися певні вади із розподілом елементів, було переплановано так, щоб у ньому було простіше знайти потрібний вам пункт.

source: The new main interface
es: Nueva interfaz principal
fr: La nouvelle interface principale
pt_br: A nova interface principal
uk: Новий головний інтерфейс

source: The new edit metadata dialog
es: Nuevo diálogo para modificación de metadatos
fr: La nouvelle boite d'édition des métadonnées
pt_br: O novo diálogo de edição de metadados
uk: Нове діалогове вікно редагування метаданих

source: The new preferences dialog
es: Nuevo diálogo de preferencias
fr: La nouvelle boîte de dialogue pour les Préférences
pt_br: O novo diálogo de preferências
uk: Нове діалогове вікно налаштовування

source: Content server improvements
es: Mejoras en el servidor de contenidos
fr: Améliorations du Serveur de contenu
pt_br: Melhorias no servidor de conteúdo
uk: Поліпшення у сервері даних

source: The calibre Content server was completely redesigned with a "modern" (AJAX based, dynamic) user interface that allows for the browsing of your library by Tags/Series/Authors/etc.
fr: Le Serveur de contenu de calibre a été complètement revu avec une interface utilisateur "moderne" (dynamique, basée sur AJAX) et autorise la navigation de votre bibliothèque par Étiquettes/Séries/Auteurs/etc.
pt_br: O Servidor de Conteúdo do calibre foi completamente redesenhado com uma interface do usuário "moderna" (baseada no AJAX, dinâmica) que permite a navegação de sua biblioteca por etiquetas / séries / autores / etc.
uk: Сервер даних calibre повністю переписано із використанням «сучасного інтерфейсу користувача (на основі AJAX із динамічною зміною вигляду), що уможливило навігацію бібліотекою за мітками, циклами, авторами тощо.

source: Content server front page
es: Carátula del servidor de contenidos
fr: Page d'accueil du Serveur de contenu
pt_br: Página inicial do servidor de conteúdo
uk: Початкова сторінка сервера даних

source: The Content server book list
es: Lista de libros del servidor de contenidos
fr: La liste de livres du Serveur de contenu
pt_br: A lista de livros do Servidor de conteúdo
uk: Список книг сервера даних

source: The Content server book details page
es: Página de detalles del libro del servidor de contenidos
fr: La page de détails du livre du Serveur de contenu
pt_br: A página de detalhes do livro do Servidor de conteúdo
uk: Сторінка подробиць щодо книги сервера даних

source: A new "Inspect" feature which allows you to right click on anything in an e-book and see the HTML+CSS code that is responsible for rendering it. A great way for e-book creators/tweakers to understand what goes on behind the scenes in an e-book.
es: Una nueva función «Inspeccionar», que le permite pulsar con el botón derecho en cualquier elemento de un libro electrónico y ver el código HTML+CSS responsable de su visualización. Una manera estupenda para que los creadores o modificadores de libros puedan ver lo que hay entre bastidores en un libro electrónico.
fr: Une nouvelle fonctionnalité "Inspecter" qui vous permet de faire un clic-droit sur n'importe quoi dans un livre numérique et de voir le code HTML + CSS qui est responsable du rendu. Un excellent moyen pour les créateurs/ajusteurs de livre numérique de comprendre ce qui se passe dans les coulisses d'un livre numérique.
pt_br: Uma nova função de "Inspeção" que permite você clicar com o botão direito em qualquer coisa em um e-book ver o código HTML+CSS que é responsável por renderizá-lo. Uma excelente maneira para criadores/modificadores de e-books entenderem o que acontece atrás das cenas em um e-book.
uk: Реалізовано нову можливість «Інспектування», яка надає вам можливість клацнути правою кнопкою на будь-якому місці у електронній книзі і переглянути код HTML+CSS, який відповідає за показ цього місця. Це чудовий спосіб для розробників та коректорів електронних книг зрозуміти, який код стоїть за лаштунками електронної книги.

source: A new "page turn animation" when using the page scrolling mode in the viewer. For thos of you that dont like it, it can be turned off in the viewer preferences.
fr: Une nouvelle "animation tourner la page" lors de l'utilisation du défilement en mode page dans la visionneuse. Pour ceux d'entre-vous qui ne l'aiment pas, il peut être désactivé dans préférences de la visionneuse.

source: calibre's conversion engine can now automatically convert straight quotes, hyphens, dots, etc. into their typographically snobbish equivalents. This option is called "Smarten punctuation" in the Look &amp; Feel section of the conversion settings.
fr: Le moteur de conversion de calibre peut maintenant convertir automatiquement les guillemets droit, les traits d'union, les points, etc en leurs équivalents typographiquement snobs. Cette option est appelée "Ponctuation intelligente" dans la section Apparence &amp; présentation des paramètres de conversion.
pt_br: O mecanismo de conversão do calibre pode agora automaticamente converter aspas retas, hifens, pontos, etc em seus equivalentes tipográficos elegantes. Esta opção é chamada "Pontuação inteligente" na seção Aparência das configurações de conversão.
uk: У новій версії рушій перетворення calibre може автоматично перетворювати прості лапки, дефіси, крапки тощо на їхні типографські еквіваленти. Відповідний пункт у розділі «Вигляд та поведінка» вікна параметрів перетворення називається «Удосконалення пунктуації».

source: A useful new feature in the main calibre interface is "Tweak EPUB", accessed by right clicking on any book. This shows you the internals of the EPUB, allowing you to easily make small corrections, without needing to fire up a full fledged e-book editing program.
es: Una nueva función muy útil en la interfaz principal de calibre es «Retocar EPUB», a la que se accede pulsando con el botón derecho sobre cualquier libro. Esto le muestra las entrañas del EPUB y le permite hacer pequeñas correcciones fácilmente, sin necesidad de iniciar un programa de modificación de libros electrónicos completo.
fr: Une nouvelle fonctionnalité utile dans l'interface principale de calibre est "Affiner EPUB", accessible par un clic droit sur n'importe quel livre. Ceci vous montre les entrailles du EPUB, vous permettant de faire de petites corrections, sans la nécessité de mettre en route un véritable programme d'édition de livre numérique.
pt_br: Uma nova função útil na interface principal do calibre é o "Ajustar EPUB", acessado clicando com o botão direito em qualquer livro. Isto mostra a parte interna do EPUB, permitindo fazer facilmente pequenas correções, sem a necessidade de um programa editor de e-books completo.
uk: Корисною новою можливістю у головному інтерфейсі calibre є «Коригування EPUB», доступ до якого можна отримати з контекстного меню будь-якої книги. Програма покаже вам нутрощі EPUB, надаючи вам змогу просто внести невеличкі виправлення без потреби у запуску повноцінної програми для редагування електронних книг.

source: calibre learned how to convert a couple of new formats: SNB and Plucker.
es: calibre ha aprendido cómo convertir un par más de nuevos formatos: SNB y Plucker.
fr: calibre peut maintenant convertir de nouveaux formats : SNB et Plucker.
pt_br: O calibre aprendeu como converter alguns novos formatos: SNB e Plucker.
uk: Ми навчили calibre перетворювати дані ще у двох форматах: SNB і Plucker.

source: 0.8 brings lots of goodies to make manage your ever growing e-book collection easier:
es: 0.8 trae muchas opciones para hacer más fácil la gestión de su creciente colección de libros electrónicos:
fr: La version 0.8 apporte beaucoup de possibilités pour faciliter le gestion de votre collection de livres numériques toujours grandissante :
pt_br: 0.8 traz uma porção de novidades para tornar mais fácil o gerenciamento da sua crescente coleção de e-books:
uk: У 0.8 багато інструментів, які спрощують керування вашою збіркою електронних книг:

source: Metadata search and replace: You can now perform search and replace operations on the book list in your calibre library via the Bulk metadata edit dialog.
fr: Recherche et remplacement de métadonnées : Vous pouvez maintenant effectuer des opérations de rechercher et remplacer sur la lite de livres dans votre bibliothèque calibre via la boite de dialogue d'édition des métadonnées par lot.
pt_br: Buscar e substituir: Agora você pode fazer operações de busca e substituição na lista de livros na sua biblioteca do calibre via caixa de diálogo "Editar metadados em lote".
uk: Пошук із заміною у метаданих: у новій версії ви зможете виконувати пошук із заміною над списком книг у бібліотеці calibre за допомогою діалогового вікна пакетного редагування метаданих.

source: Metadata plugboards: Have calibre automatically transform the metadata of files when sending to device. For example, you can ask calibre to append the series to the title, in case your device does not support series metadata. See Preferences-&gt;Metadata plugboards
fr: Tableau de connexion des métadonnées : Fait en sorte que calibre transforme automatiquement les métadonnées des fichiers lors de l'envoi vers vers un périphérique. Par exemple, vous pouvez demander à calibre d'apposer les séries sur les titres, dans le cas ou votre périphérique ne prend pas en charge les métadonnées de séries. Voir Préférences-&gt;Tableau de connexions des métadonnées.
pt_br: Quadro de conexões de metadados: Faça com que o calibre transforme automaticamente os metadados dos arquivos quando enviá-los ao dispositivo. Por exemplo: você pode pedir ao calibre para incluir a série ao título, caso seu dispositivo não suporte metadados de série. Veja Preferências-&gt;Quadro de conexões de metadados
uk: Засоби обробки метаданих: надають можливість calibre автоматично перетворювати метадані файлів під час надсилання їх на пристрій. Наприклад, ви можете наказати calibre дописувати назву циклу до заголовка, якщо на вашому пристрої не передбачено підтримки читання метаданих щодо циклу книги. Див. «Налаштування -&gt; Засоби обробки метаданих».

source: A powerful new template language: You can use this to construct complex file names from book metadata when exporting books from the calibre library, or in the metadata plugboards above, or to create "virtual columns" that display combined or transformed metadata in the book list.
fr: Un nouveau langage de modèle puissant : Vous pouvez utiliser ceci pour construire des noms de fichiers complexes à partir des métadonnées d'un livre lors de l'exportation de livres depuis la bibliothèque calibre, ou dans le tableau de connexions des métadonnées susmentionné, ou pour créer des "colonnes virtuelles" qui affichent dans la liste de livres des métadonnées combinées ou transformées.
pt_br: Uma poderosa nova linguagem de modelo: Você pode usar isto para construir nomes de arquivos complexos a partir dos metadados do livro ao exportar livros da biblioteca do calibre, ou nos quadro de conexões acima, ou criar "colunas virtuais" que mostram metadados combinados ou transformados na lista de livros.
uk: Нова потужна мова шаблонів: ви можете скористатися нею для побудови складних назв файлів на основі метаданих книги під час експортування книг з бібліотеки calibre, або у описаних вище засобах обробки метаданих, або для створення «віртуальних стовпчиків», які показуватимуть об'єднані або перетворені метадані у списку книг.

source: Virtual columns: These are custom columns you can add to calibre that display metadata from other fields. For example and ISBN column or a column to show the formats the book has.
fr: Colonnes virtuelles : Celles-ci sont des colonnes personnalisées que vous pouvez ajouter à calibre qui affichent des métadonnées d'autres champs. Par exemple une colonne ISBN ou une colonne pour montrer les formats qu'un livre a.

source: This is an appropriate time to throw out a big thank you to all the calibre developers who have contributed most of the major new features listed above. An incomplete list of contributors is available <a href="%(href)s" title="Contributors">here</a>.
es: Este es un momento apropiado para dar unas gracias enormes a todos los desarrolladores de calibre que han contribuido en la mayoría de características principales citadas más arriba. Una lista incompleta de los colaboradores está disponible <a href="%(href)s" title="Colaboradores">aquí</a>.
fr: C'est le moment adéquat pour remercier fortement tous les développeurs de calibre qui ont contribué à la plupart des nouvelles fonctionnalités majeures listées ci-dessus. Vous pouvez trouver <a href="%(href)s" title="Contributors">ici</a>une liste incomplète des contributeurs.
pt_br: Este é um momento apropriado para dizer um grande obrigado para todos os desenvolvedores do calibre, que contribuíram com a maioria das novas funcionalidades listadas acima. Uma lista incompleta dos contribuidores está disponível <a href="%(href)s" title="Contributors">aqui</a>.
uk: Саме час сказати велике «дякую!» усім розробникам calibre, які зробили свій внесок у реалізацію більшої частини основних можливостей, список яких наведено вище. Із неповним списком учасників розробки можна ознайомитися <a href="%(href)s" title="Contributors">тут</a>.

source: Note that many of these features were actually introduced during the lifetime of the 0.7.x series. This document describes new features as compared to 0.7.0
es: Tenga en cuenta que muchas de estas características se introdujeron realmente durante el ciclo de vida de las series 0.7.x. Este documento describe nuevas características con respecto a 0.7.0
fr: Notez qu'un grand nombre de ces fonctionnalités ont été en fait introduites tout au long de la série de version 0.7x. Ce document décrit les nouvelles fonctionnalités comparativement à la version 0.7.0
pt_br: Note que muitas dessas funções foram de fato introduzidas durante o ciclo de vida da série 0.7.x. Este documento descreve novas funções comparadas à versão 0.7.0
uk: Зауважте, що багато з цих можливостей було насправді впроваджено під час створення послідовності випусків 0.7.x. У цьому ж документі описано нові можливості, які з'явилися з часу випуску 0.7.0.
