Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: More generally, you can now customize Comments-like columns, controlling how their headings are displayed in the Book details panel and also specifying what kind of data they contain (plain text, HTML or even Markdown)
fr: De manière plus générale, vous pouvez maintenant personnaliser les colonnes basées sur Commentaires, en contrôlant comment leurs en-têtes sont affichées dans le panneau de Détails du livre et également en spécifiant quel type de données elles contiennent (texte brut, HTML ou même Markdown)

source: Edit book: Function mode: Allow appending text to the end of the marked text when running function mode Search/replace on marked text
fr: Éditer le livre : mode Fonction : Permettre d'ajouter du texte à la fin du texte marqué lorsque le mode fonction rechercher/remplacer est exécuté sur le texte marqué

source: PDF output: Add a new variable _TOP_LEVEL_SECTION_ for use in header/footer templates that resolves to the current top-most section in the Table of Contents
fr: • Document PDF en sortie pour la conversion : Ajout d'une nouvelle variable _TOP_LEVEL_SECTION_ à utiliser dans les modèles en-tête/pied de page qui se règle à la section supérieure actuelle dans la Table des Matières

source: Linux/macOS: Shutdown gracefully on receiving the interrupt or terminate Unix signals
fr: Linux/macOS: calibre se ferme avec élégance lorsqu'il reçoit les signaux Unix interrompre ou terminer

source: PDF output: Fix a regression that caused the last page of a chapter to sometimes be dropped from the output
fr: Format PDF en sortie : Correction d'une régression qui empêchait parfois la création de la dernière page d'un chapitre dans le fichier de sortie

source: Do not show an error if the user tries to quit calibre while editing a cell in the book list. Instead, just silently abort the edit
fr: N'affiche plus une erreur si l'utilisateur essaie de quitter calibre pendant l'édition d'une cellule dans la liste de livres, il abandonne juste silencieusement l'édition

source: E-book viewer: Fix 0px margins and percentage margins not being respected when the option to override book margins is turned off
fr: Visionneuse de livre numérique : Solutionne le fait que les marges 0px et les marges en pourcentage ne soient pas respectées lorsque l'option pour écraser les marge du livre est désactivée

source: Book details: Do not show the 'Copy link' context menu item unless there is an actual link at the cursor location
fr: Détails du livre : N'affiche pas l'élément du menu contextuel 'Copier le lien' à moins qu'il n'y ait un lien véritable à l'emplacement du curseur

source: Get books: Update store plugin for nexto
fr: Obtenir des livres : Mise à jour de l'extension de la boutique nexto

source: News download: Allow controlling which periodicals are automatically sent to a specific email in Preferences-&gt;Sharing by email
fr: Téléchargement d'actualités : Permettre le contrôle de quels périodiques sont automatiquement envoyés à une adresse courriel spécifique dans Préférences-&gt;Partager des livres par courriel

source: Edit book: Update regex engine to support Unicode 9.0
fr: Éditer le livre : Mise à jour du moteur regex pour prendre en charge Unicode 9.0

source: Edit metadata dialog: Fix pasting ISBN from clipboard not stripping garbage characters after a valid ISBN
fr: Boîte de dialogue de modification des métadonnées : Solutionne le fait que coller l'ISBN à partir du presse-papiers ne retire pas les caractères inutiles après un ISBN valide

source: Edit book: Also refresh the Preview and Live CSS panels after performing any action that changes files other than the currently displayed file
fr: Éditer le livre : Rafraîchi également les panneaux de Prévisualisation et de CSS en direct après avoir effectué n'importe quelle action qui change les fichiers autres que celui actuellement affiché

source: E-book viewer: Fix the show metadata button not reading EPUB 3 metadata
fr: Visionneuse de livre numérique : Corrige le bouton d'affichage des métadonnées qui ne lit pas les métadonnées EPUB 3

source: MOBI output: Fix &lt;hr&gt; not being rendered as full-width in old MOBI files
fr: Document MOBI en sortie pour la conversion : Solutionne le fait que &lt;hr&gt; n'est pas restitué en tant que largeur complète dans les anciens fichiers MOBI

source: CSV catalog output: Fix incorrect formatting of is_multiple custom columns
fr: Catalogue de livres au format CSV : Solutionne le formatage incorrect des colonnes personnalisées is_multiple

source: CSV catalog output: Separate multiple authors with &amp; instead of comma. Fixes problems when the author name contains commas
fr: Catalogue de livres au format CSV : Sépare les auteurs multiples avec "&" à la place d'une virgule. Solutionne les problèmes lorsque le nom d'auteur contient des virgules

source: EPUB 3 metadata: Fix updating metadata in EPUB 3 files not overwriting existing authors
fr: Métadonnées EPUB3 : Solutionne le fait que la mise à jour des métadonnées dans les fichiers EPUB3 ne réécrive pas les auteurs existants

source: Fix duplicate detection when adding books not working when the book title has leading or trailing whitespace
fr: Solutionne la détection de doublons lors de l'ajout de livres qui ne fonctionne pas lorsque le titre du livre a un espace au début ou à la fin.

source: Book details panel: Pick the color used for links from the current system color theme
fr: Panneau de détails du livre : Prend la couleur utilisée pour les liens à partir du thème de couleur du système courant

source: Windows: Fix file selection dialogs blurry on HiDPI monitors
fr: Windows : Solutionne le fait que la boîte de sélection de fichiers soit floue sur les moniteurs HiDPI

source: EPUB metadata: Support for reading and writing EPUB 3 specific metadata. Now when processing EPUB 3 files, calibre will generate/use EPUB 3 specific metadata constructs when available, for example for series
fr: Métadonnées EPUB : Support de la lecture et de l'écriture des métadonnées spécifiques à l'EPUB3. Dorénavant, lors du traitement de fichiers EPUB3, calibre générera/utilisera la construction spécifique de métadonnées de l'EPUB3 lorsqu'elles sont disponibles, par exemple pour les séries

source: Recognize the newest Kindle model, that started shipping today
fr: Reconnaissance du tout nouveau modèle Kindle dont la vente à commencé aujourd'hui

source: Tag mapper: Allow specifying a space as the split character when creating a split tags rule
fr: Mappeur d'étiquette : Permettre de déterminer un espace comme caractère de séparation lors de la création d'une règle de séparation des étiquettes

source: Tag mapper: Fix upper case characters not working in 'contains' rules
fr: Mappeur d'étiquette : Solutionne le non fonctionnement des caractères majuscules dans les règles 'contains'

source: Smarten punctuation: Fix double dashes and triple dots being smartened even inside attribute values
fr: Ponctuation intelligente : Solutionne le fait que les doubles tirets et les trois petits points étaient modifiés même à l'intérieur de valeurs attribut

source: HTML input: Sanitize semi-colons from HTML filenames as they can cause problems with other EPUB consuming software
fr: • Document HTML en entrée pour la conversion : Assainir les points-virgules de noms de fichiers HTML, car ils peuvent causer des problèmes avec d'autres logiciels utilisant EPUB

source: EPUB input: Speed up reading of the book spine from the OPF file for books with a very large number of entries in the spine
fr: Document EPUB en entrée pour la conversion vers un autre format : Accélérer la lecture de la structure du livre à partir du fichier OPF pour les livres qui ont un très grand nombre d'entrées dans celle-ci

source: Edit book: Reports: Characters: Fix sorting by count and name not working
fr: Éditer le livre : Outils : Rapports : Caractères : Solutionne le fait que le tri par nom et nombre d’utilisations ne fonctionne pas

source: Fix Kobo Touch configuration migration not working for older settings
fr: Solutionne la migration de la configuration pour la KoboTouch qui ne fonctionne pas pour les anciens paramètres

source: Driver for FNAC (re-branded Bq) with new firmware
fr: • Pilote pour FNAC (rebaptisé Bq) avec un nouveau firmware

source: Edit book: Check Book: Add an auto fix action to remove all links to a missing resource (such as a deleted stylesheet) automatically
fr: Éditer le livre : Vérifier le livre : Ajout d'une action d'auto-réparation pour supprimer automatiquement tous les liens relatifs à une ressource manquante (Comme une feuille de style supprimée)

source: Edit book: Check Book: Fix incorrect handling of font family names with spaces in them that are not quoted
fr: Éditer le livre : Vérifier le livre : Solutionne une prise en charge incorrecte des familles de police avec espaces dans le nom de celles-ci qui n'est pas mis entre guillemets

source: E-book viewer: Fix Qt 5.7 breaking mouse wheel scrolling
fr: Visionneuse de livre numérique : Solutionne Qt5.7 qui endommage le défilement par la mollette de souris

source: Kobo driver: Fix a regression in the last release that broke connecting to older devices
fr: Pilote Kobo : Solutionne une régression dans la dernière version qui endommage la connexion avec les anciens appareils

source: Get books: Fix detection of book formats broken for the Legimi plugin by a website change
fr: Obtenir des livres : Solutionne la détection de formats de livres endommagée pour le plugin Legimi suite à un changement sur le site web

source: Update builtin metadata source Ozon.ru to handle website changes
fr: Mise à jour de la source de métadonnées intégrée ozon.ru pour prendre en charge des changements sur le site web

source: Font subsetting: Fix incorrect handling of fonts whose names are included in font rules without quotes
fr: Sous-ensemble de police : Solutionne la prise en charge incorrecte des polices dont les noms sont inclus, sans guillemets, dans une règle de police

source: Fix E-book viewer broken when running the binary calibre release on systems with very old versions of glibc
fr: Solutionne un dysfonctionnement de la visionneuse lors de l'exécution de la version binary de calibre sur des systèmes qui ont une très ancienne version de glibc

source: Edit metadata: In the drop down list for languages, show the five most recently used languages first
fr: Modifier les métadonnées : Dans la liste déroulante pour les langues, montrent les cinq langues les plus récemment utilisées en premier

source: Edit book: Check Book: Add a check for missing navigation documents in EPUB 3 books
fr: Éditer le livre : Vérifier le livre : Ajout d'une vérification pour les documents Navigation manquants dans les livres EPUB3

source: Kobo driver: Improved configuration dialog for the Kobo Touch device driver
fr: Pilote Kobo : Boîte de dialogue de configuration améliorée pour le pilote de périphérique KoboTouch

source: Copy to Library: Do not abort the copy process if only some books fail to copy, instead report which books failed and copy the rest
fr: Copie vers la bibliothèque : Ne pas interrompre le processus de copie si seulement certains livres échouent, rapporter plutôt quels livres ont échoué et copier le reste

source: News download: Make all relative links (those starting with /) absolute. Useful when reading on a device that supports web browsing
fr: Téléchargement d'actualités : Rendre tous les liens relatifs (ceux commençant par /) absolus. Utile lors de la lecture sur un appareil qui supporte la navigation web

source: EPUB metadata: Add an option to disable adding of cover images to EPUB files that declare no cover image in their metadata (Preferences-&gt;Plugins-&gt;Customize the Set EPUB metadata plugin)
fr: Métadonnées EPUB : Ajout d'une option pour désactiver l'ajout d'images de couverture aux fichiers EPUB qui ne déclarent aucune image de couverture dans leurs métadonnées (Préférences-&gt;Extensions-&gt;Personnaliser l'extension Set EPUB metadata)

source: ToC Editor: Fix ToC detection in EPUB 3 files with only an NCX and no nav not working
fr: Éditeur de TdM : Solutionne la détection de TdM dans les fichiers EPUB3 avec seulement un NCX et aucun nav fonctionnel

source: E-book viewer: In paged mode, when the window is toggled between full screen and window, repeatedly, preserve the position more accurately
fr: Visionneuse de livre numérique : En mode paginé, lorsque la fenêtre est basculée entre plein écran et fenêtre, à plusieurs reprises, rapidement, préserver la position plus précisément

source: E-book viewer: Fix incorrect page turning when multiple pages are displayed on screen for books that wrap all their content in a single 100% height tag
fr: Visionneuse de livre : Solutionne un changement de page incorrect lorsque plusieurs pages sont affichées à l'écran pour les livres qui enveloppent tout leur contenu en une seule balise height de 100%

source: Fix a regression that broke scheduling a new news download in timezones west of GMT
fr: Solutionne une régression qui endommage la planification d'un nouveau téléchargement d'actualités dans les fuseaux horaires à l'ouest de GMT

source: Edit book: Fix undocked Windows not resizable on macOS
fr: Éditer le livre : Solutionne le fait que les fenêtres non ancrées ne soit pas redimensionnables sous macOS

source: Fix a regression in 2.57 that broke rescaling of images to fit the output profile screen size during conversion
fr: Correction d'une régression apparue dans la version 2.57 qui cassait le redimensionnement des images lors de l'adaptation de celles-ci au profil d'écran de sortie pendant conversion.

source: Fix for file dialogs not working on Windows when non-ASCII environment variables are present
fr: Solution pour les boîtes de dialogue de fichiers ne fonctionnant pas sous Windows lorsque des variables d'environnement non-ascii sont présentes

source: HTML input: Fix error when converting HTML file with URL encoded filename
fr: Document HTML en entrée pour la conversion : Correction d'une erreur lors de la conversion d'un fichier HTML avec une URL codée dans le nom de fichier.

source: Amazon metadata download: Download the series information when available from Amazon.com
fr: Téléchargement des métadonnées Amazon : Télécharger les informations de la série lorsque disponibles sur amazon.com

source: Amazon metadata download: Recognize common patterns of embedding the series name after the title and remove it automatically
fr: Téléchargement des métadonnées Amazon : Reconnaissance des modèles communs d'intégration du nom de la série après le titre et les supprimer automatiquement

source: Edit book: Add support for EPUB 3 to the Table of Contents tool. Now when editing EPUB 3 files using the tool will automatically generate both the EPUB 3 navigation document and the NCX Table of Contents for backwards compatibility
fr: Éditer le livre : Ajout du support du format EPUB3 à l"outil Table des Matières. Dorénavant, lors de l'édition de fichiers EPUB3 à l'aide de l'outil celui-ci va automatiquement générer à la fois le document de navigation EPUB3 et la table des matières NCX pour la rétrocompatibilité

source: EPUB input: Implement reading of Table of Contents from EPUB 3 files that do not specify a fallback NCX ToC
fr: Format EPUB en entrée pour la conversion : Implémentation de la lecture de la Table des Matières des fichiers EPUB3 qui ne spécifient pas un repli NCX de la TdM

source: EPUB metadata: When setting a cover image for an EPUB file that has no metadata cover image defined, add the new cover image as a pure metadata cover instead of aborting
fr: Métadonnées EPUB : Lors de la définition d'une image de couverture pour un fichier EPUB qui n'a pas d'image de couverture de métadonnées définie, ajouter la nouvelle image de couverture en tant que pure couverture de métadonnées au lieu d'annuler

source: Fix crash on exit if any plugins have loaded code that raises exceptions during shutdown
fr: Correction d'un crash lors de la fermeture de calibre si des plugins ont chargé du code qui suscite des exceptions lors de celle-ci

source: Copy to library: Speed up checking for duplicates when copying multiple books to a large library
fr: Copie vers une bibliothèque: Accélérer la vérification des doublons lors de la copie de plusieurs livres vers une grande bibliothèque

source: Get books: Update Smashwords plugin for website changes
fr: Obtenir des livres : Mise à jour du plugin Smashwords suite à des changements sur le site web

source: Edit book: Fix a bug in the new text search facility that could cause searches to fail when searching from the current cursor position instead of the top of the file
fr: Éditer le livre : Correction d'un bug dans le nouvel utilitaire de recherche de texte qui pourrait entraîner l'échec des recherches lorsque celle-ci se font à partir de la position actuelle du curseur au lieu du début du fichier

source: Bulk conversion dialog: Fix page margin settings being ignored when converting to DOCX
fr: Boîte de dialogue de conversion par lot : Solutionne le fait que les paramètres de marge de page soient ignorés lors d'une conversion vers le format DOCX

source: Make the default shortcut for remove books Backspace on macOS since many mac keyboards have no delete key and the backspace key is labeled as delete
fr: Faire de Backspace le raccourci par défaut pour supprimer les livres sous OS X depuis que de nombreux claviers mac n'ont aucune touche de suppression et que la touche backspace est étiquetée supprimer

source: Edit book: Check Book: Do not warn if a cover image is not referenced in the text
fr: Éditer le livre : Vérifier le livre : Ne pas avertir si une image de couverture n'est pas référencée dans le texte

source: E-book viewer: Fix a bug that could cause incorrect rendering of chapter titles in some rare circumstances
fr: Visionneuse de livre numérique : Solutionne un bug qui pourrait causer un rendu incorrect des titres de chapitre dans certaines circonstances assez rares

source: Windows console output: Handle consoles with non black and white color scheme correctly
fr: Sortie console Windows : gestion correcte des palettes de couleur qui ne sont pas noires et blanches

source: Fix a regression in 2.57 that caused auto-removal of borders from covers to become much less proficient at detecting borders
fr: Solutionne une régression de la version 2.57 qui a provoqué que l'auto-suppression des bordures de couvertures soit devenue beaucoup moins efficiente que la détection des bordures

source: Fix a regression in 2.57 that broke gray scaling of images
fr: Solutionner une régression de la version 2.57 qui a cassé la mise en échelle de gris des images

source: Edit book: A text search tool to conveniently search for text even if it crosses multiple HTML tags (Search-&gt;Search ignoring HTML markup)
fr: Éditer le livre : Un outil de recherche de texte pour rechercher aisément du texte même s'il croise de multiples balises HTML (Rechercher-&gt;Rechercher en ignorant le balisage HTML)

source: macOS: Allow drag and drop of file onto viewer dock icon to view file
fr: macOS : Permettre le glisser et déposer d'un fichier sur l'icône de la visionneuse du "dock" pour afficher celui-ci

source: Workaround for incompatibility between Qt 5.5+ and Ubuntu that caused the context menu for the book list to flicker
fr: Solution pour l'incompatibilité entre Qt5.5+ et Ubuntu qui entraîne le vacillement du menu contextuel de la liste de livre

source: Windows: Workaround for explorer shell extensions on windows that write to stdout
fr: Windows : solution pour les extensions shell de l'explorateur sous Windows qui écrivent sur stdout

source: Edit book: When jumping to next occurrence of a word, take language into account
fr: Éditer le livre : Lors d'un saut vers la prochaine occurrence d'un mot, prendre la langue en considération

source: Edit book: Fix import of words into user dictionary not working
fr: Éditer le livre : Solutionne l'import des mots dans le dictionnaire utilisateur qui ne fonctionnait pas

source: Fix use of non-ASCII characters in identifiers causing an error when identifier rules are used
fr: Solutionne l'utilisation de caractères non-ascii dans les identifiants qui causait une erreur lorsque les règles pour identifiants sont utilisées

source: Fix a regression that caused the paste from clipboard button to paste two times in the Add books from ISBN dialog
fr: Solutionne une régression qui provoquait que coller à partir du bouton du presse-papiers à coller deux fois dans la boîte de dialogue Ajouter un livre à partir de l'ISBN

source: Fix for incompatibility with PyQt 5.6
fr: Solution pour une incompatibilité avec PyQt 5.6

source: Driver for the Bq Cervantes 3
fr: Pilote pour la liseuse Bq Cervantes 3

source: A new "Ornamental" cover design for the "Generate cover" feature
fr: Un nouveau design de couverture nommé "Ornemental" pour la fonctionnalité "Générer la couverture"

source: Windows: Use a helper process that does not load any calibre DLLs to display file open/save dialogs. This should fix most crashes caused by poorly designed Windows shell extensions
fr: Windows : Utilisation d'un processus d'aide qui ne charge aucune des DLLs calibre pour afficher les boîtes de dialogue ouvrir/enregistrer le fichier. Cela devrait corriger la plupart des accidents causés par des extensions Windows Shell mal conçues

source: Allow pressing Alt+O as a shortcut for click the OK button in the Add from ISBN dialog
fr: Permettre l'utilisation du raccourci Alt+O pour cliquer le bouton OK dans la boîte de dialogue "Ajouter à partir de l'ISBN"

source: Remove the calibre dependency on ImageMagick -- reduces calibre install size by ~ 15MB
fr: Suppression de la dépendance calibre sur ImageMagick -- réduit l'installation de calibre d'environ 15MB

source: Edit book: Add a new image filter: Normalize -- to improve the contrast in images
fr: Éditer le livre : Ajout d'un nouveau filtre d'image : Normaliser -- pour améliorer le contraste dans les images

source: Edit book: Add a filter to make images look like oil paintings
fr: Éditer le livre : Ajout d'un filtre pour faire en sorte que les images aient l'aspect d'une peinture à l'huile

source: Use 'Not rated' for zero stars in all rating spin boxes
fr: Utilisation de "Non évalué" pour les zéros étoiles dans toutes les boîtes d'évaluation

source: Edit book: Fix a crash in the Insert link tool if one of the HTML files contains an empty id
fr: Éditer le livre : Corrige un plantage dans l'outil "Insérer un lien" si l'un des fichiers HTML contient une id vide

source: Fix tag like custom columns not sorted when displayed in the Book details panel
fr: Solutionne les colonnes personnalisées sur le format étiquettes qui ne sont pas triées lorsqu'elles sont affichées dans le Panneau de détails du livre

source: Fix transient window shown during Edit book startup
fr: Solutionne la fenêtre transitoire montrée lors du démarrage d'"Éditer le livre"

source: Preserve booklist horizontal scroll position when merging books
fr: Préserver la position de défilement horizontal de la liste de livres lors de la fusion de livres

source: Google Images metadata download plugin: Fix error when searching for books with non-English characters in the title or author names
fr: Extension de téléchargement de métadonnées Google Images : Correction d'une erreur lors de la recherche de livres avec des caractères non anglais dans les noms de titre ou de d'auteur

source: Template language: Fix an error formatting dates when the underlying date does not have a day
fr: Modèle de langue : Correction d'une erreur du formatage des dates lorsque la date sous-jacente n'a pas de jour
