Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Content server: Fix links to external resources in book details and the viewer not working
pt_br: Servidor de conteúdo: Corrige links para recursos externos nos detalhes do livro e no visualizador não funcionando
uk: Сервер даних: виправлено посилання на зовнішні ресурси у подробицях щодо книги та непрацездатність переглядача.

source: Content server: Fix using a bookmark to load the book list not working if server is password protected.
pt_br: Servidor de conteúdo: Corrige o uso de marcador para carregar a lista de livros não funcionando se o servidor estiver protegido por senha.
uk: Сервер даних: виправлено помилку, пов'язану із тим, що використання закладки для завантаження списку книг не працювало, якщо сервер захищено паролем.

source: Content server: Book details page: Fix close button not going back to book list after using Next/previous buttons.
pt_br: Servidor de conteúdo: Página de detalhes do livro: Corrige o botão fechar não voltando para a lista de livros após usar os botões Próximo/Anterior.
uk: Сервер даних: сторінка подробиць щодо книги: виправлено помилку, пов'язану із тим, що кнопка закриття не повертала користувача до списку книг після використання кнопки далі/назад.

source: Kobo driver: Fix update device metadata setting not being saved. Also fix book language not being set correctly on newer firmware.
pt_br: Driver do Kobo: Corrige a configuração de atualizar os metadados do dispositivo não sendo salva. Também corrige o idioma do livro não sendo corretamente definido no novo firmware.
uk: Драйвер Kobo: виправлено помилку, пов'язану із тим, що оновлення параметра метаданих пристрою не зберігалося. Також виправлено помилку, пов'язану із тим, що мова книги встановлювалася неправильно, якщо використовувалася нова мікропрограма.

source: PDF Output: Fix 'stroke-dasharray' lines in SVG images in the input document not being rendered correctly.
pt_br: Saída PDF: Corrige linhas 'stroke-dasharray' em imagens SVG no documento de entrada não sendo renderizadas corretamente.
uk: Виведення до PDF: виправлено помилку, пов'язану із тим, що рядки stroke-dasharray у зображеннях SVG у вхідному документі не оброблялися належним чином.

source: Fix searching for authors on amazon not working because of a change in the amazon URL structure.
pt_br: Corrige busca por autores na Amazon não funcionando por conta de uma alteração na estrutura do URL da Amazon.
uk: Виправлено помилку, пов'язану із тим, що пошук авторів на amazon не працював через зміну у структурі адрес amazon.

source: Cover grid: Check for cover size change due to screen scale change on every paint event and invalidate cache if there is a change.
pt_br: Grade de capas: Verifica alteração no tamanho da capa devido a uma alteração na escala da tela em cada evento de pintura e invalida o cache se houver modificação.
uk: Таблиця обкладинок: реалізовано перевірку розмірів зображень обкладинок при зміні масштабів при кожній дії з малювання та скасування чинності кешу, якщо сталися зміни.

source: Edit book: Fix Option key + ; not working in the editor.
pt_br: Editar livros: Corrige tecla Opção + ; não funcionando no editor.
uk: Редагування книг: виправлено помилку, пов'язану із тим, що комбінація Option + ; не працювала у редакторі.

source: Edit book: Fix pasting images into a book with no Images folder not working correctly.
pt_br: Editar livros: Corrige a colagem de imagens em um livro sem pasta de imagens não funcionando corretamente.
uk: Редагування книг: виправлено вставлення зображень до книг без теки Images.

source: Confirm cancel on library restore dialog
pt_br: Confirma cancelamento no diálogo de restauração da biblioteca
uk: Реалізовано підтвердження скасування дії у вікні відновлення бібліотеки.

source: EPUB/MOBI Catalogs: Fix presets not being applied for some options.
pt_br: Catálogos EPUB/MOBI: Corrige predefinições não sendo aplicadas para algumas opções.
uk: Каталоги EPUB/MOBI: виправлено помилку, пов'язану із тим, що шаблони не застосовувалися до деяких параметрів.

source: Fix using --insert-metadata with ebook-convert not inserting the title and author metadata from the source document
pt_br: Corrige o uso de --insert-metadata com ebook-convert não inserindo os metadados de título e autor a partir do documento fonte
uk: Виправлено помилку, пов'язану із тим, що використання --insert-metadata у ebook-convert не призводило до вставлення метаданих заголовка та автора до початкового документа.

source: Adding books: When adding with auto-merge and auto-convert enabled, also run conversions for books into which the added files are merged.
pt_br: Adicionando livros: Ao adicionar com mesclagem automática e conversão automática habilitadas, também realizar conversões para cada um dos livros mesclados.
uk: Додавання книг: реалізовано запуск перетворень для книг, до яких об'єднуються або додаються файли за допомогою auto-merge та auto-convert.

source: Versions 3.41.1, 3.41.2, 3.41.3 fix various regressions in the previous release that affect a few people.
pt_br: Versões 3.41.1, 3.41.2, 3.41.3 corrigem várias regressões nas versões anteriores que afetavam algumas pessoas.
uk: У версіях 3.41.1, 3.41.2 та 3.41.3 виправлено різноманітні регресії у попередньому випуску, які було помічено декількома користувачами.

source: 08 Mar, 2019
pt_br: 08 de Março de 2019
uk: 8 березня 2019 року

source: TXT Input: Use markdown 3.0 with support for new extensions such as code highlighting and smarten punctuation.
pt_br: Entrada TXT: Uso de markdown 3.0 com suporte para novas extensões como realce de código e pontuação inteligente.
uk: Вхідні дані TXT: реалізовано використання markdown 3.0 із підтримкою нових розширень, зокрема підсвічування коду та кмітливої пунктуації.

source: Book details panel: Allow editing the identifiers for the book by right clicking on the existing Ids.
pt_br: Painel de detalhes do livro: Permite editar os identificadores do livro ao clicar com o botão direito em IDs existentes.
uk: Панель подробиць щодо книги: уможливлено редагування ідентифікаторів книги після клацання правою кнопкою миші на наявних ідентифікаторах.

source: Content server: Allow specifying custom URLs for the 'Search the internet' feature via Preferences-&gt;Sharing over the net-&gt;Search the internet.
pt_br: Servidor de conteúdo: Permite especificar URLs personalizadas para a função "Pesquisar na internet" via Preferências-&gt;Compartilhar pela rede-&gt;Pesquisar na internet.
uk: Сервер даних: уможливлено визначення нетипових адрес на сторінці «Шукати у інтернеті», яка викликається пунктом «Налаштування -&gt; Обмін мережею -&gt; Шукати у інтернеті».

source: Tag browser: Category editor: Add a checkbox to restrict the entries shown to only those present in the current Virtual library
pt_br: Navegador de etiquetas: Editor de categorias: Adiciona uma caixa de seleção para restringir as entradas exibidas apenas àquelas presentes na Biblioteca Virtual atual.
uk: Навігація мітками: редактор категорій: додано пункт для обмеження списку показаних записів лише тими, які є у поточній віртуальній бібліотеці.

source: Allow adding files to selected book records from the clipboard. To use copy a file from windows explorer, right click the Add books button and choose: Add files to selected books from clipboard
pt_br: Permite adicionar arquivos para registros de livros selecionados a partir da área de transferência. Para usar, copie um arquivo do windows explorer, clique com o botão direito na opção Adicionar livros e escolha: Adicionar livros para selecionar livros da área de transferência
uk: Уможливлено додавання файлів з буфера обміну даними до позначених записів книг. Щоб скористатися цією можливістю, скопіюйте книгу з Провідника у Windows, клацніть правою кнопкою миші на кнопці «Додати книги» і виберіть пункт додавання книг з буфера обміну.

source: Tag browser: When right clicking on a saved search add a menu option to search using the raw search expression.
pt_br: Navegador de etiquetas: Ao clicar com o botão direito em uma busca salva, adiciona uma opção no menu para pesquisar usando a expressão de pesquisa bruta.
uk: Навігація мітками: додано пункт меню для пошуку з використанням простого виразу пошуку до контекстного меню збережених критеріїв пошуку.

source: Tag browser: Have pressing the Enter key find the next match.
pt_br: Navegador de etiquetas: Pressionar a tecla Enter encontra a próxima ocorrência.
uk: Навігація мітками: уможливлено натискання клавіш Enter для пошуку наступного відповідника.

source: Windows: Add a button to Preferences-&gt;Sharing over the net to set calibre to run when the computer starts
pt_br: Windows: Adiciona um botão em Preferências-&gt;Compartilhar pela rede para configurar o calibre para se inicializar junto com o computador
uk: Windows: додано кнопку на панель «Налаштування -&gt; Обмін мережею» для налаштовування calibre на запуск під час запуску системи.

source: Fix a regression in the previous release that broke Copy to library and delete after when copying a duplicated book.
pt_br: Corrige uma regressão na versão anterior que danificou a função Copiar para biblioteca e deletar depois ao copiar um livro duplicado.
uk: Виправлено регресію у попередньому випуску, яка заважала копіюванню до бібліотеки і вилученню записів після копіювання дубліката книги.

source: Edit book: Fix pasting of image from clipboard using (Ctrl-V) not working
pt_br: Editar livro: Corrige erro na colagem de imagem da área de transferência (usando Ctrl+v)
uk: Редагування книг: виправлено помилку, пов'язану із тим, що не працювало вставлення зображення за допомогою Ctrl-V.

source: Content server: Fix {id} not working in the custom list template
pt_br: Servidor de conteúdo: Corrige {id} não funcionando no modelo de lista personalizado
uk: Сервер даних: усунено непрацездатність {id} у нетиповому шаблоні списку.

source: EPUB/MOBI Catalogs: Fix presets not saving title and format information.
pt_br: Catálogos EPUB/MOBI: Corrige predefinições não salvando informações de título e formato.
uk: Каталоги EPUB/MOBI: виправлено помилку, пов'язану із тим, що у шаблонах не зберігалися дані щодо назви і формату.

source: macOS: Respect the system setting for text insertion cursor blink time
pt_br: macOS: Respeita a configuração do sistema para tempo de intermitência do cursor de inserção de texto
uk: macOS: реалізовано підтримку врахування системного параметра частоти блимання для курсора вставлення тексту.

source: FB2 Output: Fix comments from the input document not present in the output.
pt_br: Saída FB2: Corrige comentários do documento de origem não estando presente no documento de saída.
uk: Виведення до FB2: виправлено помилку, пов'язану зі зникненням у вихідному документі коментарів із вхідного документа.

source: calibredb: Fix adding books with an OPF file to a remote server not picking up the cover specified in the OPF file
pt_br: calibredb: Corrige adição de livros com um arquivo OPF para um servidor remoto não selecionando a capa especificada no arquivo OPF
uk: calibredb: виправлено помилку, пов'язану із тим, що при додаванні книг на віддалений сервер за допомогою файла OPF не враховувалася обкладинка, яку було вказано у файлі OPF.

source: TXT Input: Fix option to remove indents at the start of lines breaking conversion of markdown documents.
pt_br: Entrada TXT: Corrige opção para remover recuos no começo de linhas danificando a conversão de documentos markdown.
uk: Вхідні дані TXT: виправлено помилку, пов'язану із тим, що вилучення відступів на початку рядків заважало перетворенню документів у форматі markdown.

source: EPUB/MOBI Catalog generation: Allow matching empty fields in exclusion rules.
pt_br: Geração de catálogos EPUB/MOBI: Permite correspondência de campos vazios nas regras de exclusão.
uk: Створення каталогу EPUB/MOBI: уможливлено врахування порожніх полів у правилах виключення.

source: EPUB/MOBI Catalogs: Fix multiple books with the same title but different authors in a genre not being listed.
pt_br: Catálogos EPUB/MOBI: Corrige múltiplos livros com o mesmo título, mas diferentes autores em um gênero não sendo listados.
uk: Каталоги EPUB/MOBI: виправлено помилку, пов'язану із тим, що у списку жанрів не показувалися пункти різних книг, які мають однакову назву або різних авторів.

source: Update the Get Books and metadata Amazon.com plugins to handle changes to the markup on the Amazon results page
pt_br: Atualiza os plugins Obter Livros e metadados da Amazon.com para lidar com alterações na marcação da página de resultados da Amazon
uk: Оновлено додатки отримання даних книг та метаданих Amazon.com з метою врахування змін у розмітці сторінки списку результатів Amazon.

source: Version 3.40.1 fixes a bug in 3.40 that could prevent calibre starting when using a custom date column
pt_br: Versão 3.40.1 corrige um erro na 3.40 que poderia evitar que o calibre se iniciasse ao usar uma coluna de data personalizada
uk: У версії 3.40.1 виправлено ваду версії 3.40, яка могла завадити запуску calibre, якщо використовувався нетиповий стовпчик дати.

source: 01 Feb, 2019
pt_br: 1º de Fevereiro de 2019
uk: 1 лютого 2019 року

source: Content server: Implement the "Copy to library" function. To use it click the three dots in the top right corner of a book's page and choose "Copy to library"
pt_br: Servidor de conteúdo: Implementa a função "Copiar para a biblioteca". Para usá-la, clique nos três pontos no canto superior direito da página do livro e escolha "Copiar para a biblioteca"
uk: Сервер даних: реалізовано функціональну можливість «Копіювати до бібліотеки». Щоб скористатися нею, натисніть кнопку з трьома крапками у верхньому правому куті сторінки книги і виберіть пункт «Копіювати до бібліотеки».

source: Content server: Add Next/Previous buttons to the book details page
pt_br: Servidor de conteúdo: Adiciona botões Próximo/Anterior na página de detalhes do livro
uk: Сервер даних: на сторінці подробиць щодо книги додано кнопки «Далі» і «Назад»

source: Content server: Fix editing metadata that affects multiple books causing all the metadata for all the books to become the same.
pt_br: Servidor de conteúdo: Corrige a edição de metadados que afeta múltiplos livros fazendo com que todos os metadados para todos os livros se tornem os mesmos.
uk: Сервер даних: виправлено помилку із редагуванням метаданих декількох книг; ця помилка призводила до того, що метадані усіх книг ставали однаковими.

source: Open With: Fix using .bat files as the program not working.
pt_br: Abrir com: Corrige falha ao usar arquivos .bat como o programa
uk: Відкриття за допомогою сторонньої програми: виправлено роботу файлів .bat, якщо відповідна програма не працює.

source: ZIP Output: Fix an error when building the ToC on macOS for some books with non-ASCII ToC entries
pt_br: Saída ZIP: Corrige um error ao construir o Índice no macOS para alguns livros com entradas não ASCII no Índice.
uk: Виведення даних у форматі ZIP: виправлено помилку, яка траплялася під час створення таблиці змісту у macOS для деяких книг із записами змісту, які містили символи поза таблицею ASCII

source: Edit book: Check book: Follow recent releases of epubcheck in expecting .ttf files to have the mime-type application/vnd.ms-opentype in EPUB 3 books
pt_br: Editar livro: Verificar livro: Segue o comportamento das últimas versões do epubcheck ao esperar que arquivos .ttf tenham mime-type application/vnd.ms-opentyp em livros EPUB3
uk: Засіб редагування книг: перевірка книг: синхронізовано із нещодавніми випусками epubcheck у сенсі того, що від файлів .ttf у книгах EPUB 3 очікується належність до типу MIME application/vnd.ms-opentype

source: Fix font mime-types not being auto-corrected when upgrading EPUBs from 2 to 3
pt_br: Corrige o mime-type de fontes não sendo automaticamente corrigidos ao fazer o upgrade de EPUBs da versão 2 para 3
uk: Виправлено помилку, пов'язану із тим, що програма не виправляла автоматично типи MIME шрифтів під час перетворення з EPUB версії 2 на EPUB версії 3

source: Content server: Try to detect if a book file has been edited outside of calibre and serve the updated copy
pt_br: Servidor de conteúdo: Tenta detectar se o arquivo de um livro foi editado fora do calibre e envia cópia atualizada
uk: Сервер даних: реалізовано спосіб виявлення внесення до книги змін з-поза меж calibre і подання оновленої копії книги

source: Fix merging books not updating author if the source book has no title
pt_br: Corrige fusão de livros não atualizando o autor se livro de origem não possuir título
uk: Виправлено помилку, пов'язану із тим, що під час об'єднання книг не оновлювалися дані щодо автора, якщо у початкової книги не було заголовка

source: Content server: Fix heading for custom comments columns being duplicated in the book details page
pt_br: Servidor de conteúdo: Corrige títulos de colunas personalizadas de comentários sendo duplicados na página de detalhes do livro
uk: Сервер даних: усунено дублювання заголовків стовпчиків нетипових коментарів на сторінці подробиць щодо книги

source: Fix editing of dates not working if the date format is set to iso.
pt_br: Corrige edição de datas não funcionando se o formato de data estiver definido como iso.
uk: Виправлено помилку, пов'язану із тим, що редагування даних не працювало, якщо для формату даних дати було встановлено варіант «ISO».

source: Version 3.39.1 fixes a bug in 3.39.0 that broke copy to library for books that have saved conversion options
pt_br: A versão 3.39.1 corrige um erro na versão 3.39.0 que danificou a função de copiar para a biblioteca para livros que possuem opções de conversão salvas
uk: У версії 3.39.1 виправлено ваду версії 3.39.0, яка заважала належному копіюванню до бібліотеки книг, для яких було збережено параметри перетворення.

source: 18 Jan, 2019
pt_br: 18 de Janeiro de 2019
uk: 18 січня 2019 року

source: Tag browser: When using the Find function have unaccented characters match their accented equivalents, if the setting for it is set in Preferences-&gt;Searching
pt_br: Navegador de etiquetas: Ao utilizar a função Procurar, faz com que caracteres não acentuados correspondam seus equivalentes acentuados, se esta opção estiver marcada em Preferências-&gt;Buscar
uk: Панель навігації мітками: реалізовано пошук символів із акцентами за їхніми неакцентованими відповідниками, якщо позначено відповідний пункт на сторінці «Налаштування -&gt; Пошук»

source: DOCX Input: When converting indices, put each sub-entry on its own line.
pt_br: Entrada DOCX: Ao converter índices, coloca cada sub-entrada na sua própria linha.
uk: Вхідні дані DOCX: при перетворенні індексів реалізовано розміщення кожного підлеглого запису на окремому рядку.

source: Edit book: Insert hyperlink: Add history for the template
pt_br: Editar livro: Inserir hyperlink: Adiciona um histórico para o modelo
uk: Засіб редагування книг: вставлення гіперпосилання: до шаблона додано журнал

source: Edit book: Insert hyperlink: Add a few more variables for the link template: _SOURCE_FILENAME_, _DEST_FILENAME_ and _ANCHOR_
pt_br: Editar livro: Inserir hyperlink: Adiciona mais algumas viaráveis para o modelo de link: _SOURCE_FILENAME_, _DEST_FILENAME_ e _ANCHOR_
uk: Засіб редагування книг: вставлення гіперпосилання: додано ще декілька змінних для шаблона посилання: _SOURCE_FILENAME_, _DEST_FILENAME_ та _ANCHOR_

source: Catalogs: Set the language of created catalogs to the calibre interface language instead of English
pt_br: Catálogo: Define o idioma do catálogo criado igual ao da interface do calibre, em vez de Inglês
uk: Каталоги: реалізовано встановлення мови створених каталогів за мовою інтерфейсу calibre замість англійської

source: DOCX Input: Do not display section breaks that have a numbering style applied to them.
pt_br: Entrada DOCX: Não mostra quebras de seção que possuam um estilo de numeração aplicado a elas.
uk: Вхідні дані у DOCX: усунено показ роздільників розділів, до яких застосовано стиль нумерування.

source: Content server: Fix listening on :: not also listening on IPv4 interfaces on Windows
pt_br: Servidor de conteúdo: Corrige o calibre monitorando em :: também não monitorar em interfaces IPv4 no Windows
uk: Сервер даних: виправлено помилку, пов'язану із тим, що очікування на дані на :: не призводило до очікування на інтерфейсах IPv4 у Windows

source: DOCX Output: Fix heading styles that have the same font size as body text getting incorrect font sizes after conversion.
pt_br: Saída DOCX: Corrige estilos de título que tenham o mesmo tamanho de fonte que o corpo do texto ficando com tamanho incorreto após a conversão.
uk: Виведення даних до DOCX: виправлено некоректне встановлення розміру шрифту після перетворення для стилів заголовків, розмір шрифтів у яких збігався із розміром шрифту у тексті.

source: EPUB/MOBI Catalogs: Fix prefix rules not working when calibre UI language is something other than English
pt_br: Catálogos EPUB/MOBI: Corrige regras de prefixo não funcionando quando o idioma de interface do calibre não é Inglês.
uk: Каталоги EPUB/MOBI: усунено непрацездатність правил префіксів, якщо для мови інтерфейсу calibre вибрана якась інша мова, окрім англійської

source: EPUB/MOBI Catalogs: Fix exclusion by tag not working for tags that have spaces in them
pt_br: Catálogos EPUB/MOBI: Corrige exclusão por etiqueta não funcionando para etiquetas que possuem espaços
uk: Каталоги EPUB/MOBI: відновлено працездатність виключення за міткою для міток із пробілами

source: Subset fonts: Fix error when trying to subset unicode characters that require two UTF-16 code points on Windows.
pt_br: Subconjunto de fontes: Corrige erro ao tentar subdividir caracteres unicodes que requerem dois pontos de código UTF-16 no Windows.
uk: Використання підмножин шрифтів: виправлено помилку при спробі використання підмножини символів Unicode, для представлення яких у Windows потрібні були дві позиції UTF-16.

source: Content server: Fix option to restrict displayed user field not working in the /opds view
pt_br: Servidor de conteúdo: Corrige opção para restringir exibição do campo do usuário não funcionando na visualização /opds
uk: Сервер даних: усунено непрацездатність параметра обмеження показаних полів користувача при перегляді /opds

source: Tag browser: Fix incorrect icon for user categories.
pt_br: Navegador de etiquetas: Corrige ícone incorreto para categorias do usuário
uk: Панель навігації мітками: виправлено помилкову піктограму для категорій користувача.

source: PDF Output: Fix conversion failing when fonts with non-English names are used.
pt_br: Saída PDF: Corrige conversão falhando quando são utilizadas fontes com nomes em outros idiomas além do Inglês.
uk: Виведення до PDF: виправлено помилку перетворення при використанні шрифтів, які містять символи поза англійською абеткою у назвах.

source: 3.38.1 fixes a typo in 3.38.0 that caused the Polish books function to not work when polishing small numbers of books
pt_br: 3.38.1 corrige um erro de digitação no 3.38.0 que fazia com que a função Polir Livros não funcionasse ao polir um pequeno número de livros
uk: У 3.38.1 виправлено друкарську помилку у версії 3.38.0, яка призводила до непрацездатності можливості удосконалення книг для незначного спектра книг.

source: 04 Jan, 2019
pt_br: 04 de Janeiro de 2019
uk: 4 січня 2019 року

source: Switch from cssutils to css_parser for parsing CSS. Fixes various minor, long standing bugs
pt_br: Muda de cssutils para css_parser para o processamento de CSS. Corrige vários pequenos erros existentes há muito tempo
uk: Перехід з cssutils до css_parser для обробки коду CSS. Це надало змогу виправити давні незначні вади
