Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Edit metadata dialog: Fix undo last trim not working for automatic trims.
es: Diálogo de modificación de metadatos: Se corrige el fallo por el que deshacer el último recorte no funcionaba con recortes automáticos.
pt_br: Caixa de diálogo de edição de metadados: Corrige desfazer última ação de aparar bordas não funcionando para aparar automaticamente.
uk: Вікно редагування метаданих: виправлено помилку, пов'язану із тим, що не працювало скасовування останнього обрізання при автоматичному обрізанні.

source: Content server: Fix series field blank in Italian translation
es: Servidor de contenidos: Se corrige el fallo por el que el campo de serie aparecía en blanco en la traducción italiana
pt_br: Servidor de conteúdo: Corrige campo de série em branco em traduções italianas
uk: Сервер даних: виправлено помилку, пов'язану із порожнім полем циклів у італійському перекладі

source: BeautifulSoup: Port fix from upstream for outputting bare ampersands in strings.
es: BeautifulSoup: Se aplica una corrección de la última versión para la salida de ampersands aislados en textos.
pt_br: BeautifulSoup: Correção de envio para saída de "&" puros no texto.
uk: BeautifulSoup: портовано виправлення з основної гілки розробки для виведення окремих амперсандів у рядках.

source: calibredb add: Run the input plugins before reading metadata instead of after.
es: calibredb add: Se ejecutan los complementos de entrada antes de leer los metadatos en lugar de después.
pt_br: Adição ao calibredb: Executa o plugin de entrada antes de ler os metadados, em vez de depois.
uk: Додавання до calibredb: реалізовано запуск додатків обробки вхідних даних до читання метаданих, а не після.

source: 04 May, 2018
pt_br: 04 de Maio de 2018
uk: 4 травня 2018 року

source: Book polishing: Add an option to upgrade EPUB 2 to EPUB 3
es: Pulido de libros: Se añade una opción para actualizar EPUB 2 a EPUB 3
pt_br: Polimento de livros: Adiciona uma opção para atualizar EPUB 2 para EPUB 3
uk: Удосконалення книг: додано пункт оновлення книг у EPUB 2 до EPUB 3

source: DOCX Input: Convert text written with dingbat fonts such as Wingding or Symbol correctly.
es: Entrada DOCX: Se convierte correctamente el texto con tipos de letra de florituras como Wingdings o Symbol
pt_br: Entrada DOCX: Converte texto escrito com fontes dingbat, como Wingding ou Symbol corretamente.
uk: Вхідні дані DOCX: реалізовано правильне перетворення тексту, записаного шрифтами dingbat на текст шрифтами Wingding або Symbol.

source: When choosing the page to use as a cover from a PDF file, add a button to render more pages, if needed
es: Al elegir la página que se usa como portada de un archivo PDF, se añade un botón para mostrar más páginas si es necesario
pt_br: Ao escolher a página para usar como capa de um arquivo PDF, adiciona um botão para renderizar mais páginas, se necessário
uk: На сторінку вибору сторінки, яку слід використати як зображення обкладинки у файлі PDF, додано кнопку показу додаткових сторінок, якщо це потрібно

source: TXT Input: Add support for embedded images that use relative URLs when converting markdown or textile. Note that this will only work if you are converting using the ebook-convert command line tool as the main calibre program moves files around, so relative references will not be valid.
es: Entrada TXT: Se añade soporte para imágenes incrustadas que usan URL relativos al convertir markdown o textile. Tenga en cuenta que esto sólo funciona si usa la herramienta de línea de órdenes ebook-convert, pues el programa principal de calibre mueve los archivos y las referencias relativas no serán válidas.
pt_br: Entrada TXT: Adiciona suporte para imagens incorporadas que usam URLs relativos ao converter markdown ou textile. Note que isso só irá funcionar se você estiver convertendo usando a ferramenta de conversão de linha de comando já que o programa principal do calibre move os arquivos de lugar, de tal forma que as referências relativas não serão válidas.
uk: Вхідні дані TXT: додано підтримку вбудованих зображень, для яких використовуються відносні адреси, у засобі перетворення файла у форматі markdown або textile. Зауважте, що таке перетворення працюватиме, лише якщо для нього використовується засіб командного рядка ebook-convert, оскільки основна програма calibre використовує інше компонування файлів, тому відносні посилання не працюватимуть.

source: Edit book: Insert special character: Add an option to select if searching should match all words or any of the words
es: Modificar libro: Insertar carácter especial: Se añade una opción para seleccionar si la búsqueda debe contener todas las palabras o cualquiera de ellas
pt_br: Editar livro: Inserir caractere especial: Adiciona uma opção para escolher se a busca deve encontrar todas as palavras ou qualquer uma das palavras
uk: Засіб редагування книг: на сторінку вставлення спеціальних символів додано пункт пошуку за будь-яким із вказаних користувачем слів

source: Edit book: Insert special character: When searching by name match prefixes in addition to whole words. So you can now type "horiz" to match "horizontal".
es: Modificar libro: Insertar carácter especial: Al buscar por nombre, buscar prefijos así como palabras completas. Ahora puede escribir «horiz» para buscar «horizontal».
pt_br: Editar Livro: Inserir caractere especial: Ao pesquisar pelo nome, encontra prefixos além de palavras inteiras. Assim, você digitar "horiz" para encontrar "horizontal".
uk: Засіб редагування книг: на сторінці вставлення спеціальних символів додано можливість пошуку за префіксом, а не лише цілими словами. Отже, ви можете ввести «horiz» для пошуку «horizontal».

source: Linux installer: Simplify the command used to install calibre and add support for Ubuntu 18.04 which is missing a default python executable
es: Instalador Linux: Se simplifica la orden usada para instalar calibre y se añade soporte para Ubuntu 18.04, que carece de ejecutable python predeterminado
pt_br: Instalador do Linux: Simplifica o comando utilizado para instalar o calibre e adiciona suporte para o Ubuntu 18.04, o qual não possui um executável python padrão
uk: Засіб встановлення у Linux: спрощено команду, яка використовується для встановлення calibre і додано підтримку для Ubuntu 18.04, де немає типового виконуваного файла python

source: When upgrading EPUB 2 to EPUB 3 add the 'epub' namespace to all HTML files, for convenience.
es: Al actualivar EPUB 2 a EPUB 3 se añade el espacio de nombres «epub» a todos los archivos HTML, por conveniencia.
pt_br: Ao atualizar de EPUB 2 para EPUB 3, adiciona o namespace do "epub" a todos os arquivos HTML, por conveniência.
uk: У засобі оновлення з EPUB 2 до EPUB 3 для зручності додано простір назв «epub» в усіх файлах HTML.

source: Kobo driver: Add an option to not maintain bookmarks/read status/etc. when resending a book already on the device.
es: Controlador Kobo: Se añade una opción para no mantener los marcadores, estado de lectura, etc. al volver a enviar un libro que ya está en el dispositivo.
pt_br: Driver do Kobo: Adiciona uma opção para não manter marcadores / status de leitura / etc. ao reenviar um livro que já está no dispositivo.
uk: Драйвер Kobo: додано пункт, який надає змогу не зберігати закладки, стан читання та інші дані книги, якщо її повторно надсилають на пристрій.

source: Edit Book: Fix an error caused by a landmark entry in EPUB 3 files that has an &lt;a&gt; tag without an href attribute.
es: Modificar libro: Se corrige un error causado por una entrada de hito en archivos EPUB 3 que tiene una etiqueta &lt;a&gt; sin atributo href.
pt_br: Editar Livro: Corrige um erro causado por uma entrada de landmark em arquivos EPUB 3 que tenha uma tag &lt;a&gt; sem um atributo href.
uk: Засіб редагування книг: виправлено помилку, яка спричинялася записом landmark у файлах EPUB 3, у якому містився теґ &lt;a&gt; без атрибута href.

source: Edit Book: Fix names for some control characters not being displayed in the status bar
es: Modificar libro: Se corrige el fallo por el que los nombres de algunos caracteres de control no se muestran en la barra de estado
pt_br: Editar livro: Corrige nomes para alguns caracteres de controle não sendo mostrados na barra de status.
uk: Засіб редагування книг: виправлено помилку, пов'язану із тим, що назви деяких керівних символів не могло бути показано на смужці стану

source: Searching: Fix A (B) not being treated as A AND (B)
es: Búsqueda: Se corrige el fallo por el que «A (B)» no se interpreta como «A Y (B)»
pt_br: Pesquisa: Corrige A (B) não sendo tratado como A E (B)
uk: Пошук: виправлено помилку, пов'язану із тим, що запис A (B) не оброблявся як A ТА (B)

source: DOCX Input: Ignore complex script font styles. Fixes conversion of documents that specify only complex script styles and no simple script styles.
es: Entrada DOCX: Se ignoran estilos de escrituras complejas. Se corrige la conversión de documentos que especifican sólo estilos de escrituras complejas y no estilos de escrituras sencillas.
pt_br: Entrada DOCX: Ignora estilos com fontes de script complexo. Corrige conversão de documentos que especificam apenas estilos de script complexo e nenhum estilo de script simples.
uk: Зхідні дані DOCX: реалізовано ігнорування складких стилів для шрифтів. Це надає змогу виправити перетворення документів, де визначаються лише складні стилі запису і немає простих стилів.

source: When updating EPUB 2 to EPUB 3 ensure only a single dc:date element is present in the OPF
es: Al actualizar EPUB 2 a EPUB 3, se asegura que hay un solo elemento dc:date presente en el OPF
pt_br: Ao atualizar EPUB 2 para EPUB 3, garante que apenas um único elemento dc:date esteja presente no OPF
uk: У засобі оновлення з EPUB 2 до EPUB 3 забезпечено створення єдиного елемента dc:date у OPF

source: 19 Apr, 2018
es: 19 abr, 2018
pt_br: 19 de Abril de 2018
uk: 19 квітня 2018 року

source: Edit book: Add a tool to upgrade books from EPUB 2 to EPUB 3 (Tools-&gt;Upgrade book internals)
es: Modificar libro: Se añade una herramienta para actualizar libros de EPUB 2 a EPUB 3 (Herramientas &gt; Actualizar código del libro)
pt_br: Editar livro: Adiciona uma ferramenta para fazer o upgrade de livros no formato EPUB 2 para EPUB 3 (Ferramentas-&gt;Upgrade do código interno do livro)
uk: Редагування книг: додано інструмент оновлення книг з формату EPUB 2 до формату EPUB 3 (Інструменти-&gt;Оновити внутрішні частини)

source: Automatically upgrades metadata, converts the NCX table of contents and adds required manifest annotations
es: Actualiza automáticamente los metadatos, convierte el índice NCX y añade las anotaciones requeridas al manifiesto
pt_br: Automaticamente atualiza os metadados, converte o índice NCX e adiciona detalhes requeridos no manifesto
uk: Автоматично оновлює метадані, перетворює таблицю вмісту NCX і додає потрібні анотації маніфесту.

source: Add support for the FBZ format (zipped FB2)
es: Se añade soporte para el formato FBZ (FB2 comprimido)
pt_br: Adiciona suporte para o formato FBZ (FB2 zipado)
uk: Додано підтримку формату FBZ (стисненого zip FB2)

source: Kindle driver: Change the height of generated thumbnails to 500px, needed for the Oasis 2017
es: Controlador Kindle: Se modifica la altura de las miniaturas generadas a 500px, necesario para el Oasis 2017
pt_br: Driver do Kindle: Altera a altura da miniatura gerada para 500px, necessária para o Oasis 2017
uk: Драйвер Kindle: зменено висоту створюваних мініатюр до 500 пікселів, потрібне для Oasis 2017

source: Edit book: When bulk renaming files add an option to rename by the order in which the files appear in the book.
es: Modificar libro: Al cambiar el nombre de archivos en masa, se añade una opción para hacerlo según el orden en que los archivos aparecen en el libro.
pt_br: Editar livro: Ao renomear arquivos em massa, adiciona uma opção para renomear pela ordem em que os arquivos aparecem no livro.
uk: Редагування книг: додано пункт у вікні пакетного перейменовування файлів для перейменовування відповідно до порядку, у якому файли з'являються у книзі.

source: Polishing: Recognize titlepages that are marked as covers in the EPUB 3 landmarks section
es: Pulido: Se reconocen las páginas de título marcadas como portadas en la sección de hitos EPUB 3
pt_br: Polimento: Reconhece folhas de rosto que estão marcadas como capas na seção de landmarks do EPUB 3.
uk: Удосконалення: додано розпізнавання титульних сторінок, які позначено як обкладинки у розділі позначок (landmarks) EPUB 3.

source: Edit Book: Automatically updated the modified timestamp in the OPF when saving EPUB 3 books.
es: Modificar libro: Se actualiza automáticamente la fecha de modificación en el OPF al guardar libros EPUB 3.
pt_br: Editar Livro: Atualiza automaticamente a data de modificação no OPF ao salvar livros EPUB 3.
uk: Редагування книг: реалізовано автоматичне оновлення зміненої позначки часу у OPF під час збереження книг EPUB 3.

source: Remove the ISBNDB metadata plugin as ISBNDB no longer allows free lookups.
es: Eliminado el complemento de metadatos ISBNDB, ya que ISBNDB ya no permite libre acceso de búsqueda.
pt_br: Remove o ISBNDB do plugin de metadados, uma vez que o ISBNDB não mais permite pesquisas livres.
uk: Вилучено додаток метаданих ISBNDB, оскільки у ISBNDB тепер заборонено безкоштовний пошук.

source: EPUB 3 metadata: If the book defines more than one author sort value for an author use the first instead of the last
es: Metadatos EPUB 3: Si el libro define más de un valor de orden de autor para un autor, se usa el primero en lugar del último.
pt_br: Metadados EPUB 3: Se o livro define mais de um nome de autor para arquivar, será usado o primeiro em vez do último
uk: Метадані EPUB 3: якщо у книзі визначено декілька авторів, реалізовано упорядковування запису авторів з першого запису, а не з останнього

source: Check Book: Dont warn for nav document not in spine in EPUB 3 books
es: Comprobar libro: No se muestra advertencia si el documento de navegación no está en el lomo para libros EPUB 3
pt_br: Verificar livro: Não alerta o fato de o documento de navegação não estar na lombada em livros EPUB 3
uk: Перевірка книг: усунено попередження щодо того, що документ nav перебуває поза основою книги у книгах EPUB 3

source: Linux installer: Fix umask question not working with the recommended install command because stdin is a pipe
es: Instalador Linux: Se corrige el fallo por el que la pregunta sobre umask no funciona con la orden de instalación recomendada, pues stdin es un «pipe»
pt_br: Instalador Linux: Corrige questão do umask não estar funcionando com comando de instalação recomendado porque stdin é um pipe
uk: Засіб встановлення у Linux: виправлено непрацездатність питання щодо umask для рекомендованої команди встановлення, враховано, що stdin є каналом передавання даних

source: Browser viewer: Show an error message when trying to use the Sync function without being logged in
es: Visor de navegador: Se muestra un mensaje al intentar usar la sincronización sin iniciar sesión
pt_br: Visualizador do navegador: Mostra uma mensagem de erro ao tentar usar a função de Sincronização sem estar logado
uk: Панель навігації: реалізовано показ повідомлення про помилку, якщо виконується спроба скористатися функцією синхронізації без входу до системи

source: When setting cover from a PDF file and the user clicks cancel, do not delete the existing cover
es: Al establecer la portada de un archivo PDF, si el usuario pulsa en cancelar, no se elimina la portada existente
pt_br: Ao definir a capa a partir de um arquivo PDF e o usuário clicar em cancelar, não deleta a capa existente
uk: Усунено вилучення наявної обкладинки, коли обкладинка встановлюється на основі файла PDF, а користувач натискає кнопку «Скасувати»

source: 06 Apr, 2018
es: 06 abr, 2018
pt_br: 06 de Abril de 2018
uk: 6 квітня 2018 року

source: Browser viewer: Allow showing the time left in the current chapter/book in the header and footer areas of the book.
es: Visor del navegador: Se permite mostrar el tiempo restante del capítulo o libro actual en las áreas de cabecera o pie de página.
pt_br: Visualizador do navegador: Permite exibir o tempo restante no capítulo/livro atual nas áreas do cabeçalho e rodapé do livro.
uk: Панель навігації: уможливлено показ часу до завершення читання поточної глави або книги у полях верхнього та нижнього колонтитулів книги.

source: To use go to the preferences of the browser viewer and customize the headers and footers to display the time left. Note that time left in chapter only works correctly if chapters are in separate HTML files in the book.
es: Para usarlo vaya a las preferencias del visor del navegador y personalice las cabeceras y pies para mostrar el tiempo restante. Tenga en cuenta que el tiempo restante del capítulo sólo funciona correctamente si los capítulos están en archivos HTML individuales en el libro.
pt_br: Para usar, vá até as Preferências do visualizador do navegador e personalize os cabeçalhos e rodapés para exibir o tempo restante. Note que o tempo restante no capítulo somente funciona corretamente se estes estiverem em arquivos HTML separados no livro.
uk: Щоб цим скористатися, відкрийте панель налаштовування панелі навігації і змініть верхні і нижні колонтитули так, щоб там було показано час. Зауважте, що час до завершення читання глави буде показано правильно, лише якщо глави є окремими файлами HTML у книзі.

source: Manage tags dialog: Searching now shows all matching tags and there is an undo button to undo changes.
es: Diálogo de administración de etiquetas: La búsqueda ahora muestra todas las etiquetas que coinciden y hay un botón para deshacer los cambios.
pt_br: Caixa de diálogo de gerenciamento de etiquetas: Pesquisar agora exibe todas as etiquetas correspondentes e há um botão desfazer para reverter alterações.
uk: Вікно керування мітками: під час пошуку тепер програма показує усі відповідні мітки, передбачено кнопку скасовування змін.

source: Add an output profile for the Kindle Oasis 2017
es: Se añade un perfil de salida para el Kindle Oasis 2017
pt_br: Adiciona um perfil de saída para o Kindle Oasis 2017
uk: Додано профіль виведення даних на Kindle Oasis 2017

source: Content server: Fix adding/deleting books and editing metadata not updating the main calibre book list automatically.
es: Servidor de contenidos: Se corrige el fallo por el que al añadir o eliminar libros o modificar metadatos no se actualizaba automáticamente la lista de libros de calibre.
pt_br: Servidor de conteúdo: Corrige adicionar/deletar livros e editar metadados não atualizando a lista de livros principal do calibre automaticamente.
uk: Сервер даних: виправлено додавання і вилучення книг та редагування метаданих. Раніше наслідки цих дій не з'являлися автоматично у основному списку книг calibre.

source: Viewer: When doing a dictionary lookup, remove soft hyphens from the word, if any are present.
es: Visor: Al realizar una búsqueda de diccionario se eliminan los guiones opcionales de la palabra, si hay alguno.
pt_br: Visualizador: Ao pesquisar no dicionário, remove hifens opcionais da palavra, se houver algum presente.
uk: Засіб перегляду: реалізовано вилучення м'яких переносів з критерію пошуку під час пошуку у словнику.

source: Edit metadata dialog: Fix tab order for buttons to the left of the title and author
es: Diálogo de modificación de metadatos: Se corrige el orden de tabulación para los botones a la izquierda del título y del autor
pt_br: Caixa de diálogo de edição de metadados: Corrige ordem de seleção via TAB para botões à esquerda do título e autor.
uk: Вікно редагування метаданих: виправлено порядок вкладок для кнопок ліворуч від полів заголовка та автора.

source: Trim cover dialog: Remove the redundant Trim &amp; OK button, instead have the OK button trim automatically if there is a selection.
es: Diálogo de recortar portada: Se elimina el botón Recortar y aceptar por redundante, en su lugar el botón Aceptar recorta automáticamente si hay una selección.
pt_br: Caixa de diálogo de aparar capa: Remove os redundantes botões Aparar &amp; OK. Ao contrário, o botão OK apara automaticamente se houver uma seleção.
uk: Вікно обрізання обкладинок: вилучено зайву кнопку «Обрізати». Її роль виконає кнопка «Гаразд», натискання якої призведе до виконання відповідної дії автоматично, якщо змінено якийсь із параметрів.

source: Update Amazon metadata plugin for a website change
es: Actualizado el complemento de metadatos Amazon por un cambio en el sitio web.
pt_br: Atualiza o plugin de metadados da Amazon para uma mudança do website
uk: Оновлено додаток метаданих Amazon відповідно до змін на сайті.

source: Content server: Fix translations not being updated without clearing the browser cache
es: Servidor de contenidos: Se corrige el fallo por el que las traducciones no se actualizaban sin limpiar el caché del navegador
pt_br: Servidor de conteúdo: Corrige traduções não sendo atualizadas sem limpar o cache do navegador
uk: Сервер даних: виправлено помилку, яку було пов’язано із тим, що переклади не оновлювалися без спорожнення кешу програми для перегляду інтернету.

source: Content server: Fix switching from translations to no translations not working
es: Servidor de contenidos: Se corrige el fallo por el que el cambio de traducciones a sin traducción no funcionaba
pt_br: Servidor de conteúdo: Corrige troca de traduções para sem traduções não funcionando
uk: Сервер даних: виправлено помилку, пов'язану із тим, що перемикання зі стану із перекладом до стану без перекладу не працювало.

source: Content server: When updating interface data do not transmit translations if they have not been changed. Saves ~30-60KB bandwidth when using non-English interface language.
es: Servidor de contenidos: Al actualizar los datos de interfaz no se transmiten las traducciones si no se han modificado. Esto ahorra ~30-60KB de ancho de banda al usar un idioma de interfaz distinto del inglés.
pt_br: Servidor de conteúdo: Ao atualizar os dados da interface, não transmitir traduções se elas não tiverem sido alteradas. Reduz de 30 a 60KB de banda ao usar interface em outros idiomas além do Inglês.
uk: Сервер даних: усунено передавання перекладів, якщо вони не оновлювалися, під час оновлення даних інтерфейсу. Заощаджує ~30-60 кБ переданих даних, якщо використовується неанглійська мова інтерфейсу.

source: 23 Mar, 2018
pt_br: 23 de Março de 2018
uk: 23 березня 2018 року

source: Content server: Allow editing the metadata of books from the book details page
es: Servidor de contenidos: Se permite modificar los metadatos de los libros en la página de detalles del libro
pt_br: Servidor de conteúdo: Permite editar os metadados dos livros a partir da página de detalhes do livro
uk: Сервер даних: уможливлено редагування метаданих книг за допомогою сторінки подробиць щодо книги

source: On the book details page, you can now edit any metadata and change covers by clicking the edit metadata icon in the right area of the top bar. Note that only users that have write permissions for the library can edit metadata.
es: En la página de detalles del libro, ya se puede modificar cualquier metadato y cambiar portadas pulsando el icono de modificar metadatos a la derecha de la barra superior. Tenga en cuenta que sólo los usuarios con permiso de escritura para la biblioteca pueden modificar medatados.
pt_br: Na página de detalhes do livro, agora você pode editar qualquer metadado e mudar capas ao clicar no ícone de edição de metadados no lado direito da barra superior. Note que apenas usuários que possuem permissão de escrita para a biblioteca podem editar os metadados.
uk: На сторінці подробиць щодо книги ви можете редагувати будь-які метадані і змінювати зображення обкладинки натисканням піктограми редагування метаданих у правій частині верхньої панелі. Зауважте, що редагувати метадані можуть лише користувачі із доступом на запис до бібліотеки.
