Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Conversion: Fix heuristics processing incorrectly removing some &lt;br&gt; tags.
es: Conversión: Corregido el procesado heurístico que eliminaba de manera incorrecta algunas etiquetas &lt;br&gt;.
fr: Conversion : Solutionne le fait que heuristique traite incorrectement la suppression de certaines balises &lt;br&gt;
pt_br: Conversão: Corrige processamento heurístico removendo incorretamente algumas tags &lt;br&gt;.
uk: Перетворення: виправлено помилку, пов’язану із тим, що засіб евристичної обробки помилково вилучав деякі мітки &lt;br&gt;.

source: Handle non-ASCII binary strings in the author_name_prefix/suffix tweaks.
es: Se emplean textos no ASCII en los ajustes «author_name_prefix» y «author_name_suffix».
fr: Gestion des caractères binaires non-ASCII dans les champs author_name_prefix/suffix.
pt_br: Lida com strings binárias não-ASCII nos ajustes author_name_prefix/sufix.
uk: Реалізовано обробку двійкових рядків поза ASCII у коригуваннях author_name_prefix/suffix.

source: Server: Allow logged in users to change their passwords by clicking the user icon in the top right corner of the home screen.
es: Servidor: Permitir que los usuarios conectados cambien su contraseña pulsando en el icono de usuario en la esquina superior derecha de la página principal.
fr: Serveur : Permettre aux utilisateurs connectés de changer leur mot de passe en cliquant l'icône utilisateur dans le coin supérieur droit de la page d'accueil
pt_br: Servidor: Permite usuários logados alterarem suas senhas ao clicar no ícone do usuário no canto superior direito da tela inicial.
uk: Сервер: уможливлено зміну пароля користувачами системи, для цього достатньо натиснути піктограму користувача у верхньому правому куті домашньої сторінки.

source: macOS: Add headless support: calibre command-line utilities can now run on macOS machines without a screen
es: macOS: Soporte sin pantalla añadido: las herramientas de línea de órdenes de calibre pueden ejecutarse ahora en equipos macOS sin pantalla.
fr: macOS : Ajout du support des services calibre en ligne de commande qui peuvent être maintenant exécutés sans un écran
pt_br: macOS: Adiciona suporte headless: Os utilitários de linha de comando do calibre podem agora rodar em máquinas com macOS sem uma tela.
uk: macOS: додано підтримку систем без монітора: програми командного рядка calibre можна запускати на комп’ютерах під керуванням macOS, які не обладнано дисплеєм.

source: 3.2.1 has a fix for an issue that broke mouse wheel scrolling in the cover grid view
es: 3.2.1 corrige un fallo que afectaba al desplazamiento con la rueda del ratón en la vista de cuadro de portadas
fr: La version 3.21 contient une solution pour un problème qui empêche le défilement par la mollette de la souris dans la vue grille de couverture
pt_br: 3.2.1 corrige um erro que danificou a rolagem via mouse na visualização de grade de capas
uk: У 3.2.1 виправлено ваду, пов’язану із тим, що не працювало гортання коліщатком миші на панелі перегляду таблиці обкладинок

source: Viewer: Fix incorrect display of pages in paged mode for books that override the box-sizing CSS property on the &lt;body&gt; element.
es: Visor: Corregida la visualización incorrecta de páginas en modo paginado de libros que sustituyen la propiedad CSS «box-sizing» en el elemento &lt;body&gt;.
fr: Visionneuse : Solutionne l'affichage incorrect en mode paginé pour les livres qui dépassent la propriété CSS box-sizing sur l'élément &lt;body&gt;
pt_br: Visualizador: Corrige exibição incorreta de páginas no modo paginado para livros que substituem a propriedade CSS de dimensionamento de caixa do elemento &lt;body&gt;.
uk: Переглядач: виправлено помилковий показ сторінок у режимі поділу на сторінки для книг, у яких перевизначено властивість розміру блоку у коді CSS елемента &lt;body&gt;.

source: Server: Fix timeout errors when using SSL (particularly common when running the server on windows)
es: Servidor: Corregidos errores de excesivo tiempo de espera usando SSL (especialmente corrientes al ejecutar el servidor en Windows)
fr: Serveur : Solutionne les erreurs d'arrêt lors de l'utilisation de SSL (particulièrement présentes lors de l'exécution du serveur sous Windows)
pt_br: Servidor: Corrige erros de tempo limite ao usar SSL (particularmente comum ao rodar o servidor no Windows)
uk: Сервер: виправлено помилки, пов’язані із перевищенням часу очікування, якщо використовується SSL (зокрема помилки, які часто виникали на серверах у Windows)

source: Linux: Fix slow mouse wheel scrolling in Cover grid because of Qt bug
es: Linux: Corregido el desplazamiento lento con la rueda del ratón en el cuadro de portadas debido a un error de Qt
fr: Linux : Solutionne le fait que le défilement par la molette de la souris soit lent dans la Grille de couverture à cause d'un bogue QT
pt_br: Linux: Corrige rolagem do mouse lenta na visualização de grade de capas por conta de um bug do Qt
uk: Linux: виправлено повільне гортання за допомогою миші у таблиці обкладинок, яке було спричинено вадою у Qt

source: Blacklist the iOS Reader applications and Marvin XD plugins as they were preventing calibre from starting up and they have not worked in a long time anyway, since Apple restricted USB access to their iOS devices
es: Añadidos en la lista negra las aplicaciones iOS Reader y los complementos Marvin XD, ya que evitan que calibre se inicie y hace mucho tiempo que no funcionan, desde que Apple restringió el acceso USB a los dispositivos iOS
fr: Mise en liste noire des extensions iOS Reader applications et Marvin XD du fait qu'elles empêchent calibre de démarrer et ne fonctionnent plus depuis longtemps de toute façon, depuis que Apple a restreint l'accès USB à ses périphériques iOS
pt_br: Bloqueio dos plugins de aplicativos de leitura iOS e Marvin XD pois estavam impedindo o calibre de iniciar e eles já não funcionavam há um bom tempo, uma vez que a Apple restringiu o acesso USB aos seus dispositivos iOS.
uk: Додано до «чорного» списку програми iOS Reader та додатки Marvin XD, оскільки вони заважають запуску calibre і вже давно непрацездатні, оскільки Apple обмежила доступ за допомогою USB до пристроїв під керуванням iOS

source: Fix for in-program restart not working on some Windows 10 Home machines
es: Corregido un fallo que hacía que el reinicio desde el programa no funcionara en algunos equipos Windows 10 Home
fr: Solutionne le fait que le redémarrage du programme ne fonctionne pas sur certaines machines Windows 10 Home
pt_br: Corrige erro de reinício do programa em alguns equipamentos com Windows 10 Home
uk: Усунено проблеми із перезапуском на деяких комп’ютерах під керуванням Windows 10 Home

source: EPUB3 metadata: Fix handling of &lt;dc:creator&gt; elements with multiple roles.
es: Metadatos EPUB3: Corregida la gestión de elementos &lt;dc:creator&gt; con varias participaciones.
fr: Métadonnées EPUB3 : Solutionne la prise en charge des éléments &lt;dc:creator&gt; avec de multiples rôles.
pt_br: Metadados EPUB3: Corrige o tratamento de elementos &lt;dc:creator&gt; com múltiplos 'roles'.
uk: Метадані EPUB3: виправлено обробку елементів &lt;dc:creator&gt; із декількома ролями.

source: Server: Disallow client initiated SSL renegotiation
es: Servidor: No se permite la renegociación SSL iniciada por el cliente
fr: Serveur : Rejet de la renégociation SSL initiée par le client
pt_br: Servidor: Não permitir renegociação SSL iniciada pelo cliente
uk: Сервер: заборонено повторне узгодження SSL з ініціативи клієнта

source: Windows: Try to prevent windows from showing the annoying 'no disk in drive' error messages at calibre startup if one of the calibre libraries is on a removable disk that is missing from the system
es: Windows: Tratar de evitar que Windows muestre mensajes de error de «no hay disco en la unidad» al iniciar calibre si una de las bibliotecas de calibre está en en una unidad extraíble que no está conectada al equipo.
fr: Windows : Essayer d'empêcher Windows d'afficher le désagréable message d'erreur 'pas de disque dans le lecteur' au démarrage de calibre si l'une des bibliothèques calibre se trouve sur un disque amovible qui est absent du système
pt_br: Windows: Tenta impedir que o windows mostre mensagens de erro irritante de 'sem disco na unidade' na inicialização do calibre se uma das bibliotecas do calibre está em um disco removível que está ausente do sistema.
uk: Windows: зроблено спробу запобігти появі набридливих повідомлень «у пристрої немає диска» під час запуску calibre, якщо одну з бібліотек calibre було розміщено на портативному диску, який не з’єднано із системою

source: Edit metadata dialog: Allow right clicking the Paste ISBN button to instead paste an identifier with a different prefix.
es: Cuadro de modificación de metadatos: Se permite pulsar con el botón derecho en el botón «Pegar ISBN» para insertar un identificador con otro prefijo.
fr: Boîte de dialogue d'édition des métadonnées : Permet de faire un clic droit sur le bouton Coller ISBN pour y coller à la place un identifiant avec un autre préfixe.
pt_br: Diálogo de edição de metadados: Permite clique com o botão direito no botão Colar ISBN para colar um identificador com um prefixo diferente.
uk: Діалогове вікно редагування метаданих: уможливлено вставлення ідентифікатора з іншим префіксом у відповідь на клацання правою кнопкою миші на кнопці «Вставити ISBN».

source: Tag browser: Add an option to control the spacing between items
es: Explorador de etiquetas: Se añade una opción para controlar el espacio entre elementos
fr: Navigateur d'étiquettes : Ajout d'une option pour contrôler l'espace entre les éléments
pt_br: Navegador e etiquetas: Adiciona uma opção para controlar o espaçamento entre itens
uk: Навігатор мітками: додано можливість керування інтервалом між записами

source: Add an option in Preferences-&gt;Look &amp; feel to show individual layout buttons in the status bar, as was the case in calibre 2.x
es: Se añade una opción en Preferencias &gt; Apariencia para mostrar botones de distribución individuales en la barra de estado, como era el caso en calibre 2.x
fr: Ajout d'une option dans Préférences-&gt;Apparence et présentation pour afficher des boutons à la disposition individuelle dans la barre d'état, comme c'était le cas dans calibre 2.x
pt_br: Adiciona uma opção em Preferências-&gt;Aparência para mostrar botões individuais de layout na barra de status, como era no calibre 2.x
uk: Додано пункт для показу окремих кнопок компонування на смужці стану на сторінці «Налаштування-&gt;Вигляд та поведінка», як це було у calibre 2.x

source: Edit metadata dialog: Add buttons to easily set/clear Yes/no columns
es: Cuadro de modificación de metadatos: Se añaden botones para establecer o limpiar rápidamente las columnas de sí o no
fr: Boîte de dialogue d'édition des métadonnées : Ajout de boutons pour facilement définir/effacer les colonnes Oui/non
pt_br: Diálogo de edição de metadados: Adiciona botões para facilmente definir/limpar colunas sim/não.
uk: Діалогове вікно редагування метаданих: додано кнопки для спрощення встановлення або спорожнення значень у стовпчиках «Так/Ні»

source: Support for RAR 5.0 format RAR and CBR files
es: Soporte para el formato RAR 5.0 en archivos RAR y CBR
fr: Prise en charge du format RAR 5.0 et des fichiers CBR
pt_br: Suporte para o formato RAR 5.0 para arquivos RAR e CBR
uk: Підтримка формату RAR 5.0 для файлів RAR і CBR

source: Version 3.1.1 fixes a regression in 3.1.0 that prevented the standalone calibre-server.exe from working on Windows and macOS
es: La versión 3.1.1 corrige una regresión en 3.1.0 que hacía que el programa independiente calibre-server.exe no funcionara en Windows y macOS
fr: La version 3.1.1 solutionne une régression dans 3.1.0 qui empêchait le calibre-server.exe autonome de fonctionner sous Windows et macOS
pt_br: A versão 3.1.1 corrige uma regressão na versão 3.1.0 que impedia o funcionamento do calibre-server.exe individualmente no Windows e macOS
uk: У версії 3.1.1 виправлено регресію версії 3.1.0, яка заважала окремому файлу calibre-server.exe працювати у Windows і macOS

source: Content server: Fix various bugs in the SSL implementation causing aborted transfers when enabling SSL in the server
es: Servidor de contenidos: Corregidos varios errores en la implementación SSL que ocasionaban interrupciones en las transferencias al activar SSL en el servidor
fr: Serveur de contenu : Solutionne différents bogues dans l'implémentation SSL entraînant l'interruption de transferts lors de l'activation de SSL du serveur
pt_br: Servidor de conteúdo: Corrige vários erros na implementação SSL causando transferências abortadas ao habilitar o SSL no servidor
uk: Сервер даних: виправлено різноманітні вади у реалізації SSL, які спричиняли переривання передавання даних при вмиканні SSL на сервері

source: Content server: Fix connections not being closed after errors/timeouts on the server side
es: Servidor de contenidos: Arreglado el fallo por el que las conexiones no se cerraban tras errores o desconexiones por parte del servidor
fr: Serveur de contenu : solutionne le fait que les connexions ne soient pas fermées après des erreurs/temporisations côté serveur
pt_br: Servidor de conteúdo: Corrige conexões não sendo encerradas após erros/tempo excedido no lado do servidor
uk: Сервер даних: виправлено помилку, яку було пов’язано із тим, що з’єднання не розривалися після повідомлень про помилки або перевищення часу очікування з боку сервера

source: Fix an error during startup on Windows systems where the home directory is in a character encoding different from the system encoding
es: Arreglado un error durante el inicio en sistemas Windows por el que el directorio principal tiene una codificación de caracteres diferente de la del sistema
fr: Solutionne une erreur pendant le démarrage sur des systèmes Windows où le répertoire personnel est dans un codage des caractères différent de celui du codage système
pt_br: Corrige um erro durante a inicialização de sistemas Windows onde a pasta home tem nome com codificação de caractere diferente da codificação do sistema
uk: Виправлено помилку під час запуску у системах Windows, яку було пов’язано із тим, що кодування символів у домашньому каталозі відрізнялося від загальносистемного кодування символів

source: Edit book: Fix escaping of text for regular expression searches unnecessarily escaping spaces
es: Modificar libro: Corregido el escape innecesario de espacios al adaptar texto para búsquedas con expresiones regulares
fr: Éditer le livre : Solutionne l'échappement inutile du texte pour les recherches en expression régulière
pt_br: Editar livro: Corrige buscas com expressões regulares pulando espaços desnecessariamente
uk: Редагування книги: виправлено екранування тексту для пошуку за формальними виразами (зайве екранування пробілів)

source: Get Books: Search the entire catalog, including restricted books
es: Obtener libros: Se busca el catálogo completo, incluidos los libros restringidos
fr: Obtenir des Livres : Recherche dans l'entièreté du catalogue, incluant les livres réservés à un public averti
pt_br: Obter livros: Pesquisa o catálogo inteiro, incluindo livros restritos
uk: Отримання книг: реалізовано пошук в усьому каталозі, зокрема у книгах із обмеженим доступом

source: Fix regression in previous release that caused the Tag browser view to jump around when renaming items
es: Corregida una regresión en versiones anteriores que hacía que la vista del explorador de etiquetas diera saltos al cambiar el nombre de los elementos
fr: Solutionne une régression dans la version précédente qui entraîne le fait que la vue Navigateur d'étiquettes tressaute quand on renomme des éléments
pt_br: Corrige regressão na versão anterior que fazia com que a visualização do Navegador de etiquetas saltasse ao renomear itens
uk: Усунено регресію у попередньому випуску, яка призводила до переходу між записами під час перейменування на панелі перегляду міток

source: Splash screen: Fix text vertical overlap for some systems/font sizes
es: Pantalla de inicio: Corregido el solapamiento vertical en algunos sistemas o tamaños de letra
fr: Écran de démarrage : Solutionne un chevauchement vertical du texte pour certains systèmes/tailles de police
pt_br: Tela de abertura: Corrige texto se sobrepondo na vertical para alguns sistemas/tamanho de fontes
uk: Вікно вітання: виправлено перекриття вертикального тексту у деяких системах за певних розмірів шрифту

source: Server: --daemonize option should not be present on Windows and macOS as it does not work on those platforms
es: Servidor: la opción --daemonize no debería aparecer en Windows y macOS, pues no funciona en estas plataformas
fr: Serveur : l'option --daemonize ne devrait pas être présente sur Windows et macOS vu qu'elle ne fonctionne pas sur ces plateformes
pt_br: Servidor: opção --daemonize não deve estar presente no Windows e no macOS, uma vez que ela não funciona nestas plataformas
uk: Сервер: параметра --daemonize у Windows і macOS не повинно бути, оскільки у цих системах він не працює

source: macOS: Fix some keyboard shortcuts not working in calibre 3.0
es: macOS: Corregidos los atajos de teclado, que no funcionaban en calibre 3.0
fr: macOS : Solutionne le fait que certains raccourcis claviers ne fonctionnent pas dans calibre 3.0
pt_br: macOS: Corrige alguns atalhos de teclado não funcionando no calibre 3.0
uk: macOS: виправлено непрацездатність деяких клавіатурних скорочень у calibre 3.0

source: Server interface: Fix error in the Browse all downloaded page when the book list mode is set to detailed list
es: Interfaz del servidor: Corregido un error en la página Explorar todos los descargados cuando el modo de la lista de libros es lista detallada.
fr: Interface serveur : Solutionne une erreur dans Parcourir toutes les pages téléchargées quand le mode liste de livre est paramétrer à liste détaillées
pt_br: Interface do servidor: Corrige um erro na visualização de todos os livros baixados quando o modo de lista está definido como lista detalhada
uk: Інтерфейс сервера: виправлено помилку на сторінці перегляду усіх отриманих даних, пов’язану із тим, що режим перегляду списку книг перетворювався на режим докладного списку

source: Get books: Update amazon.fr and ebooks.com plugins for website changes
es: Obtener libros: Actualizados los complementos de amazon.fr y ebooks.com según los cambios en la web
fr: Obtenir les livres : Mise à jour des extensions amazon.fr et ebooks.com suite à des changements sur le site
pt_br: Obter livros: Atualiza os plugins da amazon.fr e do ebooks.com, por conta de alterações nos sites
uk: Отримання книг: оновлено додатки amazon.fr і ebooks.com відповідно до змін на сайтах

source: Content server: Fix for home screen being empty if the path to the calibre library has a trailing slash.
es: Servidor de contenidos: Corregido el error por el que la página principal aparecía vacía si la ruta de acceso a la biblioteca de calibre tiene una barra al final.
fr: Serveur de contenu : Solutionne le fait que l'écran d'accueil soit vide si le chemin vers la bibliothèque calibre a une barre oblique à la fin
pt_br: Servidor de conteúdo: Correção para a tela principal do calibre vazia caso o caminho para a biblioteca do calibre comece com um traço.
uk: Сервер даних: виправлено порожню початкову сторінку, якщо шлях до бібліотеки calibre містить кінцевий символ похилої риски

source: Content server: Fix the new server interface not working with the --url-prefix option when the trailing slash is omitted on the URL used in the browser.
es: Servidor de contenidos: Corregido el error por el que la nueva interfaz del servidor no funcionaba con la opción --url-prefix cuando se omite la barra fina en el URL usado en el navegador.
fr: Serveur de contenu : Solutionne le fait que la nouvelle interface du serveur ne fonctionne pas avec l'option --url-prefix quand la barre oblique de fin est oubliée dans l'URL utilisée dans le navigateur.
pt_br: Servidor de conteúdo: Corrige a nova interface do servidor não funcionando com a opção --url-prefix quando o traço inicial é omitido na URL utilizada no navegador.
uk: Сервер даних: виправлено непрацездатність інтерфейсу сервера із параметром --url-prefix, пов’язану із тим, що у браузері усувався кінцевий символ похилої риски у адресі

source: Google images metadata download plugin: Fix for change in website causing no covers to be downloaded
es: Complemento de descarga de metadatos de Google images: Arreglado el cambio en la web que hacía que no se descargaran portadas
fr: Extension de téléchargement d'images Google : Solutionne le fait qu'un changement dans le site web entraîne qu'aucune couverture ne soit téléchargée
pt_br: Plugin de download de imagens do Google: Correção por conta de mudanças no site fazendo com que nenhuma capa fosse baixada
uk: Додаток отримання метаданих зображень Google: виправлено відповідно до змін на сайті, які призводили до того, що неможливо було отримати зображення обкладинок

source: For details on the major changes in calibre between 2.0 and 3.0, see <a href="%(h0)s">%(h0)s</a>
es: Para detalles sobre los cambios principales en calibre entre 2.0 y 3.0, ver <a href="%(h0)s">%(h0)s</a>
fr: Pour des détails sur les changements majeurs dans calibre entre la version 2.0 et la version 3.0 voir <a href="%(h0)s">%(h0)s</a>
pt_br: Para detalhes sobre as principais mudanças no calibre entre a versão 2.0 e a 3.0, veja <a href="%(h0)s">%(h0)s</a>
uk: Докладний опис основних змін у calibre між версіями 2.0 і 3.0 наведено тут: <a href="%(h0)s">%(h0)s</a>

source: A completely re-written Content server with support for reading books in-browser on your phone/tablet. Also works in offline mode.
es: Un servidor de contenidos totalmente reescrito con soporte para la lectura de libros en el navegador del teléfono otableta. También trabaja en modo fuera de línea.
fr: Un Serveur de contenu complètement réécrit avec la prise en charge de la lecture de livres dans le navigateur sur votre téléphone/tablette. Fonctionne également en mode hors ligne.
pt_br: Um Servidor de conteúdo totalmente re-escrito, com suporte para leitura de livros no navegador no seu telefone/tablet. Também funciona no modo offline.
uk: Повністю переписано сервер даних, реалізовано підтримку читання книг у програмі для перегляду інтернету на телефоні або планшеті. Також реалізовано роботу у автономному режимі без з’єднання із мережею.

source: Support for high resolution (Retina screens)
es: Compatibilidad con alta resolución (pantallas Retina)
fr: Prise en charge de la haute résolution (écrans Retina)
pt_br: Suporte para alta resolução (telas Retina)
uk: Підтримка високої роздільної здатності екранів

source: A new splash screen to celebrate the release of calibre 3
es: Una nueva pantalla de bienvenida para celebrar la publicación de calibre 3
fr: Un nouvel écran de lancement pour célébrer la sortie de calibre 3
pt_br: Uma nova tela de abertura para celebrar o lançamento do calibre 3
uk: Нове вікно вітання із поздоровленнями щодо випуску calibre 3

source: Minor tweaking of the main user interface to emphasize the core features
es: Mejoras menores de la interfaz de usuario principal, para destacar las características básicas.
fr: Des ajustements mineurs de l'interface principale utilisateur pour souligner l'importance des fonctionnalités essentielles
pt_br: Pequenos ajustes na interface principal do usuário para enfatizar as funções principais
uk: Незначні зміни у основному інтерфейсі користувача, які підкреслюють основні можливості програми
