Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Content server: Redirect pre 2.x book URLs to new 3.x URLs via a JavaScript redirect
es: Servidor de contenidos: Se redirigen los URL de libros anteriores a 2.x a los nuevos URL 3.x mediante una redirección JavaScript
pt_br: Servidor de conteúdo: Redireciona URLs de livro pré 2.x para as novas URLs 3.x via redirecionamento JavaScript
uk: Сервер даних: переспрямовано адреси книг у форматі до версії 2.x на нові адреси у форматі версії 3.x за допомогою переспрямовування JavaScript

source: Content server: Allow opening entries in the book list in a new tab via middle click/right click
es: Servidor de contenidos: Se permite abrir entradas de la lista de libros en una nueva pestaña mediante el botón central o derecho
pt_br: Servidor de conteúdo: Permite abrir entradas da lista de livros em uma nova aba através de clique com o botão do meio / direito
uk: Сервер даних: уможливлено відкриття записів у списку книг у новій вкладці за допомогою клацання середньою або правою кнопкою миші

source: Add a tweak in Preferences-&gt;Tweaks to exclude some fields when using the Edit metadata-&gt;Copy/paste actions
es: Se añade un ajuste en Preferencias &gt; Ajustes para excluir algunos campos al usar las acciones Modificar metadatos &gt; Copiar o Pegar
pt_br: Adiciona um ajuste em Preferências-&gt;Ajustes para excluir alguns campos ao usar as ações Editar metadados-&gt;Copiar/colar
uk: Додано коригування на сторінці «Налаштування -&gt; Коригування» для виключення певних полів із дії пунктів «Редагувати метадані -&gt Копіювати/Вставити метадані».

source: Linux: Allow using calibre-tray.png in the calibre resources folder to override the system tray icon.
es: Linux: Se permite usar calibre-tray.png en la carpeta de recursos de calibre para sustituir el icono de la bandeja de sistema.
pt_br: Linux: Permite utilizar a imagem calibre-tray.png na pasta de recursos do calibre para se sobrepor ao ícone de bandeja do sistema.
uk: Linux: дозволено заміну зображення піктограми системного лотка на calibre-tray.png з теки ресурсів calibre.

source: Browser viewer: Fix goto next/previous section actions not working when the sections are in different individual HTML files.
es: Visor del navegador: Se corrige el fallo por el que las acciones de sección anterior o siguiente no funcionaba cuando las secciones están en distintos archivos HTML.
pt_br: Visualizador do navegador: Corrige as ações de Ir Para próxima seção / seção anterior não funcionando quando as seções estão em arquivos HTML diferentes.
uk: Панель навігації: виправлено пункти переходу до наступного або попереднього розділу — тепер вони працюють, якщо текст розділів зберігається у різних окремих файлах HTML.

source: Edit book/Book polishing: When compressing images and the compressed image is larger thant he original, use the original image.
es: Modificar libro y pulir libro: Al comprimir imágenes, si la imagen comprimida es mayor que la original, se usa la original.
pt_br: Editar livro / polir livro: Ao comprimir imagens, e a imagem comprimida é maior que a original, usa a imagem original.
uk: Редагування та поліпшення книг: якщо після стискання зображення виявиться більшим за розміром за початкове, програма тепер зберігає початкове зображення.

source: PDF input: Fix conversion of multi-level PDF Outline causing duplicate entries in the Table of Contents.
es: Entrada PDF: Se corrige el fallo por el que la conversión de un esquema PDF de varios niveles creaba entradas duplicadas en el índice.
pt_br: Entrada PDF: Corrige a conversão de PDFs com estrutura multinível causando entradas duplicadas no Índice.
uk: Вхідні дані у PDF: виправлено перетворення багаторівневої структури PDF — тепер записи у таблиці змісту не дублюються.

source: Edit book: Fix incorrect EPUB 3 declarations being added to the OPF file when adding covers to an EPUB 2 book
es: Modificar libro: Se corrige el fallo por el que se añadían declaraciones EPUB 3 incorrectas al archivo OPF al añadir portadas a un libro EPUB 2
pt_br: Editar livro: Corrige declarações EPUB 3 incorretas sendo adicionadas ao arquivo OPF ao adicionar capas a um livro EPUB 2
uk: Редагування книги: усунено додавання помилкових оголожень EPUB 3 до файла OPF під час додавання зображень обкладинок до книги у форматі EPUB 2.

source: Edit book: Fix backspace key un-indenting instead of deleting even when text is selected if the cursor is at the start of the line
es: Modificar libro: Se corrige el fallo por el que la tecla de borrado eliminaba sangría en lugar de borrar, incluse si había texto seleccionado, cuando el cursor estaba al principio de la línea
pt_br: Editar livro: Corrige tecla backspace removendo recuo em vez de deletar, mesmo quando o texto está selecionado, se o cursor estiver no início da linha
uk: Редагування книги: виправлено помилку, пов'язану із тим, що клавіша backspace скасовувала відступ замість вилучення навіть тоді, коли текст було позначено, якщо курсор перебував на початку рядка.

source: Tag browser: Fix position not being preserved when deleting books.
es: Explorador de etiquetas: Se corrige el fallo por el que la posición no se mantenía al borrar libros.
pt_br: Navegador de Etiquetas: Corrige a posição não sendo preservada ao deletar livros.
uk: Панель навігації мітками: виправлено помилку, пов'язану із тим, що після вилучення книг позиція не зберігалася.

source: Edit Book: Use the cache directory rather than the temp directory to store working files. Hopefully prevents temp file cleaners from destroying books.
es: Modificar libro: Se usa el directorio de caché en lugar del temporal para almacenar archivos de trabajo. Esto debería evitar que limpiadores de archivos temporales destruyan libros.
pt_br: Editar livro: Usa o diretório de cache em vez do diretório temp para salvar arquivos de trabalho. Espera-se que isso impeça que programas de limpeza de arquivos temporários destruam os livros.
uk: Редагування книги: для зберігання робочих файлів тепер використовується каталог cache, а не каталог temp. Сподіваємося, що це захистить файли від випадкового вилучення програмами для чищення диска.

source: EPUB input: Handle books that erroneously set the mimetype for font files to text/plain
es: Entrada EPUB: Se reconocen libros que establecen el mimetype de archivos de tipo de letra erróneamente como text/plain
pt_br: Entrada EPUB: Lida com livros que erroneamente definem o mimetype de arquivos de fontes como 'text/plain'
uk: Вхідні дані у EPUB: реалізовано обробку книг, які помилково встановлюють для шрифтів тип MIME text/plain.

source: AZW3 input: Do not fail to process files with invalid internal flow references.
es: Entrada AZW3: Los archivos con referencias de flujo internas no válidas no ocasionan un fallo de procesado
pt_br: Entrada AZW3: Não falha ao processar arquivos com referências de fluxo interno inválidas.
uk: Вхідні дані у AZW3: уможливлено обробку файлів із некоректною внутрішньою послідовністю посилань.

source: When updating plugins, do not show the dialog asking which toolbar to put the plugin, even if the user has removed the plugin for all toolbars.
es: Al actualizar complementos, no se muestra el diálogo que pregunta en qué barra de herramientas poner el complemento, incluso si el usuario ha eliminado el complemento de todas las barras de herramientas
pt_br: Ao atualizar plugins, não mostrar a caixa de diálogo perguntando em qual barra de ferramentas colocar o plugin, mesmo que o usuário tenha removido o plugin de todas as barras de ferramenta.
uk: Під час оновлення додатків усунено показ діалогового вікна, у якому програма пропонує вибрати панель інструментів для додатка, навіть якщо користувач вилучив додаток з усіх панелей інструментів.

source: Content server: Fix using the Clear logs button preventing the server from restarting until calibre itself is restarted.
es: Servidor de contenidos: Se corrige el fallo por el que el botón de borrar registros evitaba que el servidor se reiniciara hasta que se reiniciase calibre.
pt_br: Servidor de conteúdo: Corrige uso do botão de Limpar Logs impedindo o servidor de reiniciar até o próprio ser reiniciado.
uk: Сервер даних: виправлено помилку, пов'язану із тим, що кнопка спорожнення журналу не давала перезапустити сервер доти, доки не буде перезапущено calibre.

source: 15 Dec, 2017
es: 15 dic, 2017
pt_br: 15 de Dezembro de 2017
uk: 15 грудня 2017 року

source: 01 Dec, 2017
es: 01 dic, 2017
pt_br: 1º de Dezembro de 2017
uk: 1 грудня 2017 року

source: 09 Nov, 2017
pt_br: 09 de Novembro de 2017
uk: 9 листопада 2017 року

source: 02 Nov, 2017
pt_br: 02 de Novembro de 2017
uk: 2 листопада 2017 року

source: 20 Oct, 2017
pt_br: 20 de Outubro de 2017
uk: 27 жовтня 2017 року

source: 06 Oct, 2017
pt_br: 06 de Outubro de 2017
uk: 6 жовтня 2017 року

source: 22 Sep, 2017
pt_br: 22 de Setembro de 2017
uk: 22 вересня 2017 року

source: 25 Aug, 2017
es: 25 ago, 2017
pt_br: 25 de Agosto de 2017
uk: 25 серпня 2017 року

source: 04 Aug, 2017
es: 04 ago, 2017
pt_br: 04 de Agosto de 2017
uk: 4 серпня 2017 року

source: 28 Jul, 2017
pt_br: 28 de Julho de 2017
uk: 28 липня 2017 року

source: 14 Jul, 2017
pt_br: 14 de Julho de 2017
uk: 14 липня 2017 року

source: 07 Jul, 2017
pt_br: 07 de Julho de 2017
uk: 7 липня 2017 року

source: 29 Jun, 2017
pt_br: 29 de Junho de 2017
uk: 29 червня 2017 року

source: 23 Jun, 2017
pt_br: 23 de Junho de 2017
uk: 23 червня 2017 року

source: 16 Jun, 2017
pt_br: 16 de Junho de 2017
uk: 16 червня 2017 року

source: Preferences->Ignored devices: Add a button to reset the list of devices that calibre is allowed to manage
uk: Налаштування -> Ігноровані пристрої: додано кнопку для вилучення списку пристроїв, якими дозволено керувати calibre.

source: MOBI Input: Fix conversion of MOBI files with malformed markup and embedded <guide> tags not working.
uk: Вхідні дані MOBI: виправлено перетворення файлів MOBI із помилковою розміткою і вбудованими мітками <guide>.

source: Edit book: When auto-closing tags on typing </, fix occasionally incorrect tag being closed in large files because syntax highlighting has not completed
pt_br: Editar livro: Ao fechar tags automaticamente digitando </, corrige a tag incorreta sendo ocosionamente fechada em arquivos grandes por conta do realce de sintaxe não estar completo
uk: Редактор книг: виправлено помилку у завершенні блоків теґів при введенні </, яка траплялася у великих файлах, якщо не було завершено автоматичну обробку підсвічування синтаксичних конструкцій.

source: Edit book: Fix beautify not handling <colgroup> and <th> tags correctly.
pt_br: Editar livros: Corrige embelezamento não lidando corretamente com tags <colgroup> e <th>.
uk: Редагування книг: виправлено помилку, яка призводила до помилкової обробки beautify теґів <colgroup> та <th>.

source: Content server: Add an option to control which book list mode is used by default for new users (Preferences->Sharing over the net->Choose book list mode)
pt_br: Servidor de conteúdo: Adiciona uma opção para controlar qual modo de lista de livros é usado por padrão para novos usuários (Preferências->Compartilhar pela rede->Avançado->Escolher modo de lista de livros)
uk: Сервер даних: додано пункт керування типовим режимом списку книг для нових користувачів (Налаштування -> Обмін мережею -> Вибрати режим списку книг)

source: Content server: Allow specifying custom URLs for the 'Search the internet' feature via Preferences->Sharing over the net->Search the internet.
pt_br: Servidor de conteúdo: Permite especificar URLs personalizadas para função 'Pesquisar na internet' via Preferênias->Compartilhar pela rede->Pesquisar na internet.
uk: Сервер даних: уможливлено визначення нетипових адрес на сторінці «Шукати у інтернеті», яка викликається пунктом «Налаштування -> Обмін мережею -> Шукати у інтернеті».

source: Windows: Add a button to Preferences->Sharing over the net to set calibre to run when the computer starts
pt_br: Windows: Adiciona um botão em Preferências->Compartilhar pela rede para configurar o calibre para iniciar quando o computador inicializar
uk: Windows: додано кнопку на панель «Налаштування -> Обмін мережею» для налаштовування calibre на запуск під час запуску системи.

source: Tag browser: When using the Find function have unaccented characters match their accented equivalents, if the setting for it is set in Preferences->Searching
pt_br: Navegador de etiquetas: Ao usar a função Buscar, os caracteres não acentuados combinam com os equivalentes acentuados, se a configuração para isso estiver definida em Preferências->Buscar
uk: Панель навігації мітками: реалізовано пошук символів із акцентами за їхніми неакцентованими відповідниками, якщо позначено відповідний пункт на сторінці «Налаштування -> Пошук»

source: Support Calibre
es: Ayudar a Calibre
pt_br: Apoie o Calibre
uk: Підтримайте Calibre

source: PayPal unavailable!
es: ¡PayPal no está disponible!
pt_br: PayPal indisponível!
uk: PayPal є недоступним!

source: Payment successful! Thank you for your support.
es: ¡Pago realizado! Gracias por su contribución.
pt_br: Pagamento realizado com sucesso! Obrigado pelo apoio.
uk: Гроші успішно переказано! Дякуємо за вашу підтримку.

source: Payment failed!
es: ¡Fallo en el pago!
pt_br: Falha no pagamento!
uk: Не вдалося переказати гроші!

source: Version: %(version)s
es: Versión: 1%(version)s
pt_br: Versão: %(version)s
uk: Версія: %(version)s

source: Note
es: Nota
pt_br: Nota
uk: Примітка

source: You must have xdg-utils, wget, xz-utils and python &ge; 2.6 installed on your system before running the installer.
es: Debe tener xdg-utils, wget, xz-utils y python &ge; 2.6 instalados en el sistema antes de ejecutar el instalador.
pt_br: Você deve ter xdg-utils, wget, xz-utils e python &ge; 2.6 instalados no seu sistema antes de executar o instalador.
uk: Вам слід встановити xdg-utils, wget, xz-utils та python &ge; 2.6 у вашій системі, перш ніж запускати засіб встановлення.

source: Version: %(version)s
es: Versión: %(version)s
pt_br: Versão: %(version)s
uk: Версія: %(version)s

source: calibre is a result of the efforts of many volunteers from all over the world. If you find it useful, please consider contributing to support its development. Your contribution helps keep calibre development alive. You can pay using credit cards, PayPal or Patreon.
es: calibre es el resultado de los esfuerzos de muchos voluntarios de todo el mundo. Si lo encuentra útil, por favor considere hacer una donación para contribuir a su desarrollo. Su donación ayuda a mantener vivo el desarrollo de calibre. Puede pagar usando tarjetas de crédito, PayPal o Patreon.
pt_br: O calibre é o resultado do esforço de muitos voluntários de todo o mundo. Se você achá-lo útil, por favor considere contribuir para ajudar seu desenvolvimento. Sua contribuição ajuda a manter o desenvolvimento do calibre vivo. Você pode pagar usando cartão de crédito, PayPal ou Patreon.
uk: calibre — результат зусиль багатьох добровольців з усього світу. Якщо ви вважаєте програму корисною, будь ласка, розгляньте можливість підтримати її розробку фінансово. Ваш внесок допоможе продовжувати розробку calibre. Ви можете заплатити за допомогою кредитних карток, PayPal або Patreon.

source: If you would like to contribute regularly to calibre, you can become a calibre patron, by using the <a href="%(pat)s">Patreon service</a> or the <a href="%(librepay)s">Liberapay service</a>.
pt_br: Se você gostaria de contribuir regularmente com o calibre, você pode se tornar um patrono do calibre, utilizando o <a href="%(pat)s">serviço Patreon</a> ou o <a href="%(librepay)s">serviço Liberapay</a>.
uk: Якщо ви хочете регулярно допомагати calibre, ви можете стати спонсором calibre, використовуючи <a href="%(pat)s">службу Patreon</a> або <a href="%(librepay)s">службу Liberapay</a>.

source: Alternatively you can download the PO file to do your translations offline by using the <i>"Download for translation"</i> link instead of the <i>"Translate Now"</i> button. You can edit the PO file using your favorite translation software and when you are done, upload the file by clicking the <i>"Upload file"</i> link (which is just below the <i>"Download for translation"</i> link).
es: Otra posibilidad es descargar el archivo PO para realizar las traducciones desconectado, usando el enlace «<i>Descargar para traducir</i>» en lugar del botón «Traducir ahora». Puede modificar el archivo PO con su programa de traducción preferido y, cuando termine, enviar el archivo pulsando el enlace «<i>Subir archivo</i>» (que está justo debajo del enlace «Descargar para traducir»).
pt_br: Alternativamente, você pode baixar o arquivo PO para fazer suas traduções offline utilizando o link <i>"Baixar o arquivo para traduzir"</i> em vez do botão <i>"Traduza"</i>. Você pode editar o arquivo PO utilizando o seu software favorito de tradução, e quando finalizar, enviar o arquivo clicando no link <i>"Enviar arquivo"</i> (que está bem abaixo do link <i>"Baixar o arquivo para traduzir"</i>).
uk: Крім того, ви можете отримати файл PO для перекладу поза мережею за допомогою натискання посилання <i>Отримати для перекладу</i> замість кнопки <i>Перекладати</i>. Ви можете редагувати файл PO за допомогою вашого улюбленого програмного забезпечення для перекладу, а потім, коли завершите, вивантажити файл натисканням посилання <i>Вивантажити файл</i> (одразу під посиланням <i>Отримати для перекладу</i>).

source: Contact
es: Contacto
pt_br: Contato
uk: Контакт

source: <b>calibre is a powerful and easy to use e-book manager</b>. Users say it’s <i>outstanding</i> and a <i>must-have</i>. It’ll allow you to do nearly everything and it takes things a step beyond normal e-book software. It’s also <b>completely free</b> and <i>open source</i> and great for both <b>casual users</b> and computer experts.
es: <b>calibre es un gestor de libros electrónicos potente y fácil de usar</b>. Los usuarios dicen que es <i>sobresaliente</i> e <i>indispensable</i>. Le permite hacer casi cualquier cosa y va un paso por delante de otros programas de libros electrónicos. También <b>completamente libre</b> y de <b>código abierto</b> e ideal tanto para <b>usuarios ocasionales</b> como informáticos expertos.
pt_br: <b>O calibre é um gerenciador de e-books poderoso e fácil de usar</b>. Os usuários dizem que é <i>impressionante</i> e um item <i>obrigatório</i>. Ele permitirá que você faça praticamente tudo e leva as coisas a um nível além de um software de e-books normal. Ele também é <b>completamente grátis</b> e de <i>código aberto</i>, e ótimo para <b>usuários casuais</b> e especialistas em computação.
uk: <b>calibre — потужна і проста у користуванні програма для керування електронними книгами</b>. Її користувачі вважають програму <i>видатною</i> та <i>потрібною усім</i>. За її допомогою ви зможете виконати майже будь-яку дію з книгою, вона залишає позаду будь-які звичайні програми для читання електронних книг. Крім того, програма є <b>зовсім безкоштовною</b>, її код є <i>відкритим</i>, вона чудово пасує як <b>звичайним користувачам</b>, так і знавцям комп'ютерної техніки.

source: November 2009
es: Noviembre de 2009
pt_br: Novembro de 2009
uk: Листопад 2009

source: Grant Drake: For various plugins including Open with, Search the internet and Goodreads integration
uk: Grant Drake: різноманітні додатки, зокрема додаток відкриття за допомогою іншої програми, пошук у інтернеті та інтеграція з Goodreads

source: (Mar, 2017)
pt_br: (Março de 2017)
uk: (без 2017 року)

source: (Nov, 2009)
pt_br: (Novembro de 2009)
uk: (лис 2009 року)

source: Portable
es: Portátil
pt_br: Portátil
uk: Портативна система

source: You can also check out calibre’s <a href="%(fb)s">Facebook</a> and <a href="%(tw)s">Twitter</a> pages to connect with other users.
pt_br: Você também pode dar uma olhada nas páginas do <a href="%(fb)s">Facebook</a> e <a href="%(tw)s">Twitter</a> do calibre para se conectar a outros usuários.
uk: Ви також можете відвідати сторінки calibre на <a href="%(fb)s">Facebook</a> і <a href="%(tw)s">Twitter</a>, щоб встановити зв’язок із іншими користувачами.

source: Another <a href="%(uol)s">step-by-step guide</a> on creating EPUB files starting from OpenOffice and Word, by the University of Leicester.
pt_br: Mais um <a href="%(uol)s">guia passo-a-passo</a> sobre a criação de arquivos EPUB partindo do OpenOffice ou Word, pela Universidade de Leicester.
uk: Ще одні <a href="%(uol)s">покрокові настанови</a> щодо створення файлів EPUB на основі файлів OpenOffice та Word. Настанови створено університетом Лестера.

source: Get DRM free ebooks
es: Obtener libros sin DRM
pt_br: Obtenha livros livres de DRM
uk: Отримати вільні від DRM книги

source: Note that if you have customized your toolbar in calibre in the past, you may not see the Get Books button in the toolbar. You can go to Preferences-&gt;Toolbars &amp; menus and add it to the toolbar manually.
pt_br: Note que se você personalizou sua barra de ferramentas no calibre no passado, você pode não ver o botão Obter Livros na barra de ferramentas. Você pode ir em Preferências-&gt;Barra de ferramentas &amp; menus e adicione-o à barra de ferramentas manualmente.
uk: Зауважте, що якщо ви налаштовували у минулому вашу панель інструментів у calibre, ймовірно, ви не побачите кнопки «Отримати книги» на вашій панелі інструментів. Скористайтеся сторінкою «Налаштування -&gt; Панелі інструментів і меню», щоб додати її вручну.

source: The old double toolbar in calibre was replaced by a new single "unified" toolbar, to save vertical space. You can now add a second toolbar or even a menubar and customize what icons appear in each.
es: La antigua doble barra de herramientas de calibre se ha sustituido por una única barra de herramientas «unificada», para ahorrar espacio vertical. Puede añadir una segunda barra de herramientas o incluso una barra de menús y personalizar los iconos que aparecen en cada una.
pt_br: A velha barra de ferramentas dupla do calibre foi substituída por uma nova barra de ferramentas unificada, para economizar espaço vertical. Você pode agora adicionar uma segunda barra de ferramentas ou mesmo uma barra de menus e personalizar quais ícones aparecem em cada.
uk: Стару подвійну панель інструментів у calibre було замінено на нову одинарну «уніфіковану» панель інструментів для заощадження місця за вертикаллю. У новій версії програми ви можете додати другу панель інструментів або навіть смужку меню і налаштувати набір піктограм на кожній з цих панелей.

source: A new "page turn animation" when using the page scrolling mode in the viewer. For those of you that dont like it, it can be turned off in the viewer preferences.
es: Una nueva «animación de paso de página» al usar el modo de desplazamiento de página en el visor. Si no le gusta, puede desactivarse en las preferencias del visor.
pt_br: Uma nova "animação de rolagem de página" ao usar o modo paginado no visualizador. Para aqueles que não gostam, ela pode ser desativada nas preferência do visualizador.
uk: Реалізовано нову анімацію гортання сторінок при використанні режиму гортання сторінок у вікні засобу перегляду електронних книг. Ті, кому не подобається ця анімація, можуть вимкнути її у налаштуваннях засобу перегляду книг.
