Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: See what was new in previous major calibre releases:
es: Ver los cambios en las versiones principales anteriores de calibre:
fr: Voir les nouveautés des précédentes versions majeures de calibre :
pt_br: Veja as principais novidades da versões anteriores do calibre:
uk: Перегляньте нові можливості у попередніх основних випусках calibre:

source: 30 Aug, 2019
uk: 30 серпня 2019 року

source: HTML metadata: Support reading identifiers from HTML files
uk: Метадані HTML: реалізовано підтримку читання ідентифікаторів з файлів HTML

source: Preferences-&gt;Ignored devices: Add a button to reset the list of devices that calibre is allowed to manage
uk: Налаштування-&gt;Ігноровані пристрої: додано кнопку для вилучення списку пристроїв, якими дозволено керувати calibre.

source: macOS: Fix a regression that could cause a crash on exit if any books were deleted while calibre was running.
uk: macOS: виправлено регресію, яка могла призводити до аварійного завершення програми під час виходу, якщо під час роботи з calibre було вилучено якусь книгу.

source: Content server OPDS: Handle form encoded search queries.
uk: OPDS сервера даних: реалізовано обробку запитів щодо пошуку із кодуванням форми.

source: Fix an error when adding files from clipboard and file is of unknown type
uk: Виправлено помилку при додаванні файлів з буфера обміну даними та файлів невідомого типу

source: Speed up restoring original format by doing a rename rather than a copy and re-add.
uk: Пришвидшено відновлення початкового формату шляхом виконання перейменовування, а не копіювання із повторним додаванням.

source: EPUB 3: Fix setting metadata in EPUB 3 files without a title not working
uk: EPUB 3: виправлено помилку, яка призводила до непрацездатності дії зі встановлення метаданих у файлах EPUB 3 без заголовків.

source: PML Input: Modernize the generated HTML a bit.
uk: Вхідні дані PML: дещо модернізовано створення даних HTML.

source: HTMLZ Output: Fix svg content from HTML files that contain only SVG being removed.
uk: Виведення даних до HTMLZ: усунено помилку, яка призводила до вилучення даних svg з файлів HTML, які містять лише SVG.

source: Content server: Fix OPDS feed for category based browsing listing restricted books, even though these books cannot be actually downloaded.
uk: Сервер даних: виправлено подачу даних OPDS для панелі навігації на основі категорій зі списком, у якому містяться книги із обмеженнями у використанні, навіть у випадках, якщо ці книги не можна отримати.

source: Preserve tag order when reading metadata from MOBI files
uk: Реалізовано збереження порядку міток при читанні даних з файлів MOBI.

source: Add missing 'language' field to ComicBookInfo metadata for .CBR files.
uk: Додано пропущене поле «language» у метаданих ComicBookInfo для файлів .CBR.

source: LIT Output: Fix regression in 3.41 caused by py3 porting that broke conversion of some files to LIT.
uk: Виведення даних до LIT: виправлено регресію у версії 3.41, яку було спричинено тим, що під час портування на py3 було пошкоджено код перетворення деяких файлів до формату LIT.

source: Version 3.47.1 fixes an error when using internet lookup from the book details panel and the e-book viewer, and also the tweak to control number of columns in the edit metadata dialog not working
uk: У версії 3.47.1 виправлено помилку, пов'язану із використанням пошуку в інтернеті на панелі подробиць щодо книги та у засобі перегляду електронних книг, а також проблему, пов'язану із непрацездатністю коригування кількості стовпчиків у діалоговому вікні редагування метаданих.

source: 19 Jul, 2019
uk: 19 липня 2019 року

source: Manage tags dialog: When searching for a tag also search the "Was" column to see if the original tag name matches.
uk: Вікно керування мітками: реалізовано пошук за мітками у стовпчику «Було» для визначення відповідності початковій назві мітки.

source: Windows: Fix calibre-server --manage-users not working correctly
uk: Windows: виправлено помилку, пов'язану із некоректною роботою команди calibre-server --manage-users

source: MOBI Input: Fix conversion of MOBI files with malformed markup and embedded &lt;guide&gt; tags not working.
uk: Вхідні дані MOBI: виправлено перетворення файлів MOBI із помилковою розміткою і вбудованими мітками &lt;guide&gt;.

source: Edit book: Allow the search expression history to remember very short terms and also preserve leading and trailing whitespace.
uk: Редагування книг: уможливлено запам'ятовування у журналі виразів для пошуку дуже коротких рядків, а також збереження початкових та кінцевих пробілів.

source: Fix a regression in 3.45 that broke conversion of SVG images when converting to formats such as MOBI that do not support SVG.
uk: Виправлено регресію у версії 3.45, яку було пов'язано із помилками у перетворенні зображень SVG під час обробки форматів, у яких не передбачено підтримки SVG, зокрема MOBI.

source: Fix a regression in 3.45 that broke parsing of old-style .py config files
uk: Виправлено регресію у версії 3.45, яка призводила до помилок під час обробки файлів налаштувань .py у застарілому стилі

source: 12 Jul, 2019
pt_br: 12 de Julho de 2019
uk: 12 липня 2019 року

source: Content server: Allow adding or removing formats to a book via the edit metadata page.
pt_br: Servidor de conteúdo: Permite adicionar ou remover formatos de um livro via página de edição de metadados.
uk: Сервер даних: уможливлено додавання або вилучення форматів книги за допомогою сторінки редагування метаданих.

source: ToC Editor: Allow user to control whether duplicate headings are included or not when generating ToC from headings
pt_br: Editor de Índice: Permite ao usuário controlar se títulos duplicados são incluídos ou não ao gerar o Índice a partir dos títulos
uk: Редактор змісту: уможливлено керування користувачем тим, чи буде включено дублікати заголовків під час створення змісту на основі заголовків.

source: Advanced search dialog: Remember the last focused field in the search by title/authors tab
pt_br: Diálogo de busca avançada: Lembrar o último campo selecionado na aba de pesquisa por título/autor
uk: Діалогове вікно розширеного пошуку: реалізовано запам'ятовування останнього фокусованого поля на вкладці пошуку за заголовком та авторами.

source: Conversion: Performance improvement for books that have many HTML files that all include the same CSS stylesheets
pt_br: Conversão: Melhoria de performance para livros que possuem muitos arquivos HTML que incluem a mesma folha de estilos CSS
uk: Перетворення: поліпшено швидкодію для книг, у яких багато файлів HTML, у кожному з яких використано ті самі таблиці стилів CSS.

source: Kobo driver: Add options to more precisely control the generation of cover images, to reduce size and enhance quality
pt_br: Driver do Kobo: Adiciona opções para controlar mais precisamente a geração de imagens de capa, para reduzir o tamanho e melhorar a qualidade
uk: Драйвер Kobo: з метою зменшення розмірів книг та поліпшення якості додано пункти параметрів для точнішого керування створенням зображень обкладинок.

source: Support subtitle in Douban metadata plugin
pt_br: Suporte a subtítulo no plugin de metadados Douban
uk: Реалізовано підтримку підзаголовків у додатку метаданих Douban.

source: Fix a Windows-specific regression in 3.45.0 that caused various errors in the viewer and editor
pt_br: Corrige uma regressão específica do Windows na versão 3.45.0 que causava vários erros no visualizador e no editor
uk: Виправлено специфічну для Windows регресію у версії 3.45.0, яка спричиняла різноманітні помилки у засобі перегляду електронних книг та редакторі.

source: Fix a Windows-specific regression in 3.45.0 that prevented calibre from starting on non UTF-8 locales with non-ASCII usernames
pt_br: Corrige uma regressão específica do Windows na versão 3.45.0 que impedia a inicialização em línguas não UTF-8 com nomes de usuários com caracteres não ASCII
uk: Виправлено специфічну для Windows регресію у версії 3.45.0, яка заважала запуску calibre з символами поза ASCII у назвах користувачів у локалях, відмінних від UTF-8.

source: Linux: Workaround for bug in recent Linux kernels that causes the Kindle to eject after calibre connects to it.
pt_br: Linux: Solução alternativa para erro no kernel recente do Linux que faz com que o Kindle seja ejetado após o calibre se conectar a ele.
uk: Linux: реалізовано обхідний маневр для усування вади у нещодавніх ядрах Linux, яка спричиняла від'єднання Kindle після спроби calibre встановити з'єднання з пристроєм.

source: DOCX Input: When autodetecting the Table of Contents from headings, work even if the headings use numbering.
pt_br: Entrada DOCX: Ao detectar automaticamente o Índice a partir dos títulos, funciona mesmo os títulos usarem numeração.
uk: Вхідні дані у DOCX: реалізовано автоматичне виявлення пунктів таблиці змісту на основі заголовків, навіть якщо заголовки пронумеровано.

source: EPUB Output: If there are no guide elements do not output an empty guide tag. Makes epubcheck happy.
pt_br: Saída EPUB: Se não houver elementos no 'guide', não criar um elemento 'guide' vazio. Faz o epubcheck feliz.
uk: Виведення даних до EPUB: усунено створення порожніх теґів guide, якщо у коді немає елементів guide. Усуває попередження з боку epubcheck.

source: Workaround for sortByColumn being partially broken in Qt 5.13.0
pt_br: Solução alternativa para o sortByColumn (classificar por coluna) sendo parcialmente danificado no Qt 5.13.0
uk: Реалізовано обхідний маневр, який усуває проблеми із sortByColumn у Qt 5.13.0.

source: Fix a regression that broke the per_lang_title_sort_articles tweak.
pt_br: Corrige uma regressão que danificou o ajuste per_lang_title_sort_articles.
uk: Усунено регресію, яка робила непрацездатним коригування per_lang_title_sort_articles.

source: Sending email: Fix an error on some windows machines with non-ASCII hostnames
pt_br: Enviando email: Corrige um erro em algumas máquinas com windows com hostnames com caractereres não ASCII
uk: Надсилання книг електронною поштою: виправлено помилку на деяких системах під керуванням Windows, яка траплялася, якщо назва вузла містила символи, які не є символами ASCII.

source: EPUB Output: When generating EPUB 3 preserve the old style meta tag to identify the cover as Google Play Books does not recognize EPUB 3 cover markup.
pt_br: Saída EPUB: Ao gerar um EPUB 3, preserva o antigo elemento 'meta' para identificar a capa, uma vez que o Google Play Books não reconhece a marcação de capa do EPUB 3.
uk: Виведення даних до EPUB: реалізовано збереження метамітки обкладинки у старому стилі для EPUB 3. Така мітка потрібна для того, щоб програма «Книги» з Google Play розпізнавала розмітку обкладинки у EPUB 3.

source: Create catalog: Fix handling of the tilde character in BiBTeX catalogs.
pt_br: Criar catálogo: Corrige o tratamento do caracter 'til' nos catálogos BiBTeX.
uk: Створення каталогу: виправлено обробку символу тильди у каталогах BiBTeX.

source: News downloads: Fix incorrect font sizes for some text in the index pages.
pt_br: Download de notícias: Corrige tamanhos de fontes incorretos para alguns textos nas páginas de índice.
uk: Отримання новин: виправлено помилкові розміри символів шрифту для частини тексту на сторінках покажчика.

source: Comic Input: Fix incorrect processing of comics with pages that have the same file names in different folders when using the "No process" option.
pt_br: Entrada HQ: Corrige processamento incorreto de HQs com páginas que possuem o mesmo nome de arquivo em diferentes pastas ao usar a opção "Desativar processamento de HQs".
uk: Вхідні дані коміксів: виправлено помилкову обробку коміксів зі сторінками, які мають однакові назви у різних теках, при використанні параметра «Без обробки».

source: CHM Input: Fix a regression that broke processing of some CHM files.
pt_br: Entrada CHM: Corrige uma regressão que danificou o processamento de alguns arquivos CHM.
uk: Вхідні дані у CHM: виправлено регресію, яка заважала обробці деяких файлів CHM.

source: Edit book: When auto-closing tags on typing &lt;/, fix occasionally incorrect tag being closed in large files because syntax highlighting has not completed
pt_br: Editar livro: Ao fechar automaticamente as tags digitando &lt;/, corrige a tag incorreta sendo ocasionalmente fechada em arquivos grandes por conta do realce de sintaxe não estar completo
uk: Редактор книг: виправлено помилку у завершенні блоків теґів при введенні &lt;/, яка траплялася у великих файлах, якщо не було завершено автоматичну обробку підсвічування синтаксичних конструкцій.

source: Kobo driver: Fix for ContentType not being defined error for extension-less non kepub files on a Kobo
pt_br: Driver Kobo: Correção para ContentType não registrar erro para arquivos não kepub sem extensão em um Kobo
uk: Драйвер Kobo: виправлено пов'язану із невизначеністю ContentType помилку для файлів, які не є файлами kepub і мають назви без суфіксів, при роботі з пристроями Kobo.

source: Content server: Book details page: Do not display empty rows for undefined dates
pt_br: Servidor de conteúdo: Página de detalhes do livro: Não mostrar linhas vazias para datas indefinidas
uk: Сервер даних: сторінка параметрів книги: усунено показ порожніх рядків для пунктів невизначених дат.

source: Get books: Update Google books and amazon plugins for markup changes
pt_br: Obter livros: Atualiza os plugins do Google Books e da Amazon por conta de mudanças na marcação dos sites
uk: Отримання книг: відповідно до змін у розмітці, оновлено додатки Книг Google та Amazon

source: Edit book: Text search: Fix searching for a single character backwards not working
pt_br: Editar livro: Busca de texto: Corrige busca de um único caractere em sentido para trás não funcionando
uk: Редактор книг: пошук тексту: виправлено помилку, пов'язану із тим, що не працював пошук у зворотному напрямку для односимвольних рядків пошуку.

source: 31 May, 2019
pt_br: 31 de Maio de 2019
uk: 31 травня 2019 року

source: Driver for the new NOOK Glowlight Plus
pt_br: Driver para o novo NOOK Glowlight Plus
uk: Драйвер для нового NOOK Glowlight Plus

source: Driver for updated Kobo firmware
pt_br: Atualização de driver para o novo firmware Kobo
uk: Драйвер для оновленої мікропрограми Kobo

source: Amazon metadata plugin: Fix searching the Amazon servers directly not working because of changed markup
pt_br: Plugin de metadados da Amazon: Corrige busca direta nos servidores da Amazon não funcionando por conta de mudanças no código
uk: Додаток метаданих Amazon: виправлено помилку, пов'язану із тим, що безпосередній пошук на серверах Amazon не працював через зміну розмітки

source: 28 May, 2019
pt_br: 28 de Maio de 2019
uk: 28 травня 2019 року

source: Kobo driver: Support for new Kobo firmware
pt_br: Driver do Kobo: Suporte para o novo firmware Kobo
uk: Драйвер Kobo: підтримка нової мікропрограми Kobo

source: Edit metadata dialog: Remember relative sizes of the cover and comments editors.
pt_br: Diálogo de edição de metadados: Lembra tamanhos relativos da capa e editor de comentários.
uk: Вікно редагування метаданих: реалізовано запам'ятовування відносних розмірів обкладинки та редактора коментарів.

source: PDF Output: Fix hang when converting some documents.
pt_br: Saída PDF: Corrige travamento ao converter certos documentos.
uk: Виведення даних до PDF: усунено зависання при перетворенні деяких документів.

source: Handle newlines when serializing to csr files
pt_br: Lida com novas linhas ao serializar arquivos csr
uk: Реалізовано обробку символів нового рядка при перетворенні файлів csr до послідовної форми

source: Fix searching in manage tags throws away all changes
pt_br: Corrige busca no gerenciador de etiquetas descartando todas as mudanças
uk: Виправлено помилку, пов'язану із тим, що спроба виконання пошуку на панелі керування мітками призводила до відкидання усіх змін

source: Fix a regression in the previous release that broke using the wireless device driver with the device_for_template option
pt_br: Corrige uma regressão na versão anterior que danificou o uso do driver de dispositivo sem fio com a opção device_for_template
uk: Усунено пов'язану із перешкоджанням роботі драйвера бездротових пристроїв при використанні параметра device_for_template регресію у попередньому випуску

source: Fix metadata download from Amazon stripping accents from comments text in the binary builds
pt_br: Corrige o download de metadados da Amazon removendo acentos do texto dos comentários
uk: Виправлено помилку, яка призводила до вилучення акцентів у тексті коментарів з Amazon у бінарних збірках

source: Amazon metadata download: Fix some downloads failing when a mobile user agent is randomnly selected.
pt_br: Download de metadados da Amazon: Corrige alguns downloads falhando quando um agente de usuário móvel é selecionado aleatoriamente.
uk: Отримання метаданих з Amazon: виправлено пов'язану із випадковим вибором мобільного агента користувача помилку для завантаження певних даних.

source: LRF Input: Fix a regression that broke parsing LRF files.
pt_br: Entrada LRF: Corrige uma regressão que danificou o processamento de arquivos LRF.
uk: Вхідні дані LRF: усунено регресію, яка заважала обробці файлів LRF.

source: PDF Input: Workaround for pdftohtml not always producing valid UTF-8.
pt_br: Entrada PDF: Solução alternativa para o pdftohtml nem sempre produzindo UTF-8 válido.
uk: Вхідні дані PDF: реалізовано виправлення помилки, яку пов'язано із тим, що pdftohtml не завжди дає після обробки коректні дані UTF-8.

source: 30 Apr, 2019
pt_br: 30 de Abril de 2019
uk: 30 квітня 2019 року

source: Conversion: Transform styles: When using regular expressions fix substitution groups not working.
pt_br: Conversão: Transformar estilos: Corrige substituição de grupos não funcionando ao usar expressões regulares.
uk: Перетворення: стилі перетворення: виправлено працездатність груп підставляння при використанні формальних виразів.

source: Fix a regression in the previous release that caused the conversion of HTML to text in comments when output to catalogs or converting downloaded metadata to behave slightly differently.
pt_br: Corrige uma regressão na versão anterior que fazia com que a conversão de HTML para texto em comentários, ao exportar catálogos ou converter metadados baixados, se comportasse de maneira ligeiramente diferente.
uk: Виправлено регресію у попередньому випуску, яка спричиняла різну поведінку при виведення до каталогів і перетворенні отриманих метаданих, якщо виконувалося перетворення коду HTML у текст у коментарях.

source: Edit book: Fix beautify not handling &lt;colgroup&gt; and &lt;th&gt; tags correctly.
pt_br: Editar livros: Corrige embelezamento não lidando correntamente com tags &lt;colgroup&gt; e &lt;th&gt;.
uk: Редагування книг: виправлено помилку, яка призводила до помилкової обробки beautify теґів &lt;colgroup&gt; та &lt;th&gt;.

source: DOCX Input: Fix cross-references using the 'fldSimple' markup not being recognized by calibre.
pt_br: Entrada DOCX: Corrige referências cruzadas usando a marcação 'fldSimple' não sendo reconhecidas pelo calibre.
uk: Вхідні дані DOCX: виправлено помилку, яка призводила до того, що перехресні посилання із розміткою «fldSimple» не розпізнавалися calibre.

source: EPUB/MOBI Catalogs: Fix a regression in the previous release that caused ampersands and middle-dots to appear as HTML entities in the output.
pt_br: Catálogos EPUB/MOBI: Corrige uma regressão na versão anterior que fazia com que o 'e comercial' e o 'ponto médio' aparecessem como entidades HTML na saída.
uk: Каталоги EPUB/MOBI: виправлено регресію у попередньому випуску, яка спричиняла до перетворення амперсандів та крапок на замінники HTML у виведених даних.

source: Prevent a malformed tweaks.json file from stopping calibre startup
pt_br: Evita que um arquivo tweaks.json malformado impeça a inicialização do calibre
uk: Усунено помилку, яка призводила до неможливості запуску calibre із пошкодженим файлом tweaks.json

source: Fix a regression that broke completion for ebook-convert
pt_br: Corrige uma regressão que danificou a finalização da conversão de e-books
uk: Усунено регресію, яка заважала автоматичному доповненню у команді ebook-convert

source: News fetching: Fix a regression that broke removal of attributes/javascript/srcset because of bugs in the new BeautifulSoup
pt_br: Obtenção de notícias: Corrige uma regressão que danificou a remoção de atributos/javascript/srcset por conta de erros no novo BeautifulSoup.
uk: Отримання новин: виправлено регресію, яка заважала вилученню атрибутів, javascript та srcset і яку було спричинено вадами у новій BeautifulSoup

source: TXT Output: Fix Vietnamese Â character being stripped from output.
pt_br: Saída TXT: Corrige caractere vietnamita Â sendo removido da saída.
uk: Виведення до TXT: усунено ваду, яка призводила до вилучення в'єтнамської Â з виведених даних.

source: E-book viewer: Fix specifying a non-existent location via --open-at causing viewer to hang
pt_br: Visualizador de E-books: Corrige especificação de um local não existente via --open-at causando travamento do visualizador
uk: Засіб перегляду електронних книг: виправлено помилку, яку було пов'язано із тим, що визначення місця, якого не існує, за допомогою --open-at призводило до зависання програми.

source: 19 Apr, 2019
pt_br: 19 de Abril de 2019
uk: 19 квітня 2019 року

source: Content server: Add an option to control which book list mode is used by default for new users (Preferences-&gt;Sharing over the net-&gt;Choose book list mode)
pt_br: Servidor de conteúdo: Adiciona uma opção para controlar qual mode de lista de livros é utilizado por padrão para novos usuários (Preferências-&gt;Compartilhar pela rede-&gt;Avançado-&gt;Escolha modo de lista de livros)
uk: Сервер даних: додано пункт керування типовим режимом списку книг для нових користувачів (Налаштування -&gt; Обмін мережею -&gt; Вибрати режим списку книг)

source: Content server: Allow clicking on book cover in details page to read the book.
pt_br: Servidor de conteúdo: Permite clicar na capa do livro no painel de detalhes para ler o livro.
uk: Сервер даних: уможливлено натискання обкладинки книги на сторінці подробиць для відкриття книги для читання.

source: Amazon metadata plugin: Add a option to use the mobi-asin to find books.
pt_br: Plugin de metadados da Amazon: Adiciona uma opção para usar o mobi-asin para buscar livros.
uk: Додаток метаданих Amazon: додано пункт використання mobi-asin для пошуку книг.

source: E-book viewer: Allow specifying ToC hrefs via the --open-at command line parameter.
pt_br: Visualizador de e-books: Permite especificar hrefs de ToC via parâmetro da linha de comando --open-at.
uk: Засіб перегляду електронних книг: уможливлено визначення гіперпосилань у таблиці зміну за допомогою параметра командного рядка --open-at.

source: Tag Mapper: Allow Title-casing of tags.
pt_br: Mapeador de Etiquetas: Permite usar Primeiras Letras Maiúsculas nas etiquetas.
uk: Прив'язка до міток: уможливлено записування міток великими літерами.

source: Manage authors dialog: Add an entry to the right click menu to show books by the current author in the main book list.
pt_br: Diálogo de gerenciamento de autores: Adiciona uma entrada ao menu de contexto para mostrar livros do autor selecionado na lista de livros principal.
uk: Діалогове вікно керування записами авторів: до контекстного меню додано запис для показу книг поточного автора у основному списку книг.

source: Lots of internal changes to calibre's codebase to prepare it for Python 3 support.
pt_br: Várias mudanças internas no código base do calibre para prepará-lo para suporte ao Python 3.
uk: Багато внутрішніх змін у коді calibre у приготуваннях до переходу на Python 3.
