Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Download calibre for Windows
es: Descargar calibre para Windows
fr: Télécharger calibre pour Windows
pt_br: Baixe o calibre para o Windows
uk: Отримати calibre для Windows

source: Download calibre for macOS
es: Descargar calibre para macOS
fr: Télécharger calibre pour macOS
pt_br: Baixe o calibre para o macOS
uk: Отримати calibre для macOS

source: Download calibre for linux
es: Descargar calibre para linux
fr: Télécharger calibre pour linux
pt_br: Baixe o calibre par ao linux
uk: Отримати calibre для linux

source: Download Calibre Portable
es: Descargar calibre portátil
fr: Télécharger Calibre Portable
pt_br: Baixe o Calibre Portátil
uk: Отримати портативну версію calibre

source: Download calibre for Windows 64bit
es: Descargar calibre para Windows 64bit
fr: Télécharger calibre pour Windows 64bit
pt_br: Baixe o calibre para o Windows 64bit
uk: Отримати calibre для 64-бітової Windows

source: Signatures for all the calibre installer files are <a target="_blank" href="%(href)s">here</a>
es: Las firmas digitales para todos los archivos de instalación de calibre están <a target="_blank" href="%(href)s">aquí</a>
fr: Les signatures pour tous les fichiers d'installation de calibre sont <a target="_blank" href="%(href)s">ici</a>
pt_br: Assinaturas para todos os arquivos de instalação do calibre estão <a target="_blank" href="%(href)s">aqui</a>
uk: Підписи для усіх пакунків для встановлення calibre зберігаються <a target="_blank" href="%(href)s">тут</a>

source: Reporting bugs
es: Informar de fallos
fr: Signaler les bogues
pt_br: Reportando erros
uk: Як повідомити про вади

source: calibre is a very rapidly evolving piece of software, with weekly releases. As a results bugs are inevitable. We rely on calibre's users to report these bugs, so that they can be fixed as quickly as possible. To report bugs use the <a target="_blank" href="%(href)s">calibre bug tracker</a>. Note that you will have to register for a free account first.
es: calibre es un programa informático que evoluciona muy rápidamente, con versiones semanales. Como resultado, algunos fallos son inevitables. Los informes de fallos de los usuarios son imprescindibles para poder solucionarlos lo más rápidamente posible. Para informar de fallos use el <a target="_blank" href="%(href)s">registro de fallos de calibre</a>. Tenga en mente que antes tendrá que crear una cuenta gratuita.
fr: calibre est un logiciel qui évolue très rapidement, avec des sorties hebdomadaires. De ce fait les bogues sont inévitables. Nous comptons sur les utilisateurs de calibre pour signaler ces bogues pour qu'ils puissent être solutionnés aussi vite que possible. Pour signaler les bogues utilisez le <a target="_blank" href="%(href)s">traqueur de bogue de calibre</a>. Notez que vous aurez à vous enregistrer en premier. Les signalements se font en anglais.
pt_br: O calibre é um software de evolução muito rápida, com lançamentos semanais. Como resultado, erros são inevitáveis. Contamos com os usuários do calibre para reportar esses erros, de maneira que eles possam ser corrigidos o mais rápido possível. Para reportar erros, utilize o <a target="_blank" href="%(href)s">rastreador de erros do calibre</a>. Note que você terá que se registrar com uma conta gratuita primeiro.
uk: Розвиток calibre є дуже динамічним. Щотижня створюється новий випуск програми, тому вади у коді програми майже неминучі. Ми сподіваємося, що користувачі calibre повідомлятимуть про ці вади, щоб їх було якомога швидше виправлено. Щоб повідомити про вади, скористайтеся <a target="_blank" href="%(href)s">системою стеження за вадами calibre</a>. Зауважте, що для сповіщення розробників про ваду, вам доведеться зареєструватися у системі.

source: When reporting bugs please include <b>as much information as possible</b>, as that makes it easier for us to identify the source of the problem. Remember that calibre is developed by volunteers in their spare time, so by taking these steps, you are helping to ensure that as much of that time as possible is spent actually coding as opposed to doing administrative tasks like closing duplicate bug reports.
es: Al informar de fallos por favor incluya <b>tanta información como sea posible</b>, ya que eso nos facilita la identificación del problema. Recuerde que calibre está desarrollado por voluntarios en su tiempo libro, por lo que al seguir estos pasos ayudará a que la mayor parte posible de este tiempo se emplee en programar en lugar de realizar tareas administrativas, como cerrar informes de fallos duplicados.
fr: Lorsque vous signalez des bogues merci d'inclure <b>le plus d'informations possible</b>, cela nous rend la tache plus facile pour identifier la source du problème. Rappelez-vous que calibre est développé par des bénévoles sur leur temps libre, aussi en tenant compte des ces étapes vous aidez à assurer que la majorité du temps dépensé l'est à coder plutôt que de faire des tâches administratives comme fermer des signalements de bogue en double.
pt_br: Ao reportar erros, por favor inclua <b>o máximo de informações possível</b>, na medida que isso torna mais fácil para identificarmos a origem do problema. Lembre-se de que o calibre é desenvolvido por voluntários em seu tempo extra, então ao seguir este passos, você está ajudando a garantir que o máximo desse tempo será gasto realmente escrevendo código, em vez de fazendo tarefas administrativas, como encerrando relatórios de erro duplicados.
uk: Звітуючи про вади, будь ласка, повідомляйте <b>якомога більше інформації</b>, тоді нам буде простіше визначити джерело проблеми. Пам'ятайте, що розробкою calibre займаються добровольці у вільний від основної роботи час, тому виконання настанов зі звітування про вади надасть їм змогу зосередитися на виправленні коду програми, а не витрачати час на адміністративну роботу, зокрема закриття дублікатів повідомлень про вади.

source: If you are including some <strong>sensitive data</strong> in your bug report like a copyrighted book or a debug log, mark the bug as "private", then the data will not be visible to all. You can do this by finding the location where it says "This report contains <b>Public</b> information" in the top right area of the bug's page and clicking the yellow icon next to it.
es: Si va a incluir <strong>información sensible</strong> en el informe, como un libro con derechos de autor o un registro de depuración, marque el fallo como «privado», con lo que la información no será visible para todos. Puede hacer esto buscando la parte de la página donde dice «Este informe contiene información <b>pública</b>» en la zona superior derecha de la página del informe y pulsando en el icono amarillo.
fr: Si vous intégrez certaines <strong>données sensibles</strong> dans votre signalement de bogue comme un livre sous copyright ou un journal de débogage, marquez le bogue comme "privé", alors les données ne seront pas visibles à tous. Vous pouvez faire cela en trouvant l'endroit où il est indiqué "Ce rapport contient de l'information <b>publique</b>" dans le coin supérieur droit de la page de signalement de bogue et en cliquant sur l'icône jaune qui le suit.
pt_br: Se você estiver incluindo alguns <strong>dados confidenciais</strong> no seu relatório de erros como um livro com direitos autorais ou um log de depuração, mas o erro como "privado". Então os dados não serão visíveis para todos. Você pode fazer isso buscando o local onde diz "Este relatório contém informação <b>Pública</b>" na área superior direita da página do erro e clicando no ícone amarelo próximo a ele.
uk: Якщо ви включаєте до звіту щодо вади якісь <strong>конфіденційні дані</strong>, наприклад захищену авторськими правами книгу або діагностичний журнал, позначте повідомлення як «конфіденційне» («private»), тоді дані звіту не будуть доступними будь-кому. Для позначення конфіденційного звіту скористайтеся пунктом «This report contains <b>Public</b> information» у правій частині сторінки звітування — просто натисніть жовту піктограму поряд із цим пунктом.

source: You can also use the bug tracker to <b>request new features</b>. To mark a bug report as a request for a new feature just add [Enhancement] to the subject. Please remember that calibre is a highly complex piece of software with millions of users, as such, the priorities of calibre's developers may not match your own and your feature request may well be ignored. Since calibre is open source, one sure way to get your feature request more attention is to implement it yourself and attach the patch implementing it to the bug report.
es: También puede usar el registro de fallos para <b>solicitar nuevas funciones</b>. Para marcar un informe de fallos como solicitud de una nueva función, añada «[Enhancement]» en el título. Por favor, recuerde que calibre es un programa muy complejo, con millones de usarios, y las prioridades de los desarrolladores pueden no coincidir con las suyas y la solicitud puede no ser atendida. Puesto que calibre es de código abierto, una forma de conseguir que su solicitud reciba más atención es programarla por su cuenta y adjuntar el parche al informe de fallo.
fr: Vous pouvez aussi utilisez le traqueur de bogue pour <b>demander de nouvelles fonctionnalités</b>. Pour marquer un signalement de bogue comme requête pour une nouvelle fonctionnalité, ajoutez [Enhancement] au sujet. Rappelez-vous que calibre est un logiciel extrêmement complexe avec des millions d'utilisateurs, de ce fait, les priorités des développeurs de calibre peuvent ne pas rencontrer les vôtres et votre demande de fonctionnalité sera peut être ignorée. Puisque calibre est open source, une manière facile d'obtenir plus d'attention pour votre requête de fonctionnalité est de l'implémenter vous-même et d'attacher le correctif l'implémentant au rapport de signalement.
pt_br: Você também pode usar o rastreador de erros para <b>pedir novos recursos</b>. Para marcar um relatório de erro como um pedido de um novo recurso, apenas adicione [Enhancement] ao assunto. Por favor lembre-se de que o calibre é um software altamente complexo, com milhões de usuários, e portanto, as prioridades dos desenvolvedores do calibre podem corresponder às suas e seu pedido de recurso pode ser ignorado. Um vez que o calibre possui código aberto, uma maneira certa de conseguir mais atenção para o seu pedido de recurso é implementá-lo você mesmo e anexar a o patch ao relatório de erro.
uk: Крім того, ви можете скористатися системою стеження за вадами для <b>надсилання запитів щодо нових можливостей</b>. Щоб позначити звіт щодо вади як запит щодо нової можливості, просто додайте слово [Enhancement] до його назви. Будь ласка, пам'ятайте, що calibre є досить складним програмним забезпеченням із мільйонами користувачів, тому пріоритети розробників calibre можуть не збігатися із вашими власними, а ваш запит щодо реалізації можливостей може бути проігноровано. Оскільки calibre є вільним програмним забезпеченням, найефективнішим способом дістати більше уваги до вашого запиту щодо нової можливості, є реалізація цієї можливості власноруч із наступним додаванням латки до коду із новою можливістю до вашого звіту щодо вади.

source: Note that the bug reporting site is currently incompatible with some version of <b>Internet Explorer</b>, so if you have trouble try using an alternate browser like Firefox, Chrome or Safari. Or try clicking the "Compatibility mode" button in Internet Explorer.
es: Tenga en cuenta que la página de informes de fallos es actualmente incompatible con alguna versión de <b>Internet Explorer</b>, así que si tiene problemas pruebe a usar un explorador alternativo como Firefox, Chrome o Safari. O pruebe a pulsar el botón «Modo de compatibilidad» en Internet Explorer.
fr: Notez que le site de signalement de bogue est actuellement incompatible avec certaines versions de <b>Internet Explorer</b>, si vous avez des problèmes essayez un autre navigateur comme Firefox, Chrome ou Safari. Ou essayez en cliquant le bouton "Mode compatibilité" dans Internet Explorer.
pt_br: Note que o site de relatório de erros é atualmente incompatível com algumas versões do <b>Internet Explorer</b>, então se você tiver dificuldades, tente usar um navegador alternativo como Firefox, Chrome ou Safari. Ou tente clicar no botão "Modo de compatibilidade" no Internet Explorer.
uk: Зауважте, що у засобу звітування щодо вад поточної версії є проблеми із сумісністю з деякими версіями <b>Internet Explorer</b>, отже, якщо у вас виникають проблеми зі звітуванням, спробуйте скористатися альтернативним брауземо, наприклад Firefox, Chrome або Safari. Крім того, ви можете натиснути кнопку «Режим сумісності» у Internet Explorer.

source: Getting involved with calibre
es: Participar en calibre
fr: S'impliquer dans calibre
pt_br: Envolvendo-se com o calibre
uk: Долучайтеся до команди calibre

source: The secret of calibre's success is its vibrant user community. Users have contributed code and become developers, translations to make calibre available in different languages, graphics to improve its look and feel and of course thousands of bug reports to help make it the robust piece of software it is today. An incomplete list of contributors to calibre is available <a href="%(href)s">here</a>.
es: El secreto del éxito de calibre es su activa comunidad de usarios. Los usuarios han aportado código haciéndose desarrolladores, traducciones para que calibre esté disponible en varios idiomas, gráficos para mejorar su aspecto y, por supuesto, miles de informes de fallos para ayudar a que calibre sea el programa robusto que es hoy en día. Una lista incompleta de colaboradores de calibre puede encontrarse <a href="%(href)s">aquí</a>.
fr: Le secret du succès de calibre est sa dynamique communauté d'utilisateurs. Des utilisateurs ont contribué au code et sont devenus développeurs, des traductions pour rendre calibre disponible dans différentes langues, des illustrations pour améliorer son apparence et bien sûr des milliers de signalements de bogues pour aider à en faire le logiciel robuste qu'il est aujourd'hui. Une liste incomplète des contributeurs à calibre est disponible <a href="%(href)s">ici</a>
pt_br: O segredo do sucesso do calibre é a sua vibrante comunidade de usuários. Os usuários têm contribuído com código e se tornado desenvolvedores, traduções para tornar o calibre disponível em diferentes idiomas, gráficos para melhorar sua aparência e, claro, milhares de relatórios de erro para ajudar a torná-lo a software robusto que ele é hoje. Uma lista incompleta dos contribuidores do calibre está disponível <a href="%(href)s">aqui</a>.
uk: Секрет успіху calibre полягає у чудовій спільноті користувачів. Користувачі надсилають програмний код і стають розробниками, надсилають переклади, які роблять програми calibre доступними різними мовами, надсилають власні графічні твори, які поліпшують вигляд інтерфейсу програми, і, звичайно ж, надсилають тисячі звітів про вади, які допомагають calibre стати якіснішим програмним забезпеченням. Із неповним списком учасників розробки можна ознайомитис <a href="%(href)s">тут</a>.

source: Joining the calibre community
es: Unirse a la comunidad de calibre
fr: Rejoindre la communauté calibre
pt_br: Unindo-se à comunidade do calibre
uk: Долучення до спільноти calibre

source: To talk with fellow calibre users and keep abreast of the latest developments in calibre-world, you can use several tools:
es: Para conversar con otros usuarios de calibre y mantenerse al día de los últimos desarrollos en el mundo de calibre puede usar distintas herramientas:
fr: Pour parler avec des utilisateurs de calibre et se tenir informé des derniers développements dans le monde de calibre, vous pouvez utiliser différents outils :
pt_br: Para conversar com outros usuários do calibre e ficar por dentro das últimas novidades do mundo do calibre, você pode usar várias ferramentas:
uk: Обговорити із іншими користувачами calibre та бути у курсі усіх останніх розробок у світі calibre-world можна за допомогою декількох інструментів:

source: The calibre <a href="%(href)s">user forum</a>
es: El <a href="%(href)s">foro de usuarios</a> de calibre
fr: Le <a href="%(href)s">forum utilisateur</a> de calibre
pt_br: O <a href="%(href)s">fórum de usuários</a> do calibre
uk: <a href="%(href)s">Форум користувачів</a> calibre

source: <a href="%(href)s">#calibre</a> on Twitter
es: <a href="%(href)s">#calibre</a> en Twitter
fr: <a href="%(href)s">#calibre</a> sur Twitter
pt_br: <a href="%(href)s">#calibre</a> no Twitter
uk: <a href="%(href)s">#calibre</a> у Twitter

source: The <a href="%(href)s">calibre Facebook page</a>
es: La <a href="%(href)s">página de Facebook de calibre</a>
fr: La <a href="%(href)s">page Facebook de calibre</a>
pt_br: A <a href="%(href)s">página do Facebook do calibre</a>
uk: <a href="%(href)s">Сторінка calibre на Facebook</a>

source: The calibre new releases <a href="%(href)s" type="application/rss+xml">RSS</a> feed
es: El canal <a href="%(href)s" type="application/rss+xml">RSS</a> de nuevas versiones de calibre
fr: Le flux <a href="%(href)s" type="application/rss+xml">RSS</a> des nouvelles versions de calibre
pt_br: O feed <a href="%(href)s" type="application/rss+xml">RSS</a> de novas versões do calibre
uk: Стрічка <a href="%(href)s" type="application/rss+xml">RSS</a> про нові випуски calibre

source: Creating a calibre plugin
es: Crear un complemento de calibre
fr: Créer une extension à calibre
pt_br: Criando um plugin para o calibre
uk: Створення додатка до calibre

source: calibre has a comprehensive plugin interface, that allows the creation of plugins that can do just about anything. For many examples, see the <a href="%(plugins)s">calibre Plugins forum</a>. A tutorial on getting started with plugin development, <a href="%(pdocs)s">is available</a>.
es: calibre tiene una interfaz de complementos completa, que permite la creación de complementos que pueden hacer casi cualquier cosa. Para ver muchos ejemplos, vea el <a href="%(plugins)s">foro de complementos de calibre</a>. <a href="%(pdocs)s">Hay disponible</a> un cursillo para iniciarse en el desarrollo de complementos.
fr: calibre a une interface extension complète, celle-ci permet la création des extensions qui peuvent faire ce qu'il faut au sujet de n'importe quoi. Pour beaucoup d'exemples, voir le <a href="%(plugins)s">forum des extensions de calibre</a>. Un tutoriel sur comment démarrer avec le développement des extensions, <a href="%(pdocs)s">est disponible</a>.
pt_br: O calibre possui uma interface abrangente para plugins, que permite a criação de plugins que podem fazer praticamente tudo. Para muitos exemplos, veja o <a href="%(plugins)s">fórum de Plugins do calibre</a>. Um tutorial inicial sobre o desenvolvimento de plugins <a href="%(pdocs)s">está disponível</a>.
uk: У calibre передбачено всебічний інтерфейс додатків, за допомогою якого можна створювати додатки, які виконуватимуть майже будь-які дії. Багато прикладів таких додатків можна знайти на <a href="%(plugins)s">форумі додатків calibre</a>. Крім того, розробниками написано <a href="%(pdocs)s">підручник</a>, який присвячено початковим крокам у розробці додатків.

source: Contributing translations to calibre
es: Aportar traducciones a calibre
fr: Contribuer à la traduction de calibre
pt_br: Contribuindo com traduções para o calibre
uk: Переклад calibre

source: calibre has support for translating its user interface. You can see the list of languages for which translations exist <a target="new" href="%(tmain)s">here</a>. If the translations for your language are incomplete/missing, you can contribute the translations using a simple web-based interface. To do so first create an account in <a target="new" href="%(signup)s">Transifex</a>, then click on your language in <a target="new" href="%(project)s">this page</a>. Click on the <i>"Join Team"</i> button. Once you have been approved, simply click on the language you want to translate <a href="%(tmain)s">here</a> and use the <i>"Translate Now"</i> button to contribute your translations.
es: calibre permite traducir su interfaz de usuario. Puede ver la lista de idiomas para los que existe una traducción <a target="new" href="%(tmain)s">aquí</a>. Si la traducción en su idioma falta o está incompleta, puede aportar traducciones usando una sencilla interfaz web. Para ello primero cree una cuenta en <a target="new" href="%(signup)s">Transifex</a>, luego pulse en su idioma en <a target="new" href="%(project)s">esta página</a>. Pulse en el botón «<i>Unirse al equipo</i>». Una vez que haya sido admitido, pulse en el idioma que quiera traducir <a href="%(tmain)s">aquí</a> y use el botón «<i>Traducir ahora</i>» para aportar traducciones.
fr: calibre a un support pour la traduction de son interface utilisateur. Vous pouvez voir la liste des langues pour lesquelles une traduction existe <a target="new" href="%(tmain)s">ici</a>. Si la traduction pour votre langue est incomplète/manquante, vous pouvez contribuer au traductions en utilisant une simple interface web. Pour faire cela il faut tout d'abord créer un compte sur <a target="new" href="%(signup)s">Transifex</a>, cliquez ensuite sur votre propre langue dans <a target="new" href="%(project)s">cette page</a>. Cliquez sur le bouton <i>"Se joindre à l'équipe"</i>. Une fois que vous serez approuvé, cliquez simplement sur la langue que vous voulez traduire <a href="%(tmain)s">ici</a> et utilisez le bouton <i>"Traduire"</i> pour contribuer aux traductions.
pt_br: O calibre possui suporte para traduzir sua interface de usuário. Você pode ver a lista de idiomas para as quais existem traduções <a target="new" href="%(tmain)s">aqui</a>. Se as traduções para o seu idioma estão incompletas/ausentes, você pode contribuir utilizando uma simples interface baseada na web. Para fazer isso, primeiro crie uma conta no <a target="new" href="%(signup)s">Transifex</a>, então clique no seu idioma <a target="new" href="%(project)s">nesta página</a>. Clique no botão <i>"Participar da equipe"</i>. Uma vez que você seja aprovado, simplesmente clique no idioma que deseja traduzir <a href="%(tmain)s">aqui</a> e use o botão <i>"Traduza"</i> para contribuir com suas traduções.
uk: У calibre передбачено можливість перекладу інтерфейсу користувача. Зі списком мов, якими здійснюються переклади, можна ознайомитися <a target="new" href="%(tmain)s">тут</a>. Якщо переклад вашою рідною мовою є неповним або перекладу немає, ви можете допомогти з перекладом, скориставшись простим інтернет-інтерфейсом. Для цього спершу створіть обліковий запис у системі <a target="new" href="%(signup)s">Transifex</a>, потім натисніть пункт вашої мови на <a target="new" href="%(project)s">цій сторінці</a>. Натисніть кнопку <i>«Долучитися до команди»</i>. Щойно надійде підтвердження щодо включення вас до команди, просто натисніть пункт мови, якою ви хочете перекладати, <a href="%(tmain)s">тут</a> і скористайтеся кнопкою <i>«Перекладати»</i>, щоб надіслати ваші переклади.

source: Alternatively you can download the PO file to do your translations offline by using the <i>"Download for translation"</i> link instead of the Translate Now button. You can edit the PO file using your favorite translation software and when you are done, upload the file by clicking the <i>"Upload file"</i> link (which is just below the Download for translation link).
fr: Alternativement vous pouvez télécharger le fichier PO pour faire vos traductions hors ligne en utilisant le lien <i>"Télécharger le fichier pour le traduire"</i> plutôt que le bouton Traduire. Vous pouvez éditer le fichier PO en utilisant votre application favorite de traduction et quand vous avez fini, charger le fichier en cliquant le lien <i>"Téléverser un fichier"</i> (qui se trouve en dessous du lien Télécharger le fichier pour le traduire).
