Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: calibredb: Fix adding books from directories to a remote server running on Windows not working
pt_br: calibredb: Corrige falha na adição de livros a partir de diretórios para um servidor remoto rodando no Windows
uk: calibredb: виправлено додавання книг з каталогів на віддалений сервер під керуванням Windows

source: Edit Book: Fix style attribute on &lt;html&gt; tags not being preserved when editing AZW3 files.
pt_br: Editar livro: Corrige atributo de estilo em elementos &lt;html&gt; não sendo preservados ao editar arquivos AZW3.
uk: Засіб редагування книг: виправлено помилку, яка призводила до того, що атрибут стилю у теґах &lt;html&gt; не зберігався при редагуванні файлів AZW3.

source: Get Books: Use an external browser for Google Books
pt_br: Obter livros: Usa um navegador externo para o Google Books
uk: Отримання книг: реалізовано використання зовнішньої програми для перегляду інтернету для Книг Google

source: Saving to disk: Fix errors on Linux/macOS if the title/authors are long enough to make individual path components larger than 255 characters.
pt_br: Salvar no disco: Corrige erros no Linux/macOS se os títulos/autores são longos o suficiente para fazer o caminho individual dos componentes maiores do que 255 caracteres.
uk: Збереження на диск: виправлено помилки на платформах Linux/macOS, які виникали, якщо записи заголовка книги та авторів були достатньо довгими, щоб зробити окремі компоненти шляху довшими за 255 символів.

source: PDF Input: Fix non-breaking spaces represented as entities in the output of pdftohtml, which breaks some search/replace expressions
pt_br: Entrada PDF: Corrige espaços incondicionais representados como entidades na saída de 'PDF para HTML', o que danifica algumas expressões de busca/substituição.
uk: Вхідні дані у форматі PDF: виправлено обробку нерозривних пробілів у формі замінників, які було виведено pdftohtml і які не давали змогу використовувати деякі вирази пошуку із заміною

source: Edit book: Fix a crash when mousing over links in an instance of the editor launched standalone on macOS Mojave
pt_br: Editar livro: Corrige um erro ao mover o mouse sobre links em uma instância do editor lançada individualmente no macOS Mojave
uk: Засіб редагування книг: усунено аварійне завершення роботи при наведенні вказівника миші на посилання у окремо запущеному екземплярі редактора на macOS Mojave

source: Conversion: When converting with font size rescaling disabled, convert font size names to rem unit rather than pt units.
pt_br: Conversão: Ao converter com a opção de redimensionamento de fontes desativada, converte a unidade de tamanho de fontes para 'rem', em vez de 'pt'.
uk: Засіб перетворення: реалізовано перетворення назв розмірів шрифту у одиниці rem замість одиниць pt, якщо вимкнено зміну масштабування шрифту при перетворенні

source: Windows: When registering calibre programs as possible handlers for various file types, dont set the AllowSilentDefaultTakeOver registry key
pt_br: Windows: Ao registrar os programas do calibre como possíveis manipuladores para os vários tipos de arquivo, não definir a chave de registro AllowSilentDefaultTakeOver
uk: Windows: усунено встановлення ключа реєстру AllowSilentDefaultTakeOver при реєстрації програм calibre як можливих обробників файлів різних типів

source: macOS: PDF Output: Fix bold fonts not working on Mojave.
pt_br: macOS: Saída PDF: Corrige fontes negrito não funcionando no Mojave.
uk: macOS: виведення даних у форматі PDF: усунено непрацездатність напівжирних шрифтів у Mojave.

source: Content server: Fix strings with double quotes not being translated.
pt_br: Servidor de conteúdo: Corrige textos com aspas duplas não sendo traduzidos.
uk: Сервер даних: виправлено помилку, пов'язану із неможливістю перекладу рядків із подвійними лапками.

source: 21 Dec, 2018
pt_br: 21 de Dezembro de 2018
uk: 21 грудня 2018 року

source: Happy Holidays to everyone!
pt_br: Boas Festas para todos!
uk: Усім веселих свят!

source: Kobo driver: Add supported for newly released firmware update
pt_br: Driver do Kobo: Adicionado suporte para a recém lançada atualização de firmware
uk: Драйвер Kobo: додано підтримку нового випущеного оновлення мікропрограми

source: Kobo driver: Fix a regression in the last release that caused book title to appear as Unknown if metadata management was set to manual in calibre.
pt_br: Driver do Kobo: Corrige uma regressão na última versão que fazia com que o título do livro aparecesse como Desconhecido se o gerenciamento de metadados estivesse definida como manual no calibre.
uk: Драйвер Kobo: виправлено регресію у останньому випуску, яка призводила до показу заголовка книги «Невідомий», якщо у calibre було встановлено керування метаданими книги вручну.

source: PDF Output: Do not fail if one of the fonts from the source document has no name metadata
pt_br: Saída PDF: Não falha se uma das fontes do documento fonte não possui metadados de nome
uk: Виведення до PDF: усунено аварійне завершення обробки, якщо один із шрифтів у документі джерела не містить метаданих щодо назви

source: 07 Dec, 2018
pt_br: 07 de Dezembro de 2018
uk: 7 грудня 2018 року

source: Edit book: Insert hyperlink: Allow specifying a template to control the markup that is inserted for the hyperlink.
pt_br: Editar livro: Inserir hyperlink: Permite especificar um modelo para controlar a marcação que é inserida para o hyperlink.
uk: Засіб редагування книг: вставлення гіперпосилань: уможливлено визначення шаблона для керування розміткою, яка вставляється у код книги для форматування гіперпосилань.

source: Metadata download: Add an option (in Preferences-&gt;Metadata download) to keep multiple results from individual metadata sources, useful if you prefer to pick the best result by hand and use only one or two metadata sources.
pt_br: Download de metadados: Adiciona uma opção (em Preferências-&gt;Download de metadados) para manter resultados múltiplos para fontes individuais de metadados. Útil se você preferir escolher o melhor resultado manualmente e usar somente uma ou duas fontes de metadados.
uk: Засіб отримання метаданих: додано пункт (на сторінку «Налаштування-&gt;Отримання метаданих) для зберігання декількох результатів для окремих джерел метаданих. Такий режим буде корисним, якщо ви надаєте перевагу вибору найкращого результату вручну і використовуєте одне або два джерела метаданих.

source: KoboTouch driver: Extend the metadata updated in the Kobo device database to all metadata displayed on the device. The update is only done for books already on the device. Needs to be enabled via Preferences-&gt;Plugins-&gt;Customize the KoboTouch device plugin.
pt_br: Driver do KoboTouch: Estende os metadados atualizados na base de dados do dispositivo Kobo para todos os metadados mostrados no dispositivo. A atualização é feita apenas para livros que já estão no dispositivo. Precisa ser ativado via Preferências-&gt;Plugins-&gt;Personalizar o plugin do dispositivo KoboTouch.
uk: Драйвер KoboTouch: розширено перелік метаданих, які програма оновлює у базі даних пристрою Kobo, до усіх метаданих, які показано на пристрої. Оновлення виконуватиметься лише для книг, які вже зберігаються на пристрої. Можливість оновлення має бути увімкнено за допомогою пункту «Налаштування -&gt; Додатки -&gt; Налаштувати додаток пристроїв KoboTouch».

source: E-book viewer: Fix a regression that broke viewing of HTMLZ files
pt_br: Visualizador de e-books: Corrige uma regressão que danificou a visualização de arquivos HTMLZ.
uk: Засіб перегляду електронних книг: виправлено регресію, пов'язану із некоректним показом файлів HTMLZ

source: Edit book: Fix suggestions in completion popup not being sorted.
pt_br: Editar livro: Corrige as sugestões de preenchimento não estando ordenadas.
uk: Засіб редагування книг: реалізовано упорядковування пропозицій у контекстному списку автоматичного доповнення.

source: Windows: Fix restarting calibre with system tray icon enabled causing duplicate defunct icons in the tray.
pt_br: Windows: Corrige o reinício do calibre com o ícone de bandeja ativado causando duplicidade de ícones na bandeja.
uk: Windows: виправлено помилку, пов'язану із тим, що перезапуск calibre із увімкненою піктограмою системного лотка, призводив до появи двох непридатних до користування піктограм у лотку.

source: 08 Nov, 2018
pt_br: 08 de Novembro de 2018
uk: 8 листопада 2018 року

source: Support for the new Kindle Paperwhite 2018
pt_br: Suporte para o novo Kindle Paperwhite 2018
uk: Реалізовано підтримку нового Kindle Paperwhite 2018

source: Metadata plugboards: Allow defining plugboards that modify comments metadata as well
pt_br: Quadro de conexões de metadados: Permite definir quadros de conexões que também modificam metadados de comentário
uk: Засоби обробки метаданих: уможливлено визначення засобів обробки, які вносять зміни і до самих метаданих коментарів

source: E-book viewer: Add a keyboard shortcut (Ctrl+M) for toggling between paged and flow mode
pt_br: Visualizador de e-books: Adiciona um atalho de teclado(Ctrl+M) para trocar entre modos de página e fluído
uk: Засіб перегляду електронних книг: додано клавіатурне скорочення (Ctrl+M) для перемикання між режимом поділу на сторінки та режимом згортку

source: EPUB Input: Handle invalid EPUB files that have their NCX documents in the spine.
pt_br: Entrada EPUB: Lida com arquivos EPUB inválidos que têm seus documentos NCX na lombada.
uk: Вхідні дані в EPUB: реалізовано обробку некоректних файлів EPUB, у яких документи NCX зберігаються у даних.

source: EPUB3 Input: Handle EPUB 3 files that incorrectly use EPUB 2 markup to identify cover images.
pt_br: Entrada EPUB3: Lida com arquivos EPUB 3 que incorretamente utilizam marcação de EPUB 2 para identificar imagens de capa.
uk: Вхідні дані в EPUB3: реалізовано обробку файлів EPUB 3, де некоректно використано розмітку EPUB 2 для визначення зображень обкладинок.

source: Content server: Fix --url-prefix feature not working with book conversion
pt_br: Servidor de conteúdo: Correção da função --url-prefix que não estava funcionando com a conversão de livros
uk: Сервер даних: виправлено помилку, пов'язану із тим, що --url-prefix, не працював при перетворенні книг

source: 19 Oct, 2018
pt_br: 19 de Outubro de 2018
uk: 19 жовтня 2018 року

source: Driver for the new Kobo Forma
pt_br: Driver para o novo Kobo Forma
uk: Драйвер для нової Kobo Forma

source: PDF Output: Add a new 'page number map' setting to easily modify page numbers as needed in headers/fotters and the generated inline table of contents.
pt_br: Saída PDF: Adicionada uma nova configuração de "mapa de número de página" para facilmente modificar números de páginas quando necessário nos cabeçalhos/rodapés e no índice em linha gerado.
uk: Виведення до формату PDF: додано новий пункт налаштувань «прив'язка номерів сторінок» для спрощення визначення номерів сторінок, які використовуються у верхніх і нижніх колонтитулах та створеній програмою вбудованій таблиці змісту.

source: Edit book: Insert image: remember size of displayed thumbnails.
pt_br: Editar livro: Inserir imagem: lembrar o tamanho das miniaturas exibidas.
uk: Засіб редагування книг: інструмент «Вставити зображення» тепер запам'ятовує розміри показаних мініатюр.

source: Edit book: Compress images losslessly: Remember the last used compression quality for jpeg compression.
pt_br: Editar livro: Comprimir imagens sem perda: Lembrar a última qualidade de compressão utilizada para compressão de jpeg.
uk: Засіб редагування книг: реалізовано стискання зображень без втрати якості та запам'ятовування останніх використаних параметрів якості стискання JPEG.

source: CHM Input: Fix a regression in the previous release that broke processing of CHM files.
pt_br: Entrada CHM: Corrige uma regressão na última versão, que danificou o processamento de arquivos CHM.
uk: Вхідні дані CHM: виправлено регресію у попередньому випуску, яка перешкоджала обробці файлів CHM.

source: Fix clearing of metadata download author and tag map rules not working
pt_br: Corrige limpeza de metadados baixados para regras de mapeamento de autores e etiquetas não funcionando
uk: Усунено помилку, яка заважала вилученню із отриманих даних запису автора та правил прив'язки міток

source: Fix notifications from calibre being displayed as "Others" on the GNOME desktop
pt_br: Corrige notificações do calibre sendo exibidas como "Outras" na área de trabalho do GNOME.
uk: Виправлено помилку, яка призводила до того, що сповіщення від calibre показувалися як «Інші» у стільничному середовищі GNOME

source: 28 Sep, 2018
pt_br: 28 de Setembro de 2018
uk: 28 вересня 2018 року

source: Edit book: Insert image dialog: Add buttons to change the image thumbnail size.
es: Modificar libro: Diálogo de inserción de imagen: Se añaden botones para cambiar el tamaño de la miniatura de imagen.
pt_br: Editar livro: Caixa de diálogo de inserção de imagem: Adiciona botões para mudar o tamanho da miniatura da imagem.
uk: Засіб редагування книг: діалогове вікно вставляння зображення: додано кнопки для зміни розмірів мініатюри зображення.

source: Book details panel: Allow right clicking on a format to open it in the calibre editor
es: Panel de detalles del libro: Se permite pulsar con el botón derecho sobre un formato para abrirlo con el editor de calibre
pt_br: Painel de detalhes do livro: Permite clicar com o botão direito do mouse em um formato para abri-lo no editor.
uk: Панель подробиць щодо книги: уможливлено клацання правою кнопкою на пункті формату для відкриття файла у редакторі calibre.

source: Edit metadata dialog: Allow viewing or editing specific formats by right clicking the format in the formats list
es: Diálogo de modificación de metadatos: Se permite ver o modificar formatos específicos pulsando con el botón derecho sobre el formato en la lista de formatos
pt_br: Caixa de diálogo de edição de metadados: Permite visualizar ou editar formatos específicos ao clicar com o botão direito do mouse no formato desejado na lista de formatos
uk: Діалогове вікно редагування метаданих: уможливлено перегляд та редагування певних форматів: достатньо клацнути правою кнопкою на пункті формату у списку форматів.

source: When creating a metadata jacket allow HTML in custom long text columns
es: Al crear una sobrecubierta de metadatos se permite código HTML en columnas personalizadas de texto largo
pt_br: Ao criar uma capa a partir dos metadados, permite HTML em colunas com texto muito longos
uk: При створенні обгортки метаданих уможливлено використання коду HTML у нетипових стовпчиках із довгим текстом.

source: Content server: When editing metadata add a button to remove the existing cover. Note that after removing the cover a auto-generated cover is displayed instead. You might need to hit refresh in your browser to see the change.
es: Servidor de contenidos: Al modificar metadatos se añade un botón para eliminar la portada actual. Tenga en cuenta que tras eliminar la portada se muestra una portada generada automáticamente. Puede que tenga que actualizar la vista del navegador para ver el cambio.
pt_br: Servidor de conteúdo: Adiciona um botão para remover a capa existente ao editar os metadados. Note que depois de remover a capa, um capa gerada automaticamente será mostrada no lugar. Pode ser preciso clicar em "Atualizar" no seu navegador para ver a mudança.
uk: Сервер даних: у вікно редагування метаданих додано кнопку для вилучення наявного зображення обкладинки. Зауважте, що після вилучення такого зображення програма показуватиме автоматично створене зображення обкладинки. Щоб побачити зміни, вам, ймовірно, слід натиснути кнопку оновлення даних у вашій програмі для перегляду.

source: Content server: Date edit: Add buttons to clear the date or set it to today's date
es: Servidor contenidos: Editor de fecha: Se añaden botones para limpiar la fecha o establecerla a la fecha de hoy.
pt_br: Servidor de conteúdo: Edição de data: Adiciona um botão para limpar a data ou defini-la para a data de hoje
uk: Сервер даних: редагування дати: додано кнопки для вилучення дати та встановлення поточної дати.

source: When showing books on the device, disable keyboard shortcuts for actions that operate on library books
es: Cuando se muestran los libros en el dispositivo se desactivan los atajos de teclado para acciones que operan sobre libros en la biblioteca
pt_br: Ao mostrar os livros no dispositivo, desabilita atalhos de teclado para ações que operam nos livros da biblioteca
uk: При показі книг на пристрої вимкнено клавіатурні скорочення для дій, які виконуються над книгами у бібліотеці.

source: Content server: Custom List: Fix a zero series index being displayed as one
es: Servidor de contenidos: Lista personalizada: Se corrige el fallo por el que el número de serie cero se mostraba como uno
pt_br: Servidor de conteúdo: Lista personalizada: Corrige um índice de série igual a zero sendo mostrado como um
uk: Сервер даних: нетиповий список: виправлено показ нульового індексу у циклі як одиниці.

source: Content server: Fix covers not being updated in downloaded copies of some books.
es: Servidor de contenidos: Se corrige el fallo por el que no se actualizaban las portadas en las copias descargadas de algunos libros.
pt_br: Servidor de conteúdo: Corrige capas não sendo atualizadas em cópias baixadas de alguns livros.
uk: Сервер даних: виправлено помилку, пов'язану із тим, що у отриманих копіях деяких книг не оновлювалися зображення обкладинок.

source: PDF Output: Fix an error that could occur in rare circumstances when using the option to read page margins from the input document
es: Salida PDF: Se corrige un error que podía ocurrir en algunas circunstancias al usar la opción para leer los márgenes de página del documento de entrada
pt_br: Saída PDF: Corrige um erro que poderia ocorrer em raras circunstâncias ao usar a opção de obter as margens da página a partir do documento de entrada
uk: Виведення до PDF: виправлено помилку, яка траплялася у рідкісних випадках, коли використовувався варіант із читанням полів сторінки з вхідного документа.

source: Edit book: Check book: Fix an error if a filename contains a % character
es: Modificar libro: Comprobar libro: Se corrige un fallo si el nombre de archivo contiene un carácter «%»
pt_br: Editar livro: Verificar livro: Corrige um erro caso o nome do arquivo contenha um caractere %
uk: Засіб редагування книг: виправлено помилку, пов'язану із неправильною обробкою файлів, назви яких містять символ %.

source: PDF Output: Fix CSS opacity property causing text to not be rendered. Now opacity is ignored, as it is unsupported by Qt WebKit.
es: Salida PDF: Se corrige un fallo por el que la propiedad CSS «opacity» hacía que no se mostrara el texto. Ahora «opacity» se ignora, pues no está soportada por Qt WebKit.
pt_br: Saída PDF: Corrige a propriedade de opacidade do CSS impedindo o texto de ser renderizado. Agora a opacidade é ignorada, visto que não é suportada pelo Qt WebKit.
uk: Виведення до PDF: виправлено обробку властивості непрозорості у CSS. Помилка призводила до неможливості показу тексту. Тепер значення непрозорості пропускається, оскільки його підтримки у Qt WebKit не передбачено.

source: Create custom column dialog: Ensure that the format numbers field is always visible
es: Diálogo de creación de columna personalizada: Se asegura que el campo de formato de números siempre sea visible
pt_br: Cria caixa de diálogo de coluna personalizada: Garante que o campo de formato de números está sempre visível
uk: Вікно створення нетипових стовпчиків: забезпечено видимість поля кількості форматів.

source: 07 Sep, 2018
pt_br: 07 de Setembro de 2018
uk: 7 вересня 2018 року

source: Book list: Allow changing the font used for any column to bold and/or italic by right clicking on the column header and choosing 'Change font style'.
es: Lista de libros: Se permite cambiar el tipo de letra usado para cualquier columna a negrita y/o cursiva pulsando con el botón derecho sobre el encabezado y eligiendo «Cambiar estilo de tipo de letra».
pt_br: Lista de livros: Permite mudar a fonte usada para qualquer coluna para negrito e/ou itálico clicando com o botão direito do mouse no título da coluna e escolhendo "Mudar estilo de fonte".
uk: Список книг: уможливлено зміну шрифту, який використовується для будь-якого стовпчика на напівжирний і/або курсивний за допомогою контекстного меню заголовка стовпчика (можна викликати клацання правою кнопкою миші), у якому слід вибрати пункт «Змінити стиль шрифту».

source: Note that this setting is per-library so it has to be done once for the book list in every calibre library.
es: Tenga en cuenta que esta configuración es específica por cada biblioteca, así que debe hacerse una vez en la lista de libros para cada biblioteca de calibre.
pt_br: Note que esta configuração é por biblioteca, então terá que ser definida para a lista de livros em cada biblioteca do calibre.
uk: Зауважте, що цей параметр визначається на рівні бібліотеки. Його можна змінити один раз у списку книг будь-якої бібліотеки calibre.

source: fetch-ebook-metadata.exe: Allow specifying identifiers other than just ISBN
es: fetch-ebook-metadata.exe: Se permite especificar identificadores distintos del ISBN
pt_br: fetch-ebook-metadata.exe: Permite especificar outros identificadores além de apenas o ISBN
uk: fetch-ebook-metadata.exe: уможливлено визначення ідентифікаторів, відмінних від простого ISBN

source: Amazon metadata download: Add support for Amazon Australia (can be configured via Preferences-&gt;Metadata download-&gt;customize the amazon metadata source)
es: Descarga de metadatos de Amazon: Se permite el uso de Amazon Australia (puede configurarse en Preferencias &gt; Descarga de metadatos &gt; personalizar el origen de metadatos Amazon)
pt_br: Download de metadados da Amazon: Adiciona suporte para a Amazon da Austrália (pode ser configurado via Preferências-&gt;Download de metadados-&gt;configurar a fonte de metadados da Amazon)
uk: Отримання метаданих Amazon: додано підтримку Amazon Австралія (налаштувати можна на сторінці «Налаштування -&gt; Отримання метаданих -&gt; Налаштувати джерело метаданих amazon»)

source: Table of Contents Edit tool: When generating from XPath's add a checkbox to control if duplicate entries at the same level are added or not.
es: Herramienta de edición de índice: Al generar a partir de XPath se añade una casilla para controlar si se añaden o no entradas duplicadas al mismo nivel.
pt_br: Ferramenta de edição de Índice: Ao gerar o índice a partir de XPath, adiciona uma caixa de seleção para definir se entradas duplicadas no mesmo nível devem ser adicionadas ou não.
uk: Засіб редагування таблиці змісту: при створенні таблиці на основі XPath додано пункт керування тим, чи будуть додаватися дублікати на одному рівні.

source: Edit book: Allow disabling the popup to show changes after running the Fix HTML and Beautify all files tools.
es: Modificar libro: Se permite desactivar el mensaje emergente que muestra los cambios después de ejecutar las herramientas Corregir HTML y Embellecer todos los archivos.
pt_br: Editar livro: Permite desabilitar o pop-up para mostrar as mudanças após utilizar as ferramentas "Corrigir HTML" e "Embelezar todos os arquivos".
uk: Редагування книг: уможливлено вимикання контекстного вікна для показу змін після запуску засобів виправлення HTML та поліпшення усіх файлів.

source: DOCX Input: Fix figures in newer Word documents being duplicated.
es: Entrada DOCX: Se corrige el fallo por el que las figuras en documentos Word recientes se duplicaban.
pt_br: Entrada DOCX: Corrige figuras sendo duplicadas em novos documentos do Word.
uk: Вхідні дані DOCX: усунено дублювання рисунків у новіших документах Word.
