Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: calibre started life on 31 October, 2006, soon after the release of the SONY PRS-500, the first e-ink based reader to be sold commercially in the US. At the time, I was a graduate student, with a lot of time on my hands. The PRS-500 did not work at all with Linux, my operating system of choice, so I decided to reverse engineer the USB protocol that it used, to get it working on Linux. This was accomplished with the help of the fine folks over at <a href="%(mr)s" target="new">mobileread.com</a> and calibre was born, albeit named <code>libprs500</code>.
es: calibre comenzó su vida el 31 de octubre de 2006, poco después del lanzamiento del SONY PRS-500, el primer lector basado en tinta electrónico que se vendió comercialmente en EE. UU. En esa época yo era un estudiante universitario con mucho tiempo libre en mis manos. El PRS-500 no funcionaba en absoluto en Linux, mi sistema operativo preferido, por lo que decidí investigar con ingeniería inversa el protocolo USB que usaba, para hacer que funcionara en Linux. Esto lo conseguí con la ayuda de la buena gente en <a href="%(mr)s" target="new">mobileread.com</a> y calibre nació, aunque con el nombre de <code>libprs500</code>.
fr: calibre a vu le jour le 31 octobre 2006, peu après la sortie du SONY PRS-500, la première liseuse basée sur de l'encre électronique à être vendue commercialement aux USA. En ce temps là, j'étais un étudiant diplômé avec beaucoup de temps entre mes mains. Le SONY PRS-500 ne fonctionnait pas du tout avec Linux, mon système d'exploitation de préférence, aussi ai-je décidé de faire l'ingénierie inverse du protocole USB qu'elle utilisait, pour la rendre opérationnelle sous Linux. Ceci à été accompli avec l'aide de compagnons sympathiques sur <a href="%(mr)s" target="new">mobileread.com</a> et calibre était né, bien que nommé <code>libprs500</code>.
pt_br: O calibre veio a vida em 31 de October de 2006, logo após o lançamento do SONY PRS-500, o primeiro leitor e-ink a ser vendido comercialmente nos Estados Unidos. Na ocasião, eu era um estudante de graduação, com muito tempo nas mãos. O PRS-500 não funcionava com o Linux, meus sistema operacional, então eu resolvi fazer engenharia reversa no protocolo USB que ele utilizava, para fazê-lo funcionar no Linux. Isso foi alcançado com a ajuda do pessoal do <a href="%(mr)s" target="new">mobileread.com</a> e o calibre nasceu, embora chamado <code>libprs500</code>.
uk: Історія calibre розпочалася 31 жовтня 2006 року, невдовзі після випуску SONY PRS-500, першого пристною на основі електронних чорнил для читання книг, який почав продаватися у США. На той час автор програми був студентом, у якого було багато вільного часу. PRS-500 не працювала в його улюбленій системі, Linux, тому він вирішив розібратися із протоколом USB, який використовувався для зв'язку із пристроєм, і змусити його працювати у Linux. Це вдалося зробити завдяки допомозі чудових хлопців з <a href="%(mr)s" target="new">mobileread.com</a>. Так з'явилася на світ calibre, яка, втім, тоді називалася <code>libprs500</code>.

source: At the time there were no satisfactory tools to convert content into the <code>LRF</code> format, used by the SONY reader, so I decided to implement a converter to convert the most popular e-book formats to LRF. This converter proved to be wildly popular and far better than the (mostly non-existent) offerings from SONY. It was picked up and used by various publishing houses and content digitizers to produce the first generation of books in the LRF format.
es: Por entonces no había herramientas adecuadas para convertir el contenido al formato <code>LRF</code>, usado por el lector SONY, así que decidí desarrollar un conversor para convertir los formatos de libro electrónico más populares a LRF. Este conversor resultó muy popular y mucho mejor que las ofertas (casi inexistentes) de SONY. Fue recogido y utilizado por varias casas editoriales y digitalizadores de contenidos para producir la primera generación de libros en el formato LRF.
fr: À ce moment là il n'y avait pas d'outils satisfaisants pour convertir du contenu au format <code>LRF</code>, utilisé par la liseuse SONY, aussi ai-je décidé d'implémenter un convertisseur pour convertir les formats les plus populaires de livres numériques en LRF. Ce convertisseur s'est avéré être populaire d'une manière extravagante et bien meilleur que les (principalement non-existantes) offres de SONY. Il a été repris et utilisé par différentes maisons d'édition et des numériseurs de contenu pour produire la première génération de livres au format LRF.
pt_br: À época, não havia ferramentas satisfatórias para converter conteúdo no formato <code>LRF</code>, usado pelo leitor SONY, então eu decidi implementar um conversor para converter os formatos mais populares de e-book para LRF. Este conversor provou-se altamente popular e bem melhor do que as (praticamente inexistentes) ofertas da SONY. Ele foi escolhido e utilizado por várias editoras e digitalizadores de conteúdo para produzir a primeira geração de livros no formato LRF.
uk: На той час не існувало задовільних інструментів для перетворення даних у формат <code>LRF</code>, який використовувався на пристрої для читання SONY, тому автор вирішив реалізувати перетворення більшості популярних форматів електронних книг на LRF. Цей засіб перетворення набув шаленної популярності і став кращим за програми (яких майже не існувало) від SONY. Його було використано різними видавництвами та засобами оцифрування даних для створення першого покоління книг у форматі LRF.

source: As my e-book collection grew, I realized that managing it was quickly becoming unwieldy, so I decided to write a graphical interface to libprs500 to make it easier. This became calibre, in its present form, as a comprehensive e-book management tool. libprs500 was renamed to calibre in mid-2008. The name calibre was chosen by my wife, Krittika. The libre in calibre stands for freedom, indicating that calibre is a free and open source product, modifiable by all. Nonetheless, calibre should be pronounced as cali-ber, not ca-libre.
es: Al crecer mi colección de libros electrónicos, me di cuenta de que gestionarla se estaba convirtiendo en algo inmanejable, por lo que decidí escribir una interfaz gráfica para libprs500 para hacerlo más fácil. Esto resultó en calibre, en su forma actual, como una herramienta completa para gestión de libros electrónicos. libprs500 fue rebautizado como calibre a mediados de 2008. El nombre de calibre lo eligió mi esposa, Krittika. «Libre» hace alusión a la libertad, indicando que calibre es un producto libre y de código abierto, modificable por todos. No obstante, calibre debería pronunciarse como cali-ber, no ca-libre.
fr: Au fur et à mesure que ma collection de livres numérique a grandi, j'ai réalisé que la gérer était rapidement devenu complexe, aussi ai-je décidé d'écrire une interface graphique pour libprs500 afin de rendre ça plus facile. C'est devenu calibre, dans sa forme actuelle, comme outil complet de gestion de livres numériques. libprs500 a été renommé calibre mi 2008. Le nom calibre a été choisi par mon épouse, Krittika. Le mot libre dans calibre insiste sur la liberté, indiquant que calibre est un produit gratuit et open source, modifiable par tous. Néanmoins, calibre devrait être prononcé cali-ber, pas ca-libre.
pt_br: À medida que minha coleção de e-books crescia, eu me dei conta de que gerenciá-la estava se tornando difícil, então eu decidi criar uma interface gráfica para o libprs500 afim de facilitar. Isto tornou-se o calibre, na sua forma presente, como uma ferramenta abrangente de gerenciamento de e-books. O libprs500 foi renomeado para calibre em meados de 2008. O nome calibre foi escolhido pela minha esposa, Krittika. O libre em calibre significa liberdade, indicando que o calibre é um produto grátis e de código aberto, modificável por todos. Apesar disso, calibre deve ser pronunciado como cali-ber, e não ca-libre.
uk: Зі зростанням моєї збірки електронних книг я помітив, що керування збіркою ставало усе складнішим, тому вирішив написати графічний інтерфейс, щоб зробити libprs500 простішою у користуванні. Результатом стала calibre, у її нинішньому форматі, — повноцінна програма для керування електронними книгами. libprs500 було перейменовано на calibre у середині 2008 року. Назву calibre було вибрано моєю жінкою, Кріттікою. Частина «libre» у назві calibre означає свободу і позначає те, що calibre є вільним продуктом із відкритим кодом, який може змінювати будь-хто. Крім того, calibre слід вимовляти як «cali-ber», а не «ca-libre».

source: Today calibre is a vibrant open-source community with half a dozen developers and many, many testers and bug reporters. It is used in over 200 countries and has been translated into a dozen different languages by volunteers. calibre has become a comprehensive tool for the management of digital texts, allowing you to do whatever you could possibly imagine with your e-book library. Reading is very important to me and one of my goals has always been to prevent either the fragmentation or the monopolization of the e-book market by entities that care solely for short-term goals. As the calibre community continues to grow, driven by book lovers, for book lovers, hopefully it will always present an alternative for people that love to read e-books and want to be in control of their own digital libraries.
es: A día de hoy calibre es una comunidad activa de código abierto con media docena de desarrolladores y muchos, muchos probadores e informadores de fallos. Se usa en más de 200 países y ha sido traducido por voluntarios a una docena de idiomas. calibre se ha convertido en una herramienta completa para la gestión de textos digitales, permitiendo hacer cualquier cosa imaginable con las bibliotecas de libros electrónicos. La lectura es muy importante para mí y uno de mis objetivos ha sido siempre evitar tanto la fragmentación como la monopolización del mercado de libros electrónicos por entidades que sólo se preocupan por objetivos a corto plazo. Con el continuo crecimiento de la comunidad de calibre, impulsado por amantes de libros, para amantes de libros, es de esperar que siempre presente una alternativa para las personas a las que les gusta leer libros electrónicos y que quieren tener el control de sus propias bibliotecas digitales.
fr: Aujourd'hui, calibre est une communauté open source dynamique avec une demi douzaine de développeurs et beaucoup, beaucoup de testeurs et rapporteurs de bogues. Il est utilisé dans plus de 200 pays et a été traduit dans une douzaine de langues différentes par des volontaires. calibre est devenu un outil complet pour la gestion de textes numériques, vous permettant de faire tout ce que pourriez imaginer possible avec votre bibliothèque de livres numériques. Lire est très important pour moi et l'un de mes objectifs a toujours été d'empêcher la fragmentation ou la monopolisation du marché du livre numérique par des entités qui se préoccupent uniquement d'objectifs à court terme. Comme la communauté calibre continue à grandir, menée par des amoureux du livre, avec un peu de chance une alternative sera toujours présente pour les gens qui aiment lire des livres numériques et veulent avoir le contrôle de leurs propres bibliothèques numériques.
pt_br: Hoje, o calibre é vibrante comunidade de código aberto com meia dúzia de desenvolvedores e muitos, muitos testadores e relatores de erro. Ele é usado em 200 países e foi traduzido para uma dúzia de idiomas diferentes por voluntários. O calibre tornou-se uma ferramenta abrangente para o gerenciamento de textos digitais, permitindo que você faça o que quer que imagine com sua a biblioteca. A leitura é muito importante para mim e um dos meus objetivos sempre foi evitar a fragmentação e a monopolização do mercado de e-books por entidades que visam apenas metas de curto prazo. À medida que a comunidade do calibre continua crescendo, dirigida por amantes de livros, para amantes de livros, espera-se que ela sempre se apresente como uma alternativa para pessoas que amam ler e-books e querem estar no controle da suas próprias bibliotecas digitais.
uk: Сьогодні calibre є живою спільнотою, метою якої є створення вільного програмного забезпечення. У спільноті є з десяток розробників і багато, багато тестувальників і тих, хто стежить за якістю програми. Програмою користуються у понад 200 країнах, її перекладено десятком різних мов перекладачами-добровольцями. calibre стала повноцінним інструментом для керування цифровими текстами, який надає вам змогу виконувати майже будь-які дії, які тільки можна уявити собі для цифрової бібліотеки. Читання є дуже важливим зайняттям для мене, тому одним із моїх завдань завжди було запобігання надмірній фрагментації та монополізації ринку електронних книг тими, хто переслідує лише короткотермінові цілі. Зі зростанням спільноти calibre, рушієм якої є книголюби і завданням якої є задоволення потреб книголюбів, ми сподіваємося, програма завжди буде альтернативою для тих, хто полюбляє читати і хоче контролювати власну цифрову бібліотеку.

source: Asking for help
es: Pedir ayuda
fr: Demander de l'aide
pt_br: Pedindo ajuda
uk: Консультаційні ресурси

source: The best places to ask for help with calibre are the very active <a target="forum" href="%(forum)s">calibre forum</a> at mobileread.com, where there are a number of friendly and knowledgeable long time users/developers of calibre. In addition, there is the <a href="%(fb)s">calibre Facebook fan page</a> and <a target="twitter" href="%(tw)s">#calibreforum</a> on Twitter.
es: Los mejores lugares para pedir ayuda con calibre están en el <a target="forum" href="%(forum)s">foro de calibre</a>, muy activo, en mobileread.com, frecuentado por usuarios y desarrolladores de calibre amables y experimentados. Además, está la <a href="%(fb)s">página Facebook de calibre</a> y <a target="twitter" href="%(tw)s">#calibreforum</a> en Twitter.
fr: Les meilleurs endroits pour demander de l'aide sur calibre sont les <a target="forum" href="%(forum)s">forums calibre</a> sur mobileread.com. Vous y trouverez de nombreux développeurs et utilisateurs de longue date pour répondre à vos questions (en anglais). De plus, vous pouvez consulter la <a href="%(fb)s">page Facebook de calibre</a> et <a target="twitter" href="%(tw)s">#calibreforum</a> sur Twitter.
pt_br: O melhor lugar para pedir ajuda sobre o calibre é o muito ativo <a target="forum" href="%(forum)s">fórum do calibre</a> no mobileread.com, onde há um grande número de amigáveis e experientes usuários/desenvolvedores de longa data do calibre. Além disso, há a <a href="%(fb)s">fan page do calibre no Facebook</a> e <a target="twitter" href="%(tw)s">#calibreforum</a> no Twitter.
uk: Найліпшими місцями для консультацій з calibre є дуже активний <a target="forum" href="%(forum)s">форум calibre</a> на mobileread.com, де ви зможте зв'затися із багатьма дружніми і дуже інформованими досвідченими користувачами і розробниками calibre. Крім того, можна скористатися <a href="%(fb)s">сторінкою прихильників calibre на Facebook</a> та каналом <a target="twitter" href="%(tw)s">#calibreforum</a> у Twitter.

source: Reporting issues and asking for new features
es: Informar de problemas y solicitar nuevas funciones
fr: Signaler des problèmes et demander de nouvelles fonctionnalités
pt_br: Reportando problemas e pedindo por novos recursos
uk: Надсилання звітів щодо вади та запитів щодо нових можливостей

source: If you discover a problem with calibre or would like to request a new feature, the best place to do it is via the calibre <a href="%(href)s">Bug tracker</a>. Be aware that calibre is developed by volunteers, which means that your bug report/feature request may or may not get attention, so if you are looking for help, the best place is the forum linked to above.
es: Si descubre un problema con calibre o le gustaría pedir una nueva característica, la mejor manera de comunicarlo es mediante el <a href="%(href)s">seguimiento de fallos</a> de calibre. Recuerde que calibre está desarrollado por voluntarios, lo que significa que sus informes de fallos o solicitudes de nuevas características pueden no recibir mucha atención, por lo que si está buscando ayuda el mejor lugar es el foro indicado más arriba.
fr: Si vous découvrez un problème avec calibre ou souhaitez demander une nouvelle fonctionnalité, le meilleur endroit pour le faire est via le <a href="%(href)s">Bug tracker</a> de calibre. Soyez conscient que calibre est développé par des bénévoles, ce qui signifie que votre rapport de bug ou demande de fonctionnalité peut ne pas être remarqué. Donc si vous cherchez de l'aide, le meilleur endroit est le forum indiqué ci-dessus.
pt_br: Se você descobrir um problema com o calibre ou gostaria de solicitar um novo recurso, a melhor maneira é atravé do <a href="%(href)s">Bug tracker</a> do calibre. Lembre-se de que o calibre é desenvolvido por voluntários, o que significa que o seu relatório de erro/ pedido de recurso pode ou não receber atenção, então se você está procurando por ajuda, o melhor lugar é o fórum descrito acima.
uk: Якщо вами було виявлено проблему у calibre або у вас виникла ідея щодо нової можливості у програмі, найкращим місцем повідомити про це є <a href="%(href)s">система стеження за вадами</a> calibre. Варто врахувати те, що розвиток calibre відбувається за рахунок добровільних зусиль, а це означає, що ваше повідомлення може нікого не зацікавити. Тому, якщо вам потрібна конкретна допомога, краще звернутися по неї на форму, посилання на який наведено вище.

source: calibre is an open source application that uses a large number of other open source libraries and is developed on Linux, an open source platform, and as such, it has benefited from the work of large numbers of people, some of whom are listed below. I've tried to be as exhaustive as possible, but, if I have omitted your contribution, please let me know.
es: calibre es un programa de código abierto que usa un gran número de otras librerías de código abierto y está desarrollado en Linux, una plataforma de código abierto. Por lo tanto, se ha beneficiado del trabajo de un gran número de personas, algunas de las cuales se listan a continuación. He intentado ser tan exhaustivo como ha sido posible, pero si he omitido su contribución, hágamelo saber, por favor.
fr: calibre est une application open source qui utilise un grand nombre d'autres librairies open source et est développé sous Linux, une plateforme open source, et en tant que tel, il a bénéficié du travail d'un grand nombre de personnes. certaines d'entre elles sont listées ci-dessous. J'ai essayé d'être aussi exhaustif que possible, mais si j'ai omis votre contribution, merci de me le faire savoir.
pt_br: O calibre é um programa de código aberto que usa um grande número de outras bibliotecas de código aberto e é desenvolvido no Linux, uma plataforma de código aberto, e como tal, tem se beneficiado do trabalho de uma grande quantidade de pessoas, algumas das quais estão listadas abaixo. Eu tentei ser o mais abrangente possível, mas, se eu omiti sua contribuição, por favor me avise.
uk: calibre — програма з відкритим кодом, у якій використовується багато інших бібліотек із відкритим кодом, які розроблено для Linux, платформи з відкритим кодом, і через це у програмі використовується робота багатьох людей. Імена деяких з них наведено у списку нижче. Автор списку намагався зробити його якомога повнішим, але, якщо він пропустив когось, будь ласка, повідомте його про це.

source: Contributors of code/bug fixes
es: Código y correcciones de fallos
fr: Les contributeurs au code/à la correction des bogues
pt_br: Contribuidores de código/correção de erros
uk: Потенційні розробники коду та ті, хто виправляв вади

source: In no particular order:
es: Sin ningún orden en particular:
fr: Dans aucun ordre particulier :
pt_br: Em nenhuma ordem particular:
uk: Без певного порядку:

source: Marshall Vandegrift: For epub2lrf, lit2oeb, oeb2mobi and various improvements in the html2lrf code, as well as the basic framework for the conversion pipeline in the 0.6.x series
es: Marshall Vandegrift: Por epub2lrf, lit2oeb, oeb2mobi y varias mejoras en el código de html2lrf, así como la estructura básica del proceso de conversión en la serie 0.6.x
fr: Marshall Vandegrift : Pour epub2lrf, lit2oeb, oeb2mobi et différentes améliorations dans le code de html2lrf, ainsi que dans la structure de base du pipeline de conversion dans la série 0.6.x
pt_br: Marshall Vandegrift: pelo epub2lrf, lit2oeb, oeb2mobi e várias melhorias no código do html2lrf, assim como a estrutura básica para o pipeline de conversão na série 0.6.x
uk: Marshall Vandegrift: epub2lrf, lit2oeb, oeb2mobi та різноманітні удосконалення у коді html2lrf, а також базова бібліотека для конвеєра перетворень у версіях 0.6.x

source: John Schember: For the new calibre device driver framework, various GUI enhancements and several input and output format plugins and the "Get Books" feature
es: John Schember: Por la nueva estructura de controladores de dispositivo de calibre, varias mejoras de la interfaz gráfica y varios complementos de formato de entrada y salida, así como la función «Obtener libros»
fr: John Schember : Pour la nouvelle structure du pilote de périphérique calibre, différentes améliorations de l'interface utilisateur, plusieurs extensions de format d'entrée et de sortie et la fonctionnalité "Obtenir des livres"
pt_br: John Schember: Pela nova estrutura de driver de dispositivo do calibre, várias melhorias na Interface Gráfica e muitos plugins de formatos de entrada e saída, além da função "Obter livros"
uk: John Schember: нова бібліотека драйверів пристроїв calibre, різноманітні удосконалення графічного інтерфейсу, а також декілька додатків форматів вхідних і вихідних даних разом із можливістю отримання книг.

source: Charles Haley: For custom columns, saved searches, restrictions, the wireless device driver, lots of other help/ideas
es: Charles Haley: Por las columnas personalizadas, búsquedas guardadas, restricciones, el controlador inalámbrico y muchas otras ayudas e ideas
fr: Charles Haley : Pour les colonnes personnalisées, les recherches sauvegardées, les restrictions, le pilote de périphérique sans fil, de nombreuses autres aides et idées
pt_br: Charles Haley: Pelas colunas personalizadas, pesquisas salvas, restrições, o driver de dispositivo sem fio, e várias outras ajudas/ideias
uk: Charles Haley: нетипові стовпчики, збережені пошуки, обмеження, драйвер бездротових пристроїв, багато допомоги та ідей

source: Gregory Riker: For MOBI indexing, catalogs, the iPad driver
es: Gregory Riker: Por el índice MOBI, catálogos y el controlador iPad
fr: Gregory Riker: pour le catalogage et l'indexation du format MOBI et pour le pilote iPad.
pt_br: Gregory Riker: Pelo indexamento de MOBIs, catálogos, e o driver do iPad
uk: Gregory Riker: індексування MOBI, каталоги, драйвер iPad

source: Roger Critchlow: For the initial implementation of lrs2lrf
es: Roger Critchlow: Por la implementación inicial de lrs2lrf
fr: Roger Critchlow : Pour l'implémentation initiale de lrs2lrf
pt_br: Roger Critchlow: Pela implementação inicial do lrs2lrf
uk: Roger Critchlow: початкова реалізація lrs2lrf

source: Anatoly Shipitsin: For fb2lrf and fb2-meta
es: Anatoly Shipitsin: Por fb2lrf y fb2-meta
fr: Anatoly Shipitsin : Pour fb2lrf et fb2-meta
pt_br: Anatoly Shipitsin: Pelo fb2lrf e fb2-meta
uk: Anatoly Shipitsin: fb2lrf і fb2-meta

source: Ori Avtalion and WayneD for various bug fixes
es: Ori Avtalion y WayneD por varias correcciones de fallos
fr: Ori Avtalion et WayneD pour diverses corrections de bogues
pt_br: Ori Avtalion e WayneD pelas várias correções de erros
uk: Ori Avtalion і WayneD — різноманітні виправлення вад
