Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Translations FAQ
es: Preguntas frecuentes sobre traducciones
fr: FAQ traductions
pt_br: FAQ de traduções
uk: Питання і відповіді щодо перекладів

source: What to do with the &amp; symbols?<br />The &amp; symbols denote a keyboard shortcut. So for example the string "&amp;Title" means that the corresponding GUI element can be accessed with the keyboard shortcut "Alt+t" (this only works on Windows/Linux). So in your translation leave the &amp; symbol before the same letter if possible, or some other suitable letter.
es: ¿Qué hacer con los signos &amp;?<br /> Los signos &amp; indican un atajo de teclado. Por ejemplo, el texto «&amp;Title» significa que el correspondiente elemento de la interfaz gráfica puede activarse con la combinación de teclas «Alt+t» (sólo funciona en Windows y Linux). Por lo tanto, en la traducción deje el signo &amp; frente a la misma letra si es posible, u otra letra adecuada.
fr: Que faire avec les symboles &amp; ?<br /> Les symboles &amp; indiquent un raccourci clavier. Par exemple, la chaîne "&amp;Titre" signifie que l'élément correspondant peut être accédé avec le raccourci clavier "Alt+t" (ceci fonctionne uniquement sous Windows et Linux). Dans votre traduction, laissez le symbole avant la même lettre si possible, ou avant une autre lettre appropriée.
pt_br: O que fazer com símbolos &amp;?<br />O símbolos &amp; denotam um atalho de teclado. Assim, por exemplo, a string "&amp;Título" significa que o elemento GUI correspondente pode ser acessado com o atalho de teclado "Alt+t" (isto funciona apenas no Windows/Linux). Assim, na sua tradução deixe o símbolo &amp; antes da mesma letra se possível, ou alguma outra letra adequada.
uk: Що робити з символами &amp;?<br />Символи &amp; позначають клавіатурні скорочення. Отже, наприклад, рядок «&amp;Title» означає, що доступ до відповідного елемента графічного інтерфейсу користувача можна отримати натисканням клавіатурного скорочення «Alt+T» (це працює лише у Windows/Linux). Отже, у вашому перекладі розташуйте символ &amp; перед тією самою літерою або якоюсь іншою відповідною літерою.

source: What to do with the "%%A_Word" characters?<br />The %% character and a word to the right of it (no space between the percentage sign and the word), denotes a word that will be replaced by the code. So when encountering this symbol and a word right next to it (example: %%default), don't change it. Keep it as is in the translated sentence. Similarly for sequences like %%s or %%d, leave them as is. Finally, sequences like %%(some_word)s should also be left unchanged.
es: ¿Qué hacer con los caracteres «%%una_palabra»?<br />El carácter %% y una palabra a continuación (sin espacio entre ambos), marca una palabra que será sustituida por el código. Cuando encuentre este signo junto a una palabra (por ejemplo: %%default), no los cambie. Manténgalos tal cual en el texto traducido. Igualmente para secuencias como %%s o %%d, déjelas tal cual. Por último, secuencias como %%(algunas_palabras) también deben dejarse sin modificar.
fr: Que faire avec les caractères "%%A_Word"<br /> Le caractère %% et un mot à sa droite (pas d'espace entre le signe pourcentage et le mot) indique un mot qui sera remplacé par du code. Donc lorsque vous rencontrer ce symbole et un mot juste à sa droite (exemple : %%default) ne le changez pas. Gardez le tel qu'il se trouve dans la phrase. De même manière pour les phrases telles que %%s ou %%d, gardez les telles quelles. Pour finir, les phrases comme %%(some_word)s doivent également être laissées inchangées.
pt_br: O que fazer com os caracteres "%%Uma_Palavra" ?<br />O caractere %% e um palavra à sua direita (sem espaço entre o sinal de porcentagem e a palavra), denota uma palavra que será substituída pelo código. Então, ao encontrar este símbolo e uma palavra bem à sua direita (exemplo: %%default), não altere. Mantenha como está na sentença traduzida. Similarmente, para sequências como %%s ou %%d, deixa-as como estão. Finalmente, sequências como %%(alguma_palavra)s também devem ser deixadas inalteradas.
uk: Що робити із записами «%%Якесь_слово»?<br />Символ %% зі словом після нього (без пробілу між символом відстотків і словом), позначає слово, яке буде замінено фрагментом коду. Отже, якщо вам трапиться цей символ із словом після нього (приклад: %%default), не змінюйте у записі нічого. Залиште його як є у перекладеному реченні. Так само, не слід чіпати записи %%s і %%d, просто скопіюйте їх у перекладі. Нарешті, також не слід чіпати записи %%(якесь_слово)s.

source: What to do with <code>{word}</code> constructs?<br />These are placeholders and must not be translated. They will be replaced with actual content by the code.
es: ¿Qué hacer con construcciones de tipo <code>{palabra}</code>?<br />Son marcadores y no deben traducirse. El código los sustituirá por el contenido real.
fr: Que faire avec les élaborations <code>{word}</code> ? <br />Ce sont des espaces réservés et ils ne doivent pas être traduits. Ils seront remplacés par du contenu actualisé par le code.
pt_br: O que fazer com construções do tipo <code>{palavra}</code>?<br />Estes são espaços reservados e não devem ser traduzidos. Eles serão substituídos por conteúdo real pelo código.
uk: Що робити із конструкціями типу <code>{слово}</code>?<br />Ці слова-замінники не слід перекладати. Заміну на значення буде виконано шляхом обробки виразу програмним кодом.

source: What to do with date strings like dd MMM yyy?<br />These must be left untranslated.
es: ¿Qué hacer con formatos de fecha como dd MMM yyy?<br />Deben dejarse sin traducir.
fr: Que faire avec les champs date comme dd MM yyy ? <br /> Ceux-ci doivent être laissés non traduits.
pt_br: O que fazer com strings de data como dd MMM yyyy? <br />Estas devem ser deixadas sem traduzir.
uk: Що робити із рядками дат, зокрема «dd MMM yyy»?<br />Ці рядки не слід перекладати.

source: What to do with the special markup when translating the User Manual?<br /> The User Manual is written in <a href="%(sphinx)s">ReSTructured Text</a>. You will see many constructs like <code>:guilabel:`Some text`</code>. Here the <code>:guilabel:``</code> part is markup, like HTML tags. You should only translate the text within the backticks. Particular care must be taken with links, of the following forms:
es: ¿Qué hacer con el formato especial al traducir el Manual de usuario?<br />El Manual de usario está escrito en <a href="%(sphinx)s">ReSTructured Text</a>. Verá muchas construcciones como <code>:guilabel:`Algún texto`</code>. Aquí la parte <code>:guilabel:``</code> es una marca de formato, como las etiquetas HTML. Debe traducir únicamente el texto entre los acentos graves. Debe tener un cuidado especial con los enlaces, de las siguientes formas:
fr: Que faire avec le balisage spécial lors de la traduction du Manuel Utilisateur ? <br /> Le Manuel Utilisateur est écrit en <a href="%(sphinx)s">ReStructured Text</a>. Vous verrez de nombreuses constructions comme <code>:guilabel:`Du texte`</code>. Ici, la partie <code>:guilabel:``</code> est le balisage, comme des balises HTML. Vous devez seulement traduite le texte entre les apostrophes ouvrantes. Un soin particulier doit être pris avec les liens de formes suivantes :
pt_br: O que fazer com marcação especial ao traduzir o Manual do Usuário<br /> O Manual do Usuário é escrito em <a href="%(sphinx)s">ReSTructured Text</a>. Você verá muitas construções como <code>:guilabel:`Algum texto`</code>. Aqui a parte <code>:guilabel:``</code> é marcação, como tags HTML. Você deve traduzir apenas o texto dentro das marcas ``. Cuidado particular deve ser tomado com links, das seguintes formas:
uk: Що робити із спеціальною розміткою під час перекладу підручника користувача?<br /> Підручник користувача написано мовою <a href="%(sphinx)s">ReSTructured Text</a>. У тексті ви побачите багато конструкцій, які подібні до <code>:guilabel:`Якийсь текст`</code>. У цьому прикладі <code>:guilabel:``</code> є частиною розмітки, подібної до теґів HTML. Вам слід перекласти лише текст у лаптках. Особливу увагу слід приділити посиланням, які записутються у таких форматах:

source: <code>:ref:`some text`</code> Here nothing must be translated.
es: <code>:ref:`algún texto`</code> Aquí no debe traducirse nada.
fr: <code>:ref:`some text`</code> Ici rien ne doit être traduit.
pt_br: <code>:ref:`algum texto`</code> Aqui, nada deve ser traduzido.
uk: <code>:ref:`якийсь текст`</code> — цей фрагмент не слід перекладати.

source: <code>:ref:`Some text &lt;link-location&gt;`</code> Here only "Some text" must be translated.
es: <code>:ref:`Algún texto &lt;ubicación-de-enlace&gt;`</code> Aquí sólo debe traducirse «Algún texto».
fr: <code>:ref:`Some text &lt;link-location&gt;`</code> Ici seul "Some text" doit être traduit.
pt_br: <code>:ref:`Algum texto &lt;localização-do-link&gt;`</code> Aqui, apenas o "Algum texto" deve ser traduzido.
uk: <code>:ref:`Якийсь текст &lt;посилання&gt;`</code> Тут слід перекласти лише «Якийсь текст».

source: <code>:doc:`generated/en/something`</code> Should be replaced by :doc:`generated/your_language_code/something`. For example <code>:doc:`generated/en/cli-index`</code> becomes <code>:doc:`generated/de/cli-index`</code> in German.
es: <code>:doc:`generated/en/algo`</code> Debe sustituirse por :doc:`generated/código_de_su_idioma/algo`. Por ejemplo <code>:doc:`generated/en/cli-index</code> se convierte en <code>:doc:`generated/es/cli-index`</code> en español.
fr: <code>:doc:`generated/en/something`</code> Doit être remplacé par :doc:`generated/votre_code_langue/something`. Par exemple <code>:doc:`generated/en/cli-index`</code> devient <code>:doc:`generated/fr/cli-index`</code> en Français.
pt_br: <code>:doc:`generated/en/something`</code> Deve ser substituído por :doc:`generated/seu_código_de_idioma/something`. Por exemplo <code>:doc:`generated/en/cli-index`</code> se torna <code>:doc:`generated/pt_BR/cli-index`</code> em Português Brasileiro.
uk: <code>:doc:`generated/en/щосьтам`</code> має бути замінено на :doc:`generated/код_вашої_мови/щосьтам`. Наприклад, <code>:doc:`generated/en/cli-index`</code> для української має бути замінено на <code>:doc:`generated/uk/cli-index`</code>.

source: How do I test my translations?<br />First you need to download a .po file for your language from <a href="%(tloc)s" target="new">here</a>. You can test your .po file by setting the environment variable CALIBRE_TEST_TRANSLATION to the path of the downloaded .po file. Then run calibre as normal. Currently, it is not possible to test the User Manual translations.
es: ¿Como puedo probar mi traducción?<br />Primero debe descargar un archivo .po para su idioma de <a href="%(tloc)s" target="new">aquí</a>. Puede probar el archivo .po estableciendo la variable de entorno CALIBRE_TEST_TRANSLATION como la ruta al archivo .po descargado. Después ejecute calibre normalmente. Actualmente no es posible probar las traducciones del Manual de usuario.
fr: Comment puis-je tester mes traductions ?<br /> Tout d'abord, vous devez télécharger un fichier .po pour votre langue <a href="%(tloc)s" target="new">ici</a>. Vous pouvez tester votre fichier .po en définissant la variable d'environnement CALIBRE_TEST_TRANSLATION au chemin du fichier .po télécharger. Exécutez alors calibre comme d'habitude. Actuellement, il n'est pas possible de tester les traductions du Manuel Utilisateur.
pt_br: Como eu testo minhas traduções?<br />Primeiramente você precisa baixar um arquivo .po para o seu idioma <a href="%(tloc)s" target="new">daqui</a>. Você pode testar seu arquivo .po criando a variável de ambiente CALIBRE_TEST_TRANSLATION com o valor correspondente ao caminho para o arquivo .po baixado. Então execute o calibre normalmente. Atualmente, não é possível testar as traduções do Manual do Usuário.
uk: Як перевірити створений вами переклад?<br />Спочатку вам слід отримати файл .po перекладу вашою мовою <a href="%(tloc)s" target="new">звідси</a>. Тестування вашого файла .po можна розпочати після встановлення для змінної середовища CALIBRE_TEST_TRANSLATION значення, яке збігається із шляхом до отриманого файла .po. Далі, слід запустити calibre у звичний спосіб. У поточній версії не передбачено способів тестування перекладів підручника.

source: Becoming a calibre developer
es: Hacerse desarrollador de calibre
fr: Devenir un développeur de calibre
pt_br: Torne-se um desenvolvedor do calibre
uk: Як стати розробником calibre

source: Get the source:
es: Obtenga el código fuente:
fr: Obtenir la source :
pt_br: Obtenha o código fonte:
uk: Отримання початкових кодів:

source: Or if you dont want to wait for the full version history to download, you can get only the source code:
es: O, si no quiere esperar a que se descargue todo el historial de versiones, puede obtener sólo el código fuente:
fr: Ou si vous ne voulez pas attendre après l'historique complète de la version à télécharger, vous pouvez obtenir seulement le code source :
pt_br: Ou se você não quer esperar para baixar a versão completa, você pode obter apenas o código fonte:
uk: Або якщо ви не хочете чекати на отримання повної версії історії, ви можете отримати лише початковий код:

source: Instructions for getting calibre to run using your source checkout, as well as some info about how the calibre code is organized is in the <a target="usermanual" href="%(develop)s">User Manual</a>.
es: Puede encontrar instrucciones sobre cómo ejecutar calibre usando el código fuento, así como alguna información sobre cómo está organizado en el <a target="usermanual" href="%(develop)s">Manual de usuario</a>.
fr: Les instructions pour faire en sorte que calibre soit exécuté avec votre contribution au code source, aussi bien que certaines informations sur comme est organisé le code de calibre se trouve dans le <a target="usermanual" href="%(develop)s">Manuel Utilisateur</a>.
pt_br: Instruções sobre como fazer o calibre rodar utilizando seu código fonte, assim como algumas informações sobre como o código do calibre é organizado estão no <a target="usermanual" href="%(develop)s">Manual do Usuário</a>.
uk: Настанови щодо того, як зібрати calibre на основі отриманого знімка коду, а також деяку інформацію щодо того, як упорядковано код calibre наведено у the <a target="usermanual" href="%(develop)s">Підручнику користувача</a>.

source: If you come up with a cool idea and a patch for implementing it, let us know about it and more than likely it will be in the next weekly calibre release. A great place to ask for tips on calibre hacking is the <a target="_blank" href="%(forum)s">calibre Development forum</a> where lots of calibre developers hang out.
es: Si se le ocurre una buena idea y crea un parche que la implementa, háganoslo saber y muy posiblemente aparecerá en la próxima versión semanal de calibre. Un lugar estupendo para obtener consejos sobre cómo modificar el código de calibre es el <a target="_blank" href="%(forum)s">foro de desarrollo de calibre</a>, que muchos desarrolladores de calibre visitan frecuentemente.
fr: Si vous venez avec une idée sympa et un patch pour l'implémenter, faite le nous savoir et plus que probablement il sera dans la prochaine sortie hebdomadaire de calibre. Un bel endroit pour demander des conseils sur le bidouillage de calibre est le <a target="_blank" href="%(forum)s">calibre Development forum</a> où beaucoup de développeurs calibre traînent.
pt_br: Se você tiver uma boa ideia e um patch para implementá-la, conte-nos sobre ela e muito provavelmente ela estará na próxima versão semanal. Um bom lugar para pedir dicas sobre como hackear o calibre é no <a target="_blank" href="%(forum)s">fórum de Desenvolvimento do calibre</a> onde vários desenvolvedores do calibre trocam ideias.
uk: Якщо у вас виникла блискуча ідея і ви написали латку до коду програми для її реалізації, повідомте нам про це і ми найімовірніше включимо ваш код до наступного щотижневого випуску calibre. Чудовим місцем для отримання підказок щодо роботи з кодом calibre є <a target="_blank" href="%(forum)s">форум розробників calibre</a>, де можна отримати поради від більшості розробників calibre.

source: About
es: Acerca de
fr: À propos
pt_br: Sobre
uk: Про модуль

source: About calibre
es: Acerca de calibre
fr: À propos de calibre
pt_br: Sobre o calibre
uk: Про calibre

source: A brief description of calibre's many features
es: Una breve descripción de las muchas características de calibre
fr: Une brève description des nombreuses fonctionnalités de calibre
pt_br: Uma breve descrição dos muitos recursos do calibre
uk: Короткий опис багатьох можливостей calibre

source: Features
es: caracteristicas
fr: Fonctionnalités
pt_br: Recursos
uk: Можливості

source: A history of the development of calibre
es: Historia del desarrollo de calibre
fr: Histoire du développement de calibre
pt_br: Uma história do desenvolvimento do calibre
uk: Історія розробки calibre

source: History
es: Historia
fr: Histoire
pt_br: História
uk: Історія

source: The best ways to contact the calibre team
es: Las mejores maneras de contactar con el equipo de calibre
fr: Les meilleures façons de contacter l'équipe de calibre
pt_br: As melhores maneiras de se contatar o time do calibre
uk: Найкращі способи зв’язатися із командою calibre

source: A list of contributors to the calibre community
es: Una lista de contribuyentes a la comunidad calibre
fr: Une liste des contributeurs à la communauté calibre
pt_br: Uma lista de contribuidores da comunidade do calibre
uk: Список учасників спільноти calibre

source: Contributors
es: Contribuyentes
fr: Contributeurs
pt_br: Contribuidores
uk: Учасники розробки

source: Mentions of calibre in the press
es: Menciones de calibre en la prensa
fr: Mentions à propos de calibre dans la presse
pt_br: Menções ao calibre na imprensa
uk: Згадки calibre у пресі

source: Press
es: Prensa
fr: Presse
pt_br: Imprensa
uk: У пресі

source: <b>calibre is a powerful and easy to use e-book manager</b>. Users say it’s <i>outstanding</i> and a <i>must-have</i>. It’ll allow you to do nearly everything and it takes things a step beyond normal e-book software. It’s also <b>completely free</b> and open source and great for both <b>casual users</b> and computer experts.
fr: <b>calibre est un gestionnaire de livre numérique puissant et facile à utiliser</b>. Les utilisateurs disent qu'il est <i>exceptionnel</i> et <i>incontournable</i>. Il vous permettra de réaliser presque n'importe quoi et va plus loin qu'un logiciel de livre numérique normal. Il est également <b>entièrement gratuit</b>, open source et il est idéal pour les <b>utilisateurs occasionnels</b> tout comme les experts en informatique.

source: Save time on managing your e-book collection
es: Ahorre tiempo administrando so colección de libros electrónicos
fr: Gagner du temps dans la gestion de votre collection de livres numériques
pt_br: Poupe tempo ao gerenciar sua coleção de e-books
uk: Заощадьте час на керуванні вашою збіркою електронних книг

source: calibre’s user interface is designed to be as simple as possible. <b>Large buttons</b> in the main window take care of most of your needs. The vast number of calibre’s features and options is always clearly displayed under <b>intuitive tabs</b>. Its context menus are neatly sorted, so the things you’re looking for almost find themselves on their own. <b>You’re never more than three clicks away from your goal.</b> It’s the result of years of tweaking calibre’s interface based on users’ feedback. Plus, you can change many aspects of how calibre looks and feels and try one of the three built-in library views to browse your book collection using covers, titles, tags, authors, publishers, etc.
es: La interfaz de usuario de calibre está diseñada para ser lo más simple posible. Los <b>botones grandes</b>en la ventana principal se encargan de la mayor parte de sus necesidades. El gran número de funciones y opciones de calibre se muestran siempre bajo <b>pestañas intuitivas</b>. Sus menús contextuales están cuidadosamente ordenados, por lo que las cosas que busque casi se encuentran por sí mismas. <b>Nunca estará a más de tres pulsaciones de su objetivo.</b> Es el resultado de años de ajustes en la interfaz de calibre basándonos en los comentarios de los usuarios. Además, puede cambiar muchos detalles del aspecto calibre y probar una de las tres vistas integradas de la biblioteca para explorar su colección de libros usando portadas, títulos, etiquetas, autores, editoriales, etc.
fr: L'interface utilisateur calibre est conçue pour être aussi simple que possible. <b>De grands boutons</b> dans la fenêtre principale prennent soin de la plupart de vos besoins. Le vaste nombre de fonctionnalités et d'options de calibre est toujours affiché sous <b>des onglets intuitifs</b>. Ses menus contextuels sont soigneusement triés, de ce fait les choses que vous recherchez se trouvent d'elles-mêmes. <b>Vous n'êtes jamais à plus de trois clics de votre objectif.</b> C'est le résultat d'années d'ajustements de l'interface de calibre basée sur les retours des utilisateurs. De plus, vous pouvez modifier beaucoup d'aspects de la manière dont calibre se présente et essayer l'une des trois vues intégrées de la bibliothèque pour parcourir votre collection de livres utilisant les couvertures, titres, étiquettes, auteurs, éditeurs, etc.
pt_br: A interface de usuário do calibre é desenhada para ser o mais simples possível. <b>Botões grandes</b> na janela principal cuidam da maioria das suas necessidades. O vasto número de recursos e opções do calibre é sempre claramente exibido sob <b>abas intuitivas</b>. Seus menus de contexto são bem organizados, de forma que as coisas que você procura quase se encontram por conta própria. <b>Você nunca está a mais de três cliques do seu objetivo.</b> É o resultado de anos ajustando a interface do calibre baseado no feedback dos usuários. Além disso, você pode alterar vários aspectos da aparência do calibre e tentar uma das três visualizações pré-definidas de bibliotecas para navegar na sua coleção de livros utilizando capas, títulos, etiquetas, autores, editoras, etc.
uk: Інтерфейс користувача calibre розроблено так, щоб він був якомога простішим. За допомогою <b>великих кнопок</b> у головному вікні програми можна виконати більшість найпотрібніших дій. Основну частину можливостей і параметрів calibre завжди буде показано на <b>інтуїтивно зрозумілих вкладках</b>. Контекстні меню програми добре впорядковано, тому більшість дій, які вам знадобляться, дуже просто відшукати. <b>До потрібного вам пункту завжди буде не більше за три клацання кнопкою миші.</b> Це результат років коригування інтерфейсу calibre за запитами користувачів. Крім того, ви можете змінити багато із аспектів вигляду і поведінки calibre, а також спробувати один із трьох вбудованих режимів перегляду бібліотеки для навігації вашою збіркою книг на основі зображень обкладинок, назв книг, міток, імен авторів, видавців тощо.
