Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: DOCX Input: Fix failure to convert some DOCX files that use Symbol fonts.
es: Entrada DOCX: Se corrige el fallo en la conversión de algunos archivos DOCX que usan tipos de letra Symbol.
pt_br: Entrada DOCX: Corrige falha na conversão de alguns arquivos DOCX que usam a fonte Symbol.
uk: Вхідні дані DOCX: виправлено помилку, пов'язану із перетворенням деяких файлів DOCX, де використовуються шрифти Symbol.

source: When exporting very large libraries fix failures due to busy errors.
es: Al exportar bibliotecas muy grandes se corrigen fallos debidos a errores de ocupado.
pt_br: Corrige falhas devidas a erros de "ocupado" ao exportar bibliotecas muito grandes.
uk: Виправлено пов'язані із перевантаженням помилки під час експортування дуже великих бібліотек.

source: Fix commas not working in identifiers that are transformed to URLs via rules.
es: Se corrige el fallo por el que no funcionaban las comas en identificadores que se convierten a URL mediante reglas.
pt_br: Corrige vírgulas não funcionando nos identificadores que são transformados para URLs via regras.
uk: Відновлено можливість використання ком у ідентифікаторах, які перетворюються на адреси за правилами.

source: Review downloaded metadata: Fix cancel button on the confirm reject all dialog not working.
es: Revisar metadatos descargados: Se corrige el fallo por que no funcionaba el botón cancelar en el diálogo de confirmar rechazar todo.
pt_br: Revisão de metadados baixados: Corrige o botão cancelar não funcionando na caixa de diálogo "confirmar rejeitar todos".
uk: Перегляд отриманих метаданих: відновлено працездатність кнопки скасовування у діалоговому вікні підтвердження відкидання усього.

source: Kindle Fire driver: Send books by default to the "kindle" folder instead of the "Books" folder to workaround a change in the Fire firmware that causes the Kindle to not recognize files in the Books folder.
es: Controlador Kindle Fire: Se envían los libros de manera predeterminada a la carpeta «kindle» en lugar de «Books» para evitar un cambio en el firmware del Fire que hace que el Kindle no reconozca archivos en la carpeta «Books».
pt_br: Driver do Kindle Fire: Envia livros por padrão para a pasta "kindle" em vez da pasta "Books" para contornar uma mudança no firmware do Fire que fazia com que o Kindle não reconhecesse os arquivos na pasta Books.
uk: Драйвер Kindle Fire: реалізовано типове надсилання книг до теки «kindle» замість теки «Books» для обійти зміну у мікропрограмі Fire, яка спричиняє те, що Kindle не розпізнає файли у теці «Books».

source: Linux installer: Also fix the execute bits in the umask if the user runs the installer with a umask that prevents files from being world executable.
es: Instalador Linux: Se establecen también los bits de ejecución en umask si el usuario ejecuta el instalador con un umask que evita que los archivos sean ejecutables por todo el mundo.
pt_br: Instalador do Linux: Também corrige os bits de execução no umask se o usuário executa o instalador com um umask que impeça arquivos de serem executados de forma global.
uk: Засіб встановлення у Linux: виправлено біти виконання в umask, якщо користувач запускає засіб встановлення із umask, яка запобігає можливості виконання файлів будь-яким користувачем.

source: Sort the entries in the show column menu alphabetically.
es: Se ordenan alfabéticamente las entradas en el menú de mostrar columnas
pt_br: Classifica alfabeticamente as entradas no menu mostrar colunas.
uk: Реалізовано упорядковування записів у меню показу стовпчиків за абеткою

source: 15 Jun, 2018
pt_br: 15 de Julho de 2018
uk: 15 червня 2018 року

source: Book list: Allow drag and drop of books onto other books to merge the book records.
es: Lista de libros: Se permite arrastrar y soltar unos libros en otros para unir los registros.
pt_br: Lista de livros: Permite arrastar e soltar um livro em cima de outro para fundir os registros dos livros.
uk: Список книг: уможливлено перетягування позначок книг на інші позначки книг зі скиданням для об'єднання записів книг.

source: Check Book: External link checker: Also check HTML anchors (the part after the # in the link). Can be turned off via a checkbox at the bottom of the link checker window.
es: Comprobar libro: Comprobación de enlaces externos: Se comprueban tambien los puntos de anclaje HTML (la parte que sigue al signo # en el enlace). Se puede desactivar en una casilla en la parte inferior de la ventana de comprobación de enlaces.
pt_br: Verificar Livro: Verificador de link externo: Também verifica âncoras HTML (a parte depois do # no link). Pode ser desativado via caixa de seleção na parte inferior da janela de verificação de links.
uk: Перевірка книг: засіб перевірки зовнішніх посилань: реалізовано перевірку прив'язок HTML (частин після # у посиланні). Цю перевірку можна вимкнути за допомогою пункту у нижній частині вікна налаштовування засобу перевірки посилань.

source: Edit Book: Preview panel: Show previews when editing SVG files
es: Modificar libro: Panel de vista previa: Se muestra vista previa mientras se modifican archivos SVG
pt_br: Editar Livro: Painel de visualização: Mostra visualização ao editar arquivos SVG
uk: Редагування книг: панель попереднього переггляду: реалізовано показ попереднього перегляду при редагуванні файлів SVG

source: Edit book: When downloading external resources, also convert data URLs into files.
es: Modificar libro: Al descargar recursos externos se convierten URL de datos en archivos.
pt_br: Editar livro: Ao baixar recursos externos, também converte URLs de dados em arquivos.
uk: Редагування книг: реалізовано перетворення адрес даних у файлах при отриманні зовнішніх ресурсів

source: E-book viewer: When the controls are hidden show the progress in the window title.
es: Visor de libros: Cuando los controles están ocultos se muestra el progreso en el título de la ventana.
pt_br: Visualizador de e-book: Quando os controles estão ocultos, mostra o progresso na barra de títulos.
uk: Засіб перегляду книг: реалізовано показ поступу на смужці заголовку вікна, якщо засоби керування приховано

source: Library Quick switch menu: Highlight the previously switched from library in bold.
es: Menú de cambio rápido de biblioteca: Se resalta la última biblioteca desde la que se cambió en negrita.
pt_br: Menu "Mudança rápida" de biblioteca: Destaca em negrito a última biblioteca trocada.
uk: Меню швидкого перемикання бібліотек: реалізовано позначення попередньої бібліотеки напівжирним шрифтом.

source: PDF Input: Fix a regression in 3.24 that caused conversion of PDF to be significantly worse.
es: Entrada PDF: Se corrige una regresión en 3.24 que hacía que la conversión de PDF fuera notablemente peor.
pt_br: Entrada PDF: Corrige uma regressão na versão 3.24 que fazia com que a conversão de PDF fosse significativamente pior.
uk: Вхідні дані у PDF: виправлено регресію у версії 3.24, яка значно погіршувала перетворення PDF.

source: E-book viewer: Fix very slow loading for HTML files with very many images on Linux.
es: Visor de libros: Se corrige la carga extremadamente lenta de archivos HTML con muchas imágenes en Linux.
pt_br: Visualizador de e-book: Corrige carregamento muito lento de arquivos HTML com muitas imagens no Linux.
uk: Засіб перегляду книг: виправлено дуже повільне завантаження файлів HTML з багатьма зображеннями у Linux.

source: Content server: Fix a regression in 3.14 that removed the separator between books in the detailed list view mode.
es: Servidor de contenidos: Se corrige una regresión en 3.14 que eliminaba el separador entre libros en el modo de vista de lista detallada.
pt_br: Servidor de conteúdo: Corrige uma regressão na versão 3.14 que removeu o separador entre os livros no modo de visualização de lista detalhada.
uk: Сервер даних: виправлено регресію у версії 3.14, яка призводила до вилучення роздільника між книгами у режимі перегляду докладного списку книг.

source: Edit book: Fix SVG files not being beautified by the Beautify all files tool
es: Modificar libro: Se corrige el fallo por el que los archivos SVG no se mejoraban con la herramienta de embellecer todos los archivos
pt_br: Editar livro: Corrige arquivos SVG não sendo embelezados pela ferramenta "Embelezar todos os arquivos"
uk: Редагування книг: виправлено помилку, пов'язану із тим, що файли SVG не поліпшувалися засобом поліпшення усіх файлів

source: Edit book: Fix searching in selected files not searching SVG files
es: Modificar libro: Se corrige el fallo por el que buscar en los archivos seleccionados no buscana en archivos SVG
pt_br: Editar livro: Corrige pesquisa em arquivos selecionados não pesquisando arquivos SVG
uk: Редагування книг: виправлено помилку, пов'язану із тим, що засіб пошуку у позначених файлах не виконував пошуку у файлах SVG

source: Fix Tweaks help string not being displayed translated
es: Se corrige el fallo por el que el texto de ayuda de los ajustes no se mostraba traducido
pt_br: Corrige o texto de ajuda nos Ajustes não sendo traduzidos
uk: Виправлено помилку, пов'язану із тим, що рядок підказки коригувань не перекладався

source: Edit metadata dialog: Fix distorted rendering of some labels in the custom metadata tab in rare circumstances.
es: Diálogo de modificar medatados: Se corrige la distorsión de algunas etiquetas en la pestaña de metadatos personalizados en circunstancias particulares.
pt_br: Caixa de diálogo de edição de metadados: Corrige renderização distorcida de certos rótulos na guia de metadados personalizados em raras circunstâncias.
uk: ВІкно редагування метаданих: виправлено викривлений показ деяких міток на вкладці нетипових метаданих за рідкісного збігу обставин.

source: version 3.26.1 prevents dropping of a book onto itself from triggering the merge dialog, which should reduce accidental triggers
es: La versión 3.26.1 evita que soltar un libro sobre sí mismo active el diálogo de unión, lo que debería reducir las activaciones accidentales
pt_br: versão 3.26.1 impede que ao arrastar e soltar um livro em si mesmo seja aberta a caixa de diálogo de mesclagem, o que deve reduzir as aberturas acidentais
uk: У версії 3.26.1 усунено можливість скидання пункту книги на той самий пункт книги із викликом діалогового вікна об'єднання. Це має зменшити кількість непотрібної роботи внаслідок помилкових дій користувача.

source: 01 Jun, 2018
pt_br: 1º de Julho de 2018
uk: 1 червня 2018 року

source: Kobo driver: Support the new Clara HD
es: Controlador Kobo: Soporte para el nuevo Clara HD
pt_br: Driver do Kobo: Suporta o novo Clara HD
uk: Драйвер Kobo: реалізовано підтримку нової Clara HD

source: PDF Output: Add an option to use page margins from the input document, specified via @page CSS rules.
es: Salida PDF: Se añade una opción para usar los márgenes de página del documento de entrada, especificados mediante reglas CSS @page.
pt_br: Saída PDF: Adiciona uma opção para usar margens de página do documento de entrada, especificado via regra de CSS @page.
uk: Виведення до PDF: додано параметр, який уможливлює використання параметрів полів документа з вхідного документа, якщо їх вказано за допомогою правил CSS @page.

source: Allows individual HTML files in the input document to have different page margins in the output PDF.
es: Se permite que archivos HTML individuales del documento de entrada tengan distintos márgenes de página en el PDF de salida.
pt_br: Permite que arquivos HTML individuais no documento de entrada tenham margens de página diferentes no PDF de saída.
uk: Уможливлено використання для окремих файлів HTML у вхідному документі власних параметрів полів сторінки для виведення до PDF.

source: Fix option to "show text under buttons only if there is enough space" not working well with the option to use "two lines for the text under the buttons".
es: Se corrige el fallo por el que la opción para mostrar texto bajo los botones sólo si hay suficiente espacio no funcionaba bien con la opción para mostrar dos líneas de texto bajo los botones.
pt_br: Corrige opção para "mostrar texto abaixo dos ícones se houver espaço suficiente" não funcionando bem com a opção "use duas linhas para o texto sob os ícones".
uk: Виправлено конфлікт параметрів «Показувати текст під кнопками, якщо достатньо місця» та «Два рідки тексту під кнопками».

source: Update notification: When both calibre and plugin updates are available and the user updates only the plugins, fix the restart calibre button not working.
es: Notificación de actualizaciones: Cuando hay disponibles actualizaciones tanto de calibre como de complementos y el usuario actualiza sólo los complementos, se corrige el fallo por el que el botón para reiniciar calibre no funcionaba.
pt_br: Notificação de atualização: Quando existem atualizações disponíveis tanto para o calibre quanto para plugins, e o usuário atualiza apenas os plugins, corrige o problema da opção "Reiniciar calibre" não funcionar.
uk: Сповіщення щодо оновлень: уможливлено доступ до кнопки перезапуску calibre, якщо доступні одразу оновлення calibre і додатків, а користувач вибирає оновлення лише додатків.

source: E-book viewer: Fix printing of comics (cbz/cbr files) not working.
es: Visor de libros: Se arregla la impresión de cómics (archivos cbz o cbr).
pt_br: Visualizador de e-book: Corrige a impressão de quadrinhos (arquivos cbz/cbr) não funcionando.
uk: Засіб перегляду книг: виправлено друк коміксів (файлів cbz/cbr).

source: EPUB3 Input: Fix Table of Contents not being recognized for some EPUB 3 books that placed their nav document in-side a sub-folder.
es: Entrada EPUB3: Se corrige el fallo por el que el índice no se reconocía en algunos archivos EPUB 3 que tienen el documento de navegación en una subcarpeta.
pt_br: Entrada EPUB3: Corrige o Índice não sendo reconhecido para alguns livros no formato EPUB 3 que colocam seu documento de navegação dentro de uma subpasta.
uk: Вхідні дані у EPUB3: виправлено помилку, пов'язану із тим, що таблиця змісту у деяких EPUB 3 не розпізнавалася через те, що документ nav зберігався у підтеці.

source: 25 May, 2018
pt_br: 25 de Maio de 2018
uk: 25 травня 2018 року

source: Conversion: EPUB Output: Add an option to output EPUB 3 files.
es: Conversión: Salida EPUB: Se añade una opción para generar archivos EPUB 3.
pt_br: Conversão: Saída EPUB: Adiciona uma opção para saída de arquivos EPUB 3.
uk: Перетворення: виведення даних до EPUB: додано пункт для створення файлів EPUB 3.

source: PDF Output: Add an option to break long words at the ends of lines.
es: Salida PDF: Se añade una opción para dividir palabras largas al final de los renglones.
pt_br: Saída PDF: Adiciona uma opção para quebrar palavras longas no final de linhas.
uk: Виведення до PDF: додано пункт для перенесення довгих слів наприкінці рядків.

source: PDF Output: Allow using images in the header/footer templates
es: Salida PDF: Se permite el uso de imágenes en las plantillas de encabezado y pie de página
pt_br: Saída PDF: Permite usar imagens nos modelos de cabeçalho/rodapé
uk: Виведення до PDF: уможвливлено використання зображень у шаблонах верхніх і нижніх колонтитулів

source: Add an option to use two lines for the text under the toolbar button in Preferences-&gt;Look &amp; feel
es: Se añade una opción para usar dos líneas para el texto bajo los botones de la barra de herramientas en Preferencias &gt; Apariencia
pt_br: Adiciona uma opção para usar duas linhas para o texto abaixo dos ícones da barra de ferramentas em Preferências-&gt;Aparência
uk: Додано пункт для використання двох рядків тексту під кнопкою панелі інструментів (Налаштування -&gt; Вигляд і поведінка)

source: Edit book: Spell check: Update the number of misspelled words/total words displayed when correcting/ignoring words.
es: Modificar libro: Comprobar ortografía: Se actualiza el número de palabras con problemas de ortografía y el número total de palabras que se muestra al corregir o ignorar palabras.
pt_br: Editar livro: Verificar ortografia: Atualiza o número de palavras com erro e total mostrado ao corrigir/ignorar palavras.
uk: Редагування книг: перевірка правопису: реалізовано оновлення даних щодо помилок і загальної кількості слів під час виправлення слів або додавання слів до списку ігнорованих.

source: Edit book: Fix HTML: Automatically resolve private entities
es: Modificar libro: Corregir HTML: Se resuelven automáticamente las entidades privadas
pt_br: Editar livro: Corrigir HTML: Resolve automaticamente as entidades privadas
uk: Редагування книг: виправлення HTML: автоматичне виправлення приватних замінників

source: Improve formatting of help in Preferences-&gt;Tweaks
es: Se mejora el formato de la ayuda en Preferencias &gt; Ajustes
pt_br: Melhora formatação da ajuda em Preferências-&gt;Ajustes
uk: Поліпшено форматування довідки на сторінці «Налаштування -&gt; Коригування»

source: ToC Editor: Allow undo for renaming single items as well.
es: Modificar índice: Se permite deshacer cambios de nombre de un único elemento.
pt_br: Editor de Índice: Permite desfazer renomear itens únicos também.
uk: Редактор змісту: реалізовано можливість скасовування при зміні назв окремих записів.

source: Version 3.24.2 fixes a bug in the new EPUB 3 output functionality that prevented conversion of non-EPUB 3 books to EPUB 3
es: La versión 3.24.2 corrige un fallo en la nueva función de salida EPUB 3 que no permitía convertir libros que no fueran EPUB 3 a EPUB 3
pt_br: Versão 3.24.2 corrige um erro na nova funcionalidade de saída EPUB 3 que impedia a conversão de livros que não eram EPUB 3 para EPUB 3.
uk: У версії 3.24.2 виправлено ваду у новому засобі виведення даних у форматі EPUB 3, яка заважала перетворенню книг до формату EPUB 3.

source: Version 3.24.1 fixes a regression in the 3.24 in the editor that caused syncing between the editor and the Preview panel/Live CSS panel to not work correctly
es: La versión 3.24.1 corrige una regresión en 3.24 en el editor que hacía que la sincronización entre el editor y el panel de previsualización o de CSS en vivo no funcionara correctamente
pt_br: A versão 3.24.1 corrige uma regressão na versão 3.24 no editor que fazia com que a sincronização entre o editor e o Painel de Visualização / Live CSS não funcionasse corretamente.
uk: У версії 3.24.1 виправлено регресію версії 3.24 у редакторі. Регресія призводила до неналежної роботи синхронізації між редактором та панеллю попереднього перегляду/інтерактивного CSS.

source: PDF Output: Strip zero-width space characters from the text as their presence prevents searching from working
es: Salida PDF: Se eliminan caracteres de espacio de anchura cero del texto, pues su presencia hace que la búsqueda no funcione
pt_br: Saída PDF: Remove caracteres de espaço com largura zero do texto, uma vez que a presença deles impede que a pesquisa funcione
uk: Виведення до PDF: реалізовано вилучення пробільних символів нульової ширини з тексту, оскільки наявність таких символів заважає працювати засобам пошуку

source: DOCX Output: Fix &lt;pre&gt; tags not being converted correctly.
es: Salida DOCX: Se corrige el fallo por el que las etiquetas &lt;pre&gt; no se convertían correctamente.
pt_br: Saída DOCX: Corrige as tags &lt;pre&gt; não sendo convertidas corretamente.
uk: Виведення до DOCX: виправлено помилкове перетворення теґів &lt;pre&gt;.

source: DOCX Input: Fix incorrect conversion of a framed block that contains a list.
es: Entrada DOCX: Se corrige la conversión incorrecta bloques con marco que contienen una lista.
pt_br: Entrada DOCX: Corrige conversão incorreta de um bloco emoldurado que contenha uma lista.
uk: Вхідні дані DOCX: виправлено помилкове перетворення блоків, які містять списки, у рамках.

source: Conversion: Fix private entities that use the same name as an HTML entity not being handled correctly
es: Conversión: Se corrige el fallo por el que las entidades privadas que usan el mismo nombre que una entidad HTML no se gestionaban correctamente
pt_br: Conversão: Corrige entidades privadas que usam o mesmo nome de uma entidade HTML não serem manipuladas corretamente
uk: Перетворення: виправлено помилку, пов'язану із тим, що приватні замінники, які використовують ті самі назви, що і замінники HTML, оброблялися некоректно

source: Viewer: Fix HTML files with private entities displaying an artifact at the top
es: Visor: Se corrige el fallo por el que los archivos HTML con entidades privadas mostraban un artefacto al inicio
pt_br: Visualizador: Corrige arquivos HTML com entidades privadas mostrando um artefato no topo
uk: Засіб перегляду: усунено викривлення у верхній частині при показі файлів HTML із приватними замінниками

source: Edit book: Check book: Show an error for HTML files with private entities
es: Modificar libro: Comprobar libro: Se muestra un error para archivos HTML con entidades privadas
pt_br: Editar livro: Verificar livro: Mostra um erro para arquivos HTML com entidades privadas
uk: Редагування книг: перевірка книг: реалізовано показ повідомлення про помилку, якщо файл HTML містить приватні замінники

source: EPUB3 Input: Fix titlepage being referred to in the nav causing two titlepage entries in the final book.
es: Entrada EPUB3: Se corrige el fallo por el que la página de título se referenciaba en el documento de navegación, lo que causaba dos entradas de página de título en el libro final.
pt_br: Entrada EPUB3: Corrige folha de rosto sendo referenciada no arquivo de navegação gerando duas entradas de folha de rosto no livro final.
uk: Вхідні дані у EPUB3: виправлено помилку, пов'язану із тим, що посилання на titlepage у nav призводило до появи довх записів титульної сторінки у остаточній книзі.

source: Fix throbber buttons not being perfectly aligned inside toolbars
es: Se corrige el alineamiento de los botones de actividad en las barras de herramientas
pt_br: Corrige botões pulsantes não estando perfeitamente alinhados na barra de ferramentas
uk: Виправлено помилку, пов'язану із неправильним вирівнюванням кнопок-перемикачів на панелях інструментів

source: Quickview: Fix sizes not being displayed.
es: Vista rápida: Se corrige el fallo por el que no se mostraban los tamaños.
pt_br: Visualização rápida: Corrige tamanhos não sendo mostrados.
uk: Швидкий перегляд: виправлено помилку, пов'язану із неможливістю показу розмірів

source: Edit book: Compress images tool: Do not mark the book as changed if no images could be further compressed.
es: Modificar libro: Herramienta de compresión de imágenes: No se marca el libro como modificado si no se pudo comprimir más ninguna imagen.
pt_br: Editar livro: Ferramenta de compressão de imagens: Não marca o livro como alterado se nenhuma imagem puder ser comprimida.
uk: Редагування книг: засіб стискання зображень: усунено позначення книги як зміненої, якщо зображення неможливо стиснути.

source: Book list split-view: Fix horizontal scroll position of split view can change when changing the current column in one view.
es: Vista dividida de la lista de libros: Se corrige el fallo por el que la posición de desplazamiento horizontal puede cambiar al cambiar la columna seleccionada en una vista.
pt_br: Visualização dividida de lista de livro: Corrige posição de rolagem horizontal da visualização dividida poder mudar quando alterar a coluna atual.
uk: Розділений перегляд списків книг: усунено зсув горизонтальної позиції гортання у розділеному перегляді при зміні поточного стовпчика у одній з частин перегляду.

source: Fix Bookeen Saga not being recognized on macOS/Linux.
es: Se corrige el fallo por el que el Bookeen Saga no se reconocía en macOS y Linux.
pt_br: Corrige Bookeen Saga não sendo reconhecida no macOS/Linux.
uk: Реалізовано розпізнавання Bookeen Saga у macOS/Linux.
