Repository: Easonqsp/calibre-translations
Catalog: website/*.po
Languages: es, fr, pt_br, uk

source: Edit book: Spell check dialog: Various small usability enhancements -- preserve position in word list on refresh, ensure that new current word is highlighted after changing a word, etc
fr: Éditer le Livre : Boîte de dialogue de vérification orthographique : Diverses petites améliorations ergonomiques -- préserver la position dans la liste de mots lors du rafraîchissement, s'assurer que le nouveau mot est mis en évidence après le changement du mot, etc.

source: Edit book: Flash the taskbar icon after beautify all files completes
fr: • Éditer le Livre : Clignotement de l'icône de la barre de tâches après que l'embellissement de tous les fichiers soit opéré

source: Fix creating an empty library with the same structure as current library not creating custom columns on the first restart after creating the new custom columns
fr: Solutionne la création d'une bibliothèque vide avec la même structure que la bibliothèque courante qui ne créait pas les colonnes personnalisées au premier redémarrage après la création des nouvelles colonnes personnalisées

source: Edit book: Don't fail to rename files on Windows if there is a link containing the colon character
fr: Éditer le livre : N'échoue pas à renommer les fichiers sous Windows s'il y a un lien contenant le caractère ":"

source: PDF output: Don't fail if one of the embedded fonts has no names
fr: Format PDF en sortie : Forcer la conversion même si une police incluse n'a pas de nom

source: Edit book: When downloading external resources, ensure the generated filenames are valid
fr: Éditer le Livre : Lors du téléchargement de ressources extérieures, s'assure que les noms de fichier générés sont valides

source: Windows: Fix file extension not being added automatically when missing in save dialogs
fr: Windows : Solutionne l'extension de fichier n'ayant pas été ajoutée automatiquement lorsqu'elle est manquante dans les boîtes de dialogue de sauvegarde

source: Fix calibre not opening full-screen on Windows tablet mode
fr: Solutionne le fait que calibre ne s'ouvre pas en mode plein écran dans les tablettes Windows

source: Edit book: Fix check external links tool not detecting changes that have not yet been saved
fr: Éditer le livre : Solutionne l'outil de vérification de liens externes qui ne détecte pas les changements qui n'ont pas encore été enregistrés

source: Generate covers: Fix &amp; in the series causing incorrect formatting of series number
fr: Générer les couvertures : Solutionne l'esperluette dans les séries entraînant un formatage incorrect des numéros de série

source: Edit book: Fix a regression in the last release that broke the Arrange into folders tool when arranging into sub-folders of a folder that does not exist
fr: Éditer le livre : Solutionne une régression dans la dernière version qui endommage l'outil Organiser dans des dossiers lors de l'organisation dans des sous-dossiers d'un dossier qui n'existe pas

source: calibre's tenth birthday edition!
fr: Édition pour fêter les 10 ans de calibre !

source: calibre was first released (as libprs500) ten years ago today. A big thank you to the entire calibre community -- users, contributors and developers -- for keeping it humming for so long
fr: calibre est sorti jour pour jour il y a 10 ans (sous le nom libprs500). Un grand merci à toute la communauté calibre – utilisateurs, contributeurs et développeurs – pour l'avoir gardé vivant si longtemps

source: A new set of icons for calibre
fr: Un nouveau jeu d'icônes pour calibre

source: To celebrate calibre turning ten, calibre now has a brand new set of icons designed from scratch. Note that you can choose between many different icon sets for calibre, including the original icons, from Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Choose icon theme
fr: Pour célébrer les dix ans de calibre, calibre a maintenant un tout nouvel ensemble d'icônes fraîchement sorti de l’œuf. Notez que vous pouvez choisir entre différents ensembles d'icônes, incluant les icônes originales dans Préférences-&gt;Interface-&gt;Apparence &amp; présentation-&gt;Choisir un thème d'icônes

source: A short video commemorating the occasion: <a href="%(h0)s">%(h0)s</a>
fr: Une courte vidéo afin de commémorer l'occasion : <a href="%(h0)s">%(h0)s</a>

source: Book details panel: Add a copy all action to the right click menu
fr: Panneau des détails du livre : Ajout de l'action Copier tout au menu contextuel

source: Get books: Update e-bookpoint and woblink store plugins for website changes
fr: Obtenir des livres : Mise à jour des plugins des boutiques e-bookpoint et woblink en raison de changements aux sites web

source: Edit book: When un-marking text auto-change the 'search where' location to what it was before text was marked rather than 'current file'
fr: Éditer le livre : Lorsque l'on dé-marque du texte change automatiquement l'emplacement 'où rechercher' en ce qu'il était avant que le texte soit marqué plutôt que 'fichier actuel'

source: Automatic adding: Show an error if the user specifies a folder whose name starts with a dot or underscore
fr: Ajout automatique : Affiche une erreur si l'utilisateur spécifie un répertoire dont le nom commence par un point ou un tiret bas

source: macOS: Fix a regression that caused incorrect display of the icon in pop-up message boxes when using a retina display
fr: macOS : Solutionne une régression qui occasionne un affichage incorrect de l'icône dans les fenêtres de dialogue lorsque l'on utilise un écran Retina

source: Kobo driver: Fix an error when migrating very old settings
fr: Pilote Kobo : Correction d'une erreur lors de la migration de très anciens paramètres de configuration.

source: Kobo driver: Fix a regression that broke handling of reading status for devices running old 1.9x versions of the Kobo firmware
fr: Pilote Kobo : Corrige une régression qui empêchait la lecture du statut des liseuses Kobo équipées d'un firmware ancienne version 1.9x

source: Edit book: When using the arrange into folders tool do not change the case of already existing folders in the book
fr: Éditer le livre : Lors de l'utilisation de l'outil arranger dans des dossiers ne pas changer la casse des dossiers existants dans le livre

source: Edit book: Add a tool to download external resources (images/stylesheets/etc.) that are not included in the book
fr: • Éditer le livre : Ajout d'un outil pour télécharger des ressources externes (images/feuilles de style/etc.) qui ne sont pas incluent dans le livre

source: Make custom columns available in the Alter Tag browser-&gt;Manage categories sub menu
fr: Rendre disponible les colonnes personnalisées dans le sous-menu de Configurer le Navigateur d'étiquettes-&gt;Gérer les catégories

source: Conversion: Fix incorrect resolution of references to resources in HTML files that exist in a folder level above the OPF file. This could lead to styles being incorrectly processed in such HTML files
fr: Conversion : Solutionne une résolution incorrecte des références aux ressources dans des fichiers HTML qui se trouvent dans un niveau de répertoire au dessus du fichier OPF. Ceci pourrait entraîner le fait que des styles soient incorrectement exécutés dans certains fichiers HTML

source: Get books: Update the Amazon store plugins for website changes
fr: Obtenir un livre : Mise à jour du plugin Amazon Store en raison de changements au site web

source: Update Ozon.ru metadata download plugin to fix searching for books by ISBN
fr: Mise à jour de l'extension de téléchargement de métadonnées sur Ozon.ru pour corriger la recherche de livre par ISBN

source: Edit book: Fix a regression in the previous release that broke the preferences dialog for changing color schemes
fr: Éditer le livre : Solutionne une régression dans la version précédente qui endommage la boite de dialogue préférences pour changer les schémas de couleur

source: Edit book: Better error message when user tries to open a Check Book item that refers to a file that has been deleted since the last time Check Book was run
fr: Éditer le livre : Meilleur message d'erreur lorsqu'un utilisateur essaie d'ouvrir un élément de Vérifier le livre qui se réfère à un fichier qui a été supprimé depuis la dernière fois que Vérifier le livre a été exécuté

source: Kobo driver: Support for firmware version 4.1 and Overdrive books on the device
fr: Pilote Kobo : support du firmware version 4.1 et des livres Overdrive sur la liseuse

source: Edit book: Highlight class names inside HTML tags
fr: Éditer le livre : Surligne le nom des classes à l'intérieur des balises HTML

source: Bulk metadata edit dialog: Allow Search &amp; replace to work for ratings columns as well
fr: Boite de dialogue de l'édition de métadonnées par lot : Permettre au rechercher/remplacer de fonctionner également avec les colonnes de notation

source: Fix downloading of metadata from Ozon.ru, which broke due to website changes
fr: Solutionne le problème de téléchargement de métadonnées sur Ozon.ru lié à des modifications du site web

source: Kobo driver: Fix delete of empty collections
fr: Pilote Kobo : Corrige le problème de suppression de collections vides

source: Kobo driver: Fix book previews being sometimes detected as actual books
fr: Pilote Kobo : Solutionne le fait que les prévisualisations de livre sont parfois détectées comme étant les livres actuels

source: Cover Browser: Fix setting an empty template for the title causes an error
fr: Navigateur de couvertures : Solutionne le fait que le paramétrage d'un modèle vide pour le titre provoque une erreur

source: Edit book: On Windows do not trigger shortcuts when using the right Alt (AltGr) key. This allows it to be used for entering special characters instead
fr: Éditer le livre : Sous Windows ne pas déclencher les raccourcis lors de l'utilisation de la touche Alt droite (Alt Gr). Ceci permet qu'elle soit utilisée pour entrer des caractères spéciaux

source: Edit book: Auto-add file extension when using the Save a copy dialog if it is missing
fr: Éditer le livre : Ajouter automatiquement l'extension de fichier lors de l'utilisation la boite de dialogue Sauvegarder une copie si celle-ci est manquante

source: Linux: Fix calibre not launching when used with some old VNC server implementations
fr: Linux : Solutionne le problème de calibre ne se lançant pas avec certaines anciennes implémentations de serveurs VNC

source: Windows: Run library restore in a separate process as on some Windows machines, running it in the main process causes something in the system to lock the db file
fr: Windows : Exécuter une restauration de la bibliothèque dans un processus séparé vu que sur certaines machines Windows, l'exécution dans le processus principal amène quelque chose dans le système à verrouiller le fichier db

source: Fix some news downloads in east asian languages not working because the truncation of article descriptions could cause invalid UTF-16 bytes in the string
fr: Solutionne le fait que certains téléchargements d'actualités dans des langages d'Asie de l'est ne fonctionnent pas en raison de la troncature des descriptions d'articles qui pourrait amener des bytes UTF-16 invalides dans le champ

source: Fix incorrect timezone when editing custom date columns directly in the book list
fr: Solutionne le fuseau horaire incorrect obtenu lors de l'édition de colonnes personnalisées de type date directement dans la liste de livres

source: Add a tweak to Preferences-&gt;Tweaks to control the list of servers calibre considers public email servers
fr: Ajout d'un ajustement dans Préférences-&gt;Ajustements pour contrôler la liste des serveurs que calibre considère comme étant des serveurs publics de courriel

source: Content server: Fix a regression in the previous release that broke the OPDS feeds for libraries with no custom columns
fr: Serveur de contenu: Correction d'une régression dans la version précédente qui a endommagé le flux OPDS pour les bibliothèques sans colonnes personnalisées

source: Edit metadata dialog: Fix auto-generation/validation of author sort values not working when only changing case of the author name
fr: Boîte de dialogue de modification des métadonnées : Correction de l'auto-génération/validation des valeurs de tri par auteur ne fonctionnant pas lorsque l'on change seulement la casse du nom de l'auteur

source: A nicer error message when calibre fails to create the temporary directory
fr: Meilleur message d'erreur quand calibre échoue à créer un répertoire temporaire

source: Fix dates being set to empty in bulk search/replace not becoming UNDEFINED
fr: Solutionne le fait que les dates étant réglées comme vides dans la recherche/remplacement par lot ne deviennent pas INDÉFINIE

source: Edit metadata dialog: Make pressing up on an undefined numeric field set the value to zero instead of -99999
fr: Boîte de dialogue de modification des métadonnées : Faire en sorte qu'un appui sur un champ numérique indéfini définisse la valeur à zéro au lieu de -99999

source: Conversion: Handle corrupted JPEG files that have valid headers but invalid data
fr: Conversion : Prise en charge des fichiers JPEG corrompus qui ont des en-têtes valides mais des données invalides

source: Conversion: Improve detection of input documents that use uppercase tag/attribute names
fr: Conversion : Améliorer la détection des documents d'entrée qui utilisent des noms de balise/attribut en majuscules

source: Fix regression in previous release that caused incorrect display of ratings in the side panel of the metadata download dialog
fr: Solutionne une régression dans la version précédente qui cause un affichage incorrect des notations dans le panneau latéral de la boîte de dialogue de téléchargement des métadonnées

source: Get books: Update publio and virtualo store plugins for website changes
fr: Obtenir des livres : Mise à jour des extensions pour les boutiques Publio et Virtualo suite à des changements sur le site web

source: Fix reading metadata from PDF files broken by poppler &gt;= 0.47.0
fr: • Solutionne la lecture des métadonnées de fichiers PDF endommagés par Poppler &gt;=0.47.0

source: Change the application name set in Qt to calibre from libprs500
fr: Changer le nom de l'application définie dans Qt de libprs500 à calibre

source: Allow creating custom rating columns that support half-stars via Preferences-&gt;Add your own columns
fr: Permettre la création de colonnes de notation personnalisées qui prennent en charge les demis étoiles via Préférences-&gt;Ajouter vos propres colonnes

source: Tag browser: Add an option in Preferences-&gt;Interface-&gt;Look &amp; feel-&gt;Tag browser to turn off the display of counts in the Tag browser
fr: Navigateur d'étiquettes : Ajout d'une option dans Préférences-&gt;Interface-&gt;Apparence et présentation-&gt;Navigateur d’étiquettes pour désactiver l'affichage des décomptes dans le Navigateur d’étiquettes

source: Tag browser: Show the book counts on the right edge of the Tag browser
fr: Navigateur d'étiquettes : Afficher le décompte de livres sur le bord droit du Navigateur d’étiquettes

source: Cover Browser: Allow any metadata field to be used as the sub-title, not just the rating
fr: Navigateur de couvertures : Permettre à n'importe quel champ de métadonnées d'être utilisé comme sous titre, pas seulement la notation

source: Edit book: A new tool to sort the rules in a CSS stylesheet. To use it add it to the toolbar for CSS editors
fr: Éditer le livre : Un nouvel outil pour trier les règles dans une feuille de style CSS. Pour l'utiliser ajoutez-le à la barre d'outils pour les éditeurs CSS

source: Edit book: The Remove Unused CSS tool now has an option to also merge CSS rules that have identical selectors
fr: Éditer le livre : L'outil Supprimer les règles CSS Inutilisées à maintenant une option pour également fusionner les règles CSS qui ont des sélecteurs identiques

source: Add a tweak in Preferences-&gt;Tweaks to exclude some images types from being treated a covers when dropped onto the Book details panel
fr: Ajout d'un ajustement dans Préférences-&gt;Ajustements pour empêcher que certains types d'images soient traitées comme des couvertures quand on les dépose sur le panneau Détails du livre.

source: Allow reading more image formats as covers (All images will be converted to JPEG when stored)
fr: Permettre la lecture de plus de formats d'image comme couvertures (Toutes les images seront converties en JPEG lorsqu'elles seront stockées)

source: Content server: OPDS feeds: Change the value of &lt;updated&gt; for entries in the acquisition feed to be the last modified date for the book. Also make the size and last modified timestamp available as attributes in the acquisition links. Useful for integration with third party applications
fr: Serveur de contenu : flux OPDS : Changement de la valeur &lt;updated&gt; pour que les entrées dans le flux d'acquisition soit la dernière date de modification du livre. Permettre également à la taille et au dernier horodatage modifiés d'être disponibles comme attributs dans les liens d'acquisition. Utile pour l'intégration avec des applications tierces.

source: Kobo driver: Add support for firmware version 4 available on the new Kobo Aura One
fr: Pilote Kobo : Ajout du support de la version 4 du firmware sur les nouvelles liseuses Kobo Aura One.

source: ODT input: Add support for continued lists
fr: Format ODT en entrée pour la conversion : Ajout de la prise en charge des listes poursuivies

source: Edit book: Fix high-dpi rendering of emblems in the File browser
fr: Éditer le livre : Correction du rendu high-dpi des emblèmes dans l'Explorateur de fichiers

source: Fix regression in previous release that caused wide column icons to be scaled incorrectly
fr: Corrige une régression dans la version précédente qui entraîne le fait que les larges icônes de colonne soient retaillées incorrectement

source: Metadata download dialog: Fix HTTPS links in the download summary not working
fr: Boîte de dialogue de téléchargement des métadonnées : Corrige le fait que les liens HTTPS ne fonctionnent pas dans le récapitulatif de téléchargement

source: DOCX output: Handle nested display:table tags with no rows
fr: Format DOCX en sortie pour la conversion : Traiter les balises imbriquées display:table sans lignes

source: PDF output: Fix OpenType fonts with CFF font data not embeddable on Windows
fr: Format PDF en sortie pour la conversion : Solutionne le fait que les polices OpenType avec données CFF ne soient pas intégrables sous Windows

source: A simplified calibre logo
fr: Un logo calibre simplifié

source: Edit book: Allow restricting a search to the files currently open for editing
fr: Éditer le livre : Permettre de restreindre une recherche aux fichiers actuellement ouverts pour l'édition

source: Driver for the PocketBook Touch HD
fr: Pilote pour la liseuse PocketBook Touch HD

source: Kobo driver: Add support for firmware version 3.20
fr: Pilote Kobo : Ajout du support de la version de firmware 3.20.

source: DOCX input: Fix right-to-left alignment not working for footnotes
fr: Format DOCX en entrée pour la conversion : Solutionne le fait que l'alignement de la droite vers la gauche ne fonctionne pas avec les notes de bas de page

source: Sending email: Allow setting up a mail relay that uses encryption without a username and password
fr: Envoyer un courriel : Permettre de paramétrer un relais de messagrie qui utilise le chiffrement sans identifiant ni mot de passe

source: Linux: Fix calibre not working when the username is non-ASCII
fr: Linux : Corrige le fait que calibre ne fonctionne pas quand le nom d'utilisateur est non-ASCII

source: DOCX output: Ignore invalid text-indent values in the input document instead of erroring out
fr: Format DOCX en sortie pour la conversion : Ignore les valeurs text-indent invalides dans le fichier d'entrée au lieu d'arrêter la conversion sur une erreur

source: Portable installer: Auto-create the installation folder specified on the command line if it does not exist
fr: Installateur de la version portable : Créer automatiquement le répertoire d'installation spécifié dans la ligne de commande s'il n'existe pas

source: Kobo driver: Fix the ignore collections in option not working
fr: Pilote Kobo : Solutionne le fait que l'option ignorer les collections ne fonctionne pas

source: More user interface fixes for high DPI screens
fr: Plus de corrections de l'interface utilisateur pour les écrans high DPI

source: DOCX input: Fix a regression in the previous release that could cause invalid values to be output for the text-align CSS property
fr: Format DOCX en entrée pour la conversion : Solutionne une régression dans la version précédente qui entraîne le fait que des valeurs invalides soient sorties pour la propriété CSS text-align

source: Driver for Kobo Aura One and Aura Edition 2
fr: Pilote pour les liseuses Kobo Aura One et Aura Edition 2

source: Kobo driver: Add an option to ignore some collections on the device. The specified collections will not be touched by the driver
fr: Pilote Kobo : Ajout d'une option pour ignorer certaines collections sur les liseuses. Les collections spécifiées ne seront pas modifiés par le pilote

source: Add an option in Preferences-&gt;Searching to make searching case-sensitive
fr: Ajout d'une option dans Préférences-&gt;Rechercher pour rendre la recherche sensible à la casse.

source: DOCX input: Add support for right-to-left text/tables
fr: Format DOCX en entrée pour la conversion : Ajout de la prise en charge du texte/des tables alignés de droite à gauche

source: Fix some icons/images in the user interface looking blurred in environments with High DPI scaling enabled, such as macOS retina screens
fr: Corrige le fait que certaines icônes/images dans l'interface utilisateur paraissent floues dans des environnements où le mise à l'échelle High DPI est activée, tel que les écrans retina macOS

source: DOCX input: Fix images that have the # character in their filenames not being converted correctly
fr: Format DOCX en entrée pour la conversion : Solutionne le fait que les images qui ont le caractère # dans leurs noms de fichier ne soient pas converties correctement

source: ToC wizard: Fix generating ToC from headings/xpath yielding unexpected results when tags are present out of sequence
fr: Assistant TdM : Solutionne le fait que la génération d'une TdM à partir d'en têtes/xpath produise des résultats inattendus lorsque des balises sont présentes hors de la séquence

source: Edit book: Fix drag and drop of text replacing non-breaking spaces with normal spaces
fr: Éditer le livre : Solutionne le fait que le glisser/déposer de texte remplace des espaces insécables par des espaces normaux

source: E-book viewer: Fix duplicate names in hyphenation dictionary chooser
fr: Visionneuse de livre numérique : Solutionne le fait qu'il y ait des noms en double dans le sélectionneur du dictionnaire de césure

source: Fix a regression in the previous release that caused the completion popups for some custom column types in the book list to stop working
fr: Solutionne une régression dans la version précédente qui entraîne le fait que la complétion ne fonctionne plus pour certains types de colonnes personnalisées dans la liste de livres

source: Version 2.65.1 contains a quick-fix for a typo in 2.65.0 that caused calibre to crash when a device is connected and the cover grid is enabled
fr: La version 2.65.1 contient une solution rapide pour une coquille dans la version 2.65.0 qui entraîne le fait que calibre plante quand un périphérique est connecté et la grille de couverture activée

source: Custom columns: Add a new 'Short text' column type that behaves like the builtin title column
fr: Colonnes personnalisées : Ajout d'un nouveau type de colonne 'Texte court' qui se comporte comme la colonne titre intégrée
